{"batchcomplete": "", "query": {"pages": {"164556": {"ns": 0, "pageid": 164556, "revisions": [{"*": "{{other uses}}\n{{wiktionary}}\n\n'''''Archon''''' (Gr. άρχων, pl. άρχοντες) is a [[Greek language|Greek]] word that means \"ruler\", frequently used as the title of a specific public office. It is the masculine present participle of the verb stem αρχ-, meaning \"to rule\", derived from the same root as ''[[monarch]]'' and ''[[hierarchy]]''.\n\n==Ancient Greece==\nIn the early literary period of [[ancient Greece]] the chief [[magistrates]] of various Greek city states were called ''Archon''. {{Citation needed|date=May 2007}} The term was also used throughout Greek history in a more general sense, ranging  from \"club leader\" to \"master of the tables\" at ''[[syssitia]]'' to \"Roman governor\". {{Citation needed|date=May 2007}} In Roman terms, ''archontes'' ruled by ''[[imperium]]'', whereas ''[[Basileus|Basileis]]'' (\"[[King]]s\") had ''[[auctoritas]]''.\n\nIn [[Athens]] a system of three concurrent Archons evolved, the three office holders being known as the ''[[Archon Eponymos]]'', the ''[[Polemarch]]'', and the ''Archon [[Basileus]]''. {{Citation needed|date=May 2007}} Originally these offices were filled from the aristocracy by elections every ten years. During this period the Eponymos Archon was the chief magistrate, the Polemarch was the head of the armed forces, and the Archon Basileus was responsible for the civic religious arrangements. After [[683 BC]] the offices were held for only a single year, and the year was named after the Archon Eponymos. (Many ancient [[calendar]] systems did not number their years consecutively.) After [[487 BC]] the archonships were assigned by lot to any citizen and the Polemarch's military duties were taken over by a new class of generals known as ''[[strategoi]]''. {{Citation needed|date=May 2007}}The Polemarch thereafter had only minor religious duties. The Archon Eponymus remained the titular head of state under [[democracy]], though of much reduced political importance. {{Citation needed|date=May 2007}} The Archons were assisted by \"junior Archons\", called ''Thesmothetes''. After [[457 BC]] ex-archons were automatically enrolled as life members of the [[Areopagus]], though that assembly was no longer extremely important politically at that time. (See [[Archons of Athens]].)\n\n==Archons of the Ecumenical Patriarchate of Constantinople==\nFrom time to time, [[laity]] of the [[Eastern Orthodoxy|Orthodox Church]] in communion with the [[Patriarch of Constantinople]] have been granted the title of ''Archon'' to honor their service to Church administration. In 1963, Archons were organized into a service society dedicated to [[Saint Andrew|St Andrew]]. This ''Archon'' status is not part of the Church hierarchy and is purely honorary. See http://www.archons.org/ .\n\nAn Archon is an honoree by His All Holiness the Ecumenical Patriarch, for his outstanding service to the Church, and a well-known, distinguished, and well-respected leader of the [[Eastern Orthodoxy|Orthodox Church]] (at large).\n\nIt is the sworn oath of the Archon to defend and promote the [[Eastern Orthodoxy|Orthodox Church]] faith and tradition. His main concern is to protect and promote the Holy Patriarchate and its mission. He is also concerned with [[human rights]] and the well-being and general welfare of the Church.\n\nAs it is a significant religious position, the faith and dedication of a candidate for the role are extensively reviewed during consideration; the candidate should have demonstrated commitment for the betterment of the Church, Parish-Diocese, Archdiocese and the community as a whole.\n\n==Gnostic Archons==\n{{Gnosticism}}\nIn late antiquity some variants of [[Gnosticism]] used the term ''Archon'' to refer to several servants of the ''[[Demiurge]]'', the \"creator god\", that stood between the human race and a transcendent God that could only be reached through [[gnosis]]. In this context they have the role of the [[angels]] and [[demons]] of the [[Old Testament]].\n\nThe Egyptian Gnostic [[Basilideans]] accepted the existence of an archon called [[Abraxas]] who was the prince of 365 spiritual beings ([[Irenaeus]], ''[[On the Detection and Overthrow of the So-Called Gnosis|Adversus Haereses]]'', I.24). The [[Orphic]]s accepted the existence of seven archons: [[Demiurge|Iadabaoth]] or Ialdabaoth (who created the six others), [[Iao]], [[Sabaoth]], [[Adonaios]], [[Elaios]], [[Astaphanos]] and [[Horaios]] ([[Origen]], [[Contra Celsum]], VI.31). The commonly-called [[Pistis Sophia]] (or [http://www.webcom.com/~gnosis/library/psoph.htm The Books of the Savior]) gives another set: [[Paraplex]], [[Hekate]], [[Ariouth]] (females), [[Typhon]], and [[Iachtanabas]] (males).\n\nIaldabaoth had a head of a lion, like [[Mithraic]] Kronos ([[Chronos]]) and [[Historical Vedic religion|Vedic]] [[Narasimha]], a form of [[Vishnu]]. Their wrathful nature was mistaken as [[evil]]. The snake wrapped around them is Ananta ([[Sesha]]) [[Naga (mythology)]].\n\n==Other uses==\n\n===Real life===\n*The term is used within the [[Arabic|Arab]]-speaking [[Copt]]s in church parlance as a [[title]] for a leading member of the [[laity]].\n*Archon is the title given to presidents of student chapters of the [[Pi Kappa Phi]] Fraternity. Vice-presidents are known as Vice Archons.\n*Archon is the title given to the vice-president of student chapters of the [[Pi Lambda Phi]] Fraternity\n*Archon is the title given to presidents of student chapters of the [[Phi Sigma Sigma]] Sorority. Vice-presidents are known as  Vice Archons.\n*Eminent Archon is the title given to presidents of chapters of the [[Sigma Alpha Epsilon]] Fraternity. Vice-presidents are known as Eminent Deputy Archons.\n*Grand Archon is the title given to presidents of the Sigma Delta Phi sorority and the Sigma Rho fraternity of the [[University of the Philippines]].\n*Archon is the designation given to individual members of the [[Sigma Pi Phi]] Fraternity. The wives of the members are termed ''Archousa'' (pl. ''Archousai'').\n*The Archons are a Greek co-ed group at Kenyon College that focuses on social fun through service events. Their motto is \"[[Esse quam videri|Esse Quam Videri]],\" Latin for \"To Be, Not to Seem to Be.\"\n*On the campus of the University of Rio Grande (Ohio) the Fraternal order of Archon exists.  Their brethren are commonly called, “Archons.”  The fraterinty has adapted the Greek letters AXN (alpha chi nu).\n\n===Books===\n*The term is used as the title of rulers in [[English language]] [[fiction]], [[television programs]], and games of the [[science fiction]] and [[fantasy]] genres.  Examples include  the [[Outlanders]] series of science fiction novels and the comic book series, [[The Invisibles]], in which they are generally portrayed according to the authentic Gnostic nature of the term.  It is also a common title in collegiate [[Fraternities and sororities|fraternity and sorority]] organizations.\n*In the book [[Scar Night]], Archons were a race of winged beings that were sent by Ulcis,the god of chains, out of the Abyss.\n*In the book [[Mind Invaders]] by Dave Hunt, The Archons are nine demonic beings who pretend to be highly evolved intelligent beings who have come to guide mankind to its next evolutionary step.\n*In the Greek versions of the [[Harry Potter]] books, Tom Riddle is named Anton Morvol Hert, which is an anagram of \"Archon Voldemort\".\n*[[Jacques Derrida]] uses 'archon' to refer to the guardian and authoritative interpreter of an archive. For example, Derrida traces the archon to the Greek concept in ''Archive Fever: A Freudian Impression'' (1995, p.&nbsp;2).\n*\"Archons of Athens!\" was the catchphrase of [[Dr. Gideon Fell]], a long-running detective character created by [[John Dickson Carr]].\n*In the book [[The Secrets of the Immortal Nicholas Flamel]], Archons are beings of an ancient race which once ruled earth.\n\n===Movies and television===\n*In the ''[[Star Trek: The Original Series|Star Trek]]'' episode \"[[The Return of the Archons]],\" the space vessel ''Archon'' crashes on Beta III.  The crew of the USS Enterprise are referred to as Archons, after the crew of the ill-fated ship.\n*In [[Stargate SG-1]], Archons are similar to lawyers for the [[Tollan (Stargate)|Tollans]] (an advance race living on a planet called [[Tollana]]). During Triad (trial), there are three archons, one for each defendant and a neutral archon, who has a casting vote.\n* In [[NX Files]], Archons are evolved beings who guide Team Xtreme, the true purpose of which remains a mystery.\n* Some speculate that the Agents featured in [[The Matrix]] films were intended to metaphorically represent Gnostic Archons, in that they stood between humanity and their transcendence from the Matrix, into the enlightened real world. Also the robots could be seen as Archons in that they are our creations who have in a sense enslaved us in a false reality and live off our energy.\n\n===Role-playing games===\n*In the [[Dungeons & Dragons]] [[Parallel universe (fiction)|multiverse]], [[Archon (Dungeons & Dragons)|archons]] are an [[angel]]ic race indigenous to [[Mount Celestia]].\n*In the [[World of Darkness]], Archons are the chosen servants of the Justicars; both serving under, to reinforce, the Camarilla sect of Vampires.\n*In the game [[Kult]], the ten Archons are servitors of the evil [[Demiurge]]. Their task is to keep humanity imprisoned in the Demiurge's illusion and ignorant of Reality and their true nature.\n\n===Video games===\n*[[Warlords Battlecry]] uses Archons as special powerful troops that can be produced in towers (as allies) and as a flight unit for one of the races in [[Warlords Battlecry III]].\n*In the [[Battletech]] universe, the heads of state of first the [[Lyran Commonwealth]] and later the [[Lyran Alliance]] are known by the title of Archon.\n*In the science-fiction series ''[[StarCraft]]'', archons are powerful [[psionic]] entities, formed by two mentally disciplined [[Protoss]] merging their minds and corporeal bodies into psionic energy. In the games, they serve as heavy assault warriors. A number of variations of archons can be formed depending on the affiliation of the participants.\n*In the game [[Fable (video game)|Fable]], archon was the title of rulers of the Old Kingdom.  Ultimately, the last archon became corrupted by the Sword of Aeons that granted archons the might to rule.\n*[[Archon (computer game)|Archon]] was a popular 1980s 8-bit computer game where opposing teams of good and evil characters did battle on a game board similar to a chess board.\n*In the online game [[Materia Magica]], Archons are the highest level players, subordinate only to the Immortals (system administrators).  Achievement of Archon rank requires advancement through 240 levels of play and completion of a special quest.\n*One of the final areas in the [[video game]] [[Xenosaga Episode III: Also sprach Zarathustra]] is called the Archon [[Cathedral]].  The game is known to use Gnostic and Judeo-Christian terminology as well as various terms from psychology.\n*Used as the title for subcommanders of the Council villain group in the [[MMORPG]] [[City of Heroes]] and it's expansion/counterpart [[City of Villains]].\n* In the [[computer game]] [[Lords of Magic]] (put out by [[Sierra Entertainment]]), the Archons were the human race that adhered to the faith of Order.\n* In the [[computer game]] [[EVE Online]] (put out by [[CCP Games]]), the Archon is the carrier of the Amarrian race.\n* In the [[computer game]] ''[[NetHack]]'', the Archon is the second most difficult of the randomly-generated monsters, and is regarded as the best pet.\n* In [[Deus Ex]], the username [[demiurge]] and the password archon can be used on a [[UNATCO]] computer to find a [[killphrase]] to be used on a powerful enemy.\n* Archons in [[RF Online]] are ten players with the highest Contribution Point (although Archons must be voted in to be elected), therefore considered as the leader of the race. Each race has its own Archon players.\n* In [[Age of Wonders 2]] the Archons are a race who fight for just causes, and preach virtue and obedience to their subjects. They seldom seek to overrun any kingdom, but instead seem to appear where they might most likely be overpowered. Still, they persevere and are fearless in the face of death.\n\n===Others===\n* In the popular [[trading card game]] [[Magic: The Gathering]], there are cards named '''[http://ww2.wizards.com/gatherer/CardDetails.aspx?name=blazing_archon Blazing Archon]''' and '''[http://ww2.wizards.com/gatherer/CardDetails.aspx?name=cabal_archon Cabal Archon]'''.\n*In the fantasy webcomic [[Erfworld]], \"Charlie's Archons\" are powerful flying units.  Their appearance and name are parodies of [[Charlie's Angels]].\n*One of the most angry members of the [[Newgrounds]]-based group the Clock Crew, is ArchonClock.\n\n==References==\n*''A Greek-English Lexicon'' (''aka'' Liddell and Scott), ISBN 0-19-864226-1\n*''The [[Oxford Companion to Classical Literature]]'', ISBN 0-19-866121-5.\n*[http://www.archons.patriarchate.org/ Archons of the Ecumenical Patriarchate]\n\n{{portal|Philosophy|Socrates.png}}\n\n<!-- for ancient Greek rulers and for Gnostic lower gods -->\n\n[[Category:Demons in Gnosticism]]\n[[Category:Positions of subnational authority]]\n[[Category:Ancient Greek titles]]\n[[Category:Government of Ancient Greece]]\n[[Category:Philosophy of law]]\n[[Category:Political philosophy]]\n[[Category:Philosophical terminology]]\n\n[[be:Архонт]]\n[[bg:Архонт]]\n[[bs:Arhont]]\n[[br:Arc'honted Aten]]\n[[ca:Arcont]]\n[[de:Archon (Beamter)]]\n[[et:Arhont]]\n[[es:Arconte]]\n[[fr:Archonte]]\n[[it:Arconte (storia)]]\n[[he:ארכון]]\n[[lt:Archontas]]\n[[nl:Archont (ambt)]]\n[[ja:アルコン]]\n[[no:Archon]]\n[[pl:Archont]]\n[[pt:Arconte]]\n[[ru:Архонт]]\n[[sk:Archon]]\n[[sh:Arhont]]\n[[fi:Arkontti]]\n[[sv:Arkont]]\n[[uk:Архонт]]\n[[zh:執政官 (雅典)]]", "contentmodel": "wikitext", "contentformat": "text/x-wiki"}], "title": "Archon"}}}}