{"batchcomplete": "", "query": {"normalized": [{"to": "Abraham Joshua Heschel", "from": "Abraham_Joshua_Heschel"}], "pages": {"2851": {"extract": "Abraham Joshua Heschel (January 11, 1907 – December 23, 1972) was a Polish-born American rabbi and one of the leading Jewish theologians and Jewish philosophers of the 20th century. Heschel, a professor of Jewish mysticism at the Jewish Theological Seminary of America, authored a number of widely read books on Jewish philosophy and was active in the American Civil Rights movement.\n\n\n== Biography ==\nAbraham Joshua Heschel was born in 1907 as the youngest of six children of Moshe Mordechai and Reizel Perlow. He was descended from preeminent European rabbis on both sides of his family. His paternal great-great-grandfather and namesake was Rebbe Avraham Yehoshua Heshel of Apt in present-day Poland. His mother was also a descendant of Avraham Yehoshua Heshel and other Hasidic dynasties. His siblings were Sarah, Dvora Miriam, Esther Sima, Gittel, and Jacob. Their father Moshe died of influenza in 1916 when Abraham was nine.\nAfter a traditional yeshiva education and studying for Orthodox rabbinical ordination semicha, Heschel pursued his doctorate at the University of Berlin and a liberal rabbinic ordination at the Hochschule für die Wissenschaft des Judentums. There he studied under some of the finest Jewish educators of the time: Chanoch Albeck, Ismar Elbogen, Julius Guttmann, and Leo Baeck. His mentor in Berlin was David Koigen.Heschel later taught Talmud at the Hochschule. He joined a Yiddish poetry group, Jung Vilna, and in 1933, published a volume of Yiddish poems, Der Shem Hamefoyrosh: Mentsch, dedicated to his father.\nIn late October 1938, when Heschel was living in a rented room in the home of a Jewish family in Frankfurt, he was arrested by the Gestapo and deported to Poland. He spent ten months lecturing on Jewish philosophy and Torah at Warsaw's Institute for Jewish Studies. Six weeks before the German invasion of Poland, Heschel left Warsaw for London with the help of Julian Morgenstern, president of Hebrew Union College, who had been working to obtain visas for Jewish scholars in Europe.\nHeschel's sister Esther was killed in a German bombing. His mother was murdered by the Nazis, and two other sisters, Gittel and Devorah, died in Nazi concentration camps. He never returned to Germany, Austria or Poland. He once wrote, \"If I should go to Poland or Germany, every stone, every tree would remind me of contempt, hatred, murder, of children killed, of mothers burned alive, of human beings asphyxiated.\"\nHeschel arrived in New York City in March 1940. He served on the faculty of Hebrew Union College (HUC), the main seminary of Reform Judaism, in Cincinnati for five years. In 1946, he took a position at the Jewish Theological Seminary of America (JTS) in New York City, the main seminary of Conservative Judaism. He served as professor of Jewish ethics and Mysticism until his death in 1972.\n\n\n== Marriage and family ==\nHeschel married Sylvia Straus, a concert pianist, on December 10, 1946, in Los Angeles. Their daughter, Susannah Heschel, became a Jewish scholar in her own right. Heschel's papers are held in the Rubenstein Rare Book & Manuscript Library at Duke University.\n\n\n== Ideology ==\n\nHeschel explicated many facets of Jewish thought, including studies on medieval Jewish philosophy, Kabbalah, and Hasidism. According to some scholars, he was more interested in spirituality than in critical text study; the latter was a specialty of many scholars at JTS. He was not given a graduate assistant for many years and was relegated to teach mainly in the education school or Rabbinical school, not in the academic graduate program. Heschel became quite friendly with his colleague Mordecai Kaplan. Though they differed in their approach to Judaism, they had a very cordial relationship and visited each other's homes from time to time.\nHeschel believed the teachings of the Hebrew prophets were a clarion call for social action in the United States and worked for African Americans' civil rights and against the Vietnam War.\nHe also specifically criticized what he called \"pan-halakhism\", or an exclusive focus upon religiously compatible behavior to the neglect of the non-legalistic dimension of rabbinic tradition.\n\n\n=== Influence outside Judaism ===\n\nHeschel is a widely read Jewish theologian whose most influential works include Man Is Not Alone, God in Search of Man, The Sabbath, and The Prophets. At the Vatican Council II, as representative of American Jews, Heschel persuaded the Roman Catholic Church to eliminate or modify passages in its liturgy that demeaned the Jews, or referred to an expected conversion to Christianity. His theological works argued that religious experience is a fundamentally human impulse, not just a Jewish one. He believed that no religious community could claim a monopoly on religious truth.\n\n\n== Published works ==\n\n\n=== The Sabbath (1951) ===\nThe Sabbath: Its Meaning for Modern Man is a work on the nature and celebration of Shabbat, the Jewish Sabbath. This work is rooted in the thesis that Judaism is a religion of time, not space, and that the Sabbath symbolizes the sanctification of time.\n\n\n=== Man Is Not Alone (1951) ===\nMan Is Not Alone: A Philosophy of Religion offers Heschel's views on how people can comprehend God. Judaism views God as being radically different from humans, so Heschel explores the ways that Judaism teaches that a person may have an encounter with the ineffable. A recurring theme in this work is the radical amazement that people feel when experiencing the presence of the Divine. Heschel then goes on to explore the problems of doubts and faith; what Judaism means by teaching that God is one; the essence of humanity and the problem of human needs; the definition of religion in general and of Judaism in particular; and human yearning for spirituality. He offers his views as to Judaism being a pattern for life.\n\n\n=== God in Search of Man (1955) ===\nGod in Search of Man: A Philosophy of Judaism is a companion volume to Man Is Not Alone. In this book Heschel discusses the nature of religious thought, how thought becomes faith, and how faith creates responses in the believer. He discusses ways that people can seek God's presence, and the radical amazement that we receive in return. He offers a criticism of nature worship; a study of humanity's metaphysical loneliness, and his view that we can consider God to be in search of humanity. The first section concludes with a study of Jews as a chosen people. Section two deals with the idea of revelation, and what it means for one to be a prophet. This section gives us his idea of revelation as an event, as opposed to a process. This relates to Israel's commitment to God. Section three discusses his views of how a Jew should understand the nature of Judaism as a religion. He discusses and rejects the idea that mere faith (without law) alone is enough, but then cautions against rabbis he sees as adding too many restrictions to Jewish law. He discusses the need to correlate ritual observance with spirituality and love, the importance of Kavanah (intention) when performing mitzvot. He engages in a discussion of religious behaviorism—when people strive for external compliance with the law, yet disregard the importance of inner devotion.\n\n\n=== The Prophets (1962) ===\nThis work started out as his PhD thesis in German, which he later expanded and translated into English. Originally published in a two-volume edition, this work studies the books of the Hebrew prophets. It covers their lives and the historical context that their missions were set in, summarizes their work, and discusses their psychological state. In it Heschel puts forward what would become a central idea in his theology: that the prophetic (and, ultimately, Jewish) view of God is best understood not as anthropomorphic (that God takes human form) but rather as anthropopathic—that God has human feelings.\nIn his book The Prophets, Abraham Joshua Heschel describes the unique aspect of the Jewish prophets as compared to other similar figures. Whereas other nations have soothsayers and diviners who attempt to discover the will of their gods, according to Heschel the Hebrew prophets are characterized by their experience of what he calls theotropism—God turning towards humanity. Heschel argues for the view of Hebrew prophets as receivers of the \"Divine Pathos\", of the wrath and sorrow of God over his nation that has forsaken him. In this view, prophets do not speak for God so much as they remind their audience of God's voice for the voiceless, the poor and oppressed.\nHe writes:\n\nProphecy is the voice that God has lent to the silent agony, a voice to the plundered poor, to the profane riches of the world. It is a form of living, a crossing point of God and man. God is raging in the prophet's words.\n\n\n=== Torah min HaShamayim (1962) ===\nMany consider Heschel's Torah min HaShamayim BeAspaklariya shel HaDorot, (Torah from Heaven in the mirror of the generations) to be his masterwork. The three volumes of this work are a study of classical rabbinic theology and aggadah, as opposed to halakha (Jewish law.) It explores the views of the rabbis in the Mishnah, Talmud and Midrash about the nature of Torah, the revelation of God to mankind, prophecy, and the ways that Jews have used scriptural exegesis to expand and understand these core Jewish texts. In this work, Heschel views the 2nd century sages Rabbi Akiva and Ishmael ben Elisha as paradigms for the two dominant world-views in Jewish theology\nTwo Hebrew volumes were published during his lifetime by Soncino Press, and the third Hebrew volume was published posthumously by JTS Press in the 1990s. An English translation of all three volumes, with notes, essays and appendices, was translated and edited by Rabbi Gordon Tucker, entitled Heavenly Torah: As Refracted Through the Generations. In its own right it can be the subject of intense study and analysis, and provides insight into the relationship between God and Man beyond the world of Judaism and for all Monotheism.\n\n\n=== Prophetic Inspiration After the Prophets (1966) ===\nHeschel wrote a series of articles, originally in Hebrew, on the existence of prophecy in Judaism after the destruction of the Holy Temple in Jerusalem in 70 CE. These essays were translated into English and published as Prophetic Inspiration After the Prophets: Maimonides and Others by the American Judaica publisher Ktav.\nThe publisher of this book states, \"The standard Jewish view is that prophecy ended with the ancient prophets, somewhere early in the Second Temple era. Heschel demonstrated that this view is not altogether accurate. Belief in the possibility of continued prophetic inspiration, and in its actual occurrence appear throughout much of the medieval period, and even in modern times. Heschel's work on prophetic inspiration in the Middle Ages originally appeared in two long Hebrew articles. In them he concentrated on the idea that prophetic inspiration was possible even in post-Talmudic times, and, indeed, had taken place at various times and in various schools, from the Geonim to Maimonides and beyond.\"\n\n\n== Commemoration ==\n\nFour schools have been named for Heschel, in the Upper West Side of New York City, Northridge, California, Agoura Hills, California, and Toronto, Canada. In 2009, a highway in Missouri was named \"Dr. Abraham Joshua Heschel Highway\" after a Springfield, Missouri area Neo-Nazi group cleaned the stretch of highway as part of an \"Adopt-A-Highway\" plan. Heschel's daughter, Susannah, has objected to the adoption of her father's name in this context.\n\n\n== Selected bibliography ==\nThe Earth Is the Lord's: The Inner World of the Jew in Eastern Europe. 1949. ISBN 1-879045-42-7\nMan Is Not Alone: A Philosophy of Religion. 1951. ISBN 0-374-51328-7\nThe Sabbath: Its Meaning for Modern Man. 1951. ISBN 1-59030-082-3\nMan's Quest for God: Studies in Prayer and Symbolism. 1954. ISBN 0-684-16829-4\nGod in Search of Man: A Philosophy of Judaism. 1955. ISBN 0-374-51331-7\nThe Prophets. 1962. ISBN 0-06-093699-1\nWho Is Man? 1965. ISBN 0-8047-0266-7\nIsrael: An Echo of Eternity. 1969. ISBN 1-879045-70-2\nA Passion for Truth. 1973. ISBN 1-879045-41-9\nHeavenly Torah: As Refracted Through the Generations. 2005. ISBN 0-8264-0802-8\nTorah min ha-shamayim be'aspaklariya shel ha-dorot; Theology of Ancient Judaism. [Hebrew]. 2 vols. London: Soncino Press, 1962. Third volume, New York: Jewish Theological Seminary, 1995.\nThe Ineffable Name of God: Man: Poems. 2004. ISBN 0-8264-1632-2\nKotsk: in gerangl far emesdikeyt. [Yiddish]. 2 v. (694 p.) Tel-Aviv: ha-Menorah, 1973. Added t.p.: Kotzk: the struggle for integrity (A Hebrew translation of vol. 1, Jerusalem: Magid, 2015). A Passion for Truth is an adaptation of this larger work.\nDer mizrekh-Eyropeyisher Yid (Yiddish: The Eastern European Jew‎). 45 p. Originally published: New-York: Shoken, 1946.\nAbraham Joshua Heschel: Prophetic Witness & Spiritual Radical: Abraham Joshua Heschel in America, 1940–1972, biography by Edward K. Kaplan ISBN 0-300-11540-7\n\"The Encyclopedia of Hasidism\" edited by Rabinowicz, Tzvi M.: ISBN 1-56821-123-6 Jason Aronson, Inc., 1996.\n\n\n== References ==\n\n\n== Further reading ==\nKaplan, Edward K.; Samuel H. Dresner (1998). Abraham Joshua Heschel: Prophetic Witness. Yale University Press. ISBN 978-0-300-07186-3. \nKaplan, Edward K. (2007). Spiritual Radical: Abraham Joshua Heschel in America, 1940–1972. Yale University Press. ISBN 0-300-13769-9. \n\n\n== External links ==\nGuide to the Abraham Joshua Heschel Papers, Rubenstein Library, Duke University.\nHeschel's role in Vatican II and his advocacy of interreligious respect\nAlan Brill Review of Heavenly Torah\nArnold Jacob Wolf Review of Heavenly Torah\nDavid Blumenthal review of Heavenly Torah\nAbout Rabbi A. J. Heschel The Heschel Center for Environmental Learning and Leadership", "ns": 0, "pageid": 2851, "title": "Abraham Joshua Heschel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}