{"batchcomplete": "", "query": {"normalized": [{"to": "Abraham Robinson", "from": "Abraham_Robinson"}], "pages": {"46024": {"extract": "Abraham Robinson (born Robinsohn; October 6, 1918 – April 11, 1974) was a mathematician who is most widely known for development of non-standard analysis, a mathematically rigorous system whereby infinitesimal and infinite numbers were reincorporated into modern mathematics. Nearly half of Robinson's papers were in applied mathematics rather than in pure mathematics.\n\n\n== Biography ==\nHe was born to a Jewish family with strong Zionist beliefs, in Waldenburg, Germany, which is now Wałbrzych, in Poland. In 1933, he emigrated to British Mandate of Palestine, where he earned a first degree from the Hebrew University. Robinson was in France when the Nazis invaded during World War II, and escaped by train and on foot, being alternately questioned by French soldiers suspicious of his German passport and asked by them to share his map, which was more detailed than theirs. While in London, he joined the Free French Air Force and contributed to the war effort by teaching himself aerodynamics and becoming an expert on the airfoils used in the wings of fighter planes.\nAfter the war, Robinson worked in London, Toronto, and Jerusalem, but ended up at University of California, Los Angeles in 1962.\n\n\n== Work in model theory ==\nHe became known for his approach of using the methods of mathematical logic to attack problems in analysis and abstract algebra. He \"introduced many of the fundamental notions of model theory\". Using these methods, he found a way of using formal logic to show that there are self-consistent nonstandard models of the real number system that include infinite and infinitesimal numbers. Others, such as Wilhelmus Luxemburg, showed that the same results could be achieved using ultrafilters, which made Robinson's work more accessible to mathematicians who lacked training in formal logic. Robinson's book Non-standard Analysis was published in 1966. Robinson was strongly interested in the history and philosophy of mathematics, and often remarked that he wanted to get inside the head of Leibniz, the first mathematician to attempt to articulate clearly the concept of infinitesimal numbers.\nWhile at UCLA his colleagues remember him as working hard to accommodate PhD students of all levels of ability by finding them projects of the appropriate difficulty. He was courted by Yale, and after some initial reluctance, he moved there in 1967. He died of pancreatic cancer in 1974.\n\n\n== Notes ==\n\n\n== Publications ==\nRobinson, Abraham (1963), Introduction to model theory and to the metamathematics of algebra, Amsterdam: North-Holland, ISBN 978-0-7204-2222-1, MR 0153570 \nRobinson, Abraham (1977) [1956], Keisler, H. Jerome, ed., Complete theories, Studies in Logic and the Foundations of Mathematics (2nd ed.), Amsterdam: North-Holland, ISBN 978-0-7204-0690-0, MR 0472504 \nRobinson, Abraham (1979), Keisler, H. Jerome, ed., Selected papers of Abraham Robinson. Vol. I Model theory and algebra, Yale University Press, ISBN 978-0-300-02071-7, MR 533887 \nRobinson, Abraham (1979), Luxemburg, W. A. J.; Körner, S., eds., Selected papers of Abraham Robinson. Vol. II Nonstandard analysis and philosophy, Yale University Press, ISBN 978-0-300-02072-4, MR 533888 \nRobinson, Abraham (1979), Young, A. D., ed., Selected papers of Abraham Robinson. Vol. III Aeronautics, Yale University Press, ISBN 978-0-300-02073-1, MR 533889 \nRobinson, Abraham (1996) [1966], Non-standard analysis, Princeton Landmarks in Mathematics (2nd ed.), Princeton University Press, ISBN 978-0-691-04490-3, MR 0205854 \n\n\n== See also ==\nInfluence of non-standard analysis\n\n\n== References ==\nJ. W. Dauben, Abraham Robinson: The Creation of Nonstandard Analysis, A Personal and Mathematical Odyssey, Princeton, NJ: Princeton University Press, 1998\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Abraham Robinson\", MacTutor History of Mathematics archive, University of St Andrews .\nAbraham Robinson at the Mathematics Genealogy Project\nAbraham Robinson — Biographical Memoirs of the National Academy of Sciences", "ns": 0, "pageid": 46024, "title": "Abraham Robinson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}