{"batchcomplete": "", "query": {"normalized": [{"to": "Adam Müller", "from": "Adam_Müller"}], "pages": {"1267277": {"extract": "Adam Heinrich Müller (30 June 1779 – 17 January 1829; after 1827 Ritter von Nitterdorf) was a German publicist, literary critic, political economist, theorist of the state and forerunner of economic romanticism.\n\n\n== Biography ==\n\n\n=== Early life ===\nMüller was born in Berlin. It was intended that he should study Protestant theology, but from 1798 he devoted himself in Göttingen to the study of law, philosophy, and natural science. He was a student of Gustav Hugo. Returning to Berlin, he was persuaded by his friend Friedrich von Gentz to take up political science. He had early formed a close intimacy with Gentz, his elder by 15 years; and this connection exercised an important influence both on his material circumstances and his mental development in after life. The two men differed widely in character and in their fundamental principles, but agreed, at least in their later period, in their practical political aims, and the friendship was only terminated by death.\nMüller worked for some time as referendary in the Kurmärkische Kammer in Berlin. Müller's relations with the Junker party and his co-operation with them in their opposition to Hardenberg's reforms made any public employment in Prussia impossible for him. He travelled in Sweden and Denmark, spent about two years in Poland, and then went to Vienna, where he was converted to the Catholic faith on 30 April 1805. Through Gentz he became acquainted with Metternich, to whom he was useful in the preparation of state papers.\n\n\n=== Career ===\nFrom 1806 to 1809, he lived at Dresden occupied in the political education of Prince Bernhard of Saxe-Weimar and lecturer on German literature, dramatic art, and political science. In 1808 he edited with Heinrich von Kleist the periodical Phoebus. In 1809, he returned to Berlin, and in 1811 to Vienna, where he lived in the house of Archduke Maximilian of Austria-Este and became the friend of Clemens Maria Hofbauer.\nIn 1813, he entered the Austrian service, and was appointed imperial commissioner and major of the rifle corps in Tyrol. He took part in the wars for liberty, and later on, as counsellor of the government, in the reorganization of the country. In 1815 he was called to Vienna, and went to Paris with the imperial staff.\nOn the conclusion of peace, he became Austrian consul-general for Saxony at Leipzig, and agent for Anhalt and Schwarzburg. He edited here the periodicals Deutscher Staatsanzeiger (1816–1818) and Unparteiischer Literatur- und Kirchenkorrespondent. He attended the ministerial conferences at Carlsbad and Vienna (1819–1820), where, being one of the principal literary instruments of the reaction, he took part in framing the Carlsbad resolutions. In 1826, at the instance of Prince von Metternich, he was ennobled as Ritter von Nittersdorf, was recalled to Vienna (1827), appointed imperial counsellor, and employed in the service of the chancellery. He died in Vienna in 1829, aged 49.\n\n\n== Positions and theories ==\n\nMüller was distinguished as a writer not only on politics and economics, but on literature and aesthetics. His chief work is the Elemente der Staatskunst (Elements of Statecraft), originating in lectures delivered before Prince Bernhard of Saxe-Weimar and an assembly of politicians and diplomats at Dresden in the winter, 1808-09. It treats in six books of the state, of right, of the spirit of legislation in antiquity and in the Middle Ages, of money and national wealth, of the economical factors of the state and trade, of the relation between the state and religion. Müller endeavoured to comprehend the connexion between political and social science, and, while using the historical method, to base them upon philosophy and religion. (Cf. the preface to the first volume of the Elemente, where he treats exhaustively the differences between his work and Montesquieu's De l'esprit des lois; cf. also the sixth book of this work, and the above-mentioned work of 1820.) With Edmund Burke, Friedrich von Gentz, Joseph de Maistre, and Karl Ludwig von Haller, he must be reckoned among the chief opponents of revolutionary ideas in politics.\nIn his work, Von der Notwendigkeit einer theologischen Grundlage der gesamten Staatswissenschaften (On the necessity of a comprehensive theological foundation for political science, 1820), Müller rejects, like Haller (Restauration der Staatswissenschaften, 1816), the distinction between constitutional and civil law (common law), which rests entirely on the idea of the state's omnipotence. His ideal is medieval feudalism, on which the reorganization of modern political institutions should be modelled.\n\n\n=== Romanticist ===\nIn the field of literature and aesthetics, Müller belongs to the Romantic school. He is a Romanticist even in his specialty, politics and political economy. As Eichendorff says in his Geschichte der poetischen Literatur Deutschlands (new ed., by W. Kosch, Kempten, 1906, p. 352), Müller \"mapped out a domain of his own, the application of Romanticism to the social and political conditions of life.\" Carl Schmitt presented the view that \"it is impossible to judge Müller's theory of the state as anything but a matter of aesthetics and style.\" Müller himself declares: \"The reconciliation of science and art and of their noblest ideas with serious political life was the purpose of my larger works\" (Vermischte Schriften, I, p. iii).\n\n\n=== Economics ===\nHis position in political economy is defined by his strong opposition to Adam Smith's system of materialistic-liberal (so-called classical) political economy, or the so-called industry system. He censures Smith as presenting a one-sidedly material and individualistic conception of society, and as being too exclusively English in his views. Müller is thus also an adversary of free trade. In contrast with the economical individualism of Adam Smith, he emphasizes the ethical element in national economy, the duty of the state toward the individual, and the religious basis which is also necessary in this field. Müller's importance in the history of political economy is acknowledged even by the opponents of his religious and political point of view. His reaction against Adam Smith, says Roscher (Geschichte der National-Ökonomik, p. 763), \"is not blind or hostile, but is important, and often truly helpful.\" Some of his ideas, freed from much of their alloy, are reproduced in the writings of the historical school of German economists.\nThe reactionary and feudalistic thought in Müller's writings, which agreed so little with the spirit of the times, prevented his political ideas from exerting a more notable and lasting influence on his age, while their religious character prevented them from being justly appreciated. However, Müller's teachings had long-term effects in that they were taken up again by 20th century theorists of corporatism and the corporate state, for example Othmar Spann (Der wahre Staat. Vorlesungen über Abbruch und Neubau der Gesellschaft, Vienna, 1921).\n\n\n== Writings ==\nMüller was a man of great and versatile talents, an excellent orator, and a suggestive writer. Several of his works were based upon his own lectures; the most important (besides the above-mentioned periodicals) are:\nDie Lehre vom Gegensatz (Berlin, 1804)\nVorlesungen über die deutsche Wissenschaft und Literatur (Dresden, 1806, 2nd ed., 1807)\nVon der Idee der Schönheit (lectures; Berlin, 1809)\nDie Elemente der Staatskunst (lectures; 3 parts, Berlin, 1809)\nÜber König Friedrich II. und die Natur, Würde und Bestimmung der preußischen Monarchie (lectures; Berlin, 1810)\nDie Theorie der Staatshaushaltung und ihre Forschritte in Deutschland und England seit Adam Smith (2 vols., Vienna, 1812)\nVermischte Schriften über Staat, Philosophie und Kunst (2 vols., Vienna, 1812; 2nd ed., 1817)\nVersuch einer neuen Theorie des Geldes, mit besonderer Rücksicht auf Großbritannien (Leipzig, 1816)\nZwölf Reden über die Beredsamkeit und deren Verfall in Deutschland (Leipzig, 1817)\nDie Fortschritte der nationalökonomischen Wissenschaft in England (Leipzig, 1817)\nVon der Notwendigkeit einer theologischen Grundlage der gesamten Staatswissenschaften und der Staatswirtschaft insbesondere (Leipzig, 1820; new ed., Vienna, 1898)\nDie Gewerbe-Polizei in Beziehung auf den Landbau (Leipzig, 1824)\nVorschlag zu einem historischen Ferien-Cursus (Vienna, 1829)\nA critical pamphlet, which was written in 1817 on the occasion of the Protestant jubilee of the Reformation and entitled, Etwas, das Goethe gesagt hat. Beleuchtet von Adam Müller. Leipzig, den 31 Oktober 1817, was printed but not published (reprinted in Vienna, 1910). Nevertheless, Traugott Krug's reply, entitled Etwas, das Herr Adam Müller gesagt hat über etwas, das Goethe gesagt hat, und noch etwas, das Luther gesagt hat (Leipzig, 1817), appeared in two editions.\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). \"Adam Heinrich Müller\". Catholic Encyclopedia. New York: Robert Appleton. \n This article incorporates text from a publication now in the public domain: Rines, George Edwin, ed. (1920). \"Müller, Adam Heinrich\". Encyclopedia Americana.  This work in turn cites:\nErnst Mischler (1885), \"Müller, Adam Heinrich\", Allgemeine Deutsche Biographie (ADB) (in German), 22, Leipzig: Duncker & Humblot, pp. 501–511 \n\n\n== External links ==\nCorrespondence between Müller and Gentz 1807/08\nWorks by or about Ritter von Nitterdorf at Internet Archive\nWorks by or about Adam Müller at Internet Archive", "ns": 0, "pageid": 1267277, "title": "Adam Müller"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}