{"batchcomplete": "", "query": {"normalized": [{"to": "Alan Ryan", "from": "Alan_Ryan"}], "pages": {"11335700": {"extract": "Alan James Ryan, FBA (born 9 May 1940) was Warden of New College, Oxford, and Professor of Politics at the University of Oxford and is currently a lecturer at Princeton University.\n\n\n== Biography ==\nHe was educated at Christ's Hospital, Balliol College, Oxford, and University College, London. Elected a fellow of New College in 1969, he later taught at Princeton University, and returned to New College, Oxford, in 1996 to take up the Wardenship. He was made a Fellow of the British Academy in 1986.\nA political theorist and historian of political thought, Ryan is a recognised authority on development of modern liberalism, and especially the work of John Stuart Mill, having contributed directly to the ‘Reversionary’ school, which led to a re-examination of Mill's work from the 1970s. His academic work also takes in broader themes in political theory, including the philosophy of social science, the nature of property, the history of political thought, and liberalism of the 19th and 20th centuries.\nRyan has held positions at the Universities of Oxford, Essex, Keele and Princeton University and University of Virginia School of Law. He was also a Visiting Professor of Political Science at The University of Texas at Austin, Australian National University, The New School and many others.\nRyan is a regular contributor to The New York Review of Books, the London Review of Books, and The Times Literary Supplement, and continues to write on political theory and the history of political thought.\n\n\n== Books ==\nThe Philosophy of John Stuart Mill (1970): an examination of Mill's philosophy of science, its relation to his ethical thought, and a defence of the view that Mill's work is largely coherent, concentrating on Mill's A System of Logic.\nThe Philosophy of the Social Sciences (1970): an introduction to the philosophy of social science.\nJ.S. Mill (1975): a guide through the important works of Mill, and the themes to be found therein.\nProperty and Political Theory (1984)\nProperty (1987)\nRussell: A Political Life (1993)\nJohn Dewey and the High Tide of American Liberalism (1995)\nLiberal Anxieties and Liberal Education (1998): given as a lecture series at the University of California, Berkeley, contains autobiographical material.\nOn Politics: A History of Political Thought: From Herodotus to the Present (2012) traces the origins of political philosophy from the ancient Greeks to Machiavelli in Book I and from Hobbes to the present age in Book II\nThe Making of Modern Liberalism (2012) exploration of the origins and nature of liberalism from the Enlightenment through its triumphs and setbacks in the twentieth century\n\n\n== References ==\n\n\n== External links ==\nBooknotes interview with Ryan on the Introduction to Alexis de Tocqueville's Democracy in America, February 26, 1995\nProspect magazine\nNew York Review of Books\nAlan Ryan: CV\nDepartment of Politics and International Relations\nDebrett's People of Today (12th edn, London: Debrett, 1999), p. 1715\nDefence of Mill by Ryan as the greatest British philosopher", "ns": 0, "pageid": 11335700, "title": "Alan Ryan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}