{"batchcomplete": "", "query": {"normalized": [{"to": "Alexander Gottlieb Baumgarten", "from": "Alexander_Gottlieb_Baumgarten"}], "pages": {"295569": {"extract": "Alexander Gottlieb Baumgarten (17 July 1714 – 27 May 1762) was a German philosopher. He was a brother to theologian Siegmund Jakob Baumgarten (1706–1757).\n\n\n== Biography ==\nBaumgarten was born in Berlin as the fifth of seven sons of the pietist pastor of the garrison, Jacob Baumgarten, and of his wife Rosina Elisabeth. Both his parents died early, and he was taught by Martin Georg Christgau where he learned Hebrew and became interested in Latin poetry.\nWhile the meanings of words often change as a result of cultural developments, Baumgarten's reappraisal of aesthetics is often seen as a key moment in the development of aesthetic philosophy. Previously the word aesthetics had merely meant \"sensibility\" or \"responsiveness to stimulation of the senses\" in its use by ancient writers. With the development of art as a commercial enterprise linked to the rise of a nouveau riche class across Europe, the purchasing of art inevitably lead to the question, \"what is good art?\". Baumgarten developed aesthetics to mean the study of good and bad \"taste\", thus good and bad art, linking good taste with beauty.\nBy trying to develop an idea of good and bad taste, he also in turn generated philosophical debate around this new meaning of aesthetics. Without it, there would be no basis for aesthetic debate as there would be no objective criterion, basis for comparison, or reason from which one could develop an objective argument.\n\n\n== Views on aesthetics ==\n\nBaumgarten appropriated the word aesthetics, which had always meant \"sensation\", to mean taste or \"sense\" of beauty. In so doing, he gave the word a different significance, thereby inventing its modern usage. The word had been used differently since the time of the ancient Greeks to mean the ability to receive stimulation from one or more of the five bodily senses. In his Metaphysic, § 451, Baumgarten defined taste, in its wider meaning, as the ability to judge according to the senses, instead of according to the intellect. Such a judgment of taste he saw as based on feelings of pleasure or displeasure. A science of aesthetics would be, for Baumgarten, a deduction of the rules or principles of artistic or natural beauty from individual \"taste\". Baumgarten may have been motivated to respond to Pierre Bonhours' opinion, published in a pamphlet in the late 17th century, that Germans were incapable of appreciating art and beauty.\n\n\n== Reception ==\nIn 1781, Kant declared that Baumgarten's aesthetics could never contain objective rules, laws, or principles of natural or artistic beauty.\n\nThe Germans are the only people who presently (1781) have come to use the word aesthetic[s] to designate what others call the critique of taste. They are doing so on the basis of a false hope conceived by that superb analyst Baumgarten. He hoped to bring our critical judging of the beautiful under rational principles, and to raise the rules for such judging to the level of a lawful science. Yet that endeavor is futile. For, as far as their principal sources are concerned, those supposed rules or criteria are merely empirical. Hence they can never serve as determinate a priori laws to which our judgment of taste must conform. It is, rather, our judgment of taste which constitutes the proper test for the correctness of those rules or criteria. Because of this it is advisable to follow either of two alternatives. One of these is to stop using this new name aesthetic[s] in this sense of critique of taste, and to reserve the name aesthetic[s] for the doctrine of sensibility that is true science. (In doing so we would also come closer to the language of the ancients and its meaning. Among the ancients the division of cognition into aisthētá kai noētá [sensed or thought] was quite famous.) The other alternative would be for the new aesthetic[s] to share the name with speculative philosophy. We would then take the name partly in its transcendental meaning, and partly in the psychological meaning. (Critique of Pure Reason, A 1, note.)\n\nNine years later, in his Critique of Judgment, Kant conformed to Baumgarten's new usage and employed the word aesthetic to mean the judgment of taste or the estimation of the beautiful. For Kant, an aesthetic judgment is subjective in that it relates to the internal feeling of pleasure or displeasure and not to any qualities in an external object.\nIn 1897, Leo Tolstoy, in his What is Art?, criticized Baumgarten's book on aesthetics. Tolstoy opposed \"Baumgarten's trinity — Good, Truth and Beauty….\" Tolstoy asserted that \"these words not only have no definite meaning, but they hinder us from giving any definite meaning to existing art….\" Baumgarten, he said, claimed that there are three ways to know perfection: \"Beauty is the perfect (the absolute) perceived by the senses. Truth is the perfect perceived by reason. The good is the perfect attained by the moral will.\" Tolstoy, however, contradicted Baumgarten's theory and claimed that good, truth, and beauty have nothing in common and may even oppose each other.\n\n…the arbitrary uniting of these three concepts served as a basis for the astonishing theory according to which the difference between good art, conveying good feelings, and bad art, conveying wicked feelings, was totally obliterated, and one of the lowest manifestations of art, art for mere pleasure…came to be regarded as the highest art. And art became, not the important thing it was intended to be, but the empty amusement of idle people.(What is Art?, VII.)\n\nWhatever the limitations of Baumgarten's theory of aesthetics, Frederick Copleston credits him with playing a formative role in German aesthetics, extending Christian Wolff's philosophy to topics that Wolff did not consider, and demonstrating the existence of a legitimate topic for philosophical analysis that could not be reduced to abstract logical analysis.\n\n\n== Metaphysics ==\nFor many years, Kant used Baumgarten's Metaphysics as a handbook or manual for his lectures on that topic.Georg Friedrich Meier translated the Metaphysics from Latin to German, an endeavour which - according to Meier - Baumgarten himself had planned, but could not find the time to execute.\n\n\n== Works ==\nDissertatio chorographica, Notiones superi et inferi, indeque adscensus et descensus, in chorographiis sacris occurentes, evolvens (1735)\nMeditationes philosophicae de nonnullis ad poema pertinentibus (1735)\nDe ordine in audiendis philosophicis per triennium academicum quaedam praefatus acroases proximae aestati destinatas indicit Alexander Gottlieb Baumgarten (1738)\nMetaphysica (1739)\nEthica philosophica (1740)\nAlexander Gottlieb Baumgarten eröffnet Einige Gedancken vom vernünfftigen Beyfall auf Academien, und ladet zu seiner Antritts-Rede [...] ein (1740)\nSerenissimo potentissimo principi Friderico, Regi Borussorum marchioni brandenburgico S. R. J. archicamerario et electori, caetera, clementissimo dominio felicia regni felicis auspicia, a d. III. Non. Quinct. 1740 (1740)\nPhilosophische Briefe von Aletheophilus (1741)\nScriptis, quae moderator conflictus academici disputavit, praefatus rationes acroasium suarum Viadrinarum reddit Alexander Gottlieb Baumgarten (1743)\nAesthetica (1750)\nInitia Philosophiae Practicae. Primae Acroamatice (1760)\nAcroasis logica in Christianum L.B. de Wolff (1761, 2nd ed. 1773)\nIus naturae (posthum 1763)\nSciagraphia encyclopaedia philosophicae (ed. Johs. Christian Foerster 1769)\nPhilosophia generalis (ed. Johs. Christian Foerster 1770)\nAlex. Gottl. Baumgartenii Praelectiones theologiae dogmaticae (ed. Salomon Semmler; 1773)\nMetaphysica (translated by Georg Friedrich Meier 1766)\nGedanken über die Reden Jesu nach dem Inhalt der evangelischen Geschichten (ed. F.G. Scheltz & A.B. Thiele; 1796–1797)\n\n\n== English translations ==\nAlexander Baumgarten, Metaphysics. A Critical Translation with Kant's Elucidations, Selected Notes, and Related Materials translated and edited by Courtney D. Fugate and John Hymers, London, New York: Bloomsbury Publishing, 2013.\n\n\n== Notes ==\n\n\n== References ==\n Chisholm, Hugh, ed. (1911). \"Baumgarten, Alexander Gottlieb\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== Further reading ==\nEric Watkins (ed.), Kant's Critique of Pure Reason: Background Source Materials, Cambridge University Press, 2009 (Chapter 3 contains a partial translation of the 'Metaphysics').\n\n\n== External links ==\nJan Lekschas, The Baumgarten Family (in German)\nAlexander Gottilieb Baumgarten (1714-1762) (in German)", "ns": 0, "pageid": 295569, "title": "Alexander Gottlieb Baumgarten"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}