{"batchcomplete": "", "query": {"normalized": [{"to": "Alexander Gerard", "from": "Alexander_Gerard"}], "pages": {"1078419": {"extract": "Very Rev Alexander Gerard FRSE DD (1728 –1795) was a Scottish minister, academic and philosophical writer.In 1764 he was the Moderator of the General Assembly of the Church of Scotland.\n\n\n== Life ==\nHe was born on 22 February 1728, the son of Rev. Gilbert Gerard (d.1738), at the manse in Garioch in Aberdeenshire. He attended Foveran Parish School then Aberdeen Grammar School.\nHe went to Aberdeen University, graduating MA in 1744. He then went to Edinburgh University to study Divinity. He was licensed to preach in 1748.\nIn 1750 he returned to Aberdeen University to lecture in Moral Philosophy becoming a Professor in 1752, based at Marischal College.From 1760 to 1771 he was Professor of Divinity at Marischal, moving to King's College in 1771. As a professor he introduced various reforms. During this time he was also one of the ministers of the city, serving at Greyfriars Church. He was a member of the Aberdeen Philosophical Society, founded by Prof John Gregory and including members such as Prof Thomas Gordon.\nIn 1783 he was a co-founder of the Royal Society of Edinburgh.\nHe died on 22 January 1795.\n\n\n== Publications ==\nIn 1756 he gained the prize for an Essay on Taste which, together with an Essay on Genius, he subsequently published. These treatises, though now superseded, gained for him considerable reputation.\nCompendious View of the Evidences of Natural and Revealed Religion the joint work by Alexander Gerard and his son Gilbert Gerard, published 1828.\n\n\n== Family ==\nGilbert Gerard was his son.\n\n\n== References ==\n\n\n== References ==\nLee, Sidney (1903), Dictionary of National Biography Index and Epitome\nAttribution\n This article incorporates text from a publication now in the public domain: Cousin, John William (1910). A Short Biographical Dictionary of English Literature. London: J. M. Dent & Sons. Wikisource", "ns": 0, "pageid": 1078419, "title": "Alexander Gerard"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}