{"batchcomplete": "", "query": {"normalized": [{"to": "Algernon Charles Swinburne", "from": "Algernon_Charles_Swinburne"}], "pages": {"103236": {"extract": "Algernon Charles Swinburne (5 April 1837 – 10 April 1909) was an English poet, playwright, novelist, and critic. He wrote several novels and collections of poetry such as Poems and Ballads, and contributed to the famous Eleventh Edition of the Encyclopædia Britannica. A controversial figure at the time, Swinburne was a sado-masochist and alcoholic and was obsessed with the Middle Ages and lesbianism.\nSwinburne wrote about many taboo topics, such as lesbianism, cannibalism, sado-masochism, and anti-theism. His poems have many common motifs, such as the Ocean, Time, and Death. Several historical people are featured in his poems, such as Sappho (\"Sapphics\"), Anactoria (\"Anactoria\"), Jesus (\"Hymn to Proserpine\": Galilaee, La. \"Galilean\") and Catullus (\"To Catullus\").\n\n\n== Biography ==\n\nSwinburne was born at 7 Chester Street, Grosvenor Place, London, on 5 April 1837. He was the eldest of six children born to Captain (later Admiral) Charles Henry Swinburne (1797–1877) and Lady Jane Henrietta, daughter of the 3rd Earl of Ashburnham. He grew up at East Dene in Bonchurch on the Isle of Wight. He grew up in a wealthy Northumbrian family.\nAs a child, Swinburne was \"nervous\" and \"frail,\" but \"was also fired with nervous energy and fearlessness to the point of being reckless.\"\nHe attended Eton College (1849–53), where he first started writing poetry. At Eton, he won first prizes in French and Italian. He then attended Balliol College, Oxford (1856–60) with a brief hiatus when he was rusticated from the university in 1859 for having publicly supported the attempted assassination of Napoleon III by Felice Orsini. He returned in May 1860, though he never received a degree.\nHe spent summer holidays at Capheaton Hall in Northumberland, the house of his grandfather, Sir John Swinburne, 6th Baronet (1762–1860), who had a famous library and was President of the Literary and Philosophical Society in Newcastle upon Tyne. Swinburne considered Northumberland to be his native county, an emotion reflected in poems like the intensely patriotic 'Northumberland', 'Grace Darling' and others. He enjoyed riding his pony across the moors (he was a daring horseman) 'through honeyed leagues of the northland border', as he called the Scottish border in his Recollections.\n\nIn the period 1857–60, Swinburne became one of Lady Pauline Trevelyan's intellectual circle at Wallington Hall. After his grandfather's death in 1860, he stayed with William Bell Scott in Newcastle. In 1861, Swinburne visited Menton on the French Riviera to recover from excessive use of alcohol, staying at the Villa Laurenti. From Menton, Swinburne travelled to Italy, where he journeyed extensively. In December 1862, Swinburne accompanied Scott and his guests, probably including Dante Gabriel Rossetti, on a trip to Tynemouth. Scott writes in his memoirs that, as they walked by the sea, Swinburne declaimed the as yet unpublished 'Hymn to Proserpine' and 'Laus Veneris' in his lilting intonation, while the waves 'were running the whole length of the long level sands towards Cullercoats and sounding like far-off acclamations'.\nAt Oxford, Swinburne met several Pre-Raphaelites, including Dante Gabriel Rossetti. He also met William Morris. After leaving college, he lived in London and started an active writing career, where Rossetti was delighted with his 'little Northumbrian friend', probably a reference to Swinburne's diminutive height—he was just five foot four.\n\nSwinburne was an alcoholic and algolagniac and highly excitable. He liked to be flogged. His health suffered; and, in 1879 at the age of 42, he was taken into care by his friend, lawyer Theodore Watts, who looked after him for the rest of his life at The Pines, 11 Putney Hill, Putney SW15. Thereafter, he lost his youthful rebelliousness and developed into a figure of social respectability. It was said of Watts that he saved the man and killed the poet. Swinburne died at the Pines on 10 April 1909 at the age of 72 and was buried at St. Boniface Church, Bonchurch on the Isle of Wight.\n\n\n== Reception ==\nSwinburne is considered a poet of the decadent school, although he perhaps professed to more vice than he actually indulged in to advertise his deviance – he spread a rumour that he had had sex with, then eaten, a monkey; Oscar Wilde stated that Swinburne was \"a braggart in matters of vice, who had done everything he could to convince his fellow citizens of his homosexuality and bestiality without being in the slightest degree a homosexual or a bestialiser.\" Common gossip of the time reported that he had a deep crush on the explorer Sir Richard Francis Burton, despite the fact that Swinburne himself hated travel.\nMany critics consider his mastery of vocabulary, rhyme and metre impressive, although he has also been criticised for his florid style and word choices that only fit the rhyme scheme rather than contributing to the meaning of the piece. He is the virtual star of the third volume of George Saintsbury's famous History of English Prosody, and A. E. Housman, a more measured and even somewhat hostile critic, had great praise for his rhyming ability:\n[Swinburne] possessed an altogether unexampled command of rhyme, the chief enrichment of modern verse. The English language is comparatively poor in rhymes, and most English poets, when they have to rhyme more than two or three words together, betray their embarrassment. They betray it, for instance, when they write sonnets after the strict Petrarchian rule: the poetical inferiority of most English sonnets, if compared with what their own authors have achieved in other forms of verse, is largely though not entirely the result of this difficulty. [...] To Swinburne the sonnet was child’s play: the task of providing four rhymes was not hard enough, and he wrote long poems in which each stanza required eight or ten rhymes, and wrote them so that he never seemed to be saying anything for the rhyme’s sake.\n\nSwinburne's work was once quite popular among undergraduates at Oxford and Cambridge, though today it has gone out of fashion. This is at least somewhat contextual, as it tends to mirror the popular and academic consensus regarding his work, although his Poems and Ballads, First Series and his Atalanta in Calydon have never been out of critical favour. Atalanta in Calydon in particular has been lauded as one of his best early works, written in 1865, before the passionate excesses of later works earned him a sordid reputation for blasphemy and depravity among contemporary critics.\nT. S. Eliot read Swinburne's essays on the Shakespearean and Jonsonian dramatists in The Contemporaries of Shakespeare and The Age of Shakespeare and Swinburne's books on Shakespeare and Jonson. Writing on Swinburne in 'The Sacred Wood: Essays on Poetry and Criticism', Eliot said, of Swinburne, he had mastered his material, writing 'he is more reliable to them than Hazlitt, Coleridge, or Lamb: and his perception of relative values is almost always correct'. However, Eliot judged Swinburne did not master it to the extent of being able to take liberties with it, which is everything. Furthermore, Eliot disliked Swinburne's prose, about which he wrote \"the tumultuous outcry of adjectives, the headstrong rush of undisciplined sentences, are the index to the impatience and perhaps laziness of a disorderly mind.\"\nSwinburne was nominated for the Nobel Prize in Literature every year from 1903 to 1907 and again in 1909.\nH. P. Lovecraft considered Swinburne \"the only real poet in either England or America after the death of Mr. Edgar Allan Poe.\"\n\n\n== Work ==\n\nSwinburne's poetic works include: Atalanta in Calydon (1865), Poems and Ballads (1866), Songs before Sunrise (1871), Poems and Ballads Second Series, (1878) Tristram of Lyonesse (1882), Poems and Ballads Third Series (1889), and the novel Lesbia Brandon (published posthumously in 1952).\nPoems and Ballads caused a sensation when it was first published, especially the poems written in homage of Sappho of Lesbos such as \"Anactoria\" and \"Sapphics\": Moxon and Co. transferred its publication rights to John Camden Hotten. Other poems in this volume such as \"The Leper,\" \"Laus Veneris,\" and \"St Dorothy\" evoke a Victorian fascination with the Middle Ages, and are explicitly mediaeval in style, tone and construction. Also featured in this volume are \"Hymn to Proserpine\", \"The Triumph of Time\" and \"Dolores (Notre-Dame des Sept Douleurs)\".\nSwinburne devised the poetic form called the roundel, a variation of the French Rondeau form, and some were included in A Century of Roundels dedicated to Christina Rossetti. Swinburne wrote to Edward Burne-Jones in 1883: \"I have got a tiny new book of songs or songlets, in one form and all manner of metres ... just coming out, of which Miss Rossetti has accepted the dedication. I hope you and Georgie [his wife Georgiana, one of the MacDonald sisters] will find something to like among a hundred poems of nine lines each, twenty-four of which are about babies or small children\". Opinions of these poems vary between those who find them captivating and brilliant, to those who find them merely clever and contrived. One of them, A Baby's Death, was set to music by the English composer Sir Edward Elgar as the song Roundel: The little eyes that never knew Light.\nSwinburne was influenced by the work of William Shakespeare, Percy Bysshe Shelley, Catullus, William Morris, Dante Gabriel Rossetti, Robert Browning, Alfred Lord Tennyson, and Victor Hugo. While he was popular in England during his life, Swinburne's influence has greatly decreased since his death.\nAfter the first Poems and Ballads, Swinburne's later poetry was devoted more to philosophy and politics, including the unification of Italy, particularly in the volume Songs before Sunrise. He did not stop writing love poetry entirely, including his great epic-length poem, Tristram of Lyonesse, but its content is much less shocking. His versification, and especially his rhyming technique, remain in top form to the end.\n\n\n=== Verse drama ===\nThe Queen Mother (1860)\nRosamond (1860)\nChastelard (1865)\nBothwell (1874)\nMary Stuart (1881)\nMarino Faliero (1885)\nLocrine (1887)\nThe Sisters (1892)\nRosamund, Queen of the Lombards (1899)\n\n\n=== Poetry ===\nAtalanta in Calydon (1865)†\nPoems and Ballads (1866)\nSongs Before Sunrise (1871)\nSongs of Two Nations (1875)\nErechtheus (1876)†\nPoems and Ballads, Second Series (1878)\nSongs of the Springtides (1880)\nStudies in Song (1880)\nThe Heptalogia, or the Seven against Sense. A Cap with Seven Bells (1880)\nTristam of Lyonesse (1882)\nA Century of Roundels (1883)\nA Midsummer Holiday and Other Poems (1884)\nPoems and Ballads, Third Series (1889)\nAstrophel and Other Poems (1894)\nThe Tale of Balen (1896)\nA Channel Passage and Other Poems (1904)\n^† Although formally tragedies, Atlanta in Calydon and Erechtheus are traditionally included with \"poetry\".\n\n\n=== Criticism ===\nWilliam Blake: A Critical Essay (1868, new edition 1906)\nUnder the Microscope (1872)\nGeorge Chapman: A Critical Essay (1875)\nEssays and Studies (1875)\nA Note on Charlotte Brontë (1877)\nA Study of Shakespeare (1880)\nA Study of Victor Hugo (1886)\nA Study of Ben Johnson (1889)\nStudies in Prose and Poetry (1894)\nThe Age of Shakespeare (1908)\nShakespeare (1909)\n\n\n=== Major collections ===\nThe poems of Algernon Charles Swinburne, 6 vols. London: Chatto & Windus, 1904.\nThe Tragedies of Algernon Charles Swinburne, 5 vols. London: Chatto & Windus, 1905.\nThe Complete Works of Algernon Charles Swinburne, ed. Sir Edmund Gosse and Thomas James Wise, 20 vols. Bonchurch Edition; London and New York: William Heinemann and Gabriel Wells, 1925-7.\nThe Swinburne Letters, ed. Cecil Y. Lang, 6 vols. 1959-62.\n\n\n== Ancestry ==\n\n\n== See also ==\nFlowers for Algernon, a novel in which the eponymous character is named after Swinburne\nPoems and Ballads\nDecadent movement\nTristram of Lyonesse\n\n\n== Notes ==\n\n\n== References ==\nSwinburne, Algernon (1919), Gosse, Edmund; Wise, Thomas, eds., The Letters of Algernon Charles Swinburne, Volumes 1-6, New York: John Lane Company.\nRooksby, Rikky (1997) A C Swinburne: A Poet's Life. Aldershot: Scolar Press.\nLouis, Margot Kathleen (1990) Swinburne and His Gods: the Roots and Growth of an Agnostic Poetry. Mcgill-Queens University Press.\nMcGann, Jerome (1972) Swinburne: An Experiment in Criticism. University of Chicago Press.\nPeters, Robert (1965) The Crowns of Apollo: Swinburne's Principles of Literature and Art: a Study in Victorian Criticism and Aesthetics. Wayne State University Press.\nAnonymous (1873). Cartoon portraits and biographical sketches of men of the day. Illustrated by Frederick Waddy. London: Tinsley Brothers. pp. 48–49. \nWakeling, E; Hubbard, T; Rooksby, R (2008) Lewis Carroll, Robert Louis Stevenson and Algernon Charles Swinburne by their contemporaries. London: Pickering & Chatto, 3 vols.\n Chisholm, Hugh, ed. (1911). \"Swinburne, Algernon Charles\". Encyclopædia Britannica. 26 (11th ed.). Cambridge University Press. \n Gosse, Edmund (1912). \"Swinburne, Algernon Charles\". In Lee, Sidney. Dictionary of National Biography, 1912 supplement​. London: Smith, Elder & Co. \nRooksby, Rikky. \"Swinburne, Algernon Charles (1837–1909)\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/36389.  (Subscription or UK public library membership required.)\n\n\n== External links ==\nPoetry of Algernon Charles Swinburne at the Poetry Foundation.\n\"Swinburne as Critic\" in T. S. Eliot's essay \"Imperfect Critics\", collected in The Sacred Wood: Essays on Poetry and Criticism, 1922.\nWorks by Algernon Charles Swinburne at LibriVox (public domain audiobooks) \nSwinburne, a eulogy by A.E. Housman\nStirnet: Swinburne02 (subscription required) Swinburne's genealogy.\nNo. 2. The Pines, Max Beerbohm's memoir of Swinburne.\nThe Swinburne Project: A digital archive of the life and works of Algernon Charles Swinburne.\nWorks by Algernon Swinburne at Project Gutenberg (plain text and HTML)\nWorks by or about Algernon Charles Swinburne at Internet Archive", "ns": 0, "pageid": 103236, "title": "Algernon Charles Swinburne"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}