{"batchcomplete": "", "query": {"normalized": [{"to": "Ali Shariati", "from": "Ali_Shariati"}], "pages": {"159182": {"extract": "Ali Shariati Mazinani (Persian: علی شریعتی مزینانی‎‎,  23 November 1933 – 18 June 1977) was an Iranian revolutionary and sociologist who focused on the sociology of religion. He is held as one of the most influential Iranian intellectuals of the 20th century and has been called the 'ideologue of the Iranian Revolution'.\n\n\n== Biography ==\nAli Shariati (Ali masharati) was born in 1933 in Kahak (a village in Mazinan), a suburb of Sabzevar, found in northeastern Iran. His father's family were clerics. His father, Mohammad-Taqi, was a teacher and Islamic scholar, who opened in 1947 the 'Centre for the Propagation of Islamic Truths' in Mashhad, in the Khorasan Province, a social Islamic forum which became embroiled in the oil nationalisation movement of the 1950s. Shariati's mother was from a small land-owning family.\nIn his years at the Teacher's Training College in Mashhad, Shariati came into contact with young people who were from the less privileged economic classes of the society, and for the first time saw the poverty and hardship that existed in Iran during that period. At the same time he was exposed to many aspects of Western philosophical and political thought. He attempted to explain and provide solutions for the problems faced by Muslim societies through traditional Islamic principles interwoven with and understood from the point of view of modern sociology and philosophy. His articles from this period for the Mashhad daily newspaper, Khorasan, display his developing eclecticism and acquaintance with the ideas of modernist thinkers such as Jamal al-Din al-Afghani, Sir Allama Muhammad Iqbal of Pakistan, among Muslims and Sigmund Freud and Alexis Carrel.\nIn 1952, he became a high-school teacher and founded the Islamic Students' Association, which led to his arrest after a demonstration. In 1953, the year of Mossadeq's overthrow, he became a member of the National Front. He received his bachelor's degree from the University of Mashhad in 1955. In 1957 he was arrested again by the Iranian police, along with 16 other members of the National Resistance Movement.\nShariati then managed to obtain a scholarship for France, where he continued his graduate studies at Sorbonne University in Paris. He worked towards earning his doctorate in sociology, leaving Paris after getting a PhD certificate in sociology in 1964 from Sorbonne University. During this period in Paris, Shariati started collaborating with the Algerian National Liberation Front (FLN) in 1959. The next year, he began to read Frantz Fanon and translated an anthology of his work into Persian. Shariati would introduce Fanon's thought into Iranian revolutionary émigrée circles. He was arrested in Paris during a demonstration in honour of Patrice Lumumba, on 17 January 1961.\nThe same year he joined Ebrahim Yazdi, Mostafa Chamran and Sadegh Qotbzadeh in founding the Freedom Movement of Iran abroad. In 1962, he continued studying sociology and history of religions, and followed the courses of Islamic scholar Louis Massignon, Jacques Berque and the sociologist Georges Gurvitch. He also came to know the philosopher Jean-Paul Sartre that same year, and published in Iran Jalal Al-e Ahmad's book Gharbzadegi (or Occidentosis).\nHe then returned to Iran in 1964 where he was arrested and imprisoned for engaging in subversive political activities while in France. He was released after a few weeks, at which point he began teaching at the University of Mashhad.\nShariati then went to Tehran where he began lecturing at the Hosseiniye Ershad Institute. These lectures proved to be hugely popular among his students and were spread by word of mouth throughout all economic sectors of the society, including the middle and upper classes where interest in Shariati's teachings began to grow immensely.\nShariati's continued success again aroused the interest of the government, which arrested him, as well as many of his students. Widespread pressure from the populace and an international outcry eventually led to his release after eighteen months in solitary confinement, and he was released on 20 March 1975.\nShariati was allowed to leave the country for England. He died three weeks later in a Southampton hospital under 'mysterious circumstances' although in Ali Rahnema's biography of Shariati, he is said to have died of a fatal heart attack. Shariati is buried next to Sayyidah Zaynab, the granddaughter of the Islamic prophet Muhammad and the daughter of Hazrat Ali in Damascus, Syria, where Iranian pilgrims frequently visit.\n\n\n=== Views ===\n\nShariati developed a fully novel approach to Shiism and interpreted the religion in a revolutionary manner. His interpretation of Shiism encouraged revolution in the world and promised salvation after death. Shariati referred to his brand of Shiism as \"red Shiism\" which he contrasted with clerical-dominated, unrevolutionary \"black Shiism\" or Safavid Shiism. His ideas have been compared to the Catholic Liberation Theology movement founded in South America by Peruvian Gustavo Gutierrez and Brazilian Leonardo Boff.\nShariati was a prominent Islamist philosopher who argued that a good society would conform to Islamic values; he suggested that the role of government was to guide society in the best possible manner rather than manage society in the best possible manner. Shariati believed that the most learned members of the Ulema (clergy) should play a leadership role in guiding society because they best understand how to administer an Islamic value system based on the teachings of the Prophets of God and the 12 Shia Twelver Imams. He argued that the role of the clergy was to guide society in accordance with Islamic values to advance human beings towards reaching their highest potential—not to provide/serve the hedonistic desires of individuals as in the West.\nShariati's works were highly influenced by the Third Worldism that he encountered as a student in Paris—ideas that class war and revolution would bring about a just and classless society—from one side, and the epistemic Decolonization thinking of his time from the other side. He is said to have adopted the idea of Gharbzadegi from Jalal Al-e Ahmad and given it \"its most vibrant and influential second life.\"\nHe sought to translate these ideas into cultural symbols of Shiism that Iranians could relate to. He believed Shia should not merely await the return of the 12th Imam but should actively work to hasten his return by fighting for social justice, \"even to the point of embracing martyrdom\", saying \"everyday is Ashoura, every place is Karbala.\" Shariati had a dynamic view about Islam. His ideology about Islam is closely related to Allama Iqbal's ideology; for example, according to both intellectuals, change is the greatest law of nature and Islam.\n\n\n==== Epistemology ====\nShariati developed the idea of the social, cultural and historical contingencies of religious knowledge in sociology. Shariati believed in the earthly religion and in social context in which meaning of society construed. Also he emphasized that he understands the religion historically because he is a sociologist. As he said he concerned with the historical and social tawhid not with the truth of the exalted book of Quran or Muhammad or Ali.\n\n\n== Legacy ==\nShariati's most important books and speeches\nHajj (The Pilgrimage)\nMarxism and Other Western Fallacies: An Islamic Critique\nWhere Shall We Begin?\nMission of a Free Thinker\nThe Free Man and Freedom of the Man\nExtraction and Refinement of Cultural Resources\nMartyrdom (book)\nAli\nAn approach to Understanding Islam\nA Visage of Prophet Muhammad\nA Glance of Tomorrow's History\nReflections of Humanity\nA Manifestation of Self-Reconstruction and Reformation\nSelection and/or Election\nNorouz, Declaration of Iranian's Livelihood, Eternity\nExpectations from the Muslim Woman\nHorr (Battle of Karbala)\nKavir (Desert)\nAbu-Dahr\nIslamology\nRed Shi'ism vs. Black Shi'ism\nJihad and Shahadat\nReflections of a Concerned Muslim on the Plight of Oppressed People\nA Message to the Enlightened Thinkers\nArt Awaiting the Saviour\nFatemeh is Fatemeh\nThe Philosophy of Supplication\nReligion versus Religion\nMan and Islam – see chapter \"Modern Man and His Prisons\"\nArise and Bear Witness\n\n\n== See also ==\nIntellectual Movements in Iran\nIslamic Marxism\nIslamic revival\nList of Islamic scholars\nPhilosophy in Iran\nRed Shi'ism vs. Black Shi'ism\nReligious Intellectualism in Iran\nJalal Al-e-Ahmad\nHamid Algar\nGeydar Dzhemal modern philosopher of Politic Islam, revolutionist and social activist\nAbdulaziz Sachedina, a student of Shariati\n\n\n== References ==\n\n\n== Further reading ==\nRahnema, Ali. 1998. An Islamic Utopian. A political biography of Ali Shariati. London: I.B. Tauris.\nGheissari, Ali. 1998. Iranian Intellectuals in the Twentieth Century. Austin: University of Texas Press.\nHosseini, S A. 2000 \"[Ali Shariati's Islamic-Critical School of Thought (1)] مکتب انتقادی دکتر علی شریعتی (1)\", Farhang-e-Tose'eh, 9, 44, [1]\nHosseini, S A. 2000 \"[Ali Shariati's Islamic-Critical School of Thought (2)] مکتب انتقادی دکتر علی شریعتی (2)\", Farhang-e-Tose'eh, 9, 47. [2]\n\n\n== External links ==\nThe Official WebSite of Dr Ali Shariati\nBiography and publications\n'Ali Shari'ati: Between Marx and the Infinite' A review essay of Ali Rahnema's biography of Shari'ati with an extensive discussion on the philosopher's political significance by Nathan Coombs\nHumanity and the People Power: A Tribute to Dr. Ali Shariati by Dr. Mohammad Omar Farooq\n'Ali Shari'ati: Islamic Fundamentalist, Marxist Ideologist and Sufi Mystic by David Zeidan\nCritical Religious Reason: Ali Shari'ati on Religion, Philosophy and Emancipation by Abbas Manoochehri\nThe forgotten revolutionary: Ali Shariati by Lawrence Reza Ershaghi", "ns": 0, "pageid": 159182, "title": "Ali Shariati"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}