{"batchcomplete": "", "query": {"normalized": [{"to": "Alija Izetbegović", "from": "Alija_Izetbegović"}], "pages": {"196318": {"extract": "Alija Izetbegović (Bosnian pronunciation: [ǎlija ǐzedbegoʋit͡ɕ]; 8 August 1925 – 19 October 2003) was a Bosnian politician, activist, lawyer, author, and philosopher who in 1990 became the first Chairman of the Presidency of Bosnia and Herzegovina. He served in this role until 1996, when he became a member of the Presidency of Bosnia and Herzegovina, serving until 2000. He was also the author of several books, most notably Islam Between East and West and the Islamic Declaration.\n\n\n== Early life ==\nAlija Izetbegović was born on 8 August 1925 in the northern Bosnian town of Bosanski Šamac. He was the third of five children—two sons and three daughters—born to Mustafa and Hiba Izetbegović. His was a distinguished but impoverished family descended from a former aristocrat family of Izet-bey Jahić from Belgrade who moved to the Bosnia Vilayet in 1861, following the withdrawal of the last Ottoman troops from Serbia. The Jahić family lived in Belgrade for hundreds of years. While serving as a soldier in Üsküdar, Izetbegović's grandfather Alija married a Turkish woman named Sıdıka Hanım. The couple eventually moved to Bosanski Šamac and had five children. Izetbegović's grandfather later became the town's mayor, and reportedly saved forty Serbs from execution at the hands of Austro-Hungarian authorities following Gavrilo Princip's assassination of Archduke Franz Ferdinand of Austria in June 1914.\nIzetbegović's father, an accountant, had fought for the Austro-Hungarian Army on the Italian Front during World War I and sustained serious injuries which left him in a semi-paralyzed state for at least a decade. He declared bankruptcy in 1927. The following year, the family moved to Sarajevo, where Izetbegović received a secular education.\nDuring World War II, when Bosnia was part of the Nazi puppet state known as the Independent State of Croatia, Izetbegović joined an Islamic organization called the \"Young Muslims\" (Mladi Muslimani). When the \"Young Muslims\" became torn between supporting the largely Muslim Waffen-SS Handschar Division or the communist Yugoslav Partisans, Izetbegović decided to support the SS division. Izetbegović was detained by the Serb royalist Chetniks in mid-1944 but released out of gratitude for his grandfather's role in securing the release of the forty Serb hostages in 1914. He was arrested by the Yugoslav communists following the war and sentenced to three years in prison in 1946, not for collaboration but because he was opposed to Josip Broz Tito's communist regime. Before incarceration, he had earned a law degree at the University of Sarajevo's Faculty of Law. He remained engaged in politics after serving the sentence. He had a son, Bakir, who also entered politics, as well as two daughters.\n\n\n== Dissident and activist ==\n\nIn 1970, Izetbegović published a manifesto entitled the Islamic Declaration, expressing his views on relationships between Islam, state and society. The authorities interpreted the declaration as a call for introduction of Sharia law in Bosnia, and banned the publication. Indeed, in his book, Izetbegović praised Pakistan as a model for Bosnian society and declared that \"there can be no peace or co-existence between the Islamic faith and non-Islamic societies and political institutions\". The declaration remains a source of controversy. Serbs, who were opposed to Izetbegović, often quoted the declaration as indicative of an intent to create an Iranian-style Islamic republic in Bosnia. Passages from the declaration were frequently quoted by Izetbegović's opponents during the 1990s, who considered it to be an open statement of Islamic fundamentalism. This opinion is also shared by some Western authors.\nIzetbegović vigorously denied such accusations. British author Noel Malcolm asserted that the Serb nationalist interpretation of the Declaration was false propaganda and offered a more benevolent reading. Explaining that it was \"a general treatise on politics and Islam, directed towards the entire Muslim world; it is not about Bosnia and does not even mention Bosnia\" and that \"none of these points can be described as fundamentalist\". Malcolm argues that Izetbegović's views were much more thoroughly expressed in his later book, Islam between East and West, where he presented Islam as a kind of spiritual and intellectual synthesis which included the values of West Europe.\" In this book, Islam between East and West, Izetbegović claims that Islam, as a world-view, religion, a view and way of life, is vastly superior to all intellectual and spiritual alternatives, including philosophical, religious ethical and political ones.\n\n\n== Imprisonment ==\nIn April 1983, Izetbegović and twelve other Bosniak activists (including Melika Salihbegović, Edhem Bičakčić, Omer Behmen, Mustafa Spahić and Hasan Čengić) were tried before a Sarajevo court for a variety of charges called \"offences as principally hostile activity inspired by Muslim nationalism, association for purposes of hostile activity and hostile propaganda\". Izetbegović was further accused of organizing a visit to a Muslim congress in Iran. All of those tried were convicted and Izetbegović was sentenced to fourteen years in prison.\nThe verdict was strongly criticised by Western human rights organisations, including Amnesty International and Helsinki Watch, which claimed that the case was based on \"communist propaganda\", and the accused were not charged with either using or advocating violence. The following May, the Bosnian Supreme Court conceded the point with an announcement that \"some of the actions of the accused did not have the characteristics of criminal acts\" and reduced Izetbegović's sentence to twelve years. In 1988, as communist rule faltered, he was pardoned and released after almost five years in prison. His health had suffered serious damage.\n\n\n== Presidency ==\nThe introduction of a multi-party system in Yugoslavia at the end of the 1980s prompted Izetbegović and other Bosniak activists to establish a political party, the Party of Democratic Action (Stranka Demokratske Akcije, SDA) in 1989. It had a largely Muslim character; similarly, the other principal ethnic groups in Bosnia, the Serbs and Croats, also established ethnically based parties. (The Communist Party renamed itself the Party of Democratic Changes.) The SDA won the largest share of the vote, 33% of the seats, with the next runners-up being nationalist ethnic parties representing Serbs and Croats. Fikret Abdić won the popular vote for Presidency member among the Bosniak candidates, with 44% of the vote, Izetbegović with 37%. According to the Bosnian constitution, the first two candidates of each of the three constitutient nations would be elected to a seven-member multi-ethnic rotating presidency (with two Croats, two Serbs, two Bosniaks and one Yugoslav); a Croat took the post of prime minister and a Serb the presidency of the Assembly. Abdić agreed to stand down as the Bosniak candidate for the Presidency and Izetbegović became Chairman of the Presidency.\nBosnia's power-sharing arrangements broke down very quickly as ethnic tensions grew after the outbreak of fighting between Serbs and Croats in neighboring Croatia. Although Izetbegović was due to hold the presidency for only one year according to the constitution, this arrangement was initially suspended due to \"extraordinary circumstances\" and was eventually abandoned altogether during the war as the Serb and Croat nationalistic parties SDS and HDZ abandoned the government. When fighting broke out in Slovenia and Croatia in the summer of 1991, it was immediately apparent that Bosnia would soon become embroiled in the conflict. Izetbegović initially proposed a loose confederation to preserve a unitary Bosnian state and strongly urged a peaceful solution. He did not subscribe to the peace at all costs view and commented in February 1991 that I would sacrifice peace for a sovereign Bosnia-Herzegovina ... but for that peace in Bosnia-Herzegovina I would not sacrifice sovereignty. He abandoned the Zulfikarpašić–Karadžić agreement which would see BiH as a sovereign state in a confederation with Serbia and Montenegro, with 60% of Sandžak ceded to BiH. By the start of 1992 it had become apparent that the rival nationalist demands were fundamentally incompatible: the Bosniaks and Croats sought an independent Bosnia while the Serbs wanted it to remain in a rump Yugoslavia dominated by Serbia. Izetbegović publicly complained that he was being forced to ally with one side or the other, vividly characterising the dilemma by comparing it to having to choose between leukaemia and a brain tumour.\nIn January 1992, Portuguese diplomat José Cutileiro drafted a plan, later known as the Lisbon Agreement, that would turn Bosnia into a triethnic cantonal state. Initially, all three sides signed up to the agreement; Izetbegović for the Bosniaks, Radovan Karadžić for the Serbs and Mate Boban for the Croats. Some two weeks later, however, Izetbegović withdrew his signature and declared his opposition to any type of partition of Bosnia, supposedly encouraged by Warren Zimmermann, the United States Ambassador to Yugoslavia at the time.\n\n\n== Bosnian War ==\n\nIn February 1992, Izetbegović called an independence referendum on the European condition for recognition of Bosnia and Herzegovina as an independent state, despite warnings from the Serb members of the presidency that it was unconstitutional and that any move towards independence would result in the Serb-inhabited areas seceding to remain with the rump Yugoslavia. The referendum achieved a 99.4% vote in favour on a 67% turnout, largely boycotted by the Serbs.\nThe Bosnian parliament, already vacated by the Bosnian Serbs, formally declared independence from Yugoslavia on 29 February and Izetbegović announced the country's independence on 3 March. It did not take effect until 7 April 1992, when the European Union and United States recognised the new country. Sporadic fighting between Serbs and government forces occurred across Bosnia in the run-up to international recognition. Izetbegović appears to have gambled that the international community would send a peacekeeping force upon recognising Bosnia in order to prevent a war, but this did not happen. Instead, war immediately broke out across the country as Serb and Yugoslav Army forces took control of large areas against the poorly-equipped government security forces. Initially, Serb forces attacked the non-Serb civilian population in eastern Bosnia. Once towns and villages were securely in their hands, the Serb forces systematically ransacked or burnt down Bosniak houses and apartments, Bosniak civilians were rounded up or captured, and sometimes beaten or killed in the process. Men and women were separated, with many of the men detained in the camps. The women were kept in various detention centres where they had to live in intolerably unhygienic conditions, including also being raped repeatedly by Serb soldiers or policemen.\nIzetbegović consistently promoted the idea of a multi-ethnic Bosnia under central control, which seemed a hopeless strategy under the circumstances. The Bosnian Croats, disillusioned with the Sarajevo government and supported militarily and financially by the Croatian government, increasingly turned to establishing their own ethnically-based state of Croatian Republic of Herzeg-Bosnia in Herzegovina and Central Bosnia. The Croats pulled out of the Sarajevo government and fighting broke out in 1993. In some areas local armistices were signed between the Serbs and Croats. Croat forces launched their first attacks on Bosniaks in central Bosnia in June 1992, but these failed. The Graz agreement caused deep division among Bosnian Croats and strengthened separatist Herzeg-Bosnia, and led to the Lašva Valley ethnic cleansing campaign against Bosniak civilians from May 1992 to March 1993.\nAdding to the general confusion, Izetbegović's former colleague Fikret Abdić established an Autonomous Province of Western Bosnia in parts of Cazin and Velika Kladuša municipalities in opposition to the Sarajevo government and in cooperation with Slobodan Milošević and Franjo Tuđman. Abdić's faction was eventually routed by the Bosnian Army. By this time, Izetbegović's government controlled only about 25% of the country and represented principally the Bosniak community.\nFor three and a half years, Izetbegović lived precariously in a besieged Sarajevo surrounded by Serb forces. He denounced the failure of Western countries to reverse Serbian aggression and turned instead to the Muslim world, with which he had already established relations during his days as a dissident. The Bosnian government received money and arms. Following massacres on Bosnian Muslims by Serb and, to a lesser extent, Croat forces, foreign Muslim volunteers joined the Bosnian Army in the so-called Bosnian mujahideen, numbering between 300 and 1,500. They quickly attracted heavy criticism amplified by Serbian and Croatian propaganda, who considered their presence to be evidence of violent Islamic fundamentalism at the heart of Europe. However, the foreign volunteers became unpopular even with many of the Bosniak population, because the Bosnian army had thousands of troops and no need for more soldiers, but for arms. Many Bosnian Army officers and intellectuals were suspicious regarding foreign volunteers arrival in central part of the country, because they came from Split and Zagreb in Croatia, and were passed through the self-proclaimed Herzeg-Bosnia unlike Bosnian Army soldiers who were regularly arrested by Croat forces. According to general Stjepan Šiber, the highest ranking ethnic Croat in Bosnian Army, the key role in foreign volunteers arrival was played by Franjo Tuđman and Croatian counter-intelligence underground with the aim to justify the involvement of Croatia in the Bosnian War and mass crimes committed by Croat forces. Although Izetbegović regarded them as symbolically valuable as a sign of the Muslim world's support for Bosnia, they appear to have made little military difference and became a major political liability.\nIn 1993, Izetbegović agreed to a peace plan that would divide Bosnia along ethnic lines but continued to insist on a unitary Bosnia government from Sarajevo and on the allocation to the Bosniaks of a large percentage of Bosnia's territory. The war between the Bosniaks and Croats was eventually ended by a truce brokered with the aid of the Americans in March 1994, following which the two sides collaborated more closely against the Serbs. NATO then became increasingly involved in the conflict with occasional \"pinprick\" bombings conducted against the Bosnian Serbs, generally following violations of ceasefires and the no-fly zone over Bosnia. The Bosnian Croat forces benefited indirectly from the American military training given to the Croatian Army. In addition, the Croatians provided considerable quantities of weaponry to the Bosnian Croats and much smaller amounts to the Bosnian Army, despite a UN weapons embargo. Most of the Bosnian Army's supply of weapons was air-lifted from the Muslim world, specifically Iran – an issue which became the subject of some controversy and a US congressional investigation in 1996. In September 1993, the Second Bosniak Congress officially re-introduced the historical ethnic name Bosniaks. The Yugoslav \"Muslim by nationality\" policy was considered by Bosniaks to be neglecting and opposing their Bosnian identity because the term tried to describe Bosniaks as a religious group not an ethnic one.\n\n\n== Ending the war ==\n\nIn August 1995, following the Srebrenica massacre and the 2nd Markale massacre, NATO launched intensive bombing campaign which destroyed Bosnian Serb command and control system. This allowed the Croatian and Bosniak forces to overrun many Serb-held areas of the country, producing a roughly 50/50 split of the territory between the two sides. The offensive came to a halt not far from the de facto Serb capital of Banja Luka. When the Croat and Bosniak forces stopped their advance they had captured the power plants supplying Banja Luka's electricity and used that control to pressure the Serb leadership into accepting a ceasefire. The parties agreed to meet at Dayton, Ohio to negotiate a peace treaty under the supervision of the United States. Serbian and Croatian interests were represented by Milošević and Tuđman, respectively. Izetbegović represented the internationally recognised Bosnian Government.\n\n\n== After the war ==\n\nAfter the Bosnian War was formally ended by the Dayton peace accord in November 1995, Izetbegović became a Member of Presidency of Bosnia and Herzegovina. His party's power declined after the international community installed a High Representative to oversee affairs of state, with more power than the Presidency or parliaments of either the Bosniak-Croat or Serb entities. He stepped down in October 2000 at the age of 74, citing his bad health. However, Izetbegović remained popular with the Bosniak public, who nicknamed him Dedo (which in Bosnian means grandfather). His endorsement helped his party to bounce back in the 2002 elections.\n\n\n== Death ==\nHe died in October 2003 of heart disease complicated by injuries suffered from a fall at home. An ICTY investigation of Izetbegović was in progress, but ended with his death. Following his death there was an initiative to rename a part of the main street of Sarajevo from Ulica Maršala Tita (Marshal Tito Street) and the Sarajevo International Airport in his honour. Following objections from politicians from Republika Srpska, the international community, and UN envoy Paddy Ashdown, both initiatives failed. On 11 August 2006, Izetbegović's grave at the Kovači cemetery in Sarajevo was badly damaged by a bomb. The identity of the bomber or bombers has not been determined.\n\n\n== Son ==\nIn October 2006, his son Bakir (born 1956) was elected to a four-year term in the Parliament of Bosnia and Herzegovina as a representative of the SDA. Four years later, in October 2010, and October 2014 he too was elected to the Presidency as the Bosniak member.\n\n\n== Writings ==\nAvailable in English\nIslam Between East and West, Alija Ali Izetbegović, American Trust Publications, 1985 (also ABC Publications, 1993)\nInescapable Questions: Autobiographical Notes, 'Alija Izetbegović, The Islamic Foundation, 2003\nIzetbegović of Bosnia and Herzegovina: Notes from Prison, 1983–1988, Alija Izetbegović, Greenwood Press, 2001\nNotes From Prison – 1983–1988\nThe Islamic Declaration, Alija Izetbegović, s.n., 1991\nAvailable in Bosnian\nGovori i pisma, Alija Izetbegović, SDA, 1994\nRat i mir u Bosni i Hercegovini (Biblioteka Posebna izdanja), Alija Izetbegović, Vijece Kongresa bosnjackih intelektualaca, 1998\nMoj bijeg u slobodu: Biljeske iz zatvora 1983–1988 (Biblioteka Refleksi), Alija Izetbegović, Svjetlost, 1999\nIslamska deklaracija (Mala muslimanska biblioteka), Alija Izetbegović, Bosna, 1990\nhttp://profkaminskisreadings.yolasite.com/resources/Alija%20Izetbegovic-%20The%20Islamic-Declaration%20%281990%29.pdf\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Links ==\n\"Alija Izetbegovic: 1925–2003\", Balkan News, 2014\n\"The leader caught without a land\", The Times (UK), 4 February 1993\n\"Obituaries; Alija Izetbegović, 78; Led Bosnia Through War\", Los Angeles Times, 20 October 2003\n\"Obituary: Alija Izetbegović: first Chairman of the Presidency of post-communist Bosnia and Herzegovina, a devout Muslim who fought for his country's survival in war and peace during the 1990s\", The Guardian (UK), 20 October 2003\nBosnia: A Short History, Noel Malcolm, 1996\nGalvanizing Fear of Islam: The 1983 Trial of Alija Izetbegović in Context, Aimee Wielechowski, 1996\nThe Two Faces of Islam, Stephen Schwartz, 2002\nInescapable Questions: Autobiographical Notes, Alija Izetbegović, The Islamic Foundation, 2003", "ns": 0, "pageid": 196318, "title": "Alija Izetbegović"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}