{"batchcomplete": "", "query": {"normalized": [{"to": "Allan Gibbard", "from": "Allan_Gibbard"}], "pages": {"4465051": {"extract": "Allan Gibbard (born 1942) is the Richard B. Brandt Distinguished University Professor of Philosophy Emeritus at the University of Michigan, Ann Arbor. Gibbard has made major contributions to contemporary ethical theory, in particular metaethics, where he has developed a contemporary version of non-cognitivism. He has also published articles in the philosophy of language, metaphysics, and social choice theory.\n\n\n== Education and Career ==\nGibbard received his BA in mathematics from Swarthmore College in 1963 with minors in physics and philosophy. After teaching mathematics and physics in Ghana with the Peace Corps (1963–1965), Gibbard studied philosophy at Harvard University, participating in the seminar on social and political philosophy with John Rawls, Kenneth J. Arrow, Amartya K. Sen, and Robert Nozick. In 1971 Gibbard earned his Ph.D., writing a dissertation under the direction of John Rawls.\nHe served as professor of philosophy at the University of Chicago (1969–1974), and the University of Pittsburgh (1974–1977), before joining the University of Michigan. Gibbard chaired the University of Michigan's Philosophy Department (1987–1988) and has held the title of Richard B. Brandt Distinguished University Professor of Philosophy since 1994. He retired in 2016.\nGibbard was elected a Fellow of the American Academy of Arts and Sciences in 1990 and was elected a Fellow of the National Academy of Sciences in 2009, one of only two living philosophers to be so honored (the other being Brian Skyrms). and the Econometric Society, and has also received Fellowships from the National Endowment for the Humanities. He served as President of the Central Division of the American Philosophical Association from 2001 to 2002. He gave the Tanner Lectures at the University of California, Berkeley in 2006.\n\n\n== Philosophical work ==\nSoon after his doctoral degree, Gibbard provided a first proof of a conjecture that strategic voting was an intrinsic feature of non-dictatorial voting systems with at least three choices, a conjecture of Michael Dummett and Robin Farquharson. Once established, this result has been known as the Gibbard–Satterthwaite theorem.\nGibbard is best-known in philosophy for his contributions to ethical theory. He is the author of three books in this area. Wise Choices, Apt Feelings: A Theory of Normative Judgment (1990) develops a general theory of moral judgment and judgments of rationality. Gibbard argues that when we endorse someone's action, belief, or feeling as \"rational\" or warranted we are expressing acceptance of a system of norms that permits it. More narrowly, morality is about norms relating to the aptness of moral feelings (such as guilt and resentment).\nThinking How to Live (2003) offers an argument for reconfiguring the distinctions between normative and descriptive discourse, with implications as to the \"long-standing debate\"[1] over \"objectivity\" in ethics and \"factuality\" in ethics.\nReconciling Our Aims: In Search of Bases for Ethics (2008), from the Tanner Lectures, argues in favour of a broadly utilitarian approach to ethics.\nA recent review, including extensive citing of Gibbard's work above, is in the Stanford Encyclopedia of Philosophy (2015).\nMore recently, Gibbard has written Meaning and Normativity (2012).\n\n\n== Interviews with Gibbard ==\nGibbard, Allan (2009). \"7 A pragmatic justification of morality\". In Voorhoeve, Alex. Conversations on ethics. Oxford University Press. pp. 157–178. ISBN 978-0-19-921537-9. \n\n\n== See also ==\nAmerican philosophy\nGibbard–Satterthwaite theorem\nList of American philosophers\n\n\n== Notes ==\n\n\n== References ==\nAllan Gibbard, Wise Choices, Apt Feelings. Description (from back cover) and contents. Harvard University Press, 1990 ISBN 0-674-95378-9\n____, Thinking How to Live, Harvard University Press, 2003, ISBN 0-674-01167-8\n\n\n== External links ==\nAllan Gibbard's home page\nWise Choices, Apt Feelings bk description w comments of John McDowell & Simon Blackburn", "ns": 0, "pageid": 4465051, "title": "Allan Gibbard"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}