{"batchcomplete": "", "query": {"normalized": [{"to": "Alvin Goldman", "from": "Alvin_Goldman"}], "pages": {"2079505": {"extract": "Alvin Ira Goldman (born 1938) is an American philosopher who is Board of Governors Professor of Philosophy and Cognitive Science at Rutgers University in New Jersey and a leading figure in epistemology.\n\n\n== Education and Career ==\nGoldman earned his PhD from Princeton University, and previously taught at the University of Michigan and at the University of Arizona. and is married to the ethicist Holly Martin Smith. He has done influential work on a wide range of philosophical topics, but his principal areas of research are epistemology, philosophy of mind, and cognitive science.\n\n\n== Philosophical Work ==\n\n\n=== Action theory ===\nGoldman's early book, A Theory of Human Action (a revised version of his Ph.D. thesis), presents a systematic way of classifying and relating the many actions we perform at any time. Its influence was broad ref needed and can be found in, among other writings, John Rawls' book A Theory of Justice. Goldman's early work in action theory soon gave way to work in other branches of philosophy, most influentially epistemology.\n\n\n=== Epistemology ===\nGoldman's accounts of knowledge and justified belief, using notions like causation and reliability instead of normative concepts like permissibility and obligation, contributed to a philosophical approach that came to be known in the 1970s as naturalized epistemology. (Unlike W.V.O. Quine's version of naturalized epistemology, however, Goldman's retains a traditional focus on questions of justification.) Goldman's view emerged initially as part of the efforts in the 1960s to find a \"fourth\" condition in response to the Gettier challenge to the account of knowledge as \"justified true belief.\" In his 1967 paper, \"A Causal Theory of Knowing\", Goldman proposed that knowledge amounts to true belief appropriately caused by the fact that makes it true. Later, he claimed knowledge amounts to true belief that is produced by a reliable process.\nGoldman has described his \"naturalistic\" approach to epistemology as splitting \"epistemology (individual epistemology, anyway) into two parts.... The first part is dedicated to the 'analytic' task of identifying the criteria, or satisfaction conditions, for various normative epistemic statuses. With respect to the normative status of justifiedness (of belief), the proposed criterion is the reliability of the belief-forming processes by which the belief is produced. Defense of this criterion of justifiedness was not based on scientific psychology, but rather a familiar form of armchair methodology. The second part is the task where science enters the picture. Psychological science is required to identify the kinds of operations or computations available to the human cognizer, how well they work when operating on certain inputs and under certain conditions.\"\nMore recently, Goldman has focused his epistemological efforts on questions of social epistemology, of the different social mechanisms through which knowledge is transmitted in society. His work in social epistemology has dealt with the law (especially evidence), voting and media, among other topics. He attempts to provide (in his words) a less radical view of social epistemology than those suggested by cultural theorists and postmodernists under that name. His approach uses tools of analytic philosophy especially formal epistemology to analyze problems in social knowledge. Some of this work is summarized in his book Knowledge in a Social World.\n\n\n=== Other work ===\nGoldman has devoted significant time to showing how research in cognitive science is relevant to a variety of branches of philosophy including epistemology. Much of this work appears in his books Epistemology and Cognition, Philosophical Applications of Cognitive Science, and Simulating Minds.\n\n\n== Bibliography ==\nAction (1965)\n\"A Causal Theory of Knowing\" in The Journal of Philosophy v. 64 (1967), pp. 357–372.\nA Theory of Human Action (1970)\n\"Epistemics: The Regulative Theory of Cognition,\" The Journal of Philosophy 75 (1978) pp. 509–523.\n\"What is Justified Belief?\" in Justification and Knowledge (1979), pp. 1–23.\nEpistemology and Cognition (1986)\nLiaisons: Philosophy Meets the Cognitive and Social Sciences (1991)\nPhilosophical Applications of Cognitive Science (1993)\nReadings in Philosophy and Cognitive Science (editor), (1993)\nKnowledge in a Social World (1999)\nPathways to Knowledge: Private and Public (2004)\nSimulating Minds (2006)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nReliabilism\n\n\n== References ==\n\n\n== External links ==\nAlvin Goldman's home page\nArticle partly devoted to Goldman's epistemic views\nStanford Encyclopedia of Philosophy entry on Reliabilism, written by Goldman\nStanford Encyclopedia of Philosophy entry on Naturalised Epistemology, relevant to Goldman", "ns": 0, "pageid": 2079505, "title": "Alvin Goldman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}