{"batchcomplete": "", "query": {"normalized": [{"to": "Andrzej Mostowski", "from": "Andrzej_Mostowski"}], "pages": {"1029314": {"extract": "Andrzej Mostowski (1 November 1913 – 22 August 1975) was a Polish mathematician. He is perhaps best remembered for the Mostowski collapse lemma.\nBorn in Lemberg, Austria-Hungary, Mostowski entered University of Warsaw in 1931. He was influenced by Kuratowski, Lindenbaum and Tarski. His Ph.D. came in 1939, officially directed by Kuratowski but in practice directed by Tarski who was a young lecturer at that time.\nHe became an accountant after the German invasion of Poland but continued working in the Underground Warsaw University. After the Warsaw uprising of 1944 the Nazis tried to put him in a concentration camp. With the help of some Polish nurses he escaped to a hospital, choosing to take bread with him rather than his notebook containing his research. Some of this research he reconstructed after the War, however much of it remained lost.\nThis work was largely on recursion theory and undecidability. From 1946 until his death in Vancouver, Canada, he worked at the University of Warsaw. Much of work during that time was on first order logic and model theory.\nHis son Tadeusz is also a mathematician working on differential geometry. With Krzysztof Kurdyka and Adam Parusinski, Tadeusz Mostowski solved René Thom's gradient conjecture in 2000.\n\n\n== See also ==\nList of Polish People\nMostowski model\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n=== Books by Mostowski ===\nKuratowski, Kazimierz; Mostowski, Andrzej (1976) [1968], Set theory. With an introduction to descriptive set theory, Studies in Logic and the Foundations of Mathematics, 86 (Second ed.), Amsterdam-New York-Oxford: North-Holland Publishing Co., MR 0485384 \nAndrzej Mostowski, Sentences Undecidable in Formalized Arithmetic: An Exposition of the Theory of Kurt Godel, North-Holland, Amsterdam, 1952, ISBN 978-0313231513\nAndrezj Mostowski, Constructible Sets with Applications, North-Holland, Amsterdam, 1969.\n\n\n=== Papers by Mostowski ===\nAndrzej Mostowski, \"Über die Unabhängigkeit des Wohlordnungssatzes von Ordnungsprinzip.\" Fundamenta Mathematicae Vol. 32, No.1, ss. 201-252, (1939).\nAndrzej Mostowski, \"On definable sets of positive integers\", Fundamenta Mathematicae Vol. 34, No. 1, ss. 81-112, (1947).\nAndrzej Mostowski, \"Un théorème sur les nombres cos 2πk/n\", Colloquium Mathematicae Vol. 1, No. 3, ss. 195-196, (1948).\nCasimir Kuratowski, Andrzej Mostowski, \"Sur un problème de la théorie des groupes et son rapport à la topologie\", Colloquium Mathematicae Vol. 2, No. 3-4, ss. 212-215, (1951).\nAndrzej Mostowski, \"Groups connected with Boolean algebras. (Partial solution of the problem P92)\", Colloquium Mathematicae Vol. 2, No. 3-4, ss. 216-219, (1951).\nAndrzej Mostowski, \"On direct products of theories\", Journal of Symbolic Logic, Vol. 17, No. 1, ss. 1-31, (1952).\nAndrzej Mostowski, \"Models of axiomatic systems\", Fundamenta Mathematicae Vol. 39, No. 1, ss. 133-158, (1952).\nAndrzej Mostowski, \"On a system of axioms which has no recursively enumerable arithmetic model\", Fundamenta Mathematicae Vol. 40, No. 1, ss. 56-61, (1953).\nAndrzej Mostowski, \"A formula with no recursively enumerable model\", Fundamenta Mathematicae Vol. 42, No. 1, ss. 125-140, (1955).\nAndrzej Mostowski, \"Examples of sets definable by means of two and three quantifiers\", Fundamenta Mathematicae Vol. 42, No. 2, ss. 259-270, (1955).\nAndrzej Mostowski, \"Contributions to the theory of definable sets and functions\", Fundamenta Mathematicae Vol. 42, No. 2, ss. 271-275, (1955).\nAndrzej Ehrenfeucht, Andrzej Mostowski, \"Models of Axiomatic Theories Admitting Automorphisms\", Fundamenta Mathematicae, Vol. 43, No. 1, ss. 50-68 (1956).\nAndrzej Mostowski, \"L'oeuvre scientifique de Jan Łukasiewicz dans le domaine de la logique mathématique\", Fundamenta Mathematicae Vol. 44, No. 1, ss. 1-11, (1957).\nAndrzej Mostowski, \"On a generalization of quantifiers\", Fundamenta Mathematicae Vol. 44, No. 1, ss. 12-36, (1957).\nAndrzej Mostowski, \"On computable sequences\", Fundamenta Mathematicae Vol. 44, No. 1, ss. 37-51, (1957).\nAndrzej Grzegorczyk, Andrzej Mostowski and Czesław Ryll-Nardzewski, \"The classical and ω-complete arithmetic\", Journal of Symbolic Logic Vol. 23, No. 2, ss. 188-206, (1958).\nAndrzej Mostowski, \"On a problem of W. Kinna and K. Wagner\", Colloquium Mathematicae Vol. 6, No. 1, ss. 207-208, (1958).\nAndrzej Mostowski, \"A generalization of the incompleteness theorem\", Fundamenta Mathematicae Vol. 49, No. 2, ss. 205-232, (1961).\nAndrzej Mostowski, \"Axiomatizability of some many valued predicate calculi\", Fundamenta Mathematicae Vol. 50, No. 2, ss. 165-190, (1961).\nYoshindo Suzuki, Andrzej Mostowski, \"On ω-models which are not β-models\", Fundamenta Mathematicae Vol. 65, No. 1, ss. 83-93, (1969).\n\n\n== External links ==\nAndrzej Mostowski at the Mathematics Genealogy Project\nO'Connor, John J.; Robertson, Edmund F., \"Andrzej Mostowski\", MacTutor History of Mathematics archive, University of St Andrews .", "ns": 0, "pageid": 1029314, "title": "Andrzej Mostowski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}