{"batchcomplete": "", "query": {"normalized": [{"to": "Andrzej Tadeusz Kijowski", "from": "Andrzej_Tadeusz_Kijowski"}], "pages": {"14601622": {"extract": "Not to be mistaken for Andrzej Kijowski, his father.\n\nAndrzej Tadeusz Kijowski (born 15 July 1954, Kraków) is a Polish aesthetician, theatre critic, literary critic, poet and publicist. Son of the writer Andrzej Kijowski. From 1976 to 1989 participated in the democratic opposition. Cooperated with KOR (Workers' Defence Committee) and NOWa (Independent Printing House).From 1990 to 1994 helped to create the new self-government.\nHe worked at Nowa Telewizja and TV Polonia 1 in Warsaw from 1992 to 1995, where he made over 250 television programmes. Author of the Garden Theatre Competition and the Frascati Gardens arts festival.\nMember of the Polish Writers’ Association, the Polish Journalists’ Association, and the Freedom of Word Association.\n\n\n== Literary Work ==\nChwyt Teatralny (Theatrical trick); (Wydawnictwo Literackie 1982, ISBN 83-08-00954-9)\nTeoria Teatru (The Theory of Theatre); (Ossolineum 1985, ISBN 83-04-01935-3)\nSeparacja.SMS-y poetyckie (Separation, SMS poetics); (published by author 2005, ISBN 83-923292-5-2)\nOpis obyczajów w 15-leciu międzysojuszniczym 1989-2004 (Description of the mores between the two alliances 1989-2004) (AnTraKt Publisher) 2010\nOdsłanianie Dramatu (Revealing the drama) (I) ISBN 978-83-923292-6-8\nA Teraz Konkretnie (And now, more precisely) (II) ISBN 978-83-923292-7-5\nTeatr to miejsce spotkania (The theater is a meeting place)\nParadoks o Ogródkach (Garden's Paradox) (III) ISBN 978-83-923292-8-2\nThea to znaczy widzenie (Thea that is to say the View) (IV) ISBN 978-83-923292-9-9\n\n\n== See also ==\nList of aestheticians\nList of Polish language poets\n\n\n== Sources ==\nWho is Who w Polsce (6 edition: ISBN 3-7290-0058-6) ;Verlag für Personenenzyklopädien AG) - Hübners Who is Who\nParadoks o ogródkach (Garden's Paradox) - by ROMAN PAWŁOWSKI - Gazeta Wyborcza 27-08.2001\nPolish bibliography 1988 - 2001", "ns": 0, "pageid": 14601622, "title": "Andrzej Tadeusz Kijowski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}