{"batchcomplete": "", "query": {"normalized": [{"to": "Andrei Marga", "from": "Andrei_Marga"}], "pages": {"11591619": {"extract": "Andrei Marga (Romanian pronunciation: [anˈdrej ˈmarɡa]; born 22 May 1946) is a Romanian philosopher, political scientist, and politician. Rector – for the second time – of the Babeş-Bolyai University in Cluj-Napoca, he was a member of the Christian-Democratic National Peasants' Party (PNŢCD), serving as Minister of Education in the Democratic Convention (CDR) coalition governments of Victor Ciorbea, Radu Vasile, and Mugur Isărescu (1997-2000). In January 2001, he replaced Ion Diaconescu as PNŢCD chairman, but resigned from his post in July 2001, amid political tensions in the party. He formed a new party, the Popular Christian Party later in the year. Later, he affiliated with the National Liberal Party (PNL).\nMarga has authored a large number of volumes on political science, political philosophy, and the philosophy of history. His work touches a variety of subjects, including the philosophical theories of Herbert Marcuse and Jürgen Habermas, the nature of positivism, and trends in contemporary philosophy. He has also lectured on specific subjects, such as the philosophic foundations of transition from communism to a market economy, and the evolution of principles guiding European integration. In later works, he approached topics pertaining to the philosophy of religion, and to the status of religion in the age of globalization. In 2005, Andrei Marga received the Herder Prize in recognition of his contributions.\n\n\n== Biography ==\nMarga was born in Bucharest, attended the University of Cluj and also had a one-year scholarship at the University of Freiburg (West Germany).\nIn 1993, he became the rector of the Babeş-Bolyai University, of Cluj-Napoca.\nAs minister, Andrei Marga promoted educational system reform, stressing that the communist legacy had contributed to a rise in political corruption, and indicating that Romanian education lacked staples of professionalism such as underlined purposes, standards in certification, and evaluation criteria. Marga also criticized the system for relying on \"original features\" and \"Romanian traditions\", which had been explained as a means to promote national development, but, in effect, had contributed to the gap between Romania and the Western world. He called for modernization, and defined his goals as \"increasing the links between education and the economic, administrative and cultural environment, improving the educational infrastructure, eliminating paternalism and populism from educational management, and enhancing international cooperation in education\".\nThe program was criticized by the political opposition, who argued that the system in place was satisfactory, and blamed the existing problems on the post-1989 political and social climate. In parallel, supporters of reform were dissatisfied with its slow pace and inadequate financing.\nIn early 1998, a controversy erupted in Romanian politics, after the CDR announced that it was planning to stand by the plan to set up separate universities for the Hungarian minority. The decision was in turn based on a promise made to their coalition partner, the Democratic Union of Hungarians in Romania. In this context, Marga took the middle ground, saying that he supported separate Hungarian-language sections but not separate institutions (a similar view was expressed by the CDR's other coalition partner, the Democratic Party).\nMarga joined the PNŢCD in 1999, and became its leader two years later. Party rules prohibited members with less than five years in the party from running for party president. During the party's congress, a few candidates resigned in support of Marga and the party's constitution was amended to allow Marga to run. Marga defeated his conservative opponents with the support of the congress in spite of opposition from the party hierarchy. He was brought in to reform the party and position it to recover from the losses of the December 2000 election. His tenure failed to bring in the rapid changes desired and opposition from prominent conservative elements in his party stifled his ideas. He resigned in July 2001.\nIn 2002, Marga joined the PNŢCD's former coalition partner, the National Liberal Party. From May to August 2012, Marga served as Foreign Minister in the government of Victor Ponta.\n\n\n== Published works ==\nHerbert Marcuse. Studiu critic (\"Herbert Marcuse. A Critical Study\"), Editura Dacia, Cluj-Napoca, 1980, 250 p.\nCunoaştere şi sens. Perspective critice asupra pozitivismului (\"Cognition and Sense. A Critical Approach of Positivism\"), Editura Politică, Bucharest, 1984, 256 p.\nAcţiune şi raţiune în concepţia lui Jürgen Habermas (\"Action and Reason with Jürgen Habermas\"), Editura Dacia, Cluj-Napoca, 1985, 306 p.\nRaţionalitate, comunicare, argumentare (\"Rationality, Communication, Argumentation\"), Editura Dacia, Cluj-Napoca, 1991, 327 p.\nIntroducere în metodologia şi argumentarea filosofică (\"Introduction to Philosophical Methodology and Argumentation\"), Editura Dacia, Cluj-Napoca, 1992, 194 p.\nPhilosophy in the Eastern Transition, Editura Apostrof, Cluj-Napoca, 1993, 200 p.; (expanded edition), Editura Apostrof, Cluj-Napoca, 1995, 283 p.\nExplorări în actualitate (\"Explorations into the Present Time\"), Editura Apostrof, Cluj-Napoca, 1995, 187 p.\nFilosofia unificării europene (\"The Philosophy of the European Unification\"), Editura Apostrof, Cluj-Napoca, 1995, 257 p.; (second edition), Editura Apostrof, Cluj-Napoca, 1997, 392 p.\nUniversitatea în tranziţie (\"University in Transition\"), Editura Apostrof, Cluj-Napoca, 1996, 209 p.\nAcademic Reform. A Case Study, Cluj University Press, Cluj-Napoca, 1997, 100 p.\nReconstrucţia pragmatică a filosofiei (\"The Pragmatic Reconstruction of Philosophy\"), Polirom, Iaşi, 1998, 193 p.\nEducaţia în tranziţie (\"Education in Transition\"), Editura Dacia, Cluj-Napoca, 1999, 126 p.\nRelativismul şi consecinţele sale (\"Relativism and Its Consequences\"), Editura Studiilor Europene, Cluj-Napoca, 1999, 200 p.\nAnii reformei: 1997-2000 (\"The Years of Reform: 1997-2000\"), Editura Studiilor Europene, Cluj-Napoca, 2001, 200 p.\nUniversity Reform Today, Cluj University Press, Cluj-Napoca, 2001, 214 p.\nBildung und Modernisierung (\"Education and Modernization\"), Cluj University Press, Cluj-Napoca, 2001, 206 p.\nIntroducere în filosofia contemporană (\"Introduction to Contemporary Philosophy\"), Polirom, Iaşi, 2002, 560 p.\nIeşirea din trecut (documente şi reflecţii) (\"Path out of the Past. Documents and Reflections\"), Editura Alma Mater, Cluj-Napoca, 2002, 264 p.\nFilosofia lui Habermas (\"The Philosophy of Habermas\"), Polirom, Iaşi, 2006, 520 p.\nDiagnoze - Articole şi eseuri (\"Diagnoses - Articles and Essays\"), Editura Eikon, Cluj-Napoca, 2008, 550 p.\nDialoguri cu David Ward, HeNoi Paul, Roland Lohkamp, Michel Grimaldi, E.S. Zenon Cardinal Grocholewski, Hans Gert Pöttering, E.S. Christoph Cardinal Schönborn, Î.P.S. Bartolomeu Anania, Robert S. Wistrich, Gianfranco Ghirlanda, Édith Cresson, Hans Küng, René-Samuel Sirat, Gianni Vattimo, Cluj University Press, Cluj, 2008\nPhilosophia et Theologia Hodie, Editura Fundaţiei pentru Studii Europene, Cluj, 2008\nLa Sortie du Relativisme, Editura Limes, Cluj, 2008\nPhilosophie der europäischen Einigung, Cluj University Press, Cluj, 2009\nFraţii mai mari. Intâlniri cu iudaismul (The Older brothers. Encounters with Judaism), Editura Hasefer, Bucharest, 2009\nAbsolutul astăzi. Teologia and filosofia lui Joseph Ratzinger (Absolute today. Joseph Ratzinger's theology and philosophy), Editura Eikon, Cluj, 2010\nCriza si după criză (Crisis and after the crisis), Editura Eikon, Cluj, 2010, 210 p. (second edition)\nArgumentarea (Argumentation), Editura Academiei Române, Bucharest, 2010\nChallenges, Values and Vision, Cluj University Press, Cluj, 2011\nProfilul si reforma Universităţii clujene (Profile and Reform of the Cluj University), Cluj University Press, Cluj, 2011, 480 p. (third edition).\nRiflessioni italiane, Editura Grinta, 2011\nDupă cincisprezece ani. Fifteen Years after (1998-2004 şi 2008-2012), Presa Universitară Cluj, 2011\nRomânia actuală (Diagnoză), Editura Eikon, Cluj, 2011\nThe Destiny of Europe, Editura Academiei Române, Bucureşti, 2011\nThe Pragmatic Reconstruction of Philosophy, Cluj University Press, Cluj, 2012\nCrizele Modernității Târzii, Editura Academiei Române, București, 2012\nSincronizarea culturii romane, Editura Tribuna, 2013\nSchimbarea lumii - Globalizare, cultura, geopolitica, Editura Academiei Romane, 2013\nRomania intr-o lume in schimbare, Andrei Marga, interviuri cu Romeo Couti, Ecou Transilvan, 2013\n\n\n== International Prizes ==\n2008 Prize of Sara and Haim Ianculovici Foundation – Haifa (Israel)\n2005 Herder Prize (Austria – Germany)\n2003 Gold Medal – University of Tübingen (Germany)\n2002 România – Israel Award & The Medal of Jerusalem (Israel)\n\n\n== State Awards and other International Awards ==\n2011 Doctor Honoris Causa – Baku Pedagogical State University (Azerbaijan)\n2010 Doctor Honoris Causa – “Alecu Russo” Balty State University (Republic of Moldova)\n2010 Doctor Honoris Causa – „Corvinus” University of Budapest (Hungary)\n2009 Ordine della Stella della Solidarietà Italiana in grado di Cavaliere (President of Italian Republic)\n2008 Honorary Dignitary of Carmel City (Israel)\n2008 Doctor Honoris Causa – „Paul Valery” University of Montpellier (France)\n2006 Doctor of Humane Letters – Plymouth State University of New Hampshire State (USA)\n2006 A Commendation of the Governor of State of New Hampshire (USA)\n2006 Medaglia Pontificia. Anno I. BenedictusXVI (Vatican)\n2005 Medaglia Pontificia. Anno XXVI. Joannes Paulus II (Vatican)\n2003 Das Grosse Verdienstkreuz (President of Germany)\n2003 Doctor Honoris Causa – Debrecen University (Hungary)\n2002 Palmes Académiques – Ministère de l’Education Nationale (France)\n2000 Gra-Cruz da Ordem National do Merito (President of Portugal)\n2000 Doctor Honoris Causa – “Ion Creangă” University of Chişinău (Republic of Moldova)\n2000 Insigne Aureum – University of Maribor (Slovenia)\n1999 Grand Officier de l’Ordre National du Mérite (President of France)\n\n\n== Notes ==\n\n\n== References ==\nHolger Daun, Dana Săpătoru, \"Educational reforms in Eastern Europe: Shifts, Innovation and Restoration\", in Holger Daun, Educational Restructuring in the Context of Globalization and National Policy, Routledge, London, 2002. ISBN 0-8153-3941-0\n\n\n== External links ==\nOfficial blog of Andrei Marga", "ns": 0, "pageid": 11591619, "title": "Andrei Marga"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}