{"batchcomplete": "", "query": {"normalized": [{"to": "André Malraux", "from": "André_Malraux"}], "pages": {"42691": {"extract": "André Malraux DSO (French: [ɑ̃dʁe malʁo]; 3 November 1901 – 23 November 1976) was a French novelist, art theorist and Minister of Cultural Affairs. Malraux's novel La Condition Humaine (Man's Fate) (1933) won the Prix Goncourt. He was appointed by President Charles de Gaulle as Minister of Information (1945–1946) and subsequently as France's first Minister of Cultural Affairs during de Gaulle's presidency (1959–1969).\n\n\n== Early years ==\nMalraux was born in Paris in 1901, the son of Fernand-Georges Malraux and Berthe Lamy (Malraux). His parents separated in 1905 and eventually divorced. There are suggestions that Malraux's paternal grandfather committed suicide in 1909.\nMalraux was raised by his mother, maternal aunt Marie and maternal grandmother, Adrienne Lamy-Romagna, who had a grocery store in the small town of Bondy. His father, a stockbroker, committed suicide in 1930 after the international crash of the stock market and onset of the Great Depression. From his childhood, associates noticed that André had marked nervousness and motor and vocal tics. The recent biographer Olivier Todd, who published a book on Malraux in 2005, suggests that he had Tourette's syndrome, although that has not been confirmed. Either way, most critics have not seen this as a significant factor in Malraux's life or literary works.\nThe young Malraux left formal education early, but he followed his curiosity through the booksellers and museums in Paris, and explored its rich libraries as well.\n\n\n== Marriage and family ==\n\nIn 1922, Malraux married Clara Goldschmidt. Malraux and his first wife separated in 1938 but didn't divorce until 1947. His daughter from this marriage, Florence (b. 1933), married the filmmaker Alain Resnais.\nAfter the breakdown of his marriage with Clara, Malraux lived with journalist and novelist Josette Clotis, starting in 1933. Malraux and Josette had two sons: Pierre-Gauthier (1940–1961) and Vincent (1943–1961). During 1944, while Malraux was fighting in Alsace, Josette died, aged 34, when she slipped while boarding a train. His two sons died together in 1961 in an automobile accident.\nIn 1948, Malraux married a second time, to Marie-Madeleine Lioux, a concert pianist and the widow of his half-brother, Roland Malraux. They separated in 1966.\nSubsequently, Malraux lived with Louise de Vilmorin in the Vilmorin family château at Verrières-le-Buisson, Essonne, a suburb southwest of Paris. Vilmorin was best known as a writer of delicate but mordant tales, often set in aristocratic or artistic milieu. Her most famous novel was Madame de..., published in 1951, which was adapted into the celebrated film The Earrings of Madame de... (1953), directed by Max Ophüls and starring Charles Boyer, Danielle Darrieux and Vittorio de Sica. Vilmorin's other works included Juliette, La lettre dans un taxi, Les belles amours, Saintes-Unefois, and Intimités. Her letters to Jean Cocteau were published after the death of both correspondents. After Louise's death, Malraux spent his final years with her relative, Sophie de Vilmorin.\n\n\n== Career ==\n\n\n=== Early years ===\nMalraux's first published work, an article entitled \"The Origins of Cubist Poetry\", appeared in the magazine Action in 1920. This was followed in 1921 by three semi-surrealist tales, one of which, \"Paper Moons\", was illustrated by Fernand Léger. Malraux also frequented the Parisian artistic and literary milieux of the period, meeting figures such as Demetrios Galanis, Max Jacob, François Mauriac, Guy de Pourtalès, André Salmon, Jean Cocteau, Raymond Radiguet, Florent Fels, Pascal Pia, Marcel Arland, Edmond Jaloux, and Pierre Mac Orlan.\n\n\n=== Indochina ===\nIn 1923, aged 22, Malraux left for Cambodia with Clara. There, together with Clara and a friend, Louis Chevasson, he undertook a small expedition into unexplored areas of the Cambodian jungle in search of lost Khmer temples, hoping to find items that might be sold to art museums. (At about the same time, archaeologists, with the approval of the French Government, were removing large numbers of items from Angkor Wat - many of which are now in the Musée Guimet in Paris.) On his return, Malraux was arrested by French colonial authorities for removing a bas-relief from Banteay Srei. Malraux, who believed he had acted within the law as it then stood, contested the charges but was unsuccessful.\nMalraux's experiences in Indochina led him to become highly critical of the French colonial authorities there. In 1925, with Paul Monin, a progressive lawyer, he helped to organize the Young Annam League and founded a newspaper L'Indochine.\nOn his return to France, Malraux published The Temptation of the West (1926). The work was in the form of an exchange of letters between a Westerner and an Asian, comparing aspects of the two cultures. This was followed by his first novel The Conquerors (1928), and then by The Royal Way (1930) which reflected some of his Cambodian experiences. In 1933 Malraux published Man's Fate (La Condition Humaine), a novel about the 1927 failed Communist rebellion in Shanghai. The work was awarded the 1933 Prix Goncourt.\n\n\n=== Spanish Civil War ===\nDuring the 1930s, Malraux was active in the anti-fascist Popular Front in France. At the beginning of the Spanish Civil War he joined the Republican forces in Spain, serving in and helping to organize the small Spanish Republican Air Force. (Curtis Cate, one of his biographers, claims that Malraux was slightly wounded twice during efforts to stop the Falangists' takeover of Madrid, but the historian Hugh Thomas claims otherwise.)\nThe French government sent aircraft to Republican forces in Spain, but they were obsolete by the standards of 1936. They were mainly Potez 540 bombers and Dewoitine D.372 fighters. The slow Potez 540 rarely survived three months of air missions, flying at 80 knots against enemy fighters flying at more than 250 knots. Few of the fighters proved to be airworthy, and they were delivered intentionally without guns or gunsights. (The Ministry of Defense of France had feared that modern types of planes would easily be captured by the Germans fighting for Francisco Franco, and the lesser models were a way of maintaining official \"neutrality\".) The planes were surpassed by more modern types introduced by the end of 1936 on both sides.\nThe Republic circulated photos of Malraux standing next to some Potez 540 bombers suggesting that France was on their side, at a time when France and the United Kingdom had declared official neutrality. But Malraux's commitment to the Republicans was personal, like that of many other foreign volunteers, and there was never any suggestion that he was there at the behest of the French Government. Malraux himself was not a pilot, and never claimed to be one, but his leadership qualities seem to have been recognized because he was made Squadron Leader of the 'España' squadron. Acutely aware of the Republicans' inferior armaments, of which outdated aircraft were just one example, he toured the United States to raise funds for the cause. In 1938 he published L'Espoir (Man's Hope), a novel influenced by his Spanish war experiences.\nMalraux's participation in major historical events such as the Spanish Civil War inevitably brought him determined adversaries as well as strong supporters, and the resulting polarization of opinion has colored, and rendered questionable, much that has been written about his life. Fellow combatants praised Malraux's leadership and sense of camaraderie, although Antony Beevor says André Marty of the Comintern described him as an \"adventurer\" for his high profile and demands on the Spanish Republican government. Beevor also claims that \"Malraux stands out, not just because he was a mythomaniac in his claims of martial heroism – in Spain and later in the French Resistance – but because he cynically exploited the opportunity for intellectual heroism in the legend of the Spanish Republic.\" Both these claims are highly questionable. Malraux’s only work about the Spanish Revolution was a novel – in which he does not figure at all. His later works occasionally describe episodes during the Resistance but in none of them does he make anything resembling \"claims of martial heroism”. Indeed, in one episode, he portrays himself in a somewhat unflattering light. The Comintern's remarks are, of course, very unsurprising. During the Spanish Civil War it was normal Communist practice to denigrate anyone who \"deviated\"; indeed many suffered far worse fates than that as Orwell makes clear in Homage to Catalonia.\nIn any case, Malraux's participation in events such as the Spanish Civil War has tended to distract attention from his important literary achievement. Malraux saw himself first and foremost as a writer and thinker (and not a \"man of action\" as biographers so often portray him) but his extremely eventful life – a far cry from the stereotype of the French intellectual confined to his study or a Left Bank café – has tended to obscure this fact. As a result, his literary works, including his important works on the theory of art, have received less attention than one might expect, especially in Anglophone countries.\n\n\n=== World War II ===\nAt the beginning of the Second World War, Malraux joined the French Army. He was captured in 1940 during the Battle of France but escaped and later joined the French Resistance. In 1944, he was captured by the Gestapo. He later commanded the tank unit Brigade Alsace-Lorraine in defence of Strasbourg and in the attack on Stuttgart.\nOtto Abetz was the German governor, and produced a series of \"black lists\" of authors forbidden to be read, circulated or sold in Nazi Occupied France. These included anything written by a Jew, a communist, an Anglo-Saxon or anyone else who was anti-Germanic or anti-fascist. Louis Aragon and André Malraux were both on these \"Otto Lists\" of forbidden authors.\nAfter the war, Malraux was awarded the Médaille de la Résistance and the Croix de guerre. The British awarded him the Distinguished Service Order, for his work with British liaison officers in Corrèze, Dordogne and Lot. After Dordogne was liberated, Malraux led a battalion of former resistance fighters to Alsace-Lorraine, where they fought alongside the First Army.\nDuring the war, he worked on his last novel, The Struggle with the Angel, the title drawn from the story of the Biblical Jacob. The manuscript was destroyed by the Gestapo after his capture in 1944. A surviving first section, titled The Walnut Trees of Altenburg, was published after the war.\n\n\n=== After the war ===\n\nShortly after the war, General Charles de Gaulle appointed Malraux as his Minister for Information (1945–1946). Soon after, he completed his first book on art, The Psychology of Art, published in three volumes (1947–1949). The work was subsequently revised and republished in one volume as The Voices of Silence (Les Voix du Silence), the first part of which has been published separately as The Museum without Walls. Other important works on the theory of art were to follow. These included the three-volume Metamorphosis of the Gods and Precarious Man and Literature, the latter published posthumously in 1977.\nWhen de Gaulle returned to the French presidency in 1958, Malraux became France's first Minister of Cultural Affairs, a post he held from 1958 to 1969. Among many initiatives, he launched an innovative (and subsequently widely imitated) program to clean the blackened façades of notable French buildings, revealing the natural stone underneath. He also created a number of maisons de la culture in provincial cities and worked to preserve France's national heritage.\nIn 1957, Malraux published the first volume of his trilogy on art entitled The Metamorphosis of the Gods. The second two volumes (not yet translated into English) were published shortly before he died. They are entitled L’Irréel and L'Intemporel and discuss artistic developments from the Renaissance to modern times. Malraux also initiated the series Arts of Mankind, an ambitious survey of world art that generated more than thirty large, illustrated volumes.\nMalraux was an outspoken supporter of the Bangladesh liberation movement during the 1971 Pakistani Civil War and despite his age seriously considered joining the struggle. When Indira Gandhi came to Paris in November 1971, there was extensive discussion between them about the situation in Bangladesh.\nDuring this post-war period, Malraux also published a series of semi-autobiographical works, the first entitled Antimémoires (1967). A later volume in the series, Lazarus, is a reflection on death occasioned by his experiences during a serious illness. La Tête d'obsidienne (1974) (translated as Picasso's Mask) concerns Picasso, and visual art more generally.\nMalraux died in Créteil, near Paris, on 23 November 1976. He was buried in the Verrières-le-Buisson (Essonne) cemetery. In recognition of his contributions to French culture, his ashes were moved to the Panthéon in Paris during 1996, on the twentieth anniversary of his death.\n\n\n=== Legacy and honours ===\n\n1933, Prix Goncourt\nMédaille de la Résistance\nCroix de guerre\nDistinguished Service Order (United Kingdom)\nThere is now a large and steadily growing body of critical commentary on Malraux's literary œuvre, including his very extensive writings on art. Unfortunately, some of his works, including the last two volumes of The Metamorphosis of the Gods (L'Irréel and L'Intemporel) are not yet available in English translation. Malraux's works on the theory of art contain a revolutionary approach to art that challenges the Enlightenment tradition that treats art simply as a source of \"aesthetic pleasure\". However, as French writer André Brincourt has commented, Malraux's books on art have been \"skimmed a lot but very little read\" (this is especially true in Anglophone countries) and the radical implications of his thinking are often missed. A particularly important aspect of Malraux's thinking about art is his explanation of the capacity of art to transcend time. In contrast to the traditional notion that art endures because it is timeless (\"eternal\"), Malraux argues that art lives on through metamorphosis – a process of resuscitation (where the work had fallen into obscurity) and transformation in meaning.\n1968, an international Malraux Society was founded in the United States. It produces the journal Revue André Malraux Review, Michel Lantelme, editor, at University of Oklahoma.\nAnother international Malraux association, the Amitiés internationales André Malraux, is based in Paris.\nA French-language website, Site littéraire André Malraux, offers a valuable source of research and information about Malraux's works and critical commentary.\n\n\n== Quotations ==\n\"Man is dead, after God\". Malraux, The Temptation of the West. (1926)\n‘The artist is not the transcriber of the world, he is its rival.’ Malraux, L'Intemporel (3rd volume of The Metamorphosis of the Gods.)\n\"What is a man? A miserable little pile of secrets\" Antimémoires, preface (1967)\n'In a world in which everything is subject to the passing of time, art alone is both subject to time and yet victorious over it'. Malraux in a television program about art, 1975.\n\"Art is an object lesson for the gods.\" The Voices of Silence\n\"The art museum is one of the places that give us the highest idea of man.\" The Voices of Silence\n\"Humanism does not consist in saying: ‘No animal could have done what I have done,’ but in declaring: ‘We have refused what the beast within us willed to do, and we seek to reclaim man wherever we find that which crushes him.’\" The Voices of Silence\n\"The greatest mystery is not that we have been flung at random between this profusion of matter and the stars, but that within this prison we can draw from ourselves images powerful enough to deny our nothingness.\" Les Noyers de l'Altenburg\n\n\n== Bibliography ==\nLunes en Papier, 1923 (Paper Moons, 2005)\nLa Tentation de l'Occident, 1926 (The Temptation of the West, 1926)\nRoyaume-Farfelu, 1928 (The Kingdom of Farfelu, 2005)\nMalraux, André (1928). Les Conquérants (The Conquerors). University of Chicago Press. ISBN 978-0-226-50290-8.  (reprint University of Chicago Press, 1992, ISBN 978-0-226-50290-8)\nLa Voie royale, 1930 (The Royal Way or The Way of the Kings, 1930)\nLa Condition humaine, 1933 (Man's Fate, 1934)\nLe Temps du mépris, 1935 (Days of Wrath, 1935)\nL'Espoir, 1937 (Man's Hope, 1938)\nMalraux, André (1948). Les Noyers de l'Altenburg (The Walnut Trees of Altenburg). University of Chicago Press. ISBN 978-0-226-50289-2.  (reprint University of Chicago Press, 1992, ISBN 978-0-226-50289-2)\nLa Psychologie de l'Art, 1947–1949 (The Psychology of Art)\nLe Musée imaginaire de la sculpture mondiale (1952–54) (The Imaginary Museum of World Sculpture (in three volumes))\nLes Voix du silence, 1951 (The Voices of Silence, 1953)\nLa Métamorphose des dieux (English translation: The Metamorphosis of the Gods, by Stuart Gilbert):\nVol 1. Le Surnaturel, 1957\nVol 2. L'Irréel, 1974\nVol 3. L'Intemporel, 1976\n\nAntimémoires, 1967 (Anti-Memoirs, 1968 – autobiography)\nLes Chênes qu'on abat, 1971 (Felled Oaks or The Fallen Oaks)\nLazare, 1974 (Lazarus, 1977)\nL'Homme précaire et la littérature, 1977\nSaturne: Le destin, l'art et Goya, (Paris: Gallimard, 1978) (Translation of an earlier edition published in 1957: Malraux, André. * Saturn: An Essay on Goya. Translated by C.W. Chilton. London: Phaidon Press, 1957.)\nLettres choisies, 1920–1976. Paris, Gallimard, 2012.\nFor a more complete bibliography, see site littéraire André Malraux.\n\n\n== Exhibitions ==\nAndré Malraux, Fondation Maeght, Vence, 1973\nAndré Malraux et la modernité - le dernier des romantiques, Centennial Exhibition of his Birth, Musée de la Vie romantique, Paris, 2001, by Solange Thierry, with contributions by Marc Lambron, Solange Thierry, Daniel Marchesseau, Pierre Cabanne, Antoine Terrasse, Christiane Moatti, Gilles Béguin and Germain Viatte (ISBN 978-2-87900-558-4)\n\n\n== References ==\n\n\n== Further reading ==\nArt and the Human Adventure: André Malraux's Theory of Art (Amsterdam, Rodopi: 2009) Derek Allan\nAndré Malraux (1960) by Geoffrey H. Hartman\nAndré Malraux: The Indochina adventure (1960) by Walter Langlois (New York Praeger).\nMalraux, André (1976). Le Miroir des Limbes. Bibliothèque de la Pléiade (in French). Paris: Gallimard. ISBN 2-07-010864-3. \nMalraux (1971) by Pierre Galante (ASIN B0000DMPPW)\nAndré Malraux: A Biography (1997) by Curtis Cate Fromm Publishing (ISBN 2-08-066795-5)\nMalraux ou la Lutte avec l'ange. Art, histoire et religion (2001) by Raphaël Aubert (ISBN 2-8309-1026-5)\nMalraux : A Life (2005) by Olivier Todd (ISBN 0-375-40702-2) Review by Christopher Hitchens\nDits et écrits d'André Malraux : Bibliographie commentée (2003) by Jacques Chanussot and Claude Travi (ISBN 2-905965-88-6)\nAndré Malraux (2003) by Roberta Newnham (ISBN 978-1-84150-854-2)\nDavid Bevan (1986). André Malraux: towards the expression of transcendence. McGill-Queen's Press – MQUP. ISBN 978-0-7735-0552-0. \nJean François Lyotard (1999). Signed, Malraux. University of Minnesota Press. ISBN 978-0-8166-3106-3. \nGeoffrey T. Harris (1996). André Malraux: a reassessment. Palgrave Macmillan. ISBN 978-0-312-12925-5. \nAntony Beevor (2006). The battle for Spain: the Spanish Civil War, 1936–1939. Penguin. ISBN 978-0-14-303765-1. \nAndre Malraux: Tragic Humanist (1963) by Charles D. Blend, Ohio State University Press (LCCN 62-19865)\nDerek Allan, Art and Time, Cambridge Scholars, 2013.\n\n\n== External links ==\nAmitiés Internationales André Malraux The official site of the French André Malraux Society: Malraux and culture. (French)\nAndré Malraux The site of research and information dedicated to André Malraux: literature, art, religion, history and culture. (French)\nPetri Liukkonen. \"André Malraux\". Books and Writers (kirjasto.sci.fi). Archived from the original on 4 July 2013.\nUniversité McGill: le roman selon les romanciers (French) Inventory and analysis of André Malraux non-novelistic writings (French)\nMalraux's early, surrealist writings (French)\n'Malraux, Literature and Art' – Essays by Derek Allan (English)\nA multimedia adaptation of Voices of silence (French)\n\"Andre Malraux and the Arts\" – Henri Peyre, The Baltimore Museum of Art: Baltimore, Maryland, 1964 – Accessed 26 June 2012 (English)\nFondation André Malraux (French)\nFoundation André Malraux (English)", "ns": 0, "pageid": 42691, "title": "André Malraux"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}