{"batchcomplete": "", "query": {"normalized": [{"to": "Antonio Negri", "from": "Antonio_Negri"}], "pages": {"257241": {"extract": "Antonio \"Toni\" Negri (born 1 August 1933) is an Italian Marxist sociologist and political philosopher, best known for his co-authorship of Empire, and secondarily for his work on Spinoza.\nBorn in Padua, he became a political philosophy professor in his hometown university. Negri founded the Potere Operaio (Worker Power) group in 1969 and was a leading member of Autonomia Operaia. As one of the most popular theorists of Autonomism, he has published hugely influential books urging \"revolutionary consciousness.\"\nHe was accused in the late 1970s of various charges including being the mastermind of the left-wing urban guerrilla organization Red Brigades (Brigate Rosse or BR), involved in the May 1978 kidnapping of Aldo Moro, two-time Prime Minister of Italy, and leader of the Christian-Democrat Party, among others. Voice evidence suggested Negri made a threatening phone call on behalf of the BR, but the court was unable to conclusively prove his ties. The question of Negri's complicity with left-wing extremism is a controversial subject. He was indicted on a number of charges, including \"association and insurrection against the state\" (a charge which was later dropped), and sentenced for involvement in two murders.\nNegri fled to France where, protected by the Mitterrand doctrine, he taught at the Paris VIII (Vincennes) and the Collège international de philosophie, along with Jacques Derrida, Michel Foucault and Gilles Deleuze. In 1997, after a plea-bargain that reduced his prison time from 30 to 13 years, he returned to Italy to serve the end of his sentence. Many of his most influential books were published while he was behind bars. He now lives in Venice and Paris with his partner, the French philosopher Judith Revel.\n\n\n== Early years ==\nAntonio Negri was born in Padua, Italy in 1933. His father was an active communist, and although the father died when Negri was two years old, his political engagement made Negri familiar with Marxism from an early age. He began his career as a militant in the 1950s with the activist Roman Catholic youth organization Gioventú Italiana di Azione Cattolica (GIAC). Negri became a communist in 1953–54 when he worked at a kibbutz in Israel for a year. The kibbutz was organised according to ideas of Zionist socialism and all the members were Jewish communists. He joined the Italian Socialist Party in 1956 and remained a member until 1963, while at the same time becoming more and more engaged throughout the late 1950s and early 1960s in Marxist movements.\nHe had a quick academic career at the University of Padua and was promoted to full professor at a young age in the field of \"dottrina dello Stato\" (State theory), a peculiarly Italian field that deals with juridical and constitutional theory. This might have been facilitated by his connections to influential politicians such as Raniero Panzieri and philosopher Norberto Bobbio, strongly engaged with the Socialist Party.\nIn the early 1960s Negri joined the editorial group of Quaderni Rossi, a journal that represented the intellectual rebirth of Marxism in Italy outside the realm of the communist party.\nIn 1969, together with Oreste Scalzone and Franco Piperno, Negri was one of the founders of the group Potere Operaio (Workers' Power) and the Operaismo (workerist) Communist movement. Potere Operaio disbanded in 1973 and gave rise to the Autonomia Operaia Organizzata (Organised Workers' Autonomy) movement.\n\n\n== Arrest and flight ==\nOn 16 March 1978, Aldo Moro, former Italian prime minister and Christian Democrat party leader, was kidnapped in Rome by the Red Brigades, his five-man body guard murdered on the spot of the kidnapping in Rome's Via Fani. While they were holding him, forty-five days after the kidnapping, the Red Brigades called his family on the phone, informing Moro's wife of her husband's impending death. Nine days later his body, shot in the head, was found dumped in a city lane. The conversation was recorded, and later broadcast and televised. A number of people who knew Negri and remembered his voice identified him as the probable author of the call, but the claim has been since dismissed: the author of the call was, in fact, Valerio Morucci.\nOn 7 April 1979, at the age of forty-six, Antonio Negri was arrested for his part in the Autonomy Movement, along with others (Emilio Vesce, Luciano Ferrari Bravo, Mario Dalmaviva, Lauso Zagato, Oreste Scalzone, Pino Nicotri, Alisa del Re, Carmela di Rocco, Massimo Tramonte, Sandro Serafini, Guido Bianchini, and others). Padova's Public Prosecutor Pietro Calogero accused those involved in the political wing of the Red Brigades, and thus behind left-wing terrorism in Italy. Negri was charged with a number of offenses, including leadership of the Red Brigades, masterminding the 1978 kidnapping and murder of the President of the Christian Democratic Party Aldo Moro, and plotting to overthrow the government. At the time, Negri was a political science professor at the University of Padua and visiting lecturer at Paris' École Normale Supérieure. The Italian public was shocked that an academic could be involved in such events.\nA year later, Negri was exonerated from Aldo Moro's kidnapping after a leader of the BR, having decided to cooperate with the prosecution, testified that Negri \"had nothing to do with the Red Brigades.\" The charge of 'armed insurrection against the State' against Negri was dropped at the last moment, and because of this he did not receive the 30-year plus life sentence requested by the prosecutor, but only 30 years for being the instigator of political activist Carlo Saronio's murder and having 'morally concurred' with the murder of Andrea Lombardini, a carabinier, during a failed bank robbery.\nHis philosopher peers saw little fault with Negri's activities. Michel Foucault commented, \"Isn't he in jail simply for being an intellectual?\" French philosophers Félix Guattari and Gilles Deleuze also signed in November 1977 L'Appel des intellectuels français contre la répression en Italie (The Call of French Intellectuals Against Repression in Italy) in protest against Negri's imprisonment and Italian anti-terrorism legislation.\nIn 1983, four years after his arrest and while he was still in prison awaiting trial, Negri was elected to the Italian legislature as a member for the Radical Party. Claiming parliamentary immunity, he was temporarily released and used his freedom to escape to France. There he remained for 14 years, writing and teaching, protected from extradition in virtue of the \"Mitterrand doctrine\". His refusal to stand trial in Italy was widely criticized by Italian media and by the Italian Radical Party, who had supported his candidacy to Parliament.\nIn France, Negri began teaching at the Paris VIII (Vincennes) and the Collège international de philosophie, founded by Jacques Derrida. Although the conditions of his residence in France prevented him from engaging in political activities, he wrote prolifically and was active in a broad coalition of left-wing intellectuals. In 1990 Negri with Jean-Marie Vincent and Denis Berger founded the journal Futur Antérieur. (The journal ceased publication in 1998 but was reborn as Multitudes in 2000, with Negri as a member of the international editorial board.)\nIn 1997, after a plea-bargain that reduced his prison time from 30 to 13 years, Negri returned to Italy to serve the end of his sentence. He was released from prison in the spring of 2003, having written some of his most influential works while behind bars.\nIn the late 1980s the Italian President Francesco Cossiga described Antonio Negri as \"a psychopath\" who \"poisoned the minds of an entire generation of Italy's youth.\"\n\n\n== Political thought and writing ==\nUnlike other forms of Marxism, autonomist Marxism emphasises the ability of the working class to force changes to the organization of the capitalist system independent of the state, trade unions or political parties. Autonomists are less concerned with party political organization than are other Marxists, focusing instead on self-organized action outside of traditional organizational structures. Autonomist Marxism is thus a \"bottom-up\" theory: it draws attention to activities that autonomists see as everyday working-class resistance to capitalism, for example absenteeism, slow working, and socialization in the workplace. The journal Quaderni Rossi (\"Red Notebooks\"), produced between 1961 and 1965, and its successor Classe Operaia (\"Working Class\"), produced between 1963 and 1966, were also influential in the development of early autonomism. Both were founded by Antonio Negri and Mario Tronti.\nToday, Antonio Negri is best known as the co-author, with Michael Hardt, of the controversial Marxist-inspired treatise Empire (2000).\nIn 2009 Negri completed the book Commonwealth, the final in a trilogy that began in 2000 with Empire and continued with Multitude in 2004, co-authored with Michael Hardt.\nSince Commonwealth, he has written multiple notable articles on the Arab Spring and Occupy movements along with other social issues.\n\n\n=== Labor of Dionysus: A Critique of the State-Form (1994) ===\nIn this book the authors ask themselves \"How is it, then, that labor, with all its life-affirming potential, has become the means of capitalist discipline, exploitation, and domination in modern society?\" The authors expose and pursue this paradox through a systematic analysis of the role of labor in the processes of capitalist production and in the establishment of capitalist legal and social institutions. Critiquing liberal and socialist notions of labor and institutional reform from a radical democratic perspective, Hardt and Negri challenge the state-form itself.\n\n\n=== Insurgencies: Constituent Power and the Modern State (1999) ===\nThis book written solely by Negri \"explores the drama of modern revolutions-from Machiavelli’s Florence and Harrington’s England to the American, French, and Russian revolutions-and puts forward a new notion of how power and action must be understood if we are to achieve a radically democratic future.\"\n\n\n=== Empire (2000) ===\n\nIn general, the book theorizes an ongoing transition from a \"modern\" phenomenon of imperialism, centered around individual nation-states, to an emergent postmodern construct created among ruling powers which the authors call \"Empire\", with different forms of warfare:\n\n...according to Hardt and Negri's Empire, the rise of Empire is the end of national conflict, the \"enemy\" now, whoever he is, can no longer be ideological or national. The enemy now must be understood as a kind of criminal, as someone who represents a threat not to a political system or a nation but to the law. This is the enemy as a terrorist....In the \"new order that envelops the entire space of... civilization\", where conflict between nations has been made irrelevant, the \"enemy\" is simultaneously \"banalized\" (reduced to an object of routine police repression) and absolutized (as the Enemy, an absolute threat to the ethical order\").\n\nEmpire elaborates a variety of ideas surrounding constitutions, global war, and class. Hence, the Empire is constituted by a monarchy (the United States and the G8, and international organizations such as NATO, the International Monetary Fund or the World Trade Organization), an oligarchy (the multinational corporations and other nation-states) and a democracy (the various non-government organizations and the United Nations). Part of the book's analysis deals with \"imagin[ing] resistance\", but \"the point of Empire is that it, too, is \"total\" and that resistance to it can only take the form of negation - \"the will to be against\". The Empire is total, but economic inequality persists, and as all identities are wiped out and replaced with a universal one, the identity of the poor persists.\n\n\n=== Multitude: War and Democracy in the Age of Empire (2004) ===\n\nMultitude addresses these issues and picks up the thread where Empire has left off. In order to do so, Hardt and Negri argue, one must first analyze the present configuration of war and its contradictions. This analysis is performed in the first chapter, after which chapters two and three focus on multitude and democracy, respectively. Multitude is not so much a sequel as it is a reiteration from a new point of view in a new, relatively accessible style that is distinct from the predominantly academic prose style of Empire. Multitude remains, the authors insist, despite its ubiquitous subject matter and its almost casual tone, a book of philosophy which aims to shape a conceptual ground for a political process of democratization rather than present an answer to the question ‘what to do?’ or offer a programme for concrete action.\n\n\n=== Commonwealth (2009) ===\n\nIn this book, the authors introduce the concept of \"the republic of property\": \"What is central for our purposes here is that the concept of property and the defense of property remain the foundation of every modern political constitution. This is the sense in which the republic, from the great bourgeois revolutions to today, is a republic of property\". Part 2 of the book deals with the relationship between modernity and anti-modernity and proposes \"alter-modernity\". Alter-modernity \"involves not only insertion in the long history of antimodern struggles but also rupture with any fixed dialectic between modern sovereignty and antimodern resistance. In the passage from antimodernity to altermodernity, just as tradition and identity are transformed, so too resistance takes on a new meaning, dedicated now to the constitution of alternatives. The freedom that forms the base of resistance, as we explained earlier, comes to the fore and constitutes an event to announce a new political project.\"\nFor Alex Callinicos in a review \"What is newest in Commonwealth is its take on the fashionable idea of the common. Hardt and Negri mean by this not merely the natural resources that capital seeks to appropriate, but also \"the languages we create, the social practices we establish, the modes of sociality that define our relationships\", which are both the means and the result of biopolitical production. Communism, they argue, is defined by the common, just as capitalism is by the private and socialism (which they identify in effect with statism) with the public.\" For David Harvey Negri and Hardt \"in the search of an altermodernity-something that is outside the dialectical opposition between modernity and anti-modernity-they need a means of escape. The choice between capitalism and socialism, they suggest is all wrong. We need to identify something entirely different, communism-working within a different set of dimensions.\" Harvey also notes that \"Revolutionary thought, Hardt and Negri argue, must find a way to contest capitalism and \"the republic of property.\" It \"should not shun identity politics but instead must work through it and learn from it,\" because it is the \"primary vehicle for struggle within and against the republic of property since identity itself is based on property and sovereignty.\" In the same exchange in Artforum between Harvey and Micheal Hardt and Antonio Negri, Hardt and Negri attempt to correct Harvey in a concept that is important within the argument of Commonwealth. As such, they state that \"We instead define the concept of singularity, contrasting it to the figure of the individual on the one hand and forms of identity on the other, by focusing on three aspects of its relationship to multiplicity: Singularity refers externally to a multiplicity of others; is internally divided or multiple; and constitutes a multiplicity over time - that is, a process of becoming.\"\n\n\n=== Occupy movements of 2011–2012 and Declaration ===\nIn May 2012 Negri self-published (with Michael Hardt) an electronic pamphlet on the occupy and encampment movements of 2011–2012 called Declaration that argues the movement explores new forms of democracy. The introduction was published at Jacobin under the title \"Take Up the Baton\". He also published an article with Hardt in Foreign Affairs in October 2011 stating \"The Encampment in Lower Manhattan Speaks to a Failure of Representation.\"\n\n\n== Quotes ==\n\"Prison, with its daily rhythm, with the transfer and the defense, does not leave any time; prison dissolves time: This is the principal form of punishment in a capitalist society.\"\n\"Nothing in my books has any direct organizational relationship. My responsibility is totally as an intellectual who writes and sells books!\"\n\"...it is indeed necessary to recognize as a fact the emergence of the B.R. [Red Brigades] and NAP [Armed Proletariat Nuclei] as the tip of the iceberg of the Movement. This does not require one in any way to transform the recognition into a defense, and this does not in any way deny the grave mistake of the B.R. line. At one point I defined the B.R. as a variable of the movement gone crazy... I state again that terrorism can only be fought through an authentic mass political struggle and inside the revolutionary movement.\"\nIn Empire the expansion of capitalism is supposed to be 'internal' rather than 'external,' in that it \"subsumes not the noncapitalist environment but its own capitalist terrain—that is, that the subsumption is no longer formal but real.\"\n\n\n== Selected works (English) ==\nNegri, Antonio. Pipeline: Letters from Prison, translated by Ed Emery. Cambridge, Polity, 2015\nNegri, Antonio. Insurgencies: Constituent Power and the Modern State, translated by Maurizia Boscagli. Minneapolis: University of Minnesota Press, 1999. Reprint by University of Minnesota Press, 2009.\nMichael Hardt and Antonio Negri, Commonwealth, Belknap Press of Harvard University Press, 2009. ISBN 978-0-674-03511-9\nThe Cell (DVD of 3 interviews on captivity with Negri) Angela Melitopoulos, Actar, 2008.\nAntonio Negri, The Porcelain Workshop: For a New Grammar of Politics Translated by Noura Wedell. California: Semiotext(e) 2008.\nAntonio Negri, Political Descartes: Reason, Ideology and the Bourgeois Project. Translated by Matteo Mandarini and Alberto Toscano. New York: Verso, 2007.\nAntonio Negri, Negri on Negri: In Conversation with Anne Dufourmentelle London: Routledge, 2004.\nMichael Hardt and Antonio Negri, Multitude: War and Democracy in the Age of Empire, New York: Penguin Press, 2004.\nAntonio Negri, Subversive Spinoza: (Un)Contemporary Variations, edited by Timothy S. Murphy, translated by Timothy S. Murphy, Michael Hardt, Ted Stolze, and Charles T. Wolfe, Manchester: Manchester University Press, 2004.\nAntonio Negri, Time for Revolution. Translated by Matteo Mandarini. New York: Continuum, 2003.\nAntonio Negri, The Labor of Job: The Biblical Text as a Parable of Human Labor, (Forward: Michael Hardt; Translator: Matteo Mandarini), Duke University Press, (begun 1983) 2009.\nMichael Hardt and Antonio Negri, Empire, Harvard University Press, 2000.\nHardt, Michael and Negri, Antonio. Labor of Dionysus: A Critique of the State-Form. Minneapolis: University of Minnesota Press, 1994.\nNegri, Antonio.The Savage Anomaly: The Power of Spinoza's Metaphysics and Politics, translated by Michael Hardt. Minneapolis: University of Minnesota Press, 1991.\nAntonio Negri, Marx Beyond Marx: Lessons on the Grundrisse, New York: Autonomedia, 1991.\nAntonio Negri, Revolution Retrieved: Selected Writings on Marx, Keynes, Capitalist Crisis and New Social Subjects, 1967–83, trans. Ed Emery and John Merrington, London: Red Notes, 1988. ISBN 0-906305-09-8\nAntonio Negri, The Politics of Subversion: A Manifesto for the Twenty-First Century, Cambridge: Polity Press, 1989.\nFélix Guattari and Antonio Negri, Communists like us, 1985.\nGoodbye Mr. Socialism Antonio Negri in conversation with Raf Valvola Scelsi, Seven Stories Press, 2008.\nCasarino, Cesare and Negri, Antonio. In Praise of the Common. Minneapolis: University of Minnesota Press, 2009.\nDeclaration, with Michael Hardt, 2012.\n\n\n=== Online articles ===\nMultitudes quarterly journal (in French)\nArchives of the journal Futur Antérieur (in French)\nEnglish translations of recent articles by Antonio Negri from Generation Online\nHardt & Negri (2002), \"Marx's Mole is Dead\" in Eurozine\nBetween \"Historic Compromise\" and Terrorism: Reviewing the experience of Italy in the 1970s Le Monde Diplomatique, August–September 1998\n\"Towards an Ontological Definition of Multitude\" Article published in the French journal Multitudes.\nExtract from Negri and Hardt's Empire at Marxists.org\n\"Take Up the Baton.\"\n\n\n== Films ==\nMarx Reloaded, Arte, April 2011.\nAntonio Negri: A Revolt that Never Ends, ZDF/Arte, 52 min., 2004.\n\n\n== See also ==\nPaolo Virno\nLibertarian marxism\n\n\n== References ==\n\n\n== Further reading ==\nThe Cell (DVD of 3 interviews on captivity with Negri) Angela Melitopoulos, Actar, 2008.\nEmpire and Imperialism: A Critical Reading of Michael Hardt and Antonio Negri. Atilio Boron, London: Zed Books, 2005. (Publisher's announcement)\nReading Capital Politically, Harry Cleaver. 1979, second ed. 2000.\nThe Philosophy of Antonio Negri, vol. 1: Resistance in Practice, ed. Timothy S. Murphy and Abdul-Karim Mustapha. London: Pluto Press, 2005.\nThe Philosophy of Antonio Negri, vol. 2: Revolution in Theory, ed. Timothy S. Murphy and Abdul-Karim Mustapha. London: Pluto Press, 2007.\nDossier on Empire: a special issue of Rethinking Marxism, ed. Abdul-karim Mustapha. London: T&F/Routledge, 2002.\nAutonomia: Post-Political Politics, ed. Sylvere Lotringer & Christian Marazzi. New York: Semiotext(e), 1980, 2007. (Includes transcripts of Negri's exchanges with his accusers during his trial.) ISBN 1-58435-053-9, ISBN 978-1-58435-053-8. Available online at Semiotext(e)\nAntonio Negri Illustrated: Interview in Venice, Claudio Calia, Red Quill Books, 2011. ISBN 978-1-926958-13-2 (Publisher's announcement)\n\n\n== External links ==\n Media related to Antonio Negri at Wikimedia Commons\n Quotations related to Michael Hardt and Antonio Negri at Wikiquote", "ns": 0, "pageid": 257241, "title": "Antonio Negri"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}