{"batchcomplete": "", "query": {"pages": {"164556": {"extract": "Archon (Greek ἄρχων arkhon; pl. ἄρχοντες arkhontes) is a Greek word that means \"ruler\" or \"lord,\" frequently used as the title of a specific public office. As civic and religious leaders, Archons were responsible for organizing theatrical performances during festivals through playwrights and choregai (wealthy citizen patrons). It is the masculine present participle of the verb stem ἀρχ-, meaning \"to rule,\" derived from the same root as monarch.\n\n\n== Ancient Greece ==\n\nIn ancient Greece the chief magistrate in various Greek city states was called Archon. The term was also used throughout Greek history in a more general sense, ranging from \"club leader\" to \"master of the tables\" at syssitia.\nIn Athens a republican system of nine concurrent Archons evolved, led by three respective remits over the civic, military, and religious affairs of the state: the three office holders being known as the Eponymos archon (Ἐπώνυμος ἄρχων; the \"name\" ruler, who gave his name to the year in which he held office), the Polemarch (\"war ruler\"), and the Archon Basileus (\"king ruler\"). The six others were the Thesmothétai, Judicial Officers. Originally these offices were filled from the wealthier classes by elections every ten years. During this period the eponymous Archon was the chief magistrate, the Polemarch was the head of the armed forces, and the Archon Basileus was responsible for some civic religious arrangements, and for the supervision of some major trials in the law courts. After 683 BC the offices were held for only a single year, and the year was named after the Archōn Epōnymos. (Many ancient calendar systems did not number their years consecutively.)\nAfter 487 BC, the archonships were assigned by lot to any citizen and the Polemarch's military duties were taken over by new class of generals known as stratēgoí. The ten stratēgoí (one per tribe) were elected, and the office of Polemarch was rotated among them on a daily basis. The Polemarch thereafter had only minor religious duties, and the titular headship over the strategoi. The archons were assisted by \"junior\" archons, called Thesmothétai (Θεσμοθέται \"Institutors\"). After 457 BC ex-archons were automatically enrolled as life members of the Areopagus, though that assembly was no longer extremely important politically at that time. (See Archons of Athens.)\nUnder the Athenian constitution, Archons were also in charge of organizing festivals by bringing together poets, playwrights, actors, and city-appointed choregai (wealthy citizen patrons). The Archon would begin this process months in advance of a festival by selecting a chorus of three playwrights based on descriptions of the projected plays. Each playwright would be assigned a choregos, also selected by the Archon, from among the wealthy citizens who would pay all the expenses of costumes, masks, and training the chorus. The Archon also assigned each playwright a principal actor (the protagonist), as well as a second and third actor. The City Dionysia, an ancient dramatic festival held in March in which tragedy, comedy, and satyric drama originated, was under the direction of one of the principal magistrates, the archon eponymos. The archon eponymos remained the titular head of state under democracy, though of much reduced political importance.\n\n\n== Byzantine Empire ==\nByzantine historians usually described foreign rulers as archontes. The rulers of the Bulgars themselves, along with their own titles, often bear the title archon placed by God in inscriptions in Greek.\nInside Byzantium, the term could be used to refer to any powerful noble or magnate, but in a technical sense, it was applied to a class of provincial governors. In the 8th and 9th centuries, these were the governors of some of the more peripheral provinces, inferior in status to the themata: Dalmatia, Cephalonia, Crete and Cyprus. Archontes were also placed in charge of various naval bases and trade stations, as well as semi-autonomous Slavic-inhabited areas (sclaviniae) under Byzantine sovereignty. In the 10th–12th centuries, archontes are also mentioned as the governors of specific cities. The area of an archon's jurisdiction was called an archontia (ἀρχοντία). The title was also used for the holders of several financial posts, such as the head of the mint (ἄρχων τῆς χαραγῆς), as well as directors of the imperial workshops, arsenals, etc.\nThe title of megas archon (\"grand archon\") is also attested, as a translation of foreign titles such as \"grand prince\". In the mid-13th century, it was established as a special court rank, held by the highest-ranking official of the emperor's company. It existed throughout the Palaiologan period, but did not have any specific functions.\n\n\n== Patriarchate of Constantinople ==\nFrom time to time, laity of the Eastern Church in communion with the Patriarch of Constantinople have been granted the title of Archon of the Ecumenical Patriarchate to honor their service to Church administration. In 1963, Archons were organized into a service society dedicated to St Andrew. This Archon status is not part of the Church hierarchy and is purely honorary.\nAn Archon is an honoree by His All Holiness the Ecumenical Patriarch, for his outstanding service to the Church, and a well-known, distinguished, and well-respected leader of the Orthodox Church (at large).\nIt is the sworn oath of the Archon to defend and promote the Orthodox Church faith and tradition. His main concern is to protect and promote the Holy Patriarchate and its mission. He is also concerned with human rights and the well-being and general welfare of the Church.\nAs it is a significant religious position, the faith and dedication of a candidate for the role are extensively reviewed during consideration; the candidate should have demonstrated commitment for the betterment of the Church, Parish-Diocese, Archdiocese and the community as a whole.\n\n\n== See also ==\nArchon (gnosticism)\nArhat\nCount\n\n\n== References ==\n\n\n== Further reading ==\nA Greek-English Lexicon (AKA Liddell and Scott), ISBN 0-19-864226-1\nThe Oxford Companion to Classical Literature, ISBN 0-19-866121-5.\n\n\n== External links ==\n The dictionary definition of archon at Wiktionary", "ns": 0, "pageid": 164556, "title": "Archon"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}