{"batchcomplete": "", "query": {"normalized": [{"to": "Arend Heyting", "from": "Arend_Heyting"}], "pages": {"1180911": {"extract": "Arend Heyting (Dutch: [ˈɦɛi̯tɪŋ]; 9 May 1898 – 9 July 1980) was a Dutch mathematician and logician. He was a student of Luitzen Egbertus Jan Brouwer at the University of Amsterdam, and did much to put intuitionistic logic on a footing where it could become part of mathematical logic. Heyting gave the first formal development of intuitionistic logic in order to codify Brouwer's way of doing mathematics. The inclusion of Brouwer's name in the Brouwer–Heyting–Kolmogorov interpretation is largely honorific, as Brouwer was opposed in principle to the formalisation of certain intuitionistic principles (and went as far as calling Heyting's work a \"sterile exercise\").\nIn 1942 he became member of the Royal Netherlands Academy of Arts and Sciences.\nHeyting was born in Amsterdam, Netherlands, and died in Lugano, Switzerland.\n\n\n== Selected publications ==\nHeyting, A. (1930) Die formalen Regeln der intuitionistischen Logik. (German) 3 parts, In: Sitzungsberichte der preußischen Akademie der Wissenschaften. phys.-math. Klasse, 1930, 42–65, 57-71, 158-169.\nHeyting, A. (1941) Untersuchungen der intuitionistische Algebra. (German) Verh. Nederl. Akad. Wetensch. Afd. Natuurk. Sect. 1. 18. no. 2, 36 pp.\nHeyting, A. (1956) Intuitionism. An introduction. North-Holland Publishing Co., Amsterdam.\nHeyting, A. (1959) Axioms for intuitionistic plane affine geometry. The axiomatic method. With special reference to geometry and physics. Proceedings of an International Symposium held at the Univ. of Calif., Berkeley, Dec. 26, 1957–Jan 4, 1958 (edited by L. Henkin, P. Suppes and A. Tarski) pp. 160–173 Studies in Logic and the Foundations of Mathematics North-Holland Publishing Co., Amsterdam.\nHeyting, A. (1962) After thirty years. 1962 Logic, Methodology and Philosophy of Science (Proc. 1960 Internat. Congr.) pp. 194–197 Stanford Univ. Press, Stanford, Calif.\nHeyting, A. (1963) Axiomatic projective geometry. Bibliotheca Mathematica, Vol. V. Interscience Publishers John Wiley & Sons, Inc., New York; P. Noordhoff N.V., Groningen; North-Holland Publishing Co., Amsterdam.\nHeyting, A. (1966) Intuitionism: An introduction. Second revised edition North-Holland Publishing Co., Amsterdam.\nHeyting, A. (1973) Address to Professor A. Robinson. At the occasion of the Brouwer memorial lecture given by Prof. A.Robinson on the 26th April 1973. Nieuw Arch. Wisk. (3) 21, pp. 134–137.\nHeyting, A. (1974) Mathematische Grundlagenforschung, Intuitionismus, Beweistheorie. (German) Reprint. Springer-Verlag, Berlin–New York.\nHeyting, A. (1980) Axiomatic projective geometry. Second edition. Bibliotheca Mathematica [Mathematics Library], V. Wolters-Noordhoff Scientific Publications, Ltd., Groningen; North-Holland Publishing Co., Amsterdam–New York.\n\n\n== See also ==\nHeyting algebra\nHeyting arithmetic\n\n\n== References ==\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Arend Heyting\", MacTutor History of Mathematics archive, University of St Andrews .\nArend Heyting at the Mathematics Genealogy Project", "ns": 0, "pageid": 1180911, "title": "Arend Heyting"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}