{"batchcomplete": "", "query": {"pages": {"98921": {"extract": "Aristoxenus of Tarentum (Greek: Ἀριστόξενος; b. c. 375, fl. 335 BCE) was a Greek Peripatetic philosopher, and a pupil of Aristotle. Most of his writings, which dealt with philosophy, ethics and music, have been lost, but one musical treatise, Elements of Harmony (Greek: Ἁρμονικῶν στοιχείων; Latin: Elementa harmonica), survives incomplete, as well as some fragments concerning rhythm and meter. The Elements is the chief source of our knowledge of ancient Greek music.\n\n\n== Life ==\nAristoxenus was born at Tarentum, and was the son of a learned musician named Spintharus (otherwise Mnesias). He learned music from his father, and having then been instructed by Lamprus of Erythrae and Xenophilus the Pythagorean, he finally became a pupil of Aristotle, whom he appears to have rivaled in the variety of his studies. According to the Suda, he heaped insults on Aristotle after his death, because Aristotle had designated Theophrastus as the next head of the Peripatetic school, a position which Aristoxenus himself had coveted having achieved great distinction as a pupil of Aristotle. This story is, however, contradicted by Aristocles, who asserts that he never mentioned Aristotle but with the greatest respect. Nothing is known of his life after the time of Aristotle's departure, apart from a comment in Elementa Harmonica concerning his works.\n\n\n== Overview of his works ==\nHis writings, said to have consisted of four hundred and fifty-three books, were in the style of Aristotle, and dealt with philosophy, ethics and music. The only work of his that has come down to us is the three books of the Elements of Harmony, an incomplete musical treatise. Aristoxenus' theory had an empirical tendency; in music he held that the notes of the scale are to be judged, not as the Pythagoreans held, by mathematical ratio, but by the ear. Vitruvius in his De architectura paraphrases the writings of Aristoxenus on music. His ideas were responded to and developed by some later theorists such as Archestratus, and his place in the methodological debate between rationalists and empiricists was commented upon by such writers as Ptolemais of Cyrene.\nThe theory that the soul is a \"harmony\" of the four elements composing the body, and therefore mortal (\"nothing at all,\" in the words of Cicero), was ascribed to Aristoxenus (fr. 118-121 Wehrli) and Dicaearchus. This theory is comparable to the one offered by Simmias in Plato's Phaedo.\n\n\n== Elementa harmonica ==\nIn his Elements of Harmony (also Harmonics), Aristoxenus attempted a complete and systematic exposition of music. The first book contains an explanation of the genera of Greek music, and also of their species; this is followed by some general definitions of terms, particularly those of sound, interval, and system. In the second book Aristoxenus divides music into seven parts, which he takes to be: the genera, intervals, sounds, systems, tones or modes, mutations, and melopoeia. The remainder of the work is taken up with a discussion of the many parts of music according to the order which he had himself prescribed.\nWhile it is often held among modern scholars that Aristoxenus rejected the opinion of the Pythagoreans that arithmetic rules were the ultimate judge of intervals and that in every system there must be found a mathematical coincidence before such a system can be said to be harmonic, it must be noted that Aristoxenus made extensive use of arithmetic terminology, notably to define varieties of semitones, and dieses in his descriptions of the various genera.\nIn his second book he asserted that \"by the hearing we judge of the magnitude of an interval, and by the understanding we consider its many powers.\" And further he wrote, \"that the nature of melody is best discovered by the perception of sense, and is retained by memory; and that there is no other way of arriving at the knowledge of music;\" and though, he wrote, \"others affirm that it is by the study of instruments that we attain this knowledge;\" this, he wrote, is talking wildly, \"for just as it is not necessary for him who writes an Iambic to attend to the arithmetical proportions of the feet of which it is composed, so it is not necessary for him who writes a Phrygian song to attend to the ratios of the sounds proper thereto.\" However, this should not be construed as meaning that he postulated a simplistic system of harmony resembling that of modern twelve tone theory, and especially not an equally tempered system. As he urges us to consider, \"(a)fter all, with which of the people who argue about the shades of the genera should one agree? Not everyone looks to the same division when tuning the chromatic or the enharmonic, so why should the note a ditone from mesé be called lichanos rather than a small amount higher?\" \nIt is sometimes claimed that the nature of Aristoxenus' scales and genera deviated sharply from his predecessors. That Aristoxenus used a model for creating scales based upon the notion of a topos, or range of pitch location, is fact, however there is no reason to believe that he alone set this precedent, as he himself does not make this claim. Indeed, the idea of unfixed pitch locations that cover certain ranges, the limits of which may be defined by fixed points, is a notion that was popular until the modern fixation upon fixed pitch systems, as is indicated by baroque theoretical systems of pitch and intonation. Another way of stating this, however perhaps less accurate, is that instead of using discrete ratios to place intervals, he used continuously variable quantities.\nThe postulation that this resulted in the structuring of his tetrachords and the resulting scales having 'other' qualities of consonance  is one that can only be accounted for by the recourse to often repeated inconsistencies amongst his interpreters and modern confirmation bias in favour of simplified twelve tone theories. Aristoxenus himself held that \"(...) two things must not be overlooked: first, that many people have mistakenly supposed us to be saying that a tone can be divided into three equal parts in a melody. They made this mistake because they did not realise that it is one thing to employ the third part of a tone, and another to divide a tone into three parts and sing all three. Secondly we accept that from a purely abstract point of view there is no least interval.\" \nIn book three Aristoxenus goes on to describe twenty eight laws of melodic succession, which are of great interest to those concerned with classical Greek melodic structure.\n\n\n== On rhythmics and metrics ==\nPart of the second book of a work on rhythmics and metrics, Elementa rhythmica, is preserved in medieval manuscript tradition.\nAristoxenus was also the author of a work On the Primary Duration (chronos).\nA five-column fragment of a treatise on meter (P. Oxy. 9/2687) was published in Grenfell and Hunt's Oxyrhynchus Papyri, vol. 1 (1898) and is probably by Aristoxenus.\n\n\n== Other works ==\nThe edition of Wehrli presents the surviving evidence for works with the following titles (not including several fragments of uncertain origin):\nLife of Pythagoras (Πυθαγόρου βίος): fr. 11 Wehrli\nOn Pythagoras and his pupils (Περὶ Πυθαγόρου καὶ τῶν γνωρίμων αὐτοῦ): fr. 14 Wehrli\nOn the Pythagorean life (Περὶ τοῦ Πυθαγορικοῦ βίου): fr. 31 Wehrli\nPythagorean maxims or Pythagorean negations (Πυθαγορικαὶ ἀποφάσεις): fr. 34 Wehrli\nEducational customs or Rules of education (Παιδευτικοὶ νόμοι): fr. 42-43 Wehrli\nPolitical laws (Πολιτικοὶ νόμοι): fr. 44-45 Wehrli\nMantinean character (Μαντινέων ἔθη): fr. 45, I, lines 1-9 Wehrli\nPraise of Mantineans (Μαντινέων ἐγκώμιον): fr. 45, I, lines 10-12 Wehrli\nLife of Archytas (Ἀρχύτα βίος): fr. 47-50 Wehrli\nLife of Socrates (Σωκράτους βίος): fr. 54 Wehrli\nLife of Plato (Πλάτωνος βίος): fr. 64 Wehrli\nOn tonoi (Περὶ τόνων): a brief quotation in Porphyry's commentary on Ptolemy's Harmonics, p. 78 Düring (not edited by Wehrli)\nOn music (Περὶ μουσικῆς): fr. 80, 82, 89 Wehrli\nOn listening to music or Lecture course on music (Μουσικὴ ἀκρόασις): fr. 90 Wehrli\nOn Praxidamas (Πραξιδαμάντεια): fr. 91 Wehrli\nOn melodic composition or On music in lyric poetry (Περὶ μελοποιίας): fr. 93 Wehrli\nOn musical instruments (Περὶ ὀργάνων): fr. 94-95, 102 Wehrli\nOn auloi (Περὶ αὐλῶν): fr. 96 Wehrli\nOn auletes (Περὶ αὐλητῶν): fr. 100 Wehrli\nOn the boring of auloi (Περὶ αὐλῶν τρήσεως): fr. 101 Wehrli\nOn choruses (Περὶ χορῶν): fr. 103 Wehrli\nOn tragic dancing (Περὶ τραγικῆς ὀρχήσεως): fr. 104-106 Wehrli\nComparisons of dances (Συγκρίσεις): fr. 109 Wehrli\nOn tragic poets (Περὶ τραγῳδοποιῶν): fr. 113 Wehrli\nLife of Telestes (Τελέστου βίος): fr. 117 Wehrli (according to whom this Telestes is the dithyrambic poet)\nMiscellaneous table talk or Sympotic miscellany (Σύμμικτα συμποτικά): fr. 124 Wehrli\nNotes or Memorabilia (Ὑπομνήματα), Historical notes (Ἱστορικὰ ὑπομνήματα), Brief notes (Κατὰ βραχὺ ὑπομνήματα), Miscellaneous notes (Σύμμικτα ὑπομνήματα), Random jottings (Τὰ σποράδην): fr. 128-132, 139 Wehrli\n\n\n== Editions and translations ==\nBarker, Andrew (1989). Greek Musical Writings, vol. 2: Harmonic and Acoustic Theory (Cambridge), pp. 119–89, English translation with introduction and notes, ISBN 0-521-61697-2\nMacran, Henry Stewart (1902). The Harmonics of Aristoxenus (Oxford), Greek text with English translation and notes (archive.org, Google Books)\nMarquard, Paul (1868). Die harmonischen Fragmente des Aristoxenus (Berlin), Greek text with German translation and commentary (archive.org, Google Books)\nPearson, Lionel (1990). Aristoxenus: Elementa rhythmica. The fragment of Book II and the additional evidence for Aristoxenean rhythmic theory (Oxford ), Greek texts with introduction, translation, and commentary, ISBN 0-19-814051-7\nWehrli, Fritz (1967). Die Schule des Aristoteles, vol. 2: Aristoxenos, 2nd. ed. (Basel/Stuttgart), Greek text (excluding the harmonic fragments, rhythmic fragments, On the Primary Duration, and On tonoi: see p. 28) with commentary in German\nWestphal, Rudolf (1883-1893). Aristoxenus von Tarent: Melik und Rhythmik des classischen Hellenenthums, 2 vols. (Leipzig) (vol. 1, vol. 2)\nWestphal, Rudolf (1861). Die Fragmente und die Lehrsätze der griechischen Rhythmiker (Leipzig), pp. 26–41, Greek text of Elementa rhythmica and On the Primary Duration (Google Books)\n\n\n== References and sources ==\nReferences\n\nSources\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Aristoxenus\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== See also ==\nPlato's unwritten doctrines, for Aristoxenus's report on Plato's Lecture on the Good\n\n\n== Further reading ==\nBélis, Annie (1986). Aristoxène de Tarente et Aristote: le Traité d'harmonique. Paris, Klincksieck.\nBarker, Andrew (1978). \"Hoi Kaloumenoi harmonikoi: The Predecessors of Aristoxenus\". Proceedings of the Cambridge Philological Society. 24: 1–21. doi:10.1017/s0068673500003990. \nBarker, Andrew (1978). \"Music and Perception: A Study in Aristoxenus\". Journal of Hellenic Studies. 98: 9–16. doi:10.2307/630189. \nBélis, Annie (2001). \"Aristoxenus\". In Stanley Sadie and John Tyrrell (eds.). The New Grove Dictionary of Music and Musicians. 1. London: Macmillan Publishers. p. . \nCrocker, Richard (1966). \"Aristoxenus and Greek Mathematics\". In LaRue, Jan. Aspects of Medieval and Renaissance Music. New York: W. W. Norton and Co. \nHenderson, Isabel (1957). \"Ancient Greek Music\". In Wellesz, Egon. Ancient and Oriental Music. The New Oxford History of Music. 1. London: Oxford University Press. \nHuffman, Carl (2012). Aristoxenus of Tarentum: Texts and Discussions. New Brunswick: Transactions Publications. \nLevin, Flora (1972). \"Synesis in Aristoxenian Theory\". American Philological Transactions. 103: 211–234. \nLippman, Edward (1964). Musical Thought in Ancient Greece. New York: Columbia University Press. \nRowell, Lewis (1979). \"Aristoxenus on Rhythm\". Journal of Music Theory. 23 (Spring): 63–79. doi:10.2307/843694. \nWinnington-Ingram, R. P. (1980). \"Aristoxenus\". In Stanley Sadie (ed.). The New Grove Dictionary of Music and Musicians. 1. London: Macmillan Publishers. p. . \nHuffman, Carl A. (ed.). Aristoxenus of Tarentum. Discussion, New Brunswick: Transaction Publishers, 2011. (RUSCH XVII).\n\n\n== External links ==\n Works written by or about Aristoxenus at Wikisource\nAristoxenus, archived article by Andrew Barker", "ns": 0, "pageid": 98921, "title": "Aristoxenus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}