{"batchcomplete": "", "query": {"normalized": [{"to": "Arthur Linton Corbin", "from": "Arthur_Linton_Corbin"}], "pages": {"12786850": {"extract": "Arthur Linton Corbin (October 17, 1874 – May 1, 1967) was a professor at Yale Law School and a scholar of contract law. He helped to develop the philosophy of law known as legal realism, and wrote one of the most celebrated legal treatises of the Twentieth century, Corbin on Contracts.\n\n\n== Early life ==\nCorbin was born in Linn County, Kansas, on October 17, 1874. He graduated from the University of Kansas in 1894 and briefly taught high school in Augusta, Kansas and Lawrence, Kansas. He earned his law degree from Yale Law School in 1899, graduating magna cum laude. Following graduation from Yale, he practiced law in Cripple Creek, Colorado. Corbin returned to Yale Law School in 1903 to serve as an instructor in contract law.\n\n\n== Career at Yale ==\nCorbin became a full professor at Yale Law School in 1909, a position he would hold until his retirement from teaching in 1943. During his time at Yale, he was strongly influential in turning the law school into the center of legal scholarship it is known for today. He convinced the administration to hire more full-time professors and enact more selective admission criteria, and helped to implement and popularize the casebook method of legal study created by Christopher Columbus Langdell at Harvard Law School.\nHe was a founder of the American Law Institute and the first reporter of the Restatement (Second) of Contracts.\n\n\n== Scholarship and writings ==\nCorbin wrote extensively in the field of contract law. His most famous work was the treatise Corbin on Contracts: A Comprehensive Treatise on the Working Rules of Contracts Law, the original version of which was eight volumes long and appeared in 1950 (though it has since been expanded). This treatise is still used today in American law schools and cited in law journals and judicial opinions.\nCorbin subscribed to the philosophy of legal realism, the idea that law was the product of human efforts and society. He believed that in resolving contract disputes, judges should examine not just the \"four corners\" of the legal document itself, but the intention of the parties, as evidenced by the course of dealing and course of performance between the parties, as well as the customs of the trade and business community. Corbin felt that the main purpose of a contract was to protect the reasonable expectations of each party.\nCorbin's views are frequently contrasted with those of Harvard contracts scholar Samuel Williston, who was more of a formalist in his thinking. Williston served as the reporter for the First Restatement of Contracts, but Corbin's contributions were more evident in the Restatement (Second) of Contracts, which he worked on until his retirement from legal study at age 90, due to failing eyesight. Corbin died at age 92, in 1967.\nCorbin's scholarship heavily influenced the drafters of the Uniform Commercial Code, particularly the work of Karl Llewellyn, who had previously studied under Corbin.\nHis portrait is in the Yale Law School collection.\n\n\n== Works by Corbin ==\n\"Bibliography of the Published Writings of Arthur Linton Corbin\". Yale Law Journal. 74: 311. 1964. \nCorbin, Arthur L.; Perillo, Joseph M. (1993). Corbin on contracts (Print). St. Paul, Minnesota: West Publishing Co. ISBN 0-327-00069-4. \nCorbin, Arthur L. (1984) [June 5, 1906, reprinted]. \"The Alumnus and the Law\". University of Kansas Law Review. University of Kansas. 32: 763. \nCorbin, Arthur L. (1965). \"The Interpretation of Words and the Parol Evidence Rule\". Cornell Law Quarterly. Cornell Law School. 50: 161. \n\n\n== See also ==\nLegal formalism\n\n\n== Notes ==\n\n\n== Further reading ==\n\"Early Years, 1869-1916: Arthur L. Corbin biography and portrait\". Yale Law School. Retrieved August 7, 2014. \nFarnsworth, E. Allan (1987). \"Contracts Scholarship in the Age of the Anthology\". Michigan Law Review. 85: 1406. doi:10.2307/1289060. \nGilmore, Grant (1977). The Ages of American Law. Storers Lecture Series. New Haven, Connecticut: Yale University Press. ISBN 0300023529. ISBN 9780300023527. \nGordon, Robert W.; Kronman, Anthony T., ed. (2004). Professors and Policymakers. History of the Yale Law School. \nJerry, Robert H., II (1984). \"Arthur L. Corbin: His Kansas Connections\". University of Kansas Law Review. 32: 753. \nKalman, Laura (1986). Legal Realism at Yale, 1928-1960. University of North Carolina Press. \nPollak, Louis H.; Gulliver, Ashbel Green; James, Fleming, Jr.; Kessler, Friedrich (April 1967). \"Arthur Linton Corbin\". Yale Law Journal. The Yale Law Journal Company, Inc. 76: 875–886. JSTOR 794949. (subscription required)\nSchlegel, John Henry (1980). \"American Legal Realism and Empirical Social Science: The Singular Case of Underhill Moore\". Buffalo Law Review. University at Buffalo Law School. 29: 195.", "ns": 0, "pageid": 12786850, "title": "Arthur Linton Corbin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}