{"batchcomplete": "", "query": {"normalized": [{"to": "Arthur Schopenhauer", "from": "Arthur_Schopenhauer"}], "pages": {"700": {"extract": "Arthur Schopenhauer (German: [ˈaɐ̯tʊɐ̯ ˈʃoːpm̩ˌhaʊ̯ɐ]; 22 February 1788 – 21 September 1860) was a German philosopher. He is best known for his 1818 work The World as Will and Representation, in which he characterizes the phenomenal world as the product of a blind, insatiable, and malignant metaphysical will. Proceeding from the transcendental idealism of Immanuel Kant, Schopenhauer developed an atheistic metaphysical and ethical system that has been described as an exemplary manifestation of philosophical pessimism, rejecting the contemporaneous post-Kantian philosophies of German idealism. Schopenhauer was among the first thinkers in Western philosophy to share and affirm significant tenets of Eastern philosophy (e.g., asceticism, the world-as-appearance), having initially arrived at similar conclusions as the result of his own philosophical work. His writing on aesthetics, morality, and psychology would exert important influence on thinkers and artists throughout the 19th and 20th centuries.\nThough his work failed to garner substantial attention during his life, Schopenhauer has had a posthumous impact across various disciplines, including philosophy, literature, and science. Those who have cited his influence include Friedrich Nietzsche, Richard Wagner, Leo Tolstoy, Ludwig Wittgenstein, Erwin Schrödinger, Sigmund Freud, Gustav Mahler, Joseph Campbell, Albert Einstein, Carl Jung, Thomas Mann, Jorge Luis Borges, and Samuel Beckett, among others.\n\n\n== Life ==\n\nSchopenhauer was born on 22 February 1788, in the city of Danzig (then part of the Polish–Lithuanian Commonwealth; present day Gdańsk, Poland) on Heiligegeistgasse (known in the present day as Św. Ducha 47), the son of Johanna Schopenhauer (née Trosiener) and Heinrich Floris Schopenhauer, both descendants of wealthy German patrician families. When Danzig became part of Prussia in 1793, Heinrich moved to Hamburg, although his firm continued trading in Danzig. As early as 1799, Arthur started playing the flute. In 1805, Schopenhauer's father died, possibly by suicide. Arthur endured two long years of drudgery as a merchant in honor of his dead father, but his mother soon moved with his sister Adele to Weimar—then the centre of German literature—to pursue her writing career. He dedicated himself wholly to studies at the Gotha gymnasium (Gymnasium illustre zu Gotha) in Saxe-Gotha-Altenburg, but left in disgust after seeing one of the masters lampooned.\n\nBy that time, Johanna Schopenhauer had already opened her famous salon, and Arthur was not compatible with what he considered its vain and ceremonious ways. He was also disgusted by the ease with which his mother had forgotten his father's memory. He left to become a student at the University of Göttingen in 1809. There he studied metaphysics and psychology under Gottlob Ernst Schulze, the author of Aenesidemus, who advised him to concentrate on Plato and Immanuel Kant. In Berlin, from 1811 to 1812, he had attended lectures by the prominent post-Kantian philosopher Johann Gottlieb Fichte and the theologian Friedrich Schleiermacher.\nSchopenhauer had a notably strained relationship with his mother Johanna. He wrote his first book, On the Fourfold Root of the Principle of Sufficient Reason, while at university. His mother informed him that the book was incomprehensible and it was unlikely that anyone would ever buy a copy. In a fit of temper Arthur Schopenhauer told her that his work would be read long after the \"rubbish\" she wrote would have been totally forgotten. In fact, although they considered her novels of dubious quality, the Brockhaus publishing firm held her in high esteem because they consistently sold well. Hans Brockhaus later recalled that, when she brought them some of her son's work, his predecessors \"saw nothing in this manuscript, but wanted to please one of our best-selling authors by publishing her son's work. We published more and more of her son Arthur's work and today nobody remembers Johanna, but her son's works are in steady demand and contribute to Brockhaus'[s] reputation.\" He kept large portraits of the pair in his office in Leipzig for the edification of his new editors.\nIn 1814, Schopenhauer began his seminal work The World as Will and Representation (Die Welt als Wille und Vorstellung). He finished it in 1818 and Brockhaus published it that December. In Dresden in 1819, Schopenhauer fathered, with a servant, an illegitimate daughter who was born and died the same year. In 1820, Schopenhauer became a lecturer at the University of Berlin. He scheduled his lectures to coincide with those of the famous philosopher G. W. F. Hegel, whom Schopenhauer described as a \"clumsy charlatan.\" However, only five students turned up to Schopenhauer's lectures, and he dropped out of academia. A late essay, On University Philosophy, expressed his resentment towards the work conducted in academies.\nWhile in Berlin, Schopenhauer was named as a defendant in a lawsuit initiated by a woman named Caroline Marquet. She asked for damages, alleging that Schopenhauer had pushed her. According to Schopenhauer's court testimony, she deliberately annoyed him by raising her voice while standing right outside his door. Marquet alleged that the philosopher had assaulted and battered her after she refused to leave his doorway. Her companion testified that she saw Marquet prostrate outside his apartment. Because Marquet won the lawsuit, Schopenhauer made payments to her for the next twenty years. When she died, he wrote on a copy of her death certificate, Obit anus, abit onus (\"The old woman dies, the burden is lifted\"). In 1819 the fortunes of his mother and sister, and himself, were threatened by the failure of the firm in Danzig in which his father had been a director and shareholder. His sister accepted a compromise compensation package of 70 per cent, but Schopenhauer angrily refused this, and eventually recovered 9400 thalers.\nIn 1821, he fell in love with nineteen-year-old opera singer, Caroline Richter (called Medon), and had a relationship with her for several years, but did not marry her. When he was forty-three years old, he took interest in seventeen-year-old Flora Weiss but she rejected him as recorded in her diary.\n\nIn 1831, a cholera epidemic broke out in Berlin and Schopenhauer left the city. Schopenhauer settled permanently in Frankfurt in 1833, where he remained for the next twenty-seven years, living alone except for a succession of pet poodles named Atman and Butz. The numerous notes that he made during these years, amongst others on aging, were published posthumously under the title Senilia. Schopenhauer had a robust constitution, but in 1860 his health began to deteriorate. He died of pulmonary-respiratory failure, on 21 September 1860 while sitting at home on his couch. He was 72.\n\n\n== Thought ==\n\n\n=== Philosophy of the \"Will\" ===\n\nA key focus of Schopenhauer was his investigation of individual motivation. Before Schopenhauer, Hegel had popularized the concept of Zeitgeist, the idea that society consisted of a collective consciousness that moved in a distinct direction, dictating the actions of its members. Schopenhauer, a reader of both Kant and Hegel, criticized their logical optimism and the belief that individual morality could be determined by society and reason. Schopenhauer believed that humans were motivated by only their own basic desires, or Wille zum Leben (\"Will to Live\"), which directed all of mankind.\nFor Schopenhauer, human desire was futile, illogical, directionless, and, by extension, so was all human action in the world. Einstein paraphrased his views as follows: \"Man can indeed do what he wants, but he cannot will what he wants.\" In this sense, he adhered to the Fichtean principle of idealism: \"The world is for a subject.\" This idealism so presented, immediately commits it to an ethical attitude, unlike the purely epistemological concerns of Descartes and Berkeley. To Schopenhauer, the Will is a malignant, metaphysical existence that controls not only the actions of individual, intelligent agents, but ultimately all observable phenomena—an evil to be terminated via mankind's duties: asceticism and chastity. He is credited with one of the most famous opening lines of philosophy: \"The world is my representation.\" Will, for Schopenhauer, is what Kant called the \"thing-in-itself.\" Friedrich Nietzsche was greatly influenced by this idea of Will, while developing it in a different direction.\n\n\n=== Art and aesthetics ===\n\nFor Schopenhauer, human desiring, \"willing,\" and craving cause suffering or pain. A temporary way to escape this pain is through aesthetic contemplation (a method comparable to Zapffe's \"Sublimation\"). Aesthetic contemplation allows one to escape this pain—albeit temporarily—because it stops one perceiving the world as mere presentation. Instead, one no longer perceives the world as an object of perception (therefore as subject to the Principle of Sufficient Grounds; time, space and causality) from which one is separated; rather one becomes one with that perception: \"one can thus no longer separate the perceiver from the perception\" (The World as Will and Representation, section 34). From this immersion with the world one no longer views oneself as an individual who suffers in the world due to one's individual will but, rather, becomes a \"subject of cognition\" to a perception that is \"Pure, will-less, timeless\" (section 34) where the essence, \"ideas,\" of the world are shown. Art is the practical consequence of this brief aesthetic contemplation as it attempts to depict one's immersion with the world, thus tries to depict the essence/pure ideas of the world. Music, for Schopenhauer, was the purest form of art because it was the one that depicted the will itself without it appearing as subject to the Principle of Sufficient Grounds, therefore as an individual object. According to Daniel Albright, \"Schopenhauer thought that music was the only art that did not merely copy ideas, but actually embodied the will itself.\"\nHe deemed music a timeless, universal language comprehended everywhere, that can imbue global enthusiasm, if in possession of a significant melody.\n\n\n=== Mathematics ===\nSchopenhauer's realist views on mathematics are evident in his criticism of the contemporary attempts to prove the parallel postulate in Euclidean geometry. Writing shortly before the discovery of hyperbolic geometry demonstrated the logical independence of the axiom—and long before the general theory of relativity revealed that it does not necessarily express a property of physical space—Schopenhauer criticized mathematicians for trying to use indirect concepts to prove what he held to be directly evident from perception.\n\nThe Euclidean method of demonstration has brought forth from its own womb its most striking parody and caricature in the famous controversy over the theory of parallels, and in the attempts, repeated every year, to prove the eleventh axiom (also known as the fifth postulate). The axiom asserts, and that indeed through the indirect criterion of a third intersecting line, that two lines inclined to each other (for this is the precise meaning of \"less than two right angles\"), if produced far enough, must meet. Now this truth is supposed to be too complicated to pass as self-evident, and therefore needs a proof; but no such proof can be produced, just because there is nothing more immediate.\n\nThroughout his writings, Schopenhauer criticized the logical derivation of philosophies and mathematics from mere concepts, instead of from intuitive perceptions.\n\nIn fact, it seems to me that the logical method is in this way reduced to an absurdity. But it is precisely through the controversies over this, together with the futile attempts to demonstrate the directly certain as merely indirectly certain, that the independence and clearness of intuitive evidence appear in contrast with the uselessness and difficulty of logical proof, a contrast as instructive as it is amusing. The direct certainty will not be admitted here, just because it is no merely logical certainty following from the concept, and thus resting solely on the relation of predicate to subject, according to the principle of contradiction. But that eleventh axiom regarding parallel lines is a synthetic proposition a priori, and as such has the guarantee of pure, not empirical, perception; this perception is just as immediate and certain as is the principle of contradiction itself, from which all proofs originally derive their certainty. At bottom this holds good of every geometrical theorem ….\n\nAlthough Schopenhauer could see no justification for trying to prove Euclid's parallel postulate, he did see a reason for examining another of Euclid's axioms.\n\nIt surprises me that the eighth axiom, \"Figures that coincide with one another are equal to one another,\" is not rather attacked. For \"coinciding with one another\" is either a mere tautology, or something quite empirical, belonging not to pure intuition or perception, but to external sensuous experience. Thus it presupposes mobility of the figures, but matter alone is movable in space. Consequently, this reference to coincidence with one another forsakes pure space, the sole element of geometry, in order to pass over to the material and empirical.\n\nThis follows Kant's reasoning.\n\n\n=== Ethics ===\nSchopenhauer's moral theory proposed that only compassion can drive moral acts. According to Schopenhauer, compassion alone is the good of the object of the acts, that is, they cannot be inspired by either the prospect of personal utility or the feeling of duty. Mankind can also be guided by egoism and malice. Egotistic acts are those guided by self-interest, desire for pleasure or happiness. Schopenhauer believed most of our deeds belong to this class. Acts of malice are different from egotistic acts. As in the case of acts of compassion, these do not target personal utility. Their aim is to cause damage to others, independently of personal gains. He believed, like Swami Vivekananda in the unity of all with one-self and also believed that ego is the origin of pain and conflicts, that reduction of ego frames the moral principles.\n\n\n==== Punishment ====\n\nAccording to Schopenhauer, whenever we make a choice, \"We assume as necessary that decision was preceded by something from which it ensued, and which we call the ground or reason, or more accurately the motive, of the resultant action.\" Choices are not made freely. Our actions are necessary and determined because \"every human being, even every animal, after the motive has appeared, must carry out the action which alone is in accordance with his inborn and immutable character.\" A definite action inevitably results when a particular motive influences a person's given, unchangeable character. The State, Schopenhauer claimed, punishes criminals to prevent future crimes. It does so by placing \"beside every possible motive for committing a wrong a more powerful motive for leaving it undone, in the inescapable punishment. Accordingly, the criminal code is as complete a register as possible of counter-motives to all criminal actions that can possibly be imagined...\"\n\n...the law and its fulfillment, namely punishment, are directed essentially to the future, not to the past. This distinguishes punishment from revenge, for revenge is motivated by what has happened, and hence by the past as such. All retaliation for wrong by inflicting a pain without any object for the future is revenge, and can have no other purpose than consolation for the suffering one has endured by the sight of the suffering one has caused in another. Such a thing is wickedness and cruelty, and cannot be ethically justified. ...the object of punishment...is deterrence from crime.... Object and purpose for the future distinguish punishment from revenge, and punishment has this object only when it is inflicted in fulfillment of a law. Only in this way does it proclaim itself to be inevitable and infallible for every future case; and thus it obtains for the law the power to deter....\n\nShould capital punishment be legal? \"For safeguarding the lives of citizens,\" he asserted, \"capital punishment is therefore absolutely necessary.\" \"The murderer,\" wrote Schopenhauer, \"who is condemned to death according to the law must, it is true, be now used as a mere means, and with complete right. For public security, which is the principal object of the State, is disturbed by him; indeed it is abolished if the law remains unfulfilled. The murderer, his life, his person, must be the means of fulfilling the law, and thus of re-establishing public security.\" Schopenhauer disagreed with those who would abolish capital punishment. \"Those who would like to abolish it should be given the answer: 'First remove murder from the world, and then capital punishment ought to follow.' \"\nPeople, according to Schopenhauer, cannot be improved. They can only be influenced by strong motives that overpower criminal motives. Schopenhauer declared that \"real moral reform is not at all possible, but only determent from the deed....\"\nHe claimed this doctrine was not original to him. Previously, it appeared in the writings of Plato, Seneca, Hobbes, Pufendorf, and Anselm Feuerbach. Schopenhauer declared that their teaching was corrupted by subsequent errors and therefore was in need of clarification.\n\n\n==== God ====\nEven though Schopenhauer ended his treatise on the freedom of human will with the postulate of everyone's responsibility for their character and, consequently, acts—the responsibility following from one's being the Will as noumenon (from which also all the characters and creations come)—he considered his views incompatible with theism, on grounds of fatalism and, more generally, responsibility for evil. In Schopenhauer's philosophy the dogmas of Christianity lose their significance, and the \"Last Judgment\" is no longer preceded by anything—\"The world is itself the Last Judgment on it.\" Whereas God, if he existed, would be evil.\n\n\n=== Psychology ===\nPhilosophers have not traditionally been impressed by the tribulations of sex, but Schopenhauer addressed it and related concepts forthrightly:\n...one ought rather to be surprised that a thing [sex] which plays throughout so important a part in human life has hitherto practically been disregarded by philosophers altogether, and lies before us as raw and untreated material.\nHe named a force within man that he felt took invariable precedence over reason: the Will to Live or Will to Life (Wille zum Leben), defined as an inherent drive within human beings, and indeed all creatures, to stay alive; a force that inveigles us into reproducing.\nSchopenhauer refused to conceive of love as either trifling or accidental, but rather understood it as an immensely powerful force that lay unseen within man's psyche and dramatically shaped the world:\nThe ultimate aim of all love affairs ... is more important than all other aims in man's life; and therefore it is quite worthy of the profound seriousness with which everyone pursues it. What is decided by it is nothing less than the composition of the next generation ...\nThese ideas foreshadowed the discovery of evolution, Freud's concepts of the libido and the unconscious mind, and evolutionary psychology in general.\n\n\n=== Political and social thought ===\n\n\n==== Politics ====\n\nSchopenhauer's politics were, for the most part, an echo of his system of ethics (the latter being expressed in Die beiden Grundprobleme der Ethik, available in English as two separate books, On the Basis of Morality and On the Freedom of the Will). Ethics also occupies about one quarter of his central work, The World as Will and Representation.\nIn occasional political comments in his Parerga and Paralipomena and Manuscript Remains, Schopenhauer described himself as a proponent of limited government. What was essential, he thought, was that the state should \"leave each man free to work out his own salvation,\" and so long as government was thus limited, he would \"prefer to be ruled by a lion than one of [his] fellow rats\" — i.e., by a monarch, rather than a democrat. Schopenhauer shared the view of Thomas Hobbes on the necessity of the state, and of state action, to check the destructive tendencies innate to our species. He also defended the independence of the legislative, judicial and executive branches of power, and a monarch as an impartial element able to practise justice (in a practical and everyday sense, not a cosmological one). He declared monarchy as \"that which is natural to man\" for \"intelligence has always under a monarchical government a much better chance against its irreconcilable and ever-present foe, stupidity\" and disparaged republicanism as \"unnatural as it is unfavourable to the higher intellectual life and the arts and sciences.\"\nSchopenhauer, by his own admission, did not give much thought to politics, and several times he writes proudly of how little attention he had paid \"to political affairs of [his] day.\" In a life that spanned several revolutions in French and German government, and a few continent-shaking wars, he did indeed maintain his aloof position of \"minding not the times but the eternities.\" He wrote many disparaging remarks about Germany and the Germans. A typical example is, \"For a German it is even good to have somewhat lengthy words in his mouth, for he thinks slowly, and they give him time to reflect.\"\nSchopenhauer attributed civilizational primacy to the northern \"white races\" due to their sensitivity and creativity (except for the ancient Egyptians and Hindus whom he saw as equal):\n\nThe highest civilization and culture, apart from the ancient Hindus and Egyptians, are found exclusively among the white races; and even with many dark peoples, the ruling caste or race is fairer in colour than the rest and has, therefore, evidently immigrated, for example, the Brahmans, the Incas, and the rulers of the South Sea Islands. All this is due to the fact that necessity is the mother of invention because those tribes that emigrated early to the north, and there gradually became white, had to develop all their intellectual powers and invent and perfect all the arts in their struggle with need, want and misery, which in their many forms were brought about by the climate. This they had to do in order to make up for the parsimony of nature and out of it all came their high civilization.\n\nDespite this, he was adamantly against differing treatment of races, was fervently anti-slavery, and supported the abolitionist movement in the United States. He describes the treatment of \"[our] innocent black brothers whom force and injustice have delivered into [the slave-master's] devilish clutches\" as \"belonging to the blackest pages of mankind's criminal record.\"\nSchopenhauer additionally maintained a marked metaphysical and political anti-Judaism. Schopenhauer argued that Christianity constituted a revolt against the materialistic basis of Judaism, exhibiting an Indian-influenced ethics reflecting the Aryan-Vedic theme of spiritual \"self-conquest.\" This he saw as opposed to what he held to be the ignorant drive toward earthly utopianism and superficiality of a worldly Jewish spirit:\n\nWhile all other religions endeavor to explain to the people by symbols the metaphysical significance of life, the religion of the Jews is entirely immanent and furnishes nothing but a mere war-cry in the struggle with other nations.\n\n\n==== Views on women ====\nIn Schopenhauer's 1851 essay On Women, he expressed his opposition to what he called \"Teutonico-Christian stupidity\" of reflexive unexamined reverence (\"abgeschmackten Weiberveneration\") for the female. Schopenhauer wrote that \"Women are directly fitted for acting as the nurses and teachers of our early childhood by the fact that they are themselves childish, frivolous and short-sighted.\" He opined that women are deficient in artistic faculties and sense of justice, and expressed opposition to monogamy. Indeed, Rodgers and Thompson in Philosophers Behaving Badly call Schopenhauer \"a misogynist without rival in....Western philosophy.\" He claimed that \"woman is by nature meant to obey.\" The essay does give some compliments, however: that \"women are decidedly more sober in their judgment than [men] are,\" and are more sympathetic to the suffering of others.\nSchopenhauer's controversial writings have influenced many, from Friedrich Nietzsche to nineteenth-century feminists. Schopenhauer's biological analysis of the difference between the sexes, and their separate roles in the struggle for survival and reproduction, anticipates some of the claims that were later ventured by sociobiologists and evolutionary psychologists.\nAfter the elderly Schopenhauer sat for a sculpture portrait by Elisabet Ney, he told Richard Wagner's friend Malwida von Meysenbug, \"I have not yet spoken my last word about women. I believe that if a woman succeeds in withdrawing from the mass, or rather raising herself above the mass, she grows ceaselessly and more than a man.\"\n\n\n==== Heredity and eugenics ====\n\nNote for clarity in the following that \"genetics\" are but one component of \"heredity\". Though commonly used interchangeably, \"heritable traits\" would include socio-economic and other psycho-social potentialities. (See e.g. The difference between genetic and hereditary | Evolutionary Biology).\nSchopenhauer believed that personality and intellect were inherited. He quotes Horace's saying, \"From the brave and good are the brave descended\" (Odes, iv, 4, 29) and Shakespeare's line from Cymbeline, \"Cowards father cowards, and base things sire base\" (IV, 2) to reinforce his hereditarian argument. Mechanistically, Schopenhauer believed that a person inherits his level of intellect through his mother, and personal character through one's father. This belief in heritability of traits informed Schopenhauer's view of love – placing it at the highest level of importance. For Schopenhauer the \"final aim of all love intrigues, be they comic or tragic, is really of more importance than all other ends in human life. What it all turns upon is nothing less than the composition of the next generation.... It is not the weal or woe of any one individual, but that of the human race to come, which is here at stake.\" This view of the importance for the species of whom we choose to love was reflected in his views on eugenics or good breeding. Here Schopenhauer wrote:\n\nWith our knowledge of the complete unalterability both of character and of mental faculties, we are led to the view that a real and thorough improvement of the human race might be reached not so much from outside as from within, not so much by theory and instruction as rather by the path of generation. Plato had something of the kind in mind when, in the fifth book of his Republic, he explained his plan for increasing and improving his warrior caste. If we could castrate all scoundrels and stick all stupid geese in a convent, and give men of noble character a whole harem, and procure men, and indeed thorough men, for all girls of intellect and understanding, then a generation would soon arise which would produce a better age than that of Pericles.\n\nIn another context, Schopenhauer reiterated his antidemocratic-eugenic thesis: \"If you want Utopian plans, I would say: the only solution to the problem is the despotism of the wise and noble members of a genuine aristocracy, a genuine nobility, achieved by mating the most magnanimous men with the cleverest and most gifted women. This proposal constitutes my Utopia and my Platonic Republic.\" Analysts (e.g., Keith Ansell-Pearson) have suggested that Schopenhauer's advocacy of anti-egalitarianism and eugenics influenced the neo-aristocratic philosophy of Friedrich Nietzsche, who initially considered Schopenhauer his mentor.\n\n\n==== Animal welfare ====\nAs a consequence of his monistic philosophy, Schopenhauer was very concerned about the welfare of animals. For him, all individual animals, including humans, are essentially the same, being phenomenal manifestations of the one underlying Will. The word \"will\" designated, for him, force, power, impulse, energy, and desire; it is the closest word we have that can signify both the real essence of all external things and also our own direct, inner experience. Since every living thing possesses will, then humans and animals are fundamentally the same and can recognize themselves in each other. For this reason, he claimed that a good person would have sympathy for animals, who are our fellow sufferers.\n\nCompassion for animals is intimately associated with goodness of character, and it may be confidently asserted that he who is cruel to living creatures cannot be a good man.\n\nNothing leads more definitely to a recognition of the identity of the essential nature in animal and human phenomena than a study of zoology and anatomy.\n\nThe assumption that animals are without rights and the illusion that our treatment of them has no moral significance is a positively outrageous example of Western crudity and barbarity. Universal compassion is the only guarantee of morality.\n\nIn 1841, he praised the establishment, in London, of the Society for the Prevention of Cruelty to Animals, and also the Animals' Friends Society in Philadelphia. Schopenhauer even went so far as to protest against the use of the pronoun \"it\" in reference to animals because it led to the treatment of them as though they were inanimate things. To reinforce his points, Schopenhauer referred to anecdotal reports of the look in the eyes of a monkey who had been shot and also the grief of a baby elephant whose mother had been killed by a hunter.\nHe was very attached to his succession of pet poodles. Schopenhauer criticized Spinoza's belief that animals are to be used as a mere means for the satisfaction of humans.\n\n\n==== Views on homosexuality and pederasty ====\nIn the third, expanded edition of The World as Will and Representation (1859), Schopenhauer added an appendix to his chapter on the Metaphysics of Sexual Love. He also wrote that homosexuality did have the benefit of preventing ill-begotten children. Concerning this, he stated that \"the vice we are considering appears to work directly against the aims and ends of nature, and that in a matter that is all important and of the greatest concern to her, it must in fact serve these very aims, although only indirectly, as a means for preventing greater evils.\" Shrewdly anticipating the interpretive distortion, on the part of the popular mind, of his attempted scientific explanation of pederasty as personal advocacy (when he had otherwise described the act, in terms of spiritual ethics, as an \"objectionable aberration\"), Schopenhauer sarcastically concludes the appendix with the statement that \"by expounding these paradoxical ideas, I wanted to grant to the professors of philosophy a small favour, for they are very disconcerted by the ever-increasing publicization of my philosophy which they so carefully concealed. I have done so by giving them the opportunity of slandering me by saying that I defend and commend pederasty.\"\n\n\n=== Intellectual interests and affinities ===\n\n\n==== Indology ====\nSchopenhauer read the Latin translation of the ancient Hindu texts, The Upanishads, which French writer Anquetil du Perron had translated from the Persian translation of Prince Dara Shikoh entitled Sirre-Akbar (\"The Great Secret\"). He was so impressed by their philosophy that he called them \"the production of the highest human wisdom,\" and believed they contained superhuman concepts. The Upanishads was a great source of inspiration to Schopenhauer. Writing about them, he said:\n\nIt is the most satisfying and elevating reading (with the exception of the original text) which is possible in the world; it has been the solace of my life and will be the solace of my death.\n\nIt is well known that the book Oupnekhat (Upanishad) always lay open on his table, and he invariably studied it before sleeping at night. He called the opening up of Sanskrit literature \"the greatest gift of our century,\" and predicted that the philosophy and knowledge of the Upanishads would become the cherished faith of the West.\nSchopenhauer was first introduced to the 1802 Latin Upanishad translation through Friedrich Majer. They met during the winter of 1813–1814 in Weimar at the home of Schopenhauer's mother according to the biographer Sanfranski. Majer was a follower of Herder, and an early Indologist. Schopenhauer did not begin a serious study of the Indic texts, however, until the summer of 1814. Sansfranski maintains that between 1815 and 1817, Schopenhauer had another important cross-pollination with Indian thought in Dresden. This was through his neighbor of two years, Karl Christian Friedrich Krause. Krause was then a minor and rather unorthodox philosopher who attempted to mix his own ideas with that of ancient Indian wisdom. Krause had also mastered Sanskrit, unlike Schopenhauer, and the two developed a professional relationship. It was from Krause that Schopenhauer learned meditation and received the closest thing to expert advice concerning Indian thought.\nMost noticeable, in the case of Schopenhauer’s work, was the significance of the Chandogya Upanishad, whose Mahavakya, Tat Tvam Asi is mentioned throughout The World as Will and Representation.\n\n\n==== Buddhism ====\nSchopenhauer noted a correspondence between his doctrines and the Four Noble Truths of Buddhism. Similarities centered on the principles that life involves suffering, that suffering is caused by desire (taṇhā), and that the extinction of desire leads to liberation. Thus three of the four \"truths of the Buddha\" correspond to Schopenhauer's doctrine of the will. In Buddhism, however, while greed and lust are always unskillful, desire is ethically variable – it can be skillful, unskillful, or neutral.\nFor Schopenhauer, Will had ontological primacy over the intellect; in other words, desire is understood to be prior to thought. Schopenhauer felt this was similar to notions of puruṣārtha or goals of life in Vedānta Hinduism.\nIn Schopenhauer's philosophy, denial of the will is attained by either:\npersonal experience of an extremely great suffering that leads to loss of the will to live; or\nknowledge of the essential nature of life in the world through observation of the suffering of other people.\nHowever, Buddhist nirvāṇa is not equivalent to the condition that Schopenhauer described as denial of the will. Nirvāṇa is not the extinguishing of the person as some Western scholars have thought, but only the \"extinguishing\" (the literal meaning of nirvana) of the flames of greed, hatred, and delusion that assail a person's character. Occult historian Joscelyn Godwin (1945– ) stated, \"It was Buddhism that inspired the philosophy of Arthur Schopenhauer, and, through him, attracted Richard Wagner. This Orientalism reflected the struggle of the German Romantics, in the words of Leon Poliakov, to \"free themselves from Judeo-Christian fetters.\" In contradistinction to Godwin's claim that Buddhism inspired Schopenhauer, the philosopher himself made the following statement in his discussion of religions:\n\nIf I wished to take the results of my philosophy as the standard of truth, I should have to concede to Buddhism pre-eminence over the others. In any case, it must be a pleasure to me to see my doctrine in such close agreement with a religion that the majority of men on earth hold as their own, for this numbers far more followers than any other. And this agreement must be yet the more pleasing to me, inasmuch as in my philosophizing I have certainly not been under its influence [emphasis added]. For up till 1818, when my work appeared, there was to be found in Europe only a very few accounts of Buddhism.\n\nBuddhist philosopher Nishitani Keiji, however, sought to distance Buddhism from Schopenhauer. While Schopenhauer's philosophy may sound rather mystical in such a summary, his methodology was resolutely empirical, rather than speculative or transcendental:\n\nPhilosophy ... is a science, and as such has no articles of faith; accordingly, in it nothing can be assumed as existing except what is either positively given empirically, or demonstrated through indubitable conclusions.\n\nAlso note:\n\nThis actual world of what is knowable, in which we are and which is in us, remains both the material and the limit of our consideration.\n\nThe argument that Buddhism affected Schopenhauer’s philosophy more than any other Dharmic faith loses more credence when viewed in light of the fact that Schopenhauer did not begin a serious study of Buddhism until after the publication of The World as Will and Representation in 1818. Scholars have started to revise earlier views about Schopenhauer's discovery of Buddhism. Proof of early interest and influence, however, appears in Schopenhauer's 1815/16 notes (transcribed and translated by Urs App) about Buddhism. They are included in a recent case study that traces Schopenhauer's interest in Buddhism and documents its influence. Other scholarly work questions how similar Schopenhauer's philosophy actually is to Buddhism.\n\n\n== Influences ==\nSchopenhauer said he was influenced by the Upanishads, Immanuel Kant and Plato. References to Eastern philosophy and religion appear frequently in his writing. As noted above, he appreciated the teachings of the Buddha and even called himself a Buddhist. He said that his philosophy could not have been conceived before these teachings were available.\nConcerning the Upanishads and Vedas, he writes in The World as Will and Representation:\n\nIf the reader has also received the benefit of the Vedas, the access to which by means of the Upanishads is in my eyes the greatest privilege which this still young century (1818) may claim before all previous centuries, if then the reader, I say, has received his initiation in primeval Indian wisdom, and received it with an open heart, he will be prepared in the very best way for hearing what I have to tell him. It will not sound to him strange, as to many others, much less disagreeable; for I might, if it did not sound conceited, contend that every one of the detached statements which constitute the Upanishads, may be deduced as a necessary result from the fundamental thoughts which I have to enunciate, though those deductions themselves are by no means to be found there.\n\nAmong Schopenhauer's other influences were:\nShakespeare, Jean-Jacques Rousseau, John Locke, Thomas Reid, Baruch Spinoza, Matthias Claudius, George Berkeley, David Hume, and René Descartes.\n\n\n== Critique of Kant and Hegel ==\n\n\n=== Critique of the Kantian philosophy ===\n\nSchopenhauer accepted Kant's double-aspect of the universe – the phenomenal (world of experience) and the noumenal (the true world, independent of experience). Some commentators suggest that Schopenhauer claimed that the noumenon, or thing-in-itself, was the basis for Schopenhauer's concept of the will. Other commentators suggest that Schopenhauer considered will to be only a subset of the \"thing-in-itself\" class, namely that which we can most directly experience.\nSchopenhauer's identification of the Kantian noumenon (i.e., the actually existing entity) with what he termed \"will\" deserves some explanation. The noumenon was what Kant called the Ding an sich (the Thing in Itself), the reality that is the foundation of our sensory and mental representations of an external world. In Kantian terms, those sensory and mental representations are mere phenomena. Schopenhauer departed from Kant in his description of the relationship between the phenomenon and the noumenon. According to Kant, things-in-themselves ground the phenomenal representations in our minds; Schopenhauer, on the other hand, believed that phenomena and noumena are two different sides of the same coin. Noumena do not cause phenomena, but rather phenomena are simply the way by which our minds perceive the noumena, according to the principle of sufficient reason. This is explained more fully in Schopenhauer's doctoral thesis, On the Fourfold Root of the Principle of Sufficient Reason (1813).\nSchopenhauer's second major departure from Kant's epistemology concerns the body. Kant's philosophy was formulated as a response to the radical philosophical skepticism of David Hume, who claimed that causality could not be observed empirically. Schopenhauer begins by arguing that Kant's demarcation between external objects, knowable only as phenomena, and the Thing in Itself of noumenon, contains a significant omission. There is, in fact, one physical object we know more intimately than we know any object of sense perception: our own body.\nWe know our human bodies have boundaries and occupy space, the same way other objects known only through our named senses do. Though we seldom think of our body as a physical object, we know even before reflection that it shares some of an object's properties. We understand that a watermelon cannot successfully occupy the same space as an oncoming truck; we know that if we tried to repeat the experiment with our own body, we would obtain similar results – we know this even if we do not understand the physics involved.\nWe know that our consciousness inhabits a physical body, similar to other physical objects only known as phenomena. Yet our consciousness is not commensurate with our body. Most of us possess the power of voluntary motion. We usually are not aware of the breathing of our lungs or the beating of our heart unless somehow our attention is called to them. Our ability to control either is limited. Our kidneys command our attention on their schedule rather than one we choose. Few of us have any idea what our liver is doing right now, though this organ is as needful as lungs, heart, or kidneys. The conscious mind is the servant, not the master, of these and other organs. These organs have an agenda the conscious mind did not choose, and over which it has limited power.\nWhen Schopenhauer identifies the noumenon with the desires, needs, and impulses in us that we name \"will,\" what he is saying is that we participate in the reality of an otherwise unachievable world outside the mind through will. We cannot prove that our mental picture of an outside world corresponds with a reality by reasoning; through will, we know – without thinking – that the world can stimulate us. We suffer fear, or desire: these states arise involuntarily; they arise prior to reflection; they arise even when the conscious mind would prefer to hold them at bay. The rational mind is, for Schopenhauer, a leaf borne along in a stream of pre-reflective and largely unconscious emotion. That stream is will, and through will, if not through logic, we can participate in the underlying reality beyond mere phenomena. It is for this reason that Schopenhauer identifies the noumenon with what we call our will.\nIn his criticism of Kant, Schopenhauer claimed that sensation and understanding are separate and distinct abilities. Yet, for Kant, an object is known through each of them. Kant wrote: \"[T]here are two stems of human knowledge ... namely, sensibility and understanding, objects being given by the former [sensibility] and thought by the latter [understanding].\" Schopenhauer disagreed. He asserted that mere sense impressions, not objects, are given by sensibility. According to Schopenhauer, objects are intuitively perceived by understanding and are discursively thought by reason (Kant had claimed that (1) the understanding thinks objects through concepts and that (2) reason seeks the unconditioned or ultimate answer to \"why?\"). Schopenhauer said that Kant's mistake regarding perception resulted in all of the obscurity and difficult confusion that is exhibited in the Transcendental Analytic section of his critique.\nLastly, Schopenhauer departed from Kant in how he interpreted the Platonic ideas. In The World as Will and Representation Schopenhauer explicitly stated:\n\n...Kant used the word [Idea] wrongly as well as illegitimately, although Plato had already taken possession of it, and used it most appropriately.\n\nInstead Schopenhauer relied upon the Neoplatonist interpretation of the biographer Diogenes Laërtius from Lives and Opinions of Eminent Philosophers. In reference to Plato’s Ideas, Schopenhauer quotes Laërtius verbatim in an explanatory footnote.\nDiogenes Laërtius (III, 12) Plato ideas in natura velut exemplaria dixit subsistere; cetera his esse similia, ad istarum similitudinem consistencia. (Plato teaches that the Ideas exist in nature, so to speak, as patterns or prototypes, and that the remainder of things only resemble them, and exist as their copies.)\n\n\n=== Critique of Hegel ===\nSchopenhauer expressed his dislike for the philosophy of his contemporary Georg Wilhelm Friedrich Hegel many times in his published works. The following quotations are typical:\nIf I were to say that the so-called philosophy of this fellow Hegel is a colossal piece of mystification which will yet provide posterity with an inexhaustible theme for laughter at our times, that it is a pseudo-philosophy paralyzing all mental powers, stifling all real thinking, and, by the most outrageous misuse of language, putting in its place the hollowest, most senseless, thoughtless, and, as is confirmed by its success, most stupefying verbiage, I should be quite right.\nFurther, if I were to say that this summus philosophus [...] scribbled nonsense quite unlike any mortal before him, so that whoever could read his most eulogized work, the so-called Phenomenology of the Mind, without feeling as if he were in a madhouse, would qualify as an inmate for Bedlam, I should be no less right.\nAt first Fichte and Schelling shine as the heroes of this epoch; to be followed by the man who is quite unworthy even of them, and greatly their inferior in point of talent --- I mean the stupid and clumsy charlatan Hegel.\nIn his Foreword to the first edition of his work Die beiden Grundprobleme der Ethik, Schopenhauer suggested that he had shown Hegel to have fallen prey to the Post hoc ergo propter hoc fallacy.\nSchopenhauer suggested that Hegel's works were filled with \"castles of abstraction,\" and that Hegel used deliberately impressive but ultimately vacuous verbiage. He also thought that his glorification of church and state were designed for personal advantage and had little to do with the search for philosophical truth. For instance, the Right Hegelians interpreted Hegel as viewing the Prussian state of his day as perfect and the goal of all history up until then.\n\n\n== Criticism of Schopenhauer's personal life ==\nThe British philosopher and historian Bertrand Russell deemed Schopenhauer an insincere person, because judging by his life:\n\"He habitually dined well, at a good restaurant; he had many trivial love-affairs, which were sensual but not passionate; he was exceedingly quarrelsome and unusually avaricious. ... It is hard to find in his life evidences of any virtue except kindness to animals ... In all other respects he was completely selfish. It is difficult to believe that a man who was profoundly convinced of the virtue of asceticism and resignation would never have made any attempt to embody his convictions in his practice.\"\nBryan Magee points out that \"the answer to such shallow, but not uncommon criticism\" is found in a quotation from Schopenhauer:\n\"It is therefore just as little necessary for the saint to be a philosopher as for the philosopher to be a saint; just as it is not necessary for a perfectly beautiful person to be a great sculptor, or for a great sculptor to be himself a beautiful person. In general, it is a strange demand on a moralist that he should commend no other virtue than that which he himself possesses. To repeat abstractly, universally, and distinctly in concepts the whole inner nature of the world, and thus to deposit it as a reflected image in permanent concepts always ready for the faculty of reason, this and nothing else is philosophy.\"\n\n\n== Influence ==\n\nSchopenhauer has had a massive influence upon later thinkers, though more so in the arts (especially literature and music) and psychology than in philosophy. His popularity peaked in the early twentieth century, especially during the Modernist era, and waned somewhat thereafter. Nevertheless, a number of recent publications have reinterpreted and modernised the study of Schopenhauer. His theory is also being explored by some modern philosophers as a precursor to evolutionary theory and modern evolutionary psychology.\nRussian writer and philosopher Leo Tolstoy was greatly influenced by Schopenhauer. After reading Schopenhauer's The World as Will and Representation, Tolstoy gradually became converted to the ascetic morality upheld in that work as the proper spiritual path for the upper classes: \"Do you know what this summer has meant for me? Constant raptures over Schopenhauer and a whole series of spiritual delights which I've never experienced before. ... no student has ever studied so much on his course, and learned so much, as I have this summer\"\nRichard Wagner, writing in his autobiography, remembered his first impression that Schopenhauer left on him (when he read World as Will and Representation):\nSchopenhauer’s book was never completely out of my mind, and by the following summer I had studied it from cover to cover four times. It had a radical influence on my whole life.\nWagner also commented on that \"serious mood, which was trying to find ecstatic expression\" created by Schopenhauer inspired the conception of Tristan und Isolde. See also Influence of Schopenhauer on Tristan und Isolde.\n\nFriedrich Nietzsche owed the awakening of his philosophical interest to reading The World as Will and Representation and admitted that he was one of the few philosophers that he respected, dedicating to him his essay Schopenhauer als Erzieher one of his Untimely Meditations.\nJorge Luis Borges remarked that the reason he had never attempted to write a systematic account of his world view, despite his penchant for philosophy and metaphysics in particular, was because Schopenhauer had already written it for him.\nAs a teenager, Ludwig Wittgenstein adopted Schopenhauer's epistemological idealism. However, after his study of the philosophy of mathematics, he rejected epistemological idealism for Gottlob Frege's conceptual realism. In later years, Wittgenstein was highly dismissive of Schopenhauer, describing him as an ultimately shallow thinker: \"Schopenhauer has quite a crude mind... where real depth starts, his comes to an end.\"\nThe philosopher Gilbert Ryle read Schopenhauer's works as a student, but later largely forgot them, only to unwittingly recycle ideas from Schopenhauer in his The Concept of Mind (1949).\n\n\n== Selected bibliography ==\nOn the Fourfold Root of the Principle of Sufficient Reason (Ueber die vierfache Wurzel des Satzes vom zureichenden Grunde), 1813\nOn Vision and Colors (Ueber das Sehn und die Farben), 1816 ISBN 978-0-85496-988-3\nTheory of Colors (Theoria colorum), 1830.\nThe World as Will and Representation (alternatively translated in English as The World as Will and Idea; original German is Die Welt als Wille und Vorstellung): vol. 1818/1819, vol. 2, 1844\nVol. 1 Dover edition 1966, ISBN 978-0-486-21761-1\nVol. 2 Dover edition 1966, ISBN 978-0-486-21762-8\nPeter Smith Publisher hardcover set 1969, ISBN 978-0-8446-2885-1\nEveryman Paperback combined abridged edition (290 pp.) ISBN 978-0-460-87505-9\n\nThe Art of Being Right (Eristische Dialektik: Die Kunst, Recht zu Behalten), 1831\nOn the Will in Nature (Ueber den Willen in der Natur), 1836 ISBN 978-0-85496-999-9\nOn the Freedom of the Will (Ueber die Freiheit des menschlichen Willens), 1839 ISBN 978-0-631-14552-3\nOn the Basis of Morality (Ueber die Grundlage der Moral), 1840\nThe Two Basic Problems of Ethics: On the Freedom of the Will, On the Basis of Morality (Die beiden Grundprobleme der Ethik: Ueber die Freiheit des menschlichen Willens, Ueber das Fundament der Moral), 1841.\nParerga and Paralipomena, 1851; English translation by E. F. J. Payne, Clarendon Press, Oxford, 1974, 2 volumes:\nPrintings:\n1974 Hardcover, by ISBN\nVols. 1 and 2, ISBN 978-0-19-519813-3,\nVol. 1, ISBN\nVol. 2, ISBN 978-0-19-824527-8,\n\n1974/1980 Paperback, Vol. 1, ISBN 978-0-19-824634-3, Vol. 2, ISBN 978-0-19-824635-0,\n2001 Paperback, Vol. 1, ISBN 978-0-19-924220-7, Vol. 2, ISBN 978-0-19-924221-4\n\nEssays and Aphorisms, being excerpts from Volume 2 of Parerga und Paralipomena, selected and translated by R. J. Hollingdale, with Introduction by R J Hollingdale, Penguin Classics, 1970, Paperback 1973: ISBN 978-0-14-044227-4\n\nAn Enquiry concerning Ghost-seeing, and what is connected therewith (Versuch über das Geistersehn und was damit zusammenhangt), 1851\nArthur Schopenhauer, Manuscript Remains, Volume II, Berg Publishers Ltd., ISBN 978-0-85496-539-7\n\n\n=== Online ===\nWorks by Arthur Schopenhauer at Project Gutenberg\nIllustrated version of the \"Art of Being Right\" and links to logic and sophisms used by the stratagems.\nThe Art Of Controversy (Die Kunst, Recht zu behalten). (bilingual) [The Art of Being Right]\nStudies in Pessimism – audiobook from LibriVox\nThe World as Will and Idea at Internet Archive:\nVolume I\nVolume II\nVolume III\n\nOn the fourfold root of the principle of sufficient reason and On the will in nature. Two essays:\nInternet Archive. Translated by Mrs. Karl Hillebrand (1903).\nCornell University Library Historical Monographs Collection. Reprinted by Cornell University Library Digital Collections\n\nFacsimile edition of Schopenhauer's manuscripts in SchopenhauerSource\nEssays of Schopenhauer\n\n\n== See also ==\n\nAntinatalism, a position advocated by Schopenhauer that one would be better off not having been born\nGod in Buddhism\nMassacre of the Innocents (Guido Reni)\nMisotheism\nMortal coil\nNihilism\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== Further reading ==\n\n\n=== Biographies ===\nCartwright, David. Schopenhauer: A Biography, Cambridge University Press, 2010. ISBN 978-0-521-82598-6\nFrederick Copleston, Arthur Schopenhauer, philosopher of pessimism (Burns, Oates & Washbourne, 1946)\nO.F.Damm, Arthur Schopenhauer – eine Biographie, (Reclam, 1912)\nKuno Fischer, Arthur Schopenhauer (Heidelberg: Winter, 1893); revised as Schopenhauers Leben, Werke und Lehre (Heidelberg: Winter, 1898).\nEduard Grisebach, Schopenhauer – Geschichte seines Lebens (Berlin: Hofmann, 1876).\nD.W. Hamlyn, Schopenhauer, London: Routledge & Kegan Paul (1980, 1985)\nHeinrich Hasse, Schopenhauer. (Reinhardt, 1926)\nArthur Hübscher, Arthur Schopenhauer – Ein Lebensbild (Leipzig: Brockhaus, 1938).\nThomas Mann, Schopenhauer (Bermann-Fischer, 1938)\nMatthews, Jack, Schopenhauer's Will: Das Testament, Nine Point Publishing, 2015. ISBN 978-0985827885. A recent creative biography by philosophical novelist Jack Matthews.\nRüdiger Safranski, Schopenhauer und die wilden Jahre der Philosophie – Eine Biographie, hard cover Carl Hanser Verlag, München 1987, ISBN 978-3-446-14490-3, pocket edition Fischer: ISBN 978-3-596-14299-6.\nRüdiger Safranski, Schopenhauer and the Wild Years of Philosophy, trans. Ewald Osers (London: Weidenfeld and Nicolson, 1989)\nWalther Schneider, Schopenhauer – Eine Biographie (Vienna: Bermann-Fischer, 1937).\nWilliam Wallace, Life of Arthur Schopenhauer (London: Scott, 1890; repr., St. Clair Shores, Mich.: Scholarly Press, 1970)\nHelen Zimmern, Arthur Schopenhauer: His Life and His Philosophy (London: Longmans, Green & Co, 1876)\n\n\n=== Other books ===\nApp, Urs. Arthur Schopenhauer and China. Sino-Platonic Papers Nr. 200 (April 2010) (PDF, 8.7 Mb PDF, 164 p.). Contains extensive appendixes with transcriptions and English translations of Schopenhauer's early notes about Buddhism and Indian philosophy.\nAtwell, John. Schopenhauer on the Character of the World, The Metaphysics of Will.\n--------, Schopenhauer, The Human Character.\nEdwards, Anthony. An Evolutionary Epistemological Critique of Schopenhauer's Metaphysics. 123 Books, 2011.\nCopleston, Frederick, Schopenhauer: Philosopher of Pessimism, 1946 (reprinted London: Search Press, 1975).\nGardiner, Patrick, 1963. Schopenhauer. Penguin Books.\n--------, Schopenhauer: A Very Short introduction.\nJanaway, Christopher, 2003. Self and World in Schopenhauer's Philosophy. Oxford University Press. ISBN 978-0-19-825003-6\nMagee, Bryan, The Philosophy of Schopenhauer, Oxford University Press (1988, reprint 1997). ISBN 978-0-19-823722-8\nMannion, Gerard, \"Schopenhauer, Religion and Morality – The Humble Path to Ethics\", Ashgate Press, New Critical Thinking in Philosophy Series, 2003, 314pp.\nTrottier, Danick. L’influence de la philosophie schopenhauerienne dans la vie et l’oeuvre de Richard Wagner ; et, Qu’est-ce qui séduit, obsède, magnétise le philosophe dans l’art des sons? deux études en esthétique musicale, Université du Québec à Montréal, Département de musique, 2000.\nZimmern, Helen, Arthur Schopenhauer, his Life and Philosophy, London, Longman, and Co., 1876.\n\n\n=== Articles ===\nAbelson, Peter (1993). \"Schopenhauer and Buddhism\". Philosophy East and West. 43 (2): 255–78. doi:10.2307/1399616. JSTOR 1399616. \nJiménez, Camilo, 2006, \"Tagebuch eines Ehrgeizigen: Arthur Schopenhauers Studienjahre in Berlin,\" Avinus Magazin (in German).\nLuchte, James, 2009, \"The Body of Sublime Knowledge: The Aesthetic Phenomenology of Arthur Schopenhauer,\" Heythrop Journal, Volume 50, Number 2, pp. 228–242.\nMazard, Eisel, 2005, \"Schopenhauer and the Empirical Critique of Idealism in the History of Ideas.\" On Schopenhauer's (debated) place in the history of European philosophy and his relation to his predecessors.\nMoges, Awet, 2006, \"Schopenhauer's Philosophy.\" Galileian Library.\nSangharakshita, 2004, \"Schopenhauer and aesthetic appreciation.\"\nYoung, Christopher; Brook, Andrew (1994). \"Schopenhauer and Freud\". International Journal of Psychoanalysis. 75: 101–18. PMID 8005756. \nOxenford's \"Iconoclasm in German Philosophy,\" (See p. 388)\n\n\n== External links ==\nWorks by Arthur Schopenhauer at Project Gutenberg\nWorks by or about Arthur Schopenhauer at Internet Archive\nWorks by Arthur Schopenhauer at LibriVox (public domain audiobooks) \nWicks, Robert. \"Arthur Schopenhauer\". Stanford Encyclopedia of Philosophy. \nArthur Schopenhauer an article by Mary Troxell in Internet Encyclopedia of Philosophy 2011\nSchopenhauersource: Reproductions of Schopenhauer's manuscripts\nKant's philosophy as rectified by Schopenhauer\nTimeline of German Philosophers\nA Quick Introduction to Schopenhauer\nArthur Schopenhauer at Find a Grave\nRoss, Kelley L., 1998, \"Arthur Schopenhauer (1788–1860).\" Two short essays, on Schopenhauer's life and work, and on his dim view of academia.", "ns": 0, "pageid": 700, "title": "Arthur Schopenhauer"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}