{"batchcomplete": "", "query": {"normalized": [{"to": "Axel Honneth", "from": "Axel_Honneth"}], "pages": {"2324852": {"extract": "Axel Honneth (German: [aksl̩ ˈhɔnɛt]; born July 18, 1949) is a professor of philosophy at both the University of Frankfurt and Columbia University. He is also director of the Institut für Sozialforschung (Institute for Social Research) in Frankfurt am Main, Germany.\n\n\n== Biography ==\nHonneth was born in Essen, West Germany on July 18, 1949, studied in Bonn, Bochum, Berlin and Munich (under Jürgen Habermas), and taught at the Free University of Berlin and the New School before moving to the Johann Wolfgang Goethe-University of Frankfurt in 1996. He also held the Spinoza Chair of Philosophy at the University of Amsterdam in 1999. In 2001, he became director of the Institute for Social Research, originally home to the so-called Frankfurt School, at the University of Frankfurt. Since 2011, he is also Jack C. Weinstein Professor of the Humanities at the department of philosophy at Columbia University in the City of New York.\n\n\n== Research ==\nHonneth's work focuses on social-political and moral philosophy, especially relations of power, recognition, and respect. One of his core arguments is for the priority of intersubjective relationships of recognition in understanding social relations. This includes non- and mis-recognition as a basis of social and interpersonal conflict. For instance, grievances regarding the distribution of goods in society are ultimately struggles for recognition.\nHis first main work The Critique of Power: Reflective Stages in a Critical Social Theory explores the affinities between the Frankfurt School and Michel Foucault. In his second main work The Struggle for Recognition: Moral Grammar of Social Conflicts, the recognition concept is derived mainly from G.W.F. Hegel's early social philosophical works, but is supplemented by George Herbert Mead's social psychology, Habermas's communicative ethics, and Winnicott's object relation theory. Honneth's critical adaptation of these is the basis of his critical social theory, which attempts to remedy the deficits of previous approaches. In 2003, Honneth co-authored Recognition or Redistribution? with feminist philosopher Nancy Fraser, who criticizes the priority of ethical categories such as recognition over structural social-political categories such as redistribution in Honneth's thought. His recent work Reification reformulates this key \"Western Marxist\" concept in terms of intersubjective relations of recognition and power. For Honneth, all forms of reification are due to intersubjectively based pathologies rather than the structural character of social systems such as capitalism as argued by Karl Marx and György Lukács.\n\n\n== Works translated into English ==\nSocial Action and Human Nature, co-authored with Hans Joas (Cambridge University Press, 1988 [1980]).\nThe Critique of Power: Reflective Stages in a Critical Social Theory (MIT Press, 1991 [1985]).\nThe Fragmented World of the Social: Essays in Social and Political Philosophy (SUNY Press, 1995 [1990]).\nThe Struggle for Recognition: The Moral Grammar of Social Conflicts (Polity Press, 1995 [1992]).\nRedistribution or Recognition?: A Political-Philosophical Exchange, co-authored with Nancy Fraser (Verso, 2003).\nReification: A Recognition-Theoretical View (Oxford University Press, 2007).\nDisrespect: The Normative Foundations of Critical Theory (Polity Press, 2007 [2000]).\nPathologies of Reason: On the Legacy of Critical Theory (2009).\nThe Pathologies of Individual Freedom: Hegel's Social Theory (2010).\nThe I in We: Studies in the Theory of Recognition (2012).\nFreedom's Right (2014).\nSecondary Sources\nBert van den Brink and David Owen, Recognition and Power: Axel Honneth and the Tradition of Critical Social Theory (Cambridge University Press, 2007).\nDeranty, Jean-Philippe, Beyond Communication: A Critical Study of Axel Honneth's Social Philosophy (Brill, 2009).\nIser, Matthias, Empörung und Fortschritt. Grundlagen einer Kritischen Theorie der Gesellschaft (Campus, 2008).\nSchmidt-am-Busch, Hans-Christoph and Zurn, Christopher (eds), The Philosophy of Recognition. Historical and Contemporary Perspectives (Lexington Books, 2009)\nThompson, Simon, The Political Theory of Recognition. A Critical Introduction (Polity, 2006).\nHuttunen, Rauno, Habermas, Honneth and Education (Lambert Academic Publishing 2009).\n\n\n== Notes ==\n\n\n== See also ==\nFrankfurt School\nRecognition (sociology)\nSocial exclusion\n\n\n== External links ==\nTanner Lecture on Reification, 2005\n2006 Program of Research: Paradoxes of Capitalist Modernization\nJoel Anderson's Introduction to The Struggle for Recognition.\nHonneth in London Axel Honneth in conversation with Peter Dews, 2007\nHomepages of Axel Honneth at the University of Frankfurt and the Institute for Social Research.\n2007 Talks by Honneth\n\"Patterns of Intersubjective Recognition: Love, Rights, and Solidarity\" by Honneth\n\"Social Criticism in the Age of the Normalized Intellectual\"\nChapter 1, The Pathologies of Individual Freedom: Hegel's Social Theory (2010)\nRecognition Forum (Research on recognition theory, bibliographies, theses, events, forum)\nInterview with Axel Honneth, Barcelona Metropolis, num. 78, Spring, 2010.\nInterview with Honneth for the Platypus Review 59 (September, 2013)", "ns": 0, "pageid": 2324852, "title": "Axel Honneth"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}