{"batchcomplete": "", "query": {"normalized": [{"to": "Bahya ibn Paquda", "from": "Bahya_ibn_Paquda"}], "pages": {"144420": {"extract": "Bahya ben Joseph ibn Paquda (also: Pakuda, Bakuda, Hebrew: בחיי אבן פקודה, Arabic: بهية بن باكودا‎‎) was a Jewish philosopher and rabbi who lived at Zaragoza, Al-Andalus (now Spain) in the first half of the eleventh century. He is often referred to as Rabbeinu Bachya.\n\n\n== Life and works ==\nHe was the author of the first Jewish system of ethics, written in Arabic in 1040 under the title Al Hidayah ila Faraid al-Qulub, Guide to the Duties of the Heart, and translated into Hebrew by Judah ibn Tibbon in the years 1161-80 under the title Chovot HaLevavot, The Duties of the Heart.\nLittle is known of his life except that he bore the title of dayan, judge at the rabbinical court. Bahya was thoroughly familiar with the Jewish rabbinic literature, as well as the philosophical and scientific Arabic, Greek and Roman literature, quoting frequently from the works of non-Jewish moral philosophers in his work.\nBahya says in the introduction to Duties of the Heart that he wished to fill a great need in Jewish literature; he felt that neither the rabbis of the Talmud nor subsequent rabbis adequately brought all the ethical teachings of Judaism into a coherent system.\nBahya felt that many Jews paid attention only to the outward observance of Jewish law, \"the duties to be performed by the parts of the body\" (\"Hovot HaEvarim\"), without regard to the inner ideas and sentiments that should be embodied in this way of life, \"the duties of the heart\" (\"Hovot HaLev\"). He also felt that many people disregarded all duties incumbent upon them, whether outward observances or inner moral obligations.\nIn his view, most people acted in accord with selfish, worldly motives. Bahya therefore felt impelled to make an attempt to present the Jewish faith as being essentially a great spiritual truth founded on reason, revelation (especially as regarding the Torah), and Jewish tradition. He laid stress on the willingness and the joyful readiness of the God-loving heart to perform life's duties. He wrote:\n\nIt is impossible to think that the nations would recognize us as being wise and understanding if we were not to provide infallible proofs and explanations for the truths of the Torah and our faith.\n\nMany Jewish writers familiar with his work consider him an original thinker of high rank. According to the Jewish Encyclopedia:\n\nBahya combined in a rare degree great depth of emotion, a vivid poetic imagination, the power of eloquence, and beauty of diction with a penetrating intellect; and he was therefore well fitted to write a work the main object of which was not to argue about and defend the doctrines of Judaism, but to appeal to the sentiments and to stir and elevate the hearts of the people.\n\nThe Chovot HaLevavot became, a popular book among the Jews throughout the world, and parts of it were recited for devotional purposes during the days before Rosh Hashanah, the Jewish New Year.\nHis works were the inspiration and basis for later Jewish writers, such as Berachyah in his encyclopedic philosophical work Sefer Hahibbur (The Book of Compilation).\n\n\n== Neoplatonism ==\nThough he quotes Saadia Gaon's works frequently, he belongs not to the rationalistic school of the Mu'tazili that Saadia followed but, like his somewhat younger contemporary Solomon ibn Gabirol (1021–1070), is an adherent of Neoplatonic mysticism. He often followed the method of the anonymously-authored \"Encyclopedia of the 'Brethren of Purity'\" (Arabic: رسائل أخوان الصفا و خلان الوفا‎‎ Risā'ilu ikhwāni ṣ-Ṣafā'a).\nInclined to contemplative mysticism and asceticism, Bahya eliminated from his system every element that he felt might obscure monotheism, or might interfere with Jewish law. He wanted to present a religious system at once lofty and pure and in full accord with reason.\n\n\n== References ==\n\n\n== External links ==\nThe Duties of the Heart at sacred-texts.com\nChovot HaLevavot - free English translation\nBahya Ben Joseph ibn Pakuda, jewishencyclopedia.com article written by Kaufmann Kohler & Isaac Broydé.\nRabbi Bachaya Ibn Pakuda, at OU.org\nThe Book of Direction to the Duties of the Heart, from the Original Arabic Version of Bahya Ben Joseph Ibn Pakuda's al-Hidaya ila Fara'id al-Qulub by Menahem Mansoor (the only English translation from the original Arabic)\nA Sufi-Jewish Dialogue: Philosophy and Mysticism in Bahya ibn Paquda's Duties of the Heart, Diana Lobel\nibn Pakuda, Bachya; Yaakov Feldman (1996). Duties of the Heart. Northvale, NJ: Jason Aronson. pp. 20–21.", "ns": 0, "pageid": 144420, "title": "Bahya ibn Paquda"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}