{"batchcomplete": "", "query": {"normalized": [{"to": "Barry Stroud", "from": "Barry_Stroud"}], "pages": {"14188542": {"extract": "Barry Stroud (born 1935, Toronto) is a Canadian philosopher known for his work on philosophical skepticism, David Hume, and Ludwig Wittgenstein, among other topics. He received a B.A. in philosophy from the University of Toronto, followed by a Ph.D. in philosophy from Harvard University, under the direction of Morton White. Since 1961, Stroud has worked at the University of California, Berkeley. In 1987, he gave the John Locke Lectures at Oxford. In 2007 he was named Willis S. and Marion Slusser Professor of Philosophy in the Berkeley Philosophy Department.\nHe is an elected Fellow of the American Academy of Arts & Sciences and a Corresponding Fellow of the British Academy.\n\n\n== Selected works ==\n(1977) Hume. Routledge (Winner of the Matchette Prize in 1979).\n(1984) The Significance of Philosophical Scepticism. Oxford University Press. ISBN 978-0-19-824761-6.\n(1999) The Quest for Reality: Subjectivism & the Metaphysics of Colour. Oxford University Press. ISBN 978-0-19-513388-2.\n(2000) Understanding Human Knowledge: Philosophical Essays. Oxford University Press. ISBN 978-0-19-825033-3.\n(2000) \"Meaning, Understanding, and Practice: Philosophical Essays\". Oxford University Press. ISBN 978-0-19-825034-0.\n(2011) \"Engagement and Metaphysical Dissatisfaction: Modality and Value\". Oxford University Press. ISBN 978-0-19-976496-9.\n(2011) \"Philosophers Past and Present: Selected Essays\". Oxford University Press. ISBN 978-0-19-960859-1.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nFaculty page at the University of Berkeley\nThe Study of Human Nature and the Subjectivity of Value, The Tanner Lectures on Human Values. Delivered at The University of Buenos Aires, June 7, 1988\nBarry Stroud on Scepticism, podcast interview, December 16, 2007", "ns": 0, "pageid": 14188542, "title": "Barry Stroud"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}