{"batchcomplete": "", "query": {"normalized": [{"to": "Berit Brogaard", "from": "Berit_Brogaard"}], "pages": {"32349940": {"extract": "Berit Oskar Brogaard (born August 28, 1970) is a Danish and American philosopher specializing in the areas of cognitive neuroscience, philosophy of mind, and philosophy of language. Her recent work concerns synesthesia, savant syndrome, blindsight and perceptual reports. She is Professor of Philosophy and runs a perception lab at the University of Miami in Coral Gables, Florida.\n\n\n== Education and Career ==\nBrogaard was born and raised in Copenhagen. From an early age, she excelled at physics, mathematics, and biology, eventually completing her undergraduate education at the University of Copenhagen with a bachelor's degree in linguistics and philosophy. She then studied neuroscience under the direction of Thue Schwartz, M.D., D.M.Sci. at University of Copenhagen and the Danish National Hospital.\nUpon completion of her degrees in Copenhagen she studied linguistics and philosophy at the University at Buffalo, where she obtained her PhD with Barry Smith as her supervisor. She was a postdoctoral fellow at the Centre for Consciousness and the Philosophy Program directed by David Chalmers at Australian National University from 2007 to 2009, and her first tenure-track position was at Southern Illinois University, Edwardsville, from 2001 to 2005. She was subsequently appointed Associate Professor of Philosophy (2008–2012) and Professor of Philosophy (2012–2014) at University of Missouri, St. Louis. She has taught at the University of Miami since 2014.\nShe has been President of the Southern Society for Philosophy and Psychology and was the first female President of the Central States Philosophical Association. Brogaard is also a Danish-language poet and the author of three books, Transient Truths, On Romantic Love and The Superhuman Mind. She is now the editor of the Philosophical Gourmet Report, a ranking of philosophy graduate programs, after serving as co-editor of the 2014 Report and, before that, a member of the Advisory Board.\nSince 2009 Brogaard has worked as a freelance writer for many popular media outlets, including Psychology Today, Hello Magazine and the Lance Armstrong Foundation. Since then she has written about 300 popular articles on brain intervention and emotional regulation. She has also co-authored a breakup program with counselor and relationship expert Catherine Behan entitled The Breakup Cleanse.\nHer academic and popular work has been featured in, among other places, A Report of the President's council on bioethics - Washington D.C. 2004, Danish National Radio, the Modesto Bee, UMSL newsroom, MostMost, Attract Your Soul Mate Now, Nightline, NPR, Popular Science, Science Omega, the Huffington Post, and ABC News.\n\n\n== Philosophical Work ==\n\n\n=== Cognitive neuroscience ===\nIn the area of cognitive neuroscience Brogaard is best known for her work on synesthesia and savant syndrome. Her team, which consists of colleagues from the Brogaard Lab for Multisensory Research, and the Visual Awareness and Cognition Group, Brain Research Unit, Low Temperature Laboratory, Aalto University School of Science, Finland just completed a series of studies on Jason Padgett, who has acquired savant syndrome and acquired synesthesia. Jason Padgett was mugged in 2002. He was hit on his head and developed a form of synesthesia and savant syndrome. Certain objects and mathematical formulas trigger synesthetic mathematical fractals in him. He is the first to hand-draw mathematical fractals, an ability he acquired after the incident.\nIn a series of functional MRI studies in Finland, Brogaard's team found uni-lateral left-side activity in the parietal and frontal areas when Padgett is exposed to well-formed mathematical formulas that give rise to synesthetic fractals in him and bi-lateral activation when he is exposed to nonsense formulas or formulas that don't give rise to synesthetic fractals.\nThey re-tested the results from the Functional magnetic resonance imaging (fMRI) using Transcranial magnetic stimulation (TMS). In the TMS study, Padgett was shown formulas and asked to rate his synesthetic sensation on a scale 1-10, relative to his \"baseline\" percept (i.e. without TMS). They applied TMS over the brain areas that were activated in the fMRI scan with the formulas that give rise to synesthetic experiences and found the TMS modulated two central areas.\nThe results establish for the first time that synesthetic imagery may be generated in areas of the brain not normally used for the creation of visual imagery. Jason Padgett has since then published an autobiography with Maureen Seaberg. The book is being turned into a major Hollywood movie, starring Channing Tatum.\nBrogaard's lab has also studied the cognitive mechanisms underlying grapheme-color synesthesia, one of the most common forms of synesthesia. Using a novel visual search paradigm to examine whether synesthetic colors guide the subject’s attention to the location of the target they found that synesthetic experience requires selective attention to occur. In light of this they propose a new long term potentiation model for grapheme-color projector synesthesia.\nBrogaard has also contributed to the topic of whether there are unconscious perceptual processes, arguing that cases of blindsight and visual for action involve unconscious perceptual processes.\n\n\n=== Philosophy of mind ===\nIn the area of philosophy of mind, Brogaard is the first to provide a thorough analysis of perceptual words such as 'look', 'sound', 'feel', 'taste', 'smell', 'seem', 'appear', 'see' and 'hear'. She argues that perceptual reports containing these words reflect the content of perception.\nBrogaard is also the first researcher to show that consciousness comes in degrees and that there can be borderline cases of consciousness. Imagine a case where we slowly destroy the primary visual cortex of a subject, one neuron at a time in an arbitrary fashion. Plausibly such an individual would proceed slowly from perceiving her surroundings normally to perceiving them unconsciously. In this process, the brightness of the perceived content would gradually decrease until a point at which it would be unclear whether the perception counted as weakly conscious.\nOr consider George Sperling's classic experiment in which a 3 x 3 array of letters was briefly flashed to the test subjects. Most subjects said that they were aware of all the letters, even though they could report only about half of them. To test whether the subjects were right, Sperling used a tone after the presentation of the stimulus to signal which row the subjects should report (high tone = top row, medium tone = middle row and low tone = the bottom row). The subjects were able to name the letters in the indicated row but they were unable to report any other numbers. The fact that the subjects were able to report any signaled row indicates that they were phenomenally conscious of all the rows but did not have access consciousness to all of them. But suppose we were to flash a 4 x 4 array of letters, then a 5 x 5 array of letters, then 6 x 6 array of letters, and so on, to subjects in an experiment. In that case, it would naturally become harder and harder for them to report the rows as the array became increasingly more complicated. There would, however, be no precise cut-off at which the subjects would go from being weakly conscious to not being weakly conscious of all the rows.\n\n\n=== Philosophy of language ===\nBrogaard is also a well known contributor to the philosophy of language. Brogaard's book, Transient Truths provides the first book-length exposition and defense of temporalism, the view that contents can change their truth-values along with changes in the world. Brogaard argues that temporal contents are contents and propositions in the full sense. This project involves a thorough analysis of how we talk about and retain mental states over time, an examination of how the phenomenology of mental states bear on the content of mental states, an analysis of how we pass on information in temporally extended conversations, and a revival of a Priorian tense logic. The view suggests a broader view according to which some types of representation have a determinate truth-value only relative to features about the subject who does the representing. If this view is right, successful semantic representation requires an eye on our own position in the world. Brogaard has also offered well known philosophical accounts of moral permissibility, anti-realism, and knowledge-how.\nBrogaard is furthermore the first to develop a dynamic two-dimensional semantics that can account for cognitive significance in a dynamic setting.\n\n\n== Books ==\n\n\n=== Transient Truths: An Essay in the Metaphysics of Propositions ===\nTransient Truths provides the first book-length exposition and defense temporalism, the philosophical theory that the contents of propositions can change their truth-values along with changes in the world. Brogaard argues that temporal contents are contents and propositions in the full sense. The project involves an analysis of how we talk about and retain mental states over time, an examination of how the phenomenology of mental states bear on the content of mental states, an analysis of how we pass on information in temporally extended conversations, and a revival of a Priorian tense logic. Her view suggests a broader view according to which some types of representation have a determinate truth-value only relative to features about the subject who does the representing. If this view is right, successful semantic representation requires an eye on our own position in the world.\n\n\n=== On Romantic Love: Simple Truths About a Complex Emotion ===\nBrogaard argues that love is an emotion; that it can be, at turns, both rational and irrational; and that it can be manifested in degrees. We can love one person more than another and we can love a person a little or a lot or not at all and love is not always something we consciously feel. However, love—like other emotions, both conscious and unconscious—is subject to rational control, and falling in or out of it can be a deliberate choice.\n\n\n=== The Superhuman Mind: Free the Genius in Your Brain ===\nBrogaard and co-author Kristian Marlow argue that our brains constantly process a huge amount of information below our awareness, and what individuals with savant syndrome have in common is that through practice, injury, an innate brain disorder, or even more unusual circumstances, they have managed to gain a degree of conscious access to the brain's innate potent processing power. Delving into the neurological underpinnings of savant syndrome, the authors reveal how we can acquire some of these skills ourselves—from perfect pitch and lightning fast math skills to supercharged creativity.\n\n\n== Miscellaneous ==\nBrogaard was the President of the Southern Society for Philosophy and Psychology and the first female President of the Central States Philosophical Association. She is a regular contributor to Psychology Today with Co-Investigator Kristian Marlow. She is on the Governing Board for Gender Studies at University of Missouri, St. Louis. On her website Lovesick Love,Brogaard offers advice focusing on relationships breakups. She is the American editor of the academic journal Erkenntnis and the philosophy of language editor for David Chalmers and David Bourget's PhilPapers. She also serves on the editorial boards of Brain and Mind, Springer Book Series, ed. Gualtiero Piccinini, Journal of Mathematics and The Open Applied Linguistics Journal, and she is a former Ph.D. program evaluator.\n\n\n== References ==\n\n\n== Bibliography ==\nA partial list of publications by Brogaard:\nThe Superhuman Mind: Free the Genius in Your Brain, Hudson Street Press, 2015\nOn Romantic Love: Simple Truths about a Complex Emotion, Oxford University Press, 2015\nTransient Truths: An Essay in the Metaphysics of Propositions, Oxford University Press, 2012\nVision for Action and the Contents of Perception, Journal of Philosophy, 2011\nWhat do We Say When We Say How or What We Feel?, Philosophers Imprint, 2011\nAre There Unconscious Perceptual Processes?, Consciousness and Cognition, 2010, doi:10.1016/j.concog.2010.10.002, in press\nConscious Vision for Action Vs. Unconscious Vision for Action, Cognitive Science, in press\nColor Experience in Blindsight? Philosophical Psychology, in press\nStupid People Deserve What They Get': The Effects of Personality Assessment on Judgments of Intentional Action, Behavioral and Brain Sciences 33, 2010, 332-334\nPerceptual Reports, forthcoming in Mohan Matthen, ed. Oxford Handbook of the Philosophy of Perception, Oxford: Oxford University Press, 2010\nAre Conscious States Conscious in Virtue of Representing Themselves?, forthcoming in Philosophical Studies\nPerceptual Content and Monadic Truth: On Cappelen and Hawthorne's Relativism and Monadic Truth, forthcoming in David Sosa, ed. Philosophical Books\nStrong Representationalism and Centered Content, Philosophical Studies 151, 2010, 373–392. doi:10.1007/s11098-009-9437-z\nContext and Content: Pragmatics in Two-Dimensional Semantics, Keith Allan and Kasia Jaszczolt, eds. Cambridge Handbook of Pragmatics, 2010\n\n\n== External links ==\nOfficial website\nBrogaard Lab for Multisensory Perception\nThe Superhuman Mind: True Tales of Extraordinary Mental Ability\nBerit Brogaard’s curriculum vitae\nLemmings – Brogaard's academic blog\nLovesick Love – Brogaard's popular blog\nThere is something about Mary: Princess Diaries – Hello Magazine\nInterview with Brogaard by relation expert Catherine Behan\nInterview with Brogaard in WhoHub\nAutobiographical interview with Brogaard at What Is It Like to Be a Philosopher?", "ns": 0, "pageid": 32349940, "title": "Berit Brogaard"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}