{"batchcomplete": "", "query": {"normalized": [{"to": "Bertrand de Jouvenel", "from": "Bertrand_de_Jouvenel"}], "pages": {"2311541": {"extract": "Bertrand de Jouvenel des Ursins, usually known only as Bertrand de Jouvenel (31 October 1903 – 1 March 1987), was a French philosopher, political economist, and futurist.\n\n\n== Life ==\nBertrand was the heir of an old family from the French nobility, coming from the Champagne region. He was the son of Henri de Jouvenel and Sarah Boas, the daughter of a Jewish industrialist. Henri divorced Sarah in 1912 to become the second husband of French writer Colette. In 1920, when he was a mere 16, Bertrand began an affair with his stepmother, who was then in her late 40s. The affair ended Colette's marriage and caused a scandal. It lasted until 1924. Some believe Bertrand to be the role model for the title character in Colette's novel Chéri, but in fact she had published about half the book, in serial form, before she and her stepson met for the first time, in the spring of 1920. In the 1930s, he participated in the Cahiers Bleus, the review of Georges Valois' Republican Syndicalist Party. From 1930 to 1934, Jouvenel had an affair with the American war correspondent Martha Gellhorn. They would have married had his wife agreed to a divorce.\nIn his memoirs, The Invisible Writing, Arthur Koestler recalled that in 1934, Jouvenel was among a small number of French intellectuals who promised moral and financial support to the newly established Institut pour l'Étude du Fascisme, a supposedly self-financing enterprise of the Popular Front. Other personalities to offer support were Professor Langevin, the Joliot-Curies, André Malraux, etc.\nHowever, that same year, Jouvenel was impressed by the riot of the antiparliamentary leagues that occurred on 6 February 1934, became disillusioned with traditional political parties and left the Radical Party. He began a paper with Pierre Andreu called La Lutte des jeunes (The Struggle of the Young) while at the same time contributing to the right wing paper Gringoire, for which he covered the 1935 Nuremberg Congress in Germany where the infamous Nuremberg Laws were passed. He began frequenting royalist and nationalist circles, where he met Henri de Man and Pierre Drieu la Rochelle.\nHe was in favour of Franco-German rapprochement and created the \"Cercle du grand pavois\", which supported the Comité France–Allemagne (Franco-German Committee). Here he became friends with Otto Abetz, the future German ambassador to Paris during the occupation. In February 1936 he interviewed Adolf Hitler for the journal Paris-Midi, for which he was criticised for being too friendly to the dictator.\nThat same year he joined Jacques Doriot's Parti populaire français (PPF). He became the editor in chief of its journal L'Émancipation nationale (National Emancipation), wherein he supported fascism. He broke with the PPF in 1938 when Doriot supported the Munich Agreement.\nJouvenel's mother passionately supported Czechoslovakian independence, and so he began his career as a private secretary to Edvard Beneš, Czechoslovakia's first prime minister. In 1947, along with Friedrich Hayek, Jacques Rueff, and Milton Friedman, he founded the Mont Pelerin Society. Later in life, de Jouvenel established the Futuribles International in Paris.\nJouvenel was among the very few French intellectuals to pay respectful attention to the economic theory and welfare economics that emerged during the first half of the 20th century in Austria, Italy, the United Kingdom, and the United States. This understanding of economics is shown by his The Ethics of Redistribution.\nDennis Hale of Boston College has co-edited two volumes of essays by Jouvenel.\n\n\n=== The Sternhell controversy ===\nZeev Sternhell published a book, Ni Droite, ni gauche (\"Neither Right nor Left\"), accusing De Jouvenel of having had fascist sympathies in the 1930s and 1940s. De Jouvenel sued in 1983, claiming nine counts of libel, two of which the court upheld. However, Sternhell was required neither to publish a retraction, nor to strike any passages from future printings of his book.\n\n\n== Bibliography ==\nOn Power: The Natural History of Its Growth\nThe Ethics of Redistribution\nSovereignty: An Inquiry into the Political Good\nThe Pure Theory of Politics\nThe Art of Conjecture\n\n\n== Notes ==\n\n\n== Further reading ==\nAnderson, Brian C. (Spring 2001). \"Bertrand de Jouvenel's melancholy liberalism,\" Public Interest, Issue 143.\nMahoney, Daniel J. (2008). \"Jourvenel, Bertrand de (1903–1987)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 263–5. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \nLuckey, William R. (October 1998). \"The Economics of Bertrand de Jouvenel,\" The Journal of Markets and Morality, Volume 1, Number 2.\nMauthner, Martin. Otto Abetz and His Paris Acolytes - French Writers Who Flirted with Fascism, 1930–1945. Sussex Academic Press, 2016, (ISBN 978-1-84519-784-1)\n\n\n== External links ==\nBertrand de Jouvenel at Goodreads", "ns": 0, "pageid": 2311541, "title": "Bertrand de Jouvenel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}