{"batchcomplete": "", "query": {"normalized": [{"to": "Bruno Leoni", "from": "Bruno_Leoni"}], "pages": {"4698617": {"extract": "Bruno Leoni (26 April 1913, Ancona – 21 November 1967, Turin) was an Italian classical-liberal political philosopher and lawyer.\nBesides being editor for the political science journal Il Politico, Leoni was also involved as secretary and later president of the Mont Pelerin Society. He taught at the University of Pavia from 1942 until his death.\nA well-known book of his is Freedom and the Law, published in English in 1961. In this work he points out the importance of the historical law (Roman jus civile and English common law) and he is very critical towards modern legislation and the idea that law can be the simple outcome of a political decision. Another important contribution of Leoni to the legal thought is his theory about the law as individual claim (he presents this idea in many articles and essays).\nFollowing Richard Posner, Leoni has been also one of the fathers of the Law and Economics school.\nLeoni was murdered by Osvaldo Quero in 1967.\n\n\n== Works ==\nEnglish\nBruno Leoni, 'Freedom and the Law, New York, Nostrand, 1961 Freedom and the Law; PDF version\nBruno Leoni, Law, Liberty and the Competitive Market, edited by Carlo Lottieri, with a preface by Richard A. Epstein, New Brunswick NJ, Transaction, 2008.\nBruno Leoni, \"The scientific demonstration\", with Introduction of Adriano Gianturco Gulisano. Procesos de Mercado, Vol. 6, n° 2, 2009, Universidad Rey Juan Carlos, Madrid, pp. 291-301.\nItalian\nBruno Leoni, Scritti di scienza politica e teoria del diritto, Introduction by M. Stoppino, Milano, Giuffrè, 1980.\nBruno Leoni, Le pretese e i poteri: le radici individuali del diritto e della politica, Introduction by Mario Stoppino, Milano, Società Aperta, 1997.\nBruno Leoni, La sovranità del consumatore, Introduzione di Sergio Ricossa, Roma, Ideazione, 1997.\nBruno Leoni, Lezioni di filosofia del diritto (ed Carlo Lottieri) Soveria Mannelli, Rubbettino, 2003 (1959).\nBruno Leoni, La libertà del lavoro (ed. Carlo Lottieri) IBL “Diritto, Mercato, Libertà”, Treviglio – Soveria Mannelli, Leonardo Facco – Rubbettino, 2004.\nBruno Leoni, Il diritto come pretesa (ed Antonio Masala), Introduction by Mauro Barberis, Macerata, Liberilibri, 2004.\nBruno Leoni, Lezioni di dottrina dello Stato (eds Raffaele De Mucci and Lorenzo Infantino) Soveria Mannelli, Rubbettino, 2004 (1957)\nBruno Leoni, Il pensiero politico moderno e contemporaneo (ed Antonio Masala), Introduction by Luigi Marco Bassani, Macerata, Liberilibri, 2009.\n\n\n== Notes ==\n\n\n== References ==\nM.N. Rothbard, On Freedom and the Law, “New Individualist Review”, I, n. 4, 1962\nP.H. Aranson, Bruno Leoni in Retrospect, “Harvard Journal of Law & Public Policy”, XI, n. 3, 1988.\nL. Liggio, and T. Palmer, T. G. (1988) “Freedom and the Law”: A Comment on Professor Aranson's Article, “Harvard Journal of Law & Public Policy”, XI, n. 3, 1988.\nR. Cubeddu, Friedrich A. von Hayek and Bruno Leoni, in “Journal des Economistes ed des Etudes Humaines”, vol. IX, n. 2\\3, 1999.\nA. Masala, Il liberalismo di Bruno Leoni, Soveria Mannelli, Rubbettino, 2003.\nE. Baglioni, L' individuo e lo scambio. Teoria ed etica dell'ordine spontaneo nell'individualismo di Bruno Leoni, Napoli, ESI 2004\nA. Masala (ed.) La teoria politica di Bruno Leoni, Soveria Mannelli, Rubbettino, 2005\nC. Lottieri, Le ragioni del diritto. Libertà individuale e ordine giuridico nel pensiero di Bruno Leoni, Soveria Mannelli, Rubbettino, 2006.\nA. Masala, Liberté et droit dans la pensée de Bruno Leoni, in Histoire du Liberalisme en Europe (eds J. Petitot, P. Nemo), Paris, PUF, 2006, pp. 777–794\nA. Favaro, Bruno Leoni. Dell’irrazionalità della legge per la spontaneità dell’ordinamento, Napoli, ESI, 2009.\nA. Gianturco Gulisano, Bruno Leoni tra positivismo e giusnaturalismo. Il diritto evolutivo, \"Foedus\", N°2, 2009, pp. 87–95\nA. Gianturco Gulisano, La «teoria empirica» di Bruno Leoni. La centralità dell’approccio metodologico, \"Biblioteca delle libertá\", Anno XLVI, gennaio - aprile 2011 - n. 200, http://www.centroeinaudi.it/images/stories/bdl_online/200online_gianturco_gulisano.pdf\n\n\n== External links ==\nIstituto Bruno Leoni\nBruno Leoni Club\nBruno Leoni, Voting versus the Market (1963)", "ns": 0, "pageid": 4698617, "title": "Bruno Leoni"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}