{"batchcomplete": "", "query": {"normalized": [{"to": "Bryan Caplan", "from": "Bryan_Caplan"}], "pages": {"215740": {"extract": "Bryan Douglas Caplan (born April 8, 1971) is an American economist. Caplan is a professor of economics at George Mason University, research fellow at the Mercatus Center, adjunct scholar at the Cato Institute, and blogger for EconLog. He works in public choice theory and is interested in libertarian subjects. The bulk of Caplan's academic work is in public economics, especially public choice theory.\n\n\n== Education ==\nCaplan holds a B.A. in economics from the University of California, Berkeley, and a Ph.D. in economics from Princeton University. His thesis is titled \"Three essays on the economics of government behavior.\"\n\n\n== Books ==\n\n\n=== The Myth of the Rational Voter ===\nThe Myth of the Rational Voter: Why Democracies Choose Bad Policies, published in 2007, further develops the \"rational irrationality\" concept from Caplan's earlier academic writing. It draws heavily from the Survey of Americans and Economists on the Economy in making the argument that voters have systematically biased beliefs about many important economic topics. Caplan writes that rational irrationality is an explanation for the failure of democracy. The book was reviewed in the popular press, including the Wall Street Journal, the New York Times, and the New Yorker, as well as in academic publications such as the Journal of Libertarian Studies, Public Choice, Libertarian Papers, and The Independent Review. It received a scathing critique by Rupert Read in the European Review.\n\n\n=== Selfish Reasons to Have More Kids ===\nSelfish Reasons to Have More Kids is a 2011 book arguing that people often work too hard in child-rearing, and as a result, they are scared of the idea of having kids. Caplan's book urged parents to relax with respect to child-rearing. The book argues that as the perceived costs (in terms of child-rearing expense and effort) of having kids fell, it made sense to have more kids based on the basic theory of supply and demand. The book was reviewed in Wall Street Journal. The book was also reviewed by The Guardian, RealClearMarkets and the Washington Times. The book also led to debates sponsored by the Wall Street Journal and The Guardian. The The Guardian had Caplan debating \"Tiger Mom\" Amy Chua on the merits of strict parenting style. The book was also featured in a story on National Public Radio.\n\n\n== Views ==\n\n\n=== Pacifism ===\nCaplan has identified himself as a pacifist on pragmatic grounds and has summarized his \"common-sense case for pacifism\" using three steps:\nThe immediate costs of war are clearly awful.\nThe long-run benefits of war are highly uncertain.\nFor a war to be morally justified, its long-run benefits have to be substantially larger than its short-run costs.\nIn July 2011, Caplan debated his case for pacifism with Ilya Somin. Sheldon Richman claimed to find Caplan's arguments more convincing in the debate. In a February 2013 LearnLiberty-sponsored debate with Jan Ting at the Students for Liberty conference, Caplan used a slightly different breakdown of the case for pacifism, using four steps instead of three.\nCaplan's arguments for pacifism have been critiqued by Tyler Cowen on the Marginal Revolution blog and others.\n\n\n=== Open borders ===\nCaplan is a vocal proponent of open borders and says that immigration restrictions keep the poor locked in a prison of poverty, limiting both freedom and prosperity. A talk titled Immigration restrictions: a solution in search of a problem by Caplan in September 2010 to the GMU Economics Society, sponsored by the Future of Freedom Foundation was praised by David R. Henderson and Jacob Hornberger. Caplan was cited as one of the leading proponents of the open borders position in an article in The Atlantic by Shaun Raviv. He has also been quoted in other mainstream press pieces on immigration in outlets such as the Huffington Post and Time Magazine.\n\n\n=== Anarcho-capitalism ===\nCaplan's anarcho-capitalist views were discussed by Brian Doherty in his book Radicals for Capitalism and in Reason magazine. One frequent criticism of Caplan is an accusation that he has engaged in historical revisionism by claiming that anarcho-capitalists have a better claim on the history of anarchist thought than mainstream left-anarchists.\n\n\n=== Ayn Rand and Objectivism ===\nAfter having long shed a youthful infatuation with the works of Russian American writer Ayn Rand and her philosophical system of Objectivism, in 2004 Caplan wrote in his essay 'An Intellectual Biography', \"I rejected Christianity because I determined that it was, to be blunt, idiotic. I rejected Objectivism and Austrianism, in contrast, as mixtures of deep truths and unfortunate mistakes. Let me begin with the deep truths. The Objectivists were right to insist that reality is objective, human reason able to grasp it, and scepticism without merit. They correctly hold that humans have free will, morality is objective, and the pursuit of self-interest typically morally right.\"\nIn his essay, \"Atlas Shrugged and Public Choice: The Obvious Parallels\", Caplan lauds Ayn Rand's Atlas Shrugged as making \"an important contribution to social science.\"\n\n\n== Personal life ==\nHe is married with four children, and resides in Oakton, Virginia.\n\n\n== References ==\n\n\n== External links ==\nBryan Caplan's Website\nThe EconLog blog\nRoberts, Russ. \"Bryan Caplan Podcasts\". EconTalk. Library of Economics and Liberty. \nBryan Caplan work at Ludwig von Mises Institute\nAppearances on C-SPAN\nVideo of interview/discussion with Caplan by Will Wilkinson on Bloggingheads.tv\nCaplan's bio at the Mercatus Center", "ns": 0, "pageid": 215740, "title": "Bryan Caplan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}