{"batchcomplete": "", "query": {"normalized": [{"to": "Calvin Seerveld", "from": "Calvin_Seerveld"}], "pages": {"1627806": {"extract": "Calvin Seerveld (born 1930 in New York) received a BA from Calvin College in 1952, an MA in English literature and classics from the University of Michigan in 1953. He then went on to study under D. H. Th. Vollenhoven at the Free University (VU) in Amsterdam, where his doctoral dissertation dealt with Croce's aesthetics. It was supervised by Vollenhoven and Carlo Antoni. He then taught philosophy and German at Trinity Christian College, and went on to teach philosophical aesthetics at the Institute for Christian Studies in Toronto.\nSeerveld has been influential in the reformational movement. In fact he was the first to coin the term 'reformational' to describe the philosophical aspects of neo-Calvinism. He has taken Dooyeweerd's aesthetic modal aspect and developed Dooyeweerd's ideas . His book Rainbows for a Fallen World has influenced many Christian artists . In it he argues that \"aesthetic obedience is required of everyone by the Lord-artist or not.\"2\nLambert Zuidervaart identifies four claims that constitute Seerveld's contribution to aesthetics1:\nThe aesthetic is part of the fabric of created reality, and aesthetic norms can be violated or ignored only at great cost.\nThe arts, despite their variety and their continuing development, are a unified sphere distinct from other spheres of cultural endeavour, offering opportunities for vocational service to Christians today.\nThe aesthetic is not limited only to the arts, just as the arts have many facets other than the aesthetic.\nThe core meaning of the aesthetic - and distinguishing characteristic of the arts - is 'allusiveness' or 'imaginativity'.\n\n\n== Publications ==\nRainbows for a Fallen World Tuppence Press, 1980\nOn Being Human: Imaging God in a Modern World Welch Publishing, 1998\nTake Hold of God and Pull Paternoster, 1999\nIn the Fields of the Lord: A Calvin Seerveld Reader Craig Bartholomew (Editor) Piquant/ Tuppence Press, 2000.\nVoicing God's Psalms Eerdmans, 2005\nAll available from Tuppence Press\n\n\n== References ==\n1 In Zuidervaart and Luttikhuizen (ed.) Pledges of Jubilee: Essays on the Arts and Culture in Honour of Calvin G. Seerveld Eerdmans, 1995; cited in Bartholomew (ed.) 2000\n2 Seerveld, Calvin \"Rainbows for the Fallen World\" Tuppence Press, Toronto 2005\nCraig Bartholomew and Gideon Strauss 'Bread and not stones: an introduction to the thought of Calvin Seerveld' in Bartholomew (ed.) 2000.\nSeerveld pages from All of Life Redeemed website", "ns": 0, "pageid": 1627806, "title": "Calvin Seerveld"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}