{"batchcomplete": "", "query": {"normalized": [{"to": "Carol Gilligan", "from": "Carol_Gilligan"}], "pages": {"297074": {"extract": "Carol Gilligan (/ˈɡɪlɪɡən/; born November 28, 1936) is an American feminist, ethicist, and psychologist best known for her work on ethical community and ethical relationships, and certain subject-object problems in ethics.\nShe is a professor at New York University and a visiting professor at the University of Cambridge. She is teaching as a visiting professor at New York University, Abu Dhabi. She is best known for her 1982 work, In a Different Voice. She is the founder of ethics of care.\n\n\n== Background and career ==\nCarol Gilligan was raised in a Jewish family in New York City. She was the only child of a lawyer, William Friedman, and nursery school teacher, Mabel Caminez. She attended Walden School, a progressive private school on Manhattan's Upper West Side, played piano and pursued a career in modern dance during her graduate studies. Gilligan received her B.A. summa cum laude in English literature from Swarthmore College, a master's degree in clinical psychology from Radcliffe College, and a Ph.D. in social psychology from Harvard University.\nShe began her teaching career at Harvard in 1967, receiving tenure with the Harvard Graduate School of Education in 1988. Gilligan taught for two years at the University of Cambridge (from 1992–1994) as the Pitt Professor of American History and Institutions. In 1997, she became Patricia Albjerg Graham Chair in Gender Studies at Harvard.\nGilligan left Harvard in 2002 to join New York University as a full professor with the School of Education and the School of Law. She is also visiting professor at the University of Cambridge in the Centre for Gender Studies.\nBest known for her work, In a Different Voice (1982), Gilligan studied women’s psychology and girls’ development and co-authored or edited a number of texts with her students. She contributed the piece \"Sisterhood Is Pleasurable: A Quiet Revolution in Psychology\" to the 2003 anthology Sisterhood Is Forever: The Women's Anthology for a New Millennium, edited by Robin Morgan. She published her first novel, Kyra, in 2008.\nShe is married to James Gilligan, M.D., who directed the Center for the Study of Violence at Harvard Medical School.\n\n\n=== Philosophy ===\nGilligan is known for her work with Lawrence Kohlberg on his stages of moral development as well as her criticism of his approach to the stages. Despite being Kohlberg's research assistant, Gilligan argued that Lawrence Kohlberg's stages of moral development were male-oriented, which limited their ability to be generalized to females. Gilligan thus proposed her theory of stages of female moral development based on her idea of moral voices. According to Gilligan, there are two kinds of moral voices: that of the masculine and the feminine. The masculine voice is \"logical and individualistic\", meaning that the emphasis in moral decisions is protecting the rights of people and making sure justice is upheld. The feminine voice places more emphasis on protecting interpersonal relationships and taking care of other people. This voice focuses on the \"care perspective,\" which means focusing on the needs of the individual in order to make an ethical decision. For Gilligan, Kohlberg's stages of moral development were emphasizing the masculine voice, making it difficult to accurately gauge a woman's moral development because of this incongruity in voices. Gilligan argues that androgyny, or integrating the masculine and the feminine, is the best way to realize one's potential as a human. Gilligan's stages of female moral development has been shown in business settings as an explanation to the different ways men and women handle ethical issues in the workplace as well.\n\n\n== Awards ==\n1992 University of Louisville Grawemeyer Award in Education\n1996 Time Magazine - one of the 25 most influential Americans\n1998 4th Annual Heinz Award in the Human Condition\n\n\n== Selected bibliography ==\n\n\n=== Books ===\nGilligan, Carol (1982). In a Different Voice: Psychological Theory and Women's Development. Cambridge, Massachusetts: Harvard University Press.  ISBN 9780674445444\nGilligan, Carol (1989). Mapping the moral domain: a contribution of women's thinking to psychological theory and education. Cambridge, Massachusetts: Harvard University Press. ISBN 9780674548312. \nGilligan, Carol; et al. (1990). Making connections: the relational worlds of adolescent girls at Emma Willard School. Cambridge, Massachusetts: Harvard University Press. ISBN 9780674540415. \nGilligan, Carol; Brown, Lyn M. (1992). Meeting at the crossroads: women's psychology and girls' development. Cambridge, Massachusetts: Harvard University Press. ISBN 9780674564640. \nGilligan, Carol; McLean Taylor, Jill; Sullivan, Amy M. (1997). Between voice and silence: women and girls, race and relationships. Cambridge, Massachusetts: Harvard University Press. ISBN 9780674068797. \nGilligan, Carol (2002). The birth of pleasure. New York: Knopf. ISBN 9780679440376. \nGilligan, Carol (2008). Kyra: a novel. New York: Random House. ISBN 9781400061754. \nGilligan, Carol; Richards, David A.J. (2009). The deepening darkness: patriarchy, resistance, & democracy's future. Cambridge New York: Cambridge University Press. ISBN 9780521898980. \nGilligan, Carol; Gilligan, John (2011). The Scarlet Letter. Prime Stage Theatre. \n\nFrom the novel The Scarlet Letter by Nathaniel Hawthorne. Co-written with her son Jonathan and produced by Prime Stage Theatre in November 2011.\nEducational fact sheet about the play.\n\nGilligan, Carol (2011). Joining the resistance. Cambridge, UK Malden, Massachusetts: Polity Press. ISBN 9780745651705. \nGilligan, Carol; Hochschild, Arlie; Tronto, Joan (2013). Contre l'indifférence des privilégiés: à quoi sert le care (in French). Paris: Payot. ISBN 9782228908771.  Details.\n\n\n=== Book chapters ===\nGilligan, Carol (1997), \"Woman's place in man's life cycle\", in Nicholson, Linda, The second wave: a reader in feminist theory, New York: Routledge, pp. 198–215, ISBN 9780415917612. \n\n\n== References ==\n\n\n== External links ==\nBiography of Gilligan at Webster University\n2008 Commencement Speech (Mount Holyoke College)\nConversation with Carol Gilligan\nCarol Gilligan's Profile on Psychology's Feminist Voices\nCarol Gilligan Video produced by Makers: Women Who Make America", "ns": 0, "pageid": 297074, "title": "Carol Gilligan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}