{"batchcomplete": "", "query": {"normalized": [{"to": "Carrie Ichikawa Jenkins", "from": "Carrie_Ichikawa_Jenkins"}], "pages": {"42548138": {"extract": "Carrie Ichikawa Jenkins is Canada Research Chair and Professor of Philosophy at the University of British Columbia. She is also a Professor at the Northern Institute of Philosophy, University of Aberdeen. Her primary research areas are epistemology, metaphysics, philosophy of logic, philosophy of language, and philosophy of mathematics. She is one of the principal editors of the journal Thought.\n\n\n== Education and career ==\nJenkins holds BA, MPhil and PhD degrees in philosophy from Trinity College, Cambridge.\nShe has held teaching and research positions at the University of St Andrews, the Australian National University, the University of Michigan and the University of Nottingham. She was head of the department of philosophy at the University of Nottingham from 2010 to 2011.\nJenkins was awarded a Canada Research Chair by the Canadian Government in 2011.\nJenkins is also a member of the philosophy-themed musical group The 21st Century Monads.\nJenkins became involved in a dispute with Brian Leiter, a professor at the University of Chicago and then editor of the Philosophical Gourmet Report. His online remarks about Jenkins led to hundreds of philosophers refusing to provide data for the report, and ultimately led to his stepping down as its editor.\n\n\n== Research areas ==\nJenkins is the author of Grounding Concepts: An Empirical Basis for Arithmetical Knowledge, published in 2008 by Oxford University Press.\nGrounding Concepts has been described as an ‘important book’, ‘an original treatment of the epistemology of arithmetic that is clearly articulated and carefully argued’, and a 'key work' in its field. Reviewers have said that ‘at each step Jenkins offers new ideas, or interesting twists of the traditional ones, or exciting polemics and criticism’, and that \"Grounding Concepts\" ‘adds a genuinely new option to the philosophical landscape.’\nJenkins has also published over thirty articles in philosophical journals and edited volumes. In 2013, she was a keynote speaker at the annual conference of the Western Canadian Philosophical Association.\nJenkins’s work on the philosophy of flirting has been described as ‘ground-breaking’.\nShe is currently leading a research project on the metaphysics of romantic love.\n\n\n== Selected publications ==\n• Grounding Concepts: An Empirical Basis for Arithmetical Knowledge (OUP, 2008, ISBN 978-0-19-923157-7)\n• ‘The Philosophy of Flirting’: http://media.wiley.com/product_data/excerpt/25/14443302/1444330225.pdf\n• ‘Concepts, Experience and Modal Knowledge’: http://onlinelibrary.wiley.com/doi/10.1111/j.1520-8583.2010.00193.x/abstract\n• ‘Romeo, René, and the Reasons Why: What Explanation Is’: http://onlinelibrary.wiley.com/doi/10.1111/j.1467-9264.2008.00236.x/abstract\n\n\n== External links ==\nPersonal website\nThe Metaphysics of Love Project\nInterviewed at Aesthetics for Birds\nInterviewed for Philosophers on Film\n\n\n== References ==", "ns": 0, "pageid": 42548138, "title": "Carrie Ichikawa Jenkins"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}