{"batchcomplete": "", "query": {"normalized": [{"to": "Carveth Read", "from": "Carveth_Read"}], "pages": {"10470346": {"extract": "Carveth Read (1848–1931) was a 19th and 20th century British philosopher and logician.\n\n\n== Life ==\nHe was born 16, March 1848 in Falmouth, Cornwall, England. He was the third son of Edward Read and Elizabeth Truscott. He attended the University of Cambridge (Christ's College). He received a B.A. (Moral Sciences Tripos, 1st) in 1873 and an M.A. in 1877. He was the Hilbert travelling scholar, studying at Leipzig and Heidelberg Universities in 1874-1877. In 1877 he married Evelyn Thompson. From 1878 he lectured at Wren's 'Coaching' establishment (located at 7 Powis Square, Westbourne Park, London). He was Grote professor of philosophy of mind and logic  at the University College London (UCL) from 1903 to 1911. From 1911 to 1921 he was Lecturer in Comparative Psychology at UCL. He died 6 December 1931 in Solihull, Warwickshire, England.\n\n\n== Work ==\nIn the preface to the fourth edition of his book Logic: Deductive and Inductive (1920), he identifies his significant influences. He states, \"the work may be considered, on the whole, as attached to the school of Mill; to whose System of Logic, and to Bain's Logic, it is deeply indebted. Amongst the works of living writers, the Empirical Logic of Venn and the Formal Logic of Keynes have given me most assistance.\" In Chapter 22 of Logic, Read says: \"It is better to be vaguely right than exactly wrong\", the original source of the much quoted aphorism \"It is better to be roughly right than exactly wrong\" that is often, incorrently attributed to John Maynard Keynes.\n\n\n== Bibliography ==\nTheory in Logic (1878)\nLogic: Deductive and Inductive (1898 – first edition)\nThe Metaphysics of Nature (1905 - first edition)\nNatural and Social Morals (1909)\nThe Origin of Man and His Superstitions (1920)\n\n\n== References ==\n\n\n== External links ==\nWorks by Carveth Read at Project Gutenberg\nWorks by or about Carveth Read at Internet Archive", "ns": 0, "pageid": 10470346, "title": "Carveth Read"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}