{"batchcomplete": "", "query": {"normalized": [{"to": "Charles Taylor (philosopher)", "from": "Charles_Taylor_(philosopher)"}], "pages": {"294996": {"extract": "Charles Margrave Taylor, CC GOQ FRSC (born November 5, 1931) is a Canadian philosopher from Montreal, Quebec, and professor emeritus at McGill University best known for his contributions to political philosophy, the philosophy of social science, history of philosophy and intellectual history. This work has earned him the prestigious Kyoto Prize, the Templeton Prize, the Berggruen Prize for Philosophy, and the John W. Kluge Prize, in addition to widespread esteem among philosophers.\nIn 2007, Taylor served with Gérard Bouchard on the Bouchard-Taylor Commission on Reasonable accommodation with regard to cultural differences in the province of Quebec. He is a practising Roman Catholic.\n\n\n== Career ==\nTaylor attended Selwyn House School from 1941 to 1946 and began his undergraduate education at McGill University (B.A. in History in 1952). He continued his studies at the University of Oxford, first as a Rhodes Scholar at Balliol College (B.A. in Philosophy, Politics and Economics) in 1955, and then as a post-graduate (D.Phil. in 1961), under the supervision of Isaiah Berlin and G. E. M. Anscombe.\nHe succeeded John Plamenatz as Chichele Professor of Social and Political Theory at the University of Oxford and became a Fellow of All Souls College. For many years, both before and after Oxford, he was Professor of Political Science and Philosophy at McGill University in Montreal, Canada, where he is now professor emeritus. Taylor was also a Board of Trustees Professor of Law and Philosophy at Northwestern University in Evanston for several years after his retirement from McGill.\nTaylor was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1986. In 1991, Taylor was appointed to the Conseil de la langue française in the province of Quebec, at which point he critiqued Quebec's commercial sign laws. In 1995, he was made a Companion of the Order of Canada. In 2000, he was made a Grand Officer of the National Order of Quebec. He was awarded the 2007 Templeton Prize for progress towards research or discoveries about spiritual realities, which includes a cash award of US$1.5 million. In 2007 he and Gérard Bouchard were appointed to head a one-year Commission of Inquiry into what would constitute \"reasonable accommodation\" for minority cultures in his home province of Quebec, Canada. In June 2008, he was awarded the Kyoto Prize in the arts and philosophy category. The Kyoto Prize is sometimes referred to as the Japanese Nobel. In 2015, he was awarded the John W. Kluge Prize for Achievement in the Study of Humanity, a prize he shared with philosopher Jürgen Habermas. In 2016, he was awarded a $1 million Berggruen Prize for being \"a thinker whose ideas are of broad significance for shaping human self-understanding and the advancement of humanity.\" \n\n\n== Views ==\nIn order to understand Taylor's views, it is helpful to understand his philosophical background, especially his writings on Georg Wilhelm Friedrich Hegel, Ludwig Wittgenstein, Martin Heidegger, and Maurice Merleau-Ponty. Taylor rejects naturalism and formalist epistemologies. He is part of an influential intellectual tradition of Canadian Idealism that includes John Watson, Paxton Young, C.B. Macpherson, and George Parkin Grant.\nIn his essay \"To Follow a Rule\", Taylor explores why people can fail to follow rules, and what kind of knowledge it is that allows a person to successfully follow a rule, such as the arrow on a sign. The intellectualist tradition presupposes that to follow directions, we must know a set of propositions and premises about how to follow directions.\nTaylor argues that Wittgenstein's solution is that all interpretation of rules draws upon a tacit background. This background is not more rules or premises, but what Wittgenstein calls \"forms of life\". More specifically, Wittgenstein says in the Philosophical Investigations that \"Obeying a rule is a practice.\" Taylor situates the interpretation of rules within the practices that are incorporated into our bodies in the form of habits, dispositions, and tendencies.\nFollowing Heidegger, Merleau-Ponty, Hans-Georg Gadamer, Michael Polanyi, and Wittgenstein, Taylor argues that it is mistaken to presuppose that our understanding of the world is primarily mediated by representations. It is only against an unarticulated background that representations can make sense to us. On occasion we do follow rules by explicitly representing them to ourselves, but Taylor reminds us that rules do not contain the principles of their own application: application requires that we draw on an unarticulated understanding or \"sense of things\"—the background.\n\n\n== Taylor's critique of naturalism ==\nTaylor defines naturalism as a family of various, often quite diverse theories that all hold \"the ambition to model the study of man on the natural sciences.\"\nPhilosophically, naturalism was largely popularized and defended by the unity of science movement that was advanced by logical positivist philosophy. In many ways, Taylor's early philosophy springs from a critical reaction against the logical positivism and naturalism that was ascendant in Oxford while he was a student.\nInitially, much of Taylor's philosophical work consisted of careful conceptual critiques of various naturalist research programs. This began with his 1964 dissertation The Explanation of Behaviour, which was a detailed and systematic criticism of the behaviourist psychology of B. F. Skinner that was highly influential at mid-century.\nFrom there, Taylor also spread his critique to other disciplines. The still hugely influential essay \"Interpretation and the Sciences of Man\" was published in 1972 as a critique of the political science of the behavioural revolution advanced by giants of the field like David Easton, Robert Dahl, Gabriel Almond, and Sydney Verba. In an essay entitled \"The Signiﬁcance of Signiﬁcance: The Case for Cognitive Psychology\", Taylor criticized the naturalism he saw distorting the major research program that had replaced B. F. Skinner's behaviourism.\nBut Taylor also detected naturalism in fields where it was not immediately apparent. For example, in 1978's \"Language and Human Nature\", he found naturalist distortions in various modern \"designative\" theories of language, while in Sources of the Self (1989) he found both naturalist error and the deep moral, motivational sources for this outlook in various individualist and utilitarian conceptions of selfhood.\n\n\n== Taylor and hermeneutics ==\nConcurrent to Taylor's critique of naturalism was his development of an alternative. Indeed, Taylor's mature philosophy begins when as a doctoral student at Oxford he turned away, disappointed, from analytic philosophy in search of other philosophical resources which he found in French and German hermeneutics and phenomenology.\nThe hermeneutic tradition develops a view of human understanding and cognition as centred on the decipherment of meanings (as opposed to, say, foundational theories of brute verification or an apodictic rationalism). Taylor's own philosophical outlook can broadly and fairly be characterized as hermeneutic. This is clear in his championing of the works of major figures within the hermeneutic tradition such as Wilhelm Dilthey, Heidegger, Merleau Ponty, and Gadamer. It is also evident in his own original contributions to hermeneutic and interpretive theory.\n\n\n== Communitarian critique of liberalism ==\nTaylor (as well as Alasdair MacIntyre, Michael Walzer, and Michael Sandel) is associated with a communitarian critique of liberal theory's understanding of the \"self\". Communitarians emphasize the importance of social institutions in the development of individual meaning and identity.\nIn his 1991 Massey Lecture \"The Malaise of Modernity\", Taylor argued that political theorists—from John Locke and Thomas Hobbes to John Rawls and Ronald Dworkin—have neglected the way in which individuals arise within the context supplied by societies. A more realistic understanding of the \"self\" recognizes the social background against which life choices gain importance and meaning.\n\n\n== Philosophy and sociology of religion ==\n\nTaylor's later work has turned to the philosophy of religion, as evident in several pieces, including the lecture \"A Catholic Modernity\" and the short monograph \"Varieties of Religion Today: William James Revisited\".\nTaylor's most significant contribution in this field to date is his book A Secular Age which argues against the secularization thesis of Max Weber, Steve Bruce, and others. In rough form, the secularization thesis holds that as modernity (a bundle of phenomena including science, technology, and rational forms of authority) progresses, religion gradually diminishes in influence. Taylor begins from the fact that the modern world has not seen the disappearance of religion but rather its diversification and in many places its growth. He then develops a complex alternative notion of what secularization actually means given that the secularization thesis has not been borne out. In the process, Taylor also greatly deepens his account of moral, political, and spiritual modernity that he had begun in Sources of the Self.\n\n\n== Politics ==\nTaylor was a candidate for the social democratic New Democratic Party in Mount Royal on three occasions in the 1960s, beginning with the 1962 federal election when he came in third behind Liberal Alan MacNaughton. He improved his standing in 1963, coming in second. Most famously, he also lost in the 1965 election to newcomer and future prime minister, Pierre Trudeau. This campaign garnered national attention. Taylor's fourth and final attempt to enter the Canadian House of Commons was in the 1968 federal election, when he came in second as an NDP candidate in the riding of Dollard. In 1994 he coedited a paper on human rights with Vitit Muntarbhorn in Thailand. In 2008, he endorsed the NDP candidate in Westmount—Ville-Marie, Anne Lagacé Dowson. He was also a professor to Canadian politician and former leader of the New Democratic Party Jack Layton.\nIn 2010, Taylor said multiculturalism was a work in progress that faced challenges. He identified tackling Islamophobia in Canada as the next challenge.\n\n\n== Interlocutors ==\n\n\n== Selected works by Taylor ==\nBooks\n1964. The Explanation of Behaviour. Routledge Kegan Paul.\n1975. Hegel. Cambridge University Press.\n1979. Hegel and Modern Society. Cambridge University Press.\n1985. Philosophical Papers (2 volumes).\n1989. Sources of the Self: The Making of Modern Identity. Harvard University Press\n1992. The Malaise of Modernity, being the published version of Taylor's Massey Lectures. Reprinted in the U.S. as The Ethics of Authenticity. Harvard University Press\n1993. Reconciling the Solitudes: Essays on Canadian Federalism and Nationalism. McGill-Queen's University Press\n1994. Multiculturalism: Examining The Politics of Recognition.\n1995. Philosophical Arguments. Harvard University Press\n1999. A Catholic Modernity?.\n2002. Varieties of Religion Today: William James Revisited. Harvard University Press\n2004. Modern Social Imaginaries. Duke University Press.\n2007. A Secular Age. Harvard University Press\n2011. Dilemmas and Connections: Selected Essays. Harvard University Press.\n2015. With Hubert Dreyfus, Retrieving Realism. Harvard University Press.\n2016. \"The Language Animal: The Full Shape of the Human Linguistic Capacity\", Harvard University Press.\nBook chapters\n\"The diversity of goods\" in Sen, Amartya; Williams, Bernard, eds. (1982). Utilitarianism and beyond. Cambridge: Cambridge University Press. pp. 129–144. ISBN 9780511611964. \n\n\n== See also ==\nList of people from Montreal\n\n\n== Notes ==\n\n\n== References ==\nAmerican Academy of Arts and Sciences. \"T\" (PDF). Book of Members, 1780–2012. American Academy of Arts and Sciences. Retrieved February 15, 2016. \nBrown, Stuart; Collinson, Diané; Wilkinson, Robert, eds. (1996). Biographical Dictionary of Twentieth-Century Philosophers. London: Routledge. pp. 774–776. ISBN 978-0-415-06043-1. \nMeynell, Robert (2011). Canadian Idealism and the Philosophy of Freedom: C.B. Macpherson, George Grant and Charles Taylor. Montreal: McGill-Queen's University Press. ISBN 978-0-7735-3798-9. \nMuntarbhorn, Vitit; Taylor, Charles (1994). Road to Democracy: Human Rights and Human Development in Thailand. Montreal: International Centre for Human Rights and Democratic Development. \nTaylor, Charles (1964). The Explanation of Behaviour. International Library of Philosophy and Scientific Method. London: Routledge & Kegan Paul. \n— (1983). \"The Significance of Significance: The Case for Cognitive Psychology\". In Mitchell, Sollace; Rosen, Michael. The Need for Interpretation: Contemporary Conceptions of the Philosopher’s Task. New Jersey: Humanities Press. ISBN 978-0-391-02825-8. \n— (1992) [1991]. The Ethics of Authenticity. Cambridge, Massachusetts: Harvard University Press. ISBN 978-0-674-26863-0. \n— (2007). A Secular Age. Cambridge, Massachusetts: Belknap Press of Harvard University Press. ISBN 978-0-674-02676-6. \n\n\n== Further reading ==\nPerreau-Saussine, Émile (2005). \"Une spiritualité libérale? Alasdair MacIntyre et Charles Taylor en conversation\" [A Liberal Spirituality? Alasdair MacIntyre and Charles Taylor in Conversation] (PDF). Revue Française de Science Politique (in French). Presses de Sciences Po. 55 (2): 299–315. Archived from the original (PDF) on March 27, 2009. Retrieved February 15, 2015. \nRedhead, Mark (2002). Charles Taylor: Thinking and Living Deep Diversity. Twentieth-Century Political Thinkers. Lanham, Maryland: Rowman & Littlefield. ISBN 978-0-7425-2126-1. \nSkinner, Quentin (1991). \"Who Are 'We'? Ambiguities of the Modern Self\". Inquiry. 34 (2): 133–153. doi:10.1080/00201749108602249. (subscription required (help)). \nTemelini, Michael (2014). \"Dialogical Approaches to Struggles Over Recognition and Distribution\". Critical Review of International Social and Political Philosophy. 17 (4): 423–447. doi:10.1080/13698230.2013.763517. (subscription required (help)). \nTully, James; Weinstock, Daniel M., eds. (1994). Philosophy in an Age of Pluralism: The Philosophy of Charles Taylor in Question. Cambridge, England: Cambridge University Press. ISBN 978-0-521-43150-7. \n\n\n== External links ==\nA wide-ranging interview with Charles Taylor, including Taylor's thoughts about his own intellectual development.\nAn Interview with Charles Taylor Part 1,Part 2 and Part 3\nThe Immanent Frame a blog with posts by Taylor, Robert Bellah, and others concerning Taylor's book A Secular Age\nText of Taylor's essay \"Overcoming Epistemology\"\nBibliography of Taylor's works and works on Taylor's philosophy\nLinks to secondary sources, reviews of Taylor's works, reading notes\nLecture notes to Charles Taylor's talk on Religion and Violence (with a link to the audio) Nov 2004\nLecture notes to Charles Taylor's talk on 'An End to Mediational Epistemology', Nov 2004\nStudy guide to Philosophical Arguments and Philosophical Papers 2\nTempleton Prize announcement\nShort essay by Dene Baker, philosophers.co.uk\nTaylor's famous essay the The Politics of Recognition\nCharles Taylor on McGill Yearbook when he graduated in 1952\nOnline videos of Charles Taylor\nCan Human Action Be Explained?; Charles Taylor gives a lecture at Columbia University\nA Political Ethic of Solidarity on YouTube; Charles Taylor gives a lecture on a future politics self-consciously based on differing views and foundations in Milan\n\"Spiritual Forgetting\" on YouTube; Charles Taylor at awarding of Templeton Prize\n(French) «La religion dans la Cité des modernes : un divorce sans issue?» (14/10/2006) ; Charles Taylor and Pierre Manent, Musée des Beaux-Arts de Montréal, «Les grandes conférences Argument».", "ns": 0, "pageid": 294996, "title": "Charles Taylor (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}