{"batchcomplete": "", "query": {"normalized": [{"to": "Charles Parsons (philosopher)", "from": "Charles_Parsons_(philosopher)"}], "pages": {"1821365": {"extract": "Charles Dacre Parsons (born April 13, 1933) is an American philosopher best known for his work in the philosophy of mathematics and the study of the philosophy of Immanuel Kant. He is professor emeritus at Harvard University.\n\n\n== Biography and career ==\nParsons is a son of the famous Harvard sociologist Talcott Parsons. He earned his Ph.D. in philosophy at Harvard University in 1961, under the direction of Burton Dreben and Willard Van Orman Quine. He taught for many years at Columbia University before moving to Harvard University in 1989. He retired in 2005 as the Edgar Pierce professor of philosophy, a position formerly held by Quine.\nHe is an elected Fellow of the American Academy of Arts and Sciences and the Norwegian Academy of Science and Letters.\nAmong his former doctoral students are James Higginbotham, R. Gregory Taylor, Peter Ludlow, Richard Tieszen, Gila Sher, Charles H. Manekin, Emily Carson, Michael Glanzberg, and Øystein Linnebo.\n\n\n== Philosophical work ==\nIn addition to his work in logic and the philosophy of mathematics, Parsons was an editor, with Solomon Feferman and others, of the posthumous works of Kurt Gödel. He has also written on historical figures, especially Immanuel Kant, Gottlob Frege, Kurt Gödel, and Willard van Orman Quine.\n\n\n== Books ==\n1983. Mathematics in Philosophy: Selected Essays. Ithaca, N.Y.: Cornell Univ. Press.\n2008. Mathematical Thought and its Objects. Cambridge Univ. Press.\n2012. From Kant to Husserl: Selected Essays. Cambridge, Mass., and London: Harvard Univ. Press.\n2014a. Philosophy of Mathematics in the Twentieth Century: Selected Essays. Cambridge, Mass., and London: Harvard Univ. Press.\n\n\n== A selection of articles ==\n1987. \"Developing arithmetic in set theory without infinity: Some historical remarks\". History and Philosophy of Logic, vol. 8, pp. 201–213.\n1990a. \"The uniqueness of the natural numbers\". Iyyun, vol. 39, pp. 13–44. ISSN 0021-3306 (2 p.).\n1990b. \"The structuralist view of mathematical objects. Synthese, vol. 84 (3), pp. 303–346.\n2014b. \"Analyticity for realists\". In Interpreting Gödel: Critical Essays, ed. J. Kennedy. Cambridge University Press, pp. 131–150.\n\n\n== References ==", "ns": 0, "pageid": 1821365, "title": "Charles Parsons (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}