{"batchcomplete": "", "query": {"normalized": [{"to": "Cheng Hao", "from": "Cheng_Hao"}], "pages": {"18699291": {"extract": "Chéng Hào (Chinese: 程顥, 1032–1085), Courtesy name Bóchún (Chinese: 伯淳), was a neo-Confucian philosopher from Luoyang, China. In his youth, he and his younger brother Cheng Yi were students of Zhou Dunyi, one of the architects of Neo-Confucian cosmology. His philosophy was dualistic (between all that is tangible and all that is intangible) and pantheistic (believing that all that is intangible is the same thing, such as god, the human nature, feelings, actions (we see things acting, but not the action itself), movement (likewise), social roles and relations (likewise), chance, etc., and that such a unified, universal principle is in everything that is sensible [rather than in an external reality as in Platonism]); among his quotes are \"outside dao there are no things and outside things there is no dao\", \"we call it god to emphasize the wonderful mystery of principle in ten thousand things, just as we call it lord (di) to characterize its being the ruler of events\" and \"in terms of the reality, it is change; in terms of principle, it is dao; in terms of its function, it is god; in terms of its destiny in a human being, it is human nature\".\n\n\n== Life ==\nHao's grandfather was a county magistrate in Huangpi and died there while in that capacity. Hao's father Cheng Xiang (Chinese: 程珦) was still young at the time and was unable to return to Luoyang, so he was forced to grow up in Huangpi instead. He later became county magistrate (Chinese: 縣尉; pinyin: xiànwèi), at which time his two sons Hao and Yi were born. In 1057 Hao passed the Imperial examinations and became an entered scholar. He successively served as an administrative clerk in Hu County, Shaanxi, as an administrative clerk in Shangyuan County (an area now in Nanjing), as an administrative director in Zezhou, as well as a minister of ceremony, a Censor, a tax and tariff official, a ceremony minister to the military, and various other positions.\nCheng Hao and Cheng Yi were among the pioneers of Song Dynasty Neo-Confucianism, and they are often credited with its formal creation along with Zhu Xi and several other scholars. The two brothers were sometimes referred to as \"The Two Chengs\" (Chinese: 二程), or individually as \"Cheng the Elder\" (Chinese: 大程) and \"Cheng the Younger\" (Chinese: 小程). They dealt extensively with cosmology in their studies, applying Neo-Confucian principles to their studies of celestial bodies. In particular, the brothers identified and applied the principle of Divine or Natural Order, called li, to that of Tian, the Heavens, as their original and guiding power. Hao established schools at Fugou and Songyang (in modern Dengfeng). Throughout his life he promoted the view that study and scholarship were means to making men sages, once writing: \"The studies of a superior man must arrive at sagacity [sage-hood] and then upon his own intellect; in the case of not arriving at sage-hood but upon his own intellect, all is lost.\" Hao died in 1085 at the age of fifty-three.\n\n\n== Legacy ==\nHao was known as an outgoing, laid-back, and lively man, in contrast to his stern and severe younger brother. As Neo-Confucianism's popularity grew throughout the early second millennium AD, the two Cheng brothers along with Zhou Dunyi, Zhang Zai, Shao Yong, and Sima Guang became known as \"The Six Masters of Northern Song\" for their philosophical contributions.\nHao also received several posthumous titles: in 1220 he was given the posthumous name \"Lord of Purity\" (Chinese: 純公) by the emperor. In 1241 he was given the posthumous title of \"Bo [Earl] of Henan\". In 1330, an imperial decree made Hao the posthumous \"Lord of Yu Kingdom [Henan]\".\nCheng Hao's offspring held the title of Wujing Boshi (五经博士; 五經博士; Wǔjīng Bóshì).\nIn 1452 Wujing Boshi was bestowed upon the offspring of Mengzi-Meng Xiwen 孟希文 56th generation and Yan Hui-Yan Xihui 顔希惠 59th generation, the same was bestowed on the offspring of Zhou Dunyi-Zhou Mian 週冕 12th generation, the two Cheng brothers (Cheng Hao and Cheng Yi-Chen Keren 程克仁 17th generation), Zhu Xi-Zhu Ting 朱梴 (Zhu Chan?) 9th generation, in 1456-1457, in 1539 the same was awarded to Zeng Can's offspring-Zeng Zhicui 曾質粹 60th generation, in 1622 the offspring of Zhang Zai received the title and in 1630 the offspring of Shao Yong.\n\n\n== References ==", "ns": 0, "pageid": 18699291, "title": "Cheng Hao"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}