{"batchcomplete": "", "query": {"normalized": [{"to": "Cheng Yi (philosopher)", "from": "Cheng_Yi_(philosopher)"}], "pages": {"8738289": {"extract": "Cheng Yi (simplified Chinese: 程颐; traditional Chinese: 程頤; pinyin: Chéng Yí; Wade–Giles: Ch'eng I, 1033–1107), courtesy name Zhengshu (正叔), also known as Mr. Yichuan (伊川先生), was a Chinese philosopher born in Luoyang during the Song Dynasty. He worked with his older brother Cheng Hao (程顥). Like his brother, he was a student of Zhou Dunyi, a friend of Shao Yong, and a nephew of Zhang Zai. The five of them along with Sima Guang are called the Six Great Masters of the 11th century by Zhu Xi.\nCheng entered the national university in 1056, and received the \"presented scholar\" degree in 1059. He lived and taught in Luoyang, and declined numerous appointments to high offices. In 1086, he was appointed expositor-in-waiting and gave many lectures to the emperor on Confucianism. He was more aggressive and obstinate than his brother, and made several enemies, including Su Shi, the leader of the Sichuan group. In 1097, his enemies were able to ban his teachings, confiscate his properties, and banish him. He was pardoned three years later, but was blacklisted and again his work was banned in 1103. He was finally pardoned in 1106, one year before his death.\nCheng Yi's offspring held the title of Wujing Boshi (五经博士; 五經博士; Wǔjīng Bóshì).\nIn 1452 Wujing Boshi was bestowed upon the offspring of Mengzi-Meng Xiwen 孟希文 56th generation and Yan Hui-Yan Xihui 顔希惠 59th generation, the same was bestowed on the offspring of Zhou Dunyi-Zhou Mian 週冕 12th generation, the two Cheng brothers (Cheng Hao and Cheng Yi-Chen Keren 程克仁 17th generation), Zhu Xi-Zhu Ting 朱梴 (Zhu Chan?) 9th generation, in 1456-1457, in 1539 the same was awarded to Zeng Can's offspring-Zeng Zhicui 曾質粹 60th generation, in 1622 the offspring of Zhang Zai received the title and in 1630 the offspring of Shao Yong.\n\n\n== References ==\n\n\"Cheng Yi\". Internet Encyclopedia of Philosophy. \nJames D. Sellman, \"Cheng Hao and Cheng Yi,\" in Great Thinkers of the Eastern World, Ian McGreal, ed., New York: Harper Collins, 1995, p. 111-115.\nTang, Yuyan, \"Cheng Yi\". Encyclopedia of China (Philosophy Edition), 1st ed.", "ns": 0, "pageid": 8738289, "title": "Cheng Yi (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}