{"batchcomplete": "", "query": {"normalized": [{"to": "Christine Korsgaard", "from": "Christine_Korsgaard"}], "pages": {"195180": {"extract": "Christine Marion Korsgaard (born April 9, 1952) is an American philosopher and academic whose main scholarly interests are in moral philosophy and its history; the relation of issues in moral philosophy to issues in metaphysics, the philosophy of mind, and the theory of personal identity; the theory of personal relationships; and in normativity in general. She has taught at Yale, the University of California at Santa Barbara, and the University of Chicago; since 1991 she has been a professor at Harvard University, where she is now Arthur Kingsley Porter Professor of Philosophy. She has been described as \"one of today's leading moral philosophers\" because of her work in defense of Kantian views in moral theory.\n\n\n== Biography ==\nKorsgaard first attended Eastern Illinois University for two years and transferred to receive a B.A. from the University of Illinois and a Ph.D from Harvard, where she was a student of John Rawls. She received an LHD Doctor of Humane Letters from the University of Illinois in 2004. She is a 1970 alumna of Homewood-Flossmoor High School in Flossmoor, Ill.\nIn 1996 Korsgaard published a book entitled The Sources of Normativity, which was the revised version of her Tanner Lectures on Human Values, and also a collection of her past papers on Kant's moral philosophy and Kantian approaches to contemporary moral philosophy: Creating the Kingdom of Ends. In 2002, she was the first woman to give the John Locke Lectures at the University of Oxford, which turned into her most recent book, Self-Constitution: Agency, Identity, and Integrity.\nShe was elected a Fellow of the American Academy of Arts & Sciences in 2001 and a Corresponding Fellow of the British Academy in 2015.\n\n\n== Selected publications ==\n\n\n=== Books ===\n(2009) Self-Constitution: Agency, Identity, and Integrity, Oxford University Press.\n(2008) The Constitution of Agency, Oxford University Press.\n(1996a) The Sources of Normativity, New York: Cambridge University Press, ISBN 0-521-55059-9.\n(1996b) Creating the Kingdom of Ends, New York: Cambridge University Press, ISBN 0-521-49644-6.\n\n\n=== Articles ===\n(1986) \"Skepticism about Practical Reason,\" The Journal of Philosophy 83 (1): 5-25. (Reprinted in as ch.11 in Korsgaard (1996b), pp. 311–334.)\n(1997) \"The Normativity of Instrumental Reason\", ch. 8 in Garrett Cullity & Berys Gaut (eds.) Ethics and Practical Reason, Oxford: Clarendon Press, pp. 215–54. (Reprinted with Afterword in Korsgaard (2008), pp. 27–69.)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== Notes ==\n\n\n== External links ==\nKorsgaard's Web Page - at Harvard University.\nInterview with 3AM Magazine", "ns": 0, "pageid": 195180, "title": "Christine Korsgaard"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}