{"batchcomplete": "", "query": {"pages": {"5823": {"extract": "Confucius (/kənˈfjuːʃəs/; September 28, 551 – 479 BC) was a Chinese teacher, editor, politician, and philosopher of the Spring and Autumn period of Chinese history.\nThe philosophy of Confucius emphasized personal and governmental morality, correctness of social relationships, justice and sincerity. His followers competed successfully with many other schools during the Hundred Schools of Thought era only to be suppressed in favor of the Legalists during the Qin Dynasty. Following the victory of Han over Chu after the collapse of Qin, Confucius' thoughts received official sanction and were further developed into a system known in the West as Confucianism.\nConfucius is traditionally credited with having authored or edited many of the Chinese classic texts including all of the Five Classics, but modern scholars are cautious of attributing specific assertions to Confucius himself. Aphorisms concerning his teachings were compiled in the Analects, but only many years after his death.\nConfucius's principles had a basis in common Chinese tradition and belief. He championed strong family loyalty, ancestor veneration, and respect of elders by their children and of husbands by their wives. He also recommended family as a basis for ideal government. He espoused the well-known principle \"Do not do to others what you do not want done to yourself\", the Golden Rule.\nConfucius is also a traditional deity in Daoism.\n\n\n== Names ==\nConfucius' family and personal name respectively was Kong Qiu (孔丘 Kǒng Qiū). His courtesy name was Zhongni (仲尼 Zhòngní). In Chinese, he is most often known as Kongzi (孔子 Kǒng Zǐ, literally \"Master Kong\"). He is also known by the honorific Kong Fuzi (孔夫子 Kǒng Fūzǐ, literally \"Grand Master Kong\"). In the Wade–Giles system of romanization, the honorific name is rendered as \"K'ung Fu-tzu\". The Latinized name \"Confucius\" is derived from \"Kong Fuzi\", and was first coined by 16th-century Jesuit missionaries to China, most probably by Matteo Ricci.\nWithin the Analects, he is often referred to simply as \"the Master\" (子 Zǐ). In 1 AD, Confucius was given his first posthumous name, the \"Laudably Declarable Lord Ni\" (褒成宣尼公). In 1530, he was declared the \"Extremely Sage Departed Teacher\" (至聖先師). He is also known separately as the \"Great Sage\" (至聖), \"First Teacher\" (先師), and \"Model Teacher for Ten Thousand Ages\" (萬世師表).\n\n\n== Family background ==\n\nAccording to tradition, three generations before Confucius' time, his ancestors had migrated from the Song state to the Lu state. Confucius was a descendant of the Shang dynasty Kings through the Dukes of Song.\n\n\n== Biography ==\n\n\n=== Early life ===\n\nIt is generally thought that Confucius was born on September 28, 551 BC. His birthplace was in Zou, Lu state (near present-day Qufu, Shandong Province). His father Kong He (孔紇), also known as Shuliang He (叔梁紇), was an officer in the Lu military. Kong died when Confucius was three years old, and Confucius was raised by his mother Yan Zhengzai (顏徵在) in poverty. His mother would later die at less than 40 years of age. At age 19 he married his wife Qiguan (亓官), and a year later the couple had their first child, Kong Li (孔鯉). Qiguan and Confucius would later have two daughters together, one of whom is thought to have died early in her life as a child.\nConfucius was educated at schools for commoners, where he studied and learned the Six Arts.\nConfucius was born into the class of shi (士), between the aristocracy and the common people. He is said to have worked in various government jobs during his early 20s, and also worked as a bookkeeper and a caretaker of sheep and horses, which he used the proceeds from to give his mother a proper burial. When his mother died, Confucius (aged 23) is said to have mourned for three years, as was the tradition.\n\n\n=== Political career ===\n\nThe Lu state was headed by a ruling ducal house. Under the duke were three aristocratic families, whose heads bore the title of viscount and held hereditary positions in the Lu bureaucracy. The Ji family held the position \"Minister over the Masses\", who was also the \"Prime Minister\"; the Meng family held the position \"Minister of Works\"; and the Shu family held the position \"Minister of War\". In the winter of 505 BC, Yang Hu—a retainer of the Ji family—rose up in rebellion and seized power from the Ji family. However, by the summer of 501 BC, the three hereditary families had succeeded in expelling Yang Hu from Lu. By then, Confucius had built up a considerable reputation through his teachings, while the families came to see the value of proper conduct and righteousness, so they could achieve loyalty to a legitimate government. Thus, that year (501 BC), Confucius came to be appointed to the minor position of governor of a town. Eventually, he rose to the position of Minister of Crime.\nConfucius desired to return the authority of the state to the duke by dismantling the fortifications of the city—strongholds belonging to the three families. This way, he could establish a centralized government. However, Confucius relied solely on diplomacy as he had no military authority himself. In 500 BC, Hou Fan—the governor of Hou—revolted against his lord of the Shu family. Although the Meng and Shu families unsuccessfully besieged Hou, a loyalist official rose up with the people of Hou and forced Hou Fan to flee to the Qi state. The situation may have been in favor for Confucius as this likely made it possible for Confucius and his disciples to convince the aristocratic families to dismantle the fortifications of their cities. Eventually, after a year and a half, Confucius and his disciples succeeded in convincing the Shu family to raze the walls of Hou, the Ji family in razing the walls of Bi, and the Meng family in razing the walls of Cheng. First, the Shu family led an army towards their city Hou and tore down its walls in 498 BC. Soon thereafter, Gongshan Furao—a retainer of the Ji family—revolted and took control of the forces at Bi. He immediately launched an attack and entered the capital Lu.\nEarlier, Gongshan had approached Confucius to join him, which Confucius considered. Even though he disapproved the use of a violent revolution, the Ji family dominated the Lu state force for generations and had exiled the previous duke. Although he wanted the opportunity to put his principles into practice, Confucius gave up on this idea in the end. Creel (1949) states that, unlike the rebel Yang Hu before him, Gongshan may have sought to destroy the three hereditary families and restore the power of the duke. However, Dubs (1946) is of the view that Gongshan was encouraged by Viscount Ji Huan to invade the Lu capital in an attempt to avoid dismantling the Bi fortified walls. Whatever the situation may have been, Gongshan was considered an upright man who continued to defend the state of Lu, even after he was forced to flee.\nDuring the revolt by Gongshan, Zhong You (仲由) had managed to keep the duke and the three viscounts together at the court. Zhong You was one of the disciples of Confucius and Confucius had arranged for him to be given the position of governor by the Ji family. When Confucius heard of the raid, he requested that Viscount Ji Huan allow the duke and his court to retreat to a stronghold on his palace grounds. Thereafter, the heads of the three families and the duke retreated to the Ji's palace complex and ascended the Wuzi Terrace. Confucius ordered two officers to lead an assault against the rebels. At least one of the two officers was a retainer of the Ji family, but they were unable to refuse the orders while in the presence of the duke, viscounts, and court. The rebels were pursued and defeated at Gu. Immediately after the revolt was defeated, the Ji family razed the Bi city walls to the ground.\nThe attackers retreated after realizing that they would have to become rebels against the state and against their own lord. Through Confucius' actions, the Bi officials had inadvertently revolted against their own lord, thus forcing Viscount Ji Huan's hand in having to dismantle the walls of Bi (as it could have harbored such rebels) or confess to instigating the event by going against proper conduct and righteousness as an official. Dubs (1949) suggests that the incident brought to light Confucius' foresight, practical political ability, and insight into human character.\nWhen it was time to dismantle the city walls of the Meng family, the governor was reluctant to have his city walls torn down and convinced the head of the Meng family not to do so. The Zuo Zhuan recalls that the governor advised against razing the walls to the ground as he said that it made Cheng vulnerable to the Qi state and cause the destruction of the Meng family. Even though Viscount Meng Yi gave his word not to interfere with an attempt, he went back on his earlier promise to dismantle the walls.\nLater in 498 BC, Duke Ding personally went with an army to lay siege to Cheng in an attempt to raze its walls to the ground, but he did not succeed. Thus, Confucius could not achieve the idealistic reforms that he wanted including restoration of the legitimate rule of the duke. He had made powerful enemies within the state, especially with Viscount Ji Huan, due to his successes so far. According to accounts in the Zuo Zhuan and Shiji, Confucius departed his homeland in 497 BC after his support for the failed attempt of dismantling the fortified city walls of the powerful Ji, Meng, and Shu families. He left the state of Lu without resigning, remaining in self-exile and unable to return as long as Viscount Ji Huan was alive.\n\n\n=== Exile ===\nThe Shiji states that the neighboring Qi state was worried that Lu was becoming too powerful while Confucius was involved in the government of the Lu state. According to this account, Qi decided to sabotage Lu's reforms by sending 100 good horses and 80 beautiful dancing girls to the duke of Lu. The duke indulged himself in pleasure and did not attend to official duties for three days. Confucius was deeply disappointed and resolved to leave Lu and seek better opportunities, yet to leave at once would expose the misbehavior of the duke and therefore bring public humiliation to the ruler Confucius was serving. Confucius therefore waited for the duke to make a lesser mistake. Soon after, the duke neglected to send to Confucius a portion of the sacrificial meat that was his due according to custom, and Confucius seized upon this pretext to leave both his post and the Lu state.\nAfter Confucius' resignation, he began a long journey or set of journeys around the small kingdoms of north-east and central China, traditionally including the states of Wei, Song, Chen, and Cai. At the courts of these states, he expounded his political beliefs but did not see them implemented.\n\n\n=== Return home ===\nAccording to the Zuo Zhuan, Confucius returned home to his native Lu when he was 68, after he was invited to do so by Ji Kangzi, the chief minister of Lu. The Analects depict him spending his last years teaching 72 or 77 disciples and transmitting the old wisdom via a set of texts called the Five Classics.\nDuring his return, Confucius sometimes acted as an advisor to several government officials in Lu, including Ji Kangzi, on matters including governance and crime.\n\n\n== Philosophy ==\n\nAlthough Confucianism is often followed in a religious manner by the Chinese, many argue that its values are secular and that it is therefore less a religion than a secular morality. Proponents argue, however, that despite the secular nature of Confucianism's teachings, it is based on a worldview that is religious. Confucianism discusses elements of the afterlife and views concerning Heaven, but it is relatively unconcerned with some spiritual matters often considered essential to religious thought, such as the nature of souls. However, Confucius is said to have believed in astrology, saying: \"Heaven sends down its good or evil symbols and wise men act accordingly\".\n\nIn the Analects, Confucius presents himself as a \"transmitter who invented nothing\". He puts the greatest emphasis on the importance of study, and it is the Chinese character for study (學) that opens the text. Far from trying to build a systematic or formalist theory, he wanted his disciples to master and internalize older classics, so that their deep thought and thorough study would allow them to relate the moral problems of the present to past political events (as recorded in the Annals) or the past expressions of commoners' feelings and noblemen's reflections (as in the poems of the Book of Odes).\n\n\n=== Ethics ===\nOne of the deepest teachings of Confucius may have been the superiority of personal exemplification over explicit rules of behavior. His moral teachings emphasized self-cultivation, emulation of moral exemplars, and the attainment of skilled judgment rather than knowledge of rules. Confucian ethics may therefore be considered a type of virtue ethics. His teachings rarely rely on reasoned argument and ethical ideals and methods are conveyed more indirectly, through allusion, innuendo, and even tautology. His teachings require examination and context in order to be understood. A good example is found in this famous anecdote:\n\n廄焚。子退朝，曰：“傷人乎？” 不問馬。\nWhen the stables were burnt down, on returning from court Confucius said, \"Was anyone hurt?\" He did not ask about the horses.\n\nAnalects X.11 (tr. Waley), 10–13 (tr. Legge), or X-17 (tr. Lau)\n\nBy not asking about the horses, Confucius demonstrates that the sage values human beings over property; readers are led to reflect on whether their response would follow Confucius' and to pursue self-improvement if it would not have. Confucius, as an exemplar of human excellence, serves not as an all-powerful deity or a universally true set of abstract principles, but rather the ultimate model for others. For these reasons, according to many commentators, Confucius' teachings may be considered a Chinese example of humanism.\nOne of his teachings was a variant of the Golden Rule, sometimes called the \"Silver Rule\" owing to its negative form:\n\n己所不欲，勿施於人。\n\"What you do not wish for yourself, do not do to others.\"\n\n子貢問曰：“有一言而可以終身行之者乎？”子曰：“其恕乎！己所不欲、勿施於人。”\nZi Gong [a disciple] asked: \"Is there any one word that could guide a person throughout life?\"\nThe Master replied: \"How about 'reciprocity'! Never impose on others what you would not choose for yourself.\"\n\nAnalects XV.24, tr. David Hinton\n\nOften overlooked in Confucian ethics are the virtues to the self: sincerity and the cultivation of knowledge. Virtuous action towards others begins with virtuous and sincere thought, which begins with knowledge. A virtuous disposition without knowledge is susceptible to corruption, and virtuous action without sincerity is not true righteousness. Cultivating knowledge and sincerity is also important for one's own sake; the superior person loves learning for the sake of learning and righteousness for the sake of righteousness.\nThe Confucian theory of ethics as exemplified in Lǐ (禮) is based on three important conceptual aspects of life: (a) ceremonies associated with sacrifice to ancestors and deities of various types, (b) social and political institutions, and (c) the etiquette of daily behavior. It was believed by some that lǐ originated from the heavens, but Confucius stressed the development of lǐ through the actions of sage leaders in human history. His discussions of lǐ seem to redefine the term to refer to all actions committed by a person to build the ideal society, rather than those simply conforming with canonical standards of ceremony.\nIn the early Confucian tradition, lǐ was doing the proper thing at the proper time, balancing between maintaining existing norms to perpetuate an ethical social fabric, and violating them in order to accomplish ethical good. Training in the lǐ of past sages cultivates in people virtues that include ethical judgment about when lǐ must be adapted in light of situational contexts.\nIn Confucianism, the concept of li is closely related to yì (義), which is based upon the idea of reciprocity. Yì can be translated as righteousness, though it may simply mean what is ethically best to do in a certain context. The term contrasts with action done out of self-interest. While pursuing one's own self-interest is not necessarily bad, one would be a better, more righteous person if one's life was based upon following a path designed to enhance the greater good. Thus an outcome of yì is doing the right thing for the right reason.\nJust as action according to Lǐ should be adapted to conform to the aspiration of adhering to yì, so yì is linked to the core value of rén (仁).Rén consists of 5 basic virtues: seriousness, generosity, sincerity, diligence and kindness. Rén is the virtue of perfectly fulfilling one's responsibilities toward others, most often translated as \"benevolence\" or \"humaneness\"; translator Arthur Waley calls it \"Goodness\" (with a capital G), and other translations that have been put forth include \"authoritativeness\" and \"selflessness.\" Confucius' moral system was based upon empathy and understanding others, rather than divinely ordained rules. To develop one's spontaneous responses of rén so that these could guide action intuitively was even better than living by the rules of yì. Confucius asserts that virtue is a means between extremes. For example, the properly generous person gives the right amount—not too much and not too little.\n\n\n=== Politics ===\nConfucius' political thought is based upon his ethical thought. He argued that the best government is one that rules through \"rites\" (lǐ) and people's natural morality, and not by using bribery and coercion. He explained that this is one of the most important analects: \"If the people be led by laws, and uniformity sought to be given them by punishments, they will try to avoid the punishment, but have no sense of shame. If they be led by virtue, and uniformity sought to be given them by the rules of propriety, they will have the sense of the shame, and moreover will become good.\" (Translated by James Legge) in the Great Learning (大學). This \"sense of shame\" is an internalisation of duty, where the punishment precedes the evil action, instead of following it in the form of laws as in Legalism.\nConfucius looked nostalgically upon earlier days, and urged the Chinese, particularly those with political power, to model themselves on earlier examples. In times of division, chaos, and endless wars between feudal states, he wanted to restore the Mandate of Heaven (天命) that could unify the \"world\" (天下, \"all under Heaven\") and bestow peace and prosperity on the people. Because his vision of personal and social perfections was framed as a revival of the ordered society of earlier times, Confucius is often considered a great proponent of conservatism, but a closer look at what he proposes often shows that he used (and perhaps twisted) past institutions and rites to push a new political agenda of his own: a revival of a unified royal state, whose rulers would succeed to power on the basis of their moral merits instead of lineage. These would be rulers devoted to their people, striving for personal and social perfection, and such a ruler would spread his own virtues to the people instead of imposing proper behavior with laws and rules.\nConfucius did not believe in the concept of \"democracy\", which is itself an Athenian concept unknown in ancient China, but could be interpreted by Confucius' principles recommending against individuals electing their own political leaders to govern them, or that anyone is capable of self-government. He expressed fears that the masses lacked the intellect to make decisions for themselves, and that, in his view, since not everyone is created equal, not everyone has a right of self-government.\nWhile he supported the idea of government ruling by a virtuous king, his ideas contained a number of elements to limit the power of rulers. He argued for representing truth in language, and honesty was of paramount importance. Even in facial expression, truth must always be represented. Confucius believed that if a ruler were to lead correctly, by action, that orders would be deemed unnecessary in that others will follow the proper actions of their ruler. In discussing the relationship between a king and his subject (or a father and his son), he underlined the need to give due respect to superiors. This demanded that the subordinates must give advice to their superiors if the superiors were considered to be taking the course of action that was wrong. Confucius believed in ruling by example, if you lead correctly, orders by force or punishment isn't necessary.\n\n\n== Disciples ==\n\nThere is not much known of Confucius' disciples and a little over half of them had their surnames recorded in the Zuo Zhuan. The Analects records 22 names that are most likely Confucius' disciples, while the Mencius records 24 names, although it is quite certain that there have been many more disciples whose name were not recorded. Most of Confucius' disciples were from the Lu state, while others were from neighboring states. For example, Zigong was from the Wey state and Sima Niu was from the Song state. Confucius' favorite disciple was Yan Hui, most probably one of the most impoverished of them all. Sima Niu, in contrast to Yan Hui, was from a hereditary noble family hailing from the Song state. Under Confucius' teachings, the disciples became well-learned in the principles and methods of government. He often engaged in discussion and debate with his students and gave high importance to their studies in history, poetry, and ritual. Confucius advocated loyalty to principle rather than to individual acumen, in which reform was to be achieved by persuasion rather than violence. Even though Confucius denounced them for their practices, the aristocracy was likely attracted to the idea of having trustworthy officials who were studied in morals as the circumstances of the time made it desirable. In fact, the disciple Zilu even died defending his ruler in Wei.\nYang Hu, who was a subordinate of the Ji family, had dominated the Lu government from 505 to 502 and even attempted a coup, which narrowly failed. As a likely consequence, it was after that that the first disciples of Confucius were appointed to government positions. A few of Confucius' disciples went on to attain official positions of some importance, some of which were arranged by Confucius. By the time Confucius was 50 years old, the Ji family had consolidated their power in the Lu state over the ruling ducal house. Even though the Ji family had practices with which Confucius disagreed and disapproved, they nonetheless gave Confucius' disciples many opportunities for employment. Confucius continued to remind his disciples to stay true to their principles and renounced those who did not, all the while being openly critical of the Ji family.\n\n\n== Legacy ==\nConfucius' teachings were later turned into an elaborate set of rules and practices by his numerous disciples and followers, who organized his teachings into the Analects. Confucius' disciples and his only grandson, Zisi, continued his philosophical school after his death. These efforts spread Confucian ideals to students who then became officials in many of the royal courts in China, thereby giving Confucianism the first wide-scale test of its dogma.\nTwo of Confucius' most famous later followers emphasized radically different aspects of his teachings. In the centuries after his death, Mencius (孟子) and Xun Zi (荀子) both composed important teachings elaborating in different ways on the fundamental ideas associated with Confucius. Mencius (4th century BC) articulated the innate goodness in human beings as a source of the ethical intuitions that guide people towards rén, yì, and lǐ, while Xun Zi (3rd century BC) underscored the realistic and materialistic aspects of Confucian thought, stressing that morality was inculcated in society through tradition and in individuals through training. In time, their writings, together with the Analects and other core texts came to constitute the philosophical corpus of Confucianism.\nThis realignment in Confucian thought was parallel to the development of Legalism, which saw filial piety as self-interest and not a useful tool for a ruler to create an effective state. A disagreement between these two political philosophies came to a head in 223 BC when the Qin state conquered all of China. Li Si, Prime Minister of the Qin Dynasty convinced Qin Shi Huang to abandon the Confucians' recommendation of awarding fiefs akin to the Zhou Dynasty before them which he saw as being against to the Legalist idea of centralizing the state around the ruler. When the Confucian advisers pressed their point, Li Si had many Confucian scholars killed and their books burned—considered a huge blow to the philosophy and Chinese scholarship.\nUnder the succeeding Han Dynasty and Tang dynasty, Confucian ideas gained even more widespread prominence. Under Wudi, the works of Confucius were made the official imperial philosophy and required reading for civil service examinations in 140 BC which was continued nearly unbroken until the end of the 19th century. As Moism lost support by the time of the Han, the main philosophical contenders were Legalism, which Confucian thought somewhat absorbed, the teachings of Laozi, whose focus on more spiritual ideas kept it from direct conflict with Confucianism, and the new Buddhist religion, which gained acceptance during the Southern and Northern Dynasties era. Both Confucian ideas and Confucian-trained officials were relied upon in the Ming Dynasty and even the Yuan Dynasty, although Kublai Khan distrusted handing over provincial control to them.\nDuring the Song dynasty, the scholar Zhu Xi (AD 1130–1200) added ideas from Daoism and Buddhism into Confucianism. In his life, Zhu Xi was largely ignored, but not long after his death his ideas became the new orthodox view of what Confucian texts actually meant. Modern historians view Zhu Xi as having created something rather different, and call his way of thinking Neo-Confucianism. Neo-Confucianism held sway in China, Japan, Korea and Vietnam until the 19th century.\n\nThe works of Confucius were translated into European languages through the agency of Jesuit scholars stationed in China. Matteo Ricci started to report on the thoughts of Confucius, and father Prospero Intorcetta published the life and works of Confucius into Latin in 1687. It is thought that such works had considerable importance on European thinkers of the period, particularly among the Deists and other philosophical groups of the Enlightenment who were interested by the integration of the system of morality of Confucius into Western civilization.\nIn the modern era Confucian movements, such as New Confucianism, still exist but during the Cultural Revolution, Confucianism was frequently attacked by leading figures in the Communist Party of China. This was partially a continuation of the condemnations of Confucianism by intellectuals and activists in the early 20th century as a cause of the ethnocentric close-mindedness and refusal of the Qing Dynasty to modernize that led to the tragedies that befell China in the 19th century.\nConfucius' works are studied by scholars in many other Asian countries, particularly those in the Chinese cultural sphere, such as Korea, Japan and Vietnam. Many of those countries still hold the traditional memorial ceremony every year.\nThe Ahmadiyya Muslim Community believes Confucius was a Divine Prophet of God, as were Lao-Tzu and other eminent Chinese personages.\nIn modern times, Asteroid 7853, \"Confucius\", was named after the Chinese thinker.\n\n\n== Visual portraits ==\nNo contemporary painting or sculpture of Confucius survives, and it was only during the Han Dynasty that he was portrayed visually. Carvings often depict his legendary meeting with Laozi. Since that time there have been many portraits of Confucius as the ideal philosopher.\nIn former times, it was customary to have a portrait in Confucius Temples; however, during the reign of Hongwu Emperor (Taizu) of the Ming dynasty it was decided that the only proper portrait of Confucius should be in the temple in his home town, Qufu in Shandong. In other temples, Confucius is represented by a memorial tablet. In 2006, the China Confucius Foundation commissioned a standard portrait of Confucius based on the Tang dynasty portrait by Wu Daozi.\n\n\n== Death and legacy ==\n\nBurdened by the loss of both his son and his favorite disciples, he died at the age of 71 or 72. He died from natural causes. Confucius was buried in Kong Lin cemetery which lies in the historical part of Qufu in the Shandong Province. The original tomb erected there in memory of Confucius on the bank of the Sishui River had the shape of an axe. In addition, it has a raised brick platform at the front of the memorial for offerings such as sandalwood incense and fruit.\n\n\n=== Memorials of Confucius ===\nSoon after Confucius' death, Qufu, his home town, became a place of devotion and remembrance. The Han dynasty Records of the Grand Historian records that it had already become a place of pilgrimage for ministers. It is still a major destination for cultural tourism, and many people visit his grave and the surrounding temples. In pan-China cultures, there are many temples where representations of the Buddha, Laozi and Confucius are found together. There are also many temples dedicated to him, which have been used for Confucian ceremonies.\nThe Chinese have a tradition of holding spectacular memorial ceremonies of Confucius (祭孔) every year, using ceremonies that supposedly derived from Zhou Li (周禮) as recorded by Confucius, on the date of Confucius' birth. This tradition was interrupted for several decades in mainland China, where the official stance of the Communist Party and the State was that Confucius and Confucianism represented reactionary feudalist beliefs which held that the subservience of the people to the aristocracy is a part of the natural order. All such ceremonies and rites were therefore banned. Only after the 1990s did the ceremony resume. As it is now considered a veneration of Chinese history and tradition, even Communist Party members may be found in attendance.\nIn Taiwan, where the Nationalist Party (Kuomintang) strongly promoted Confucian beliefs in ethics and behavior, the tradition of the memorial ceremony of Confucius (祭孔) is supported by the government and has continued without interruption. While not a national holiday, it does appear on all printed calendars, much as Father's Day does in the West.\nIn South Korea a grand-scale memorial ceremony called Seokjeon Daeje is held twice a year on Confucius' birthday and the anniversary of his death, at Confucian academies across the country and Sungkyunkwan in Seoul.\n\n\n=== Descendants ===\n\nConfucius' descendants were repeatedly identified and honored by successive imperial governments with titles of nobility and official posts. They were honored with the rank of a marquis thirty-five times since Gaozu of the Han Dynasty, and they were promoted to the rank of duke forty-two times from the Tang dynasty to the Qing Dynasty. Emperor Xuanzong of Tang first bestowed the title of \"Duke Wenxuan\" on Kong Suizhi of the 35th generation. In 1055, Emperor Renzong of Song first bestowed the title of \"Duke Yansheng\" on Kong Zongyuan of the 46th generation.\nDuring the Southern Song dynasty the Duke Yansheng Kong Duanyou fled south with the Song Emperor to Quzhou in Zhejiang, while the newly established Jin dynasty (1115–1234) in the north appointed Kong Duanyou's brother Kong Duancao who remained in Qufu as Duke Yansheng. From that time up until the Yuan dynasty, there were two Duke Yanshengs, one in the north in Qufu and the other in the south at Quzhou. An invitation to come back to Qufu was extended to the southern Duke Yansheng Kong Zhu by the Yuan dynasty Emperor Kublai Khan. The title was taken away from the southern branch after Kong Zhu rejected the invitation, so the northern branch of the family kept the title of Duke Yansheng. The southern branch still remained in Quzhou where they lived to this day. Confucius's descendants in Quzhou alone number 30,000. The Hanlin Academy rank of Wujing boshi 五經博士 was awarded to the southern branch at Quzhou by a Ming Emperor while the northern branch at Qufu held the title Duke Yansheng. The leader of the southern branch is 孔祥楷 Kong Xiangkai.\nDuring the Yuan dynasty, one of Confucius' descendants, who was one of the Duke Yansheng Kong Huan's 孔浣 sons, named Kong Shao 孔紹, moved from China to Goryeo era Korea and established a branch of the family there after wedding a Korean woman (Jo Jin-gyeong's 曹晉慶 daughter) during Toghon Temür's rule. This branch of the family received aristocratic rank in Joseon era Korea. 曲阜孔氏 (朝鲜半岛) 곡부 공씨\nDespite repeated dynastic change in China, the title of Duke Yansheng was bestowed upon successive generations of descendants until it was abolished by the Nationalist Government in 1935. The last holder of the title, Kung Te-cheng of the 77th generation, was appointed Sacrificial Official to Confucius. Kung Te-cheng died in October 2008, and his son, Kung Wei-yi, the 78th lineal descendant, had died in 1989. Kung Te-cheng's grandson, Kung Tsui-chang, the 79th lineal descendant, was born in 1975; his great-grandson, Kung Yu-jen, the 80th lineal descendant, was born in Taipei on January 1, 2006. Te-cheng's sister, Kong Demao, lives in mainland China and has written a book about her experiences growing up at the family estate in Qufu. Another sister, Kong Deqi, died as a young woman. Many descendants of Confucius still live in Qufu today.\nA descendant of Confucius, H. H. Kung was the Premier of the Republic of China. One of his sons, Kong Lingjie 孔令傑 married Debra Paget who gave birth to Gregory Kung (孔德基).\nConfucius' family, the Kongs, have the longest recorded extant pedigree in the world today. The father-to-son family tree, now in its 83rd generation, has been recorded since the death of Confucius. According to the Confucius Genealogy Compilation Committee, he has 2 million known and registered descendants, and there are an estimated 3 million in all. Of these, several tens of thousands live outside of China. In the 14th century, a Kong descendant went to Korea, where an estimated 34,000 descendants of Confucius live today. One of the main lineages fled from the Kong ancestral home in Qufu during the Chinese Civil War in the 1940s, and eventually settled in Taiwan. There are also branches of the Kong family who have converted to Islam after marrying Muslim women, in Dachuan in Gansu province in the 1800s, and in 1715 in Xuanwei city in Yunnan province. Many of the Muslim Confucius descendants are descended from the marriage of Ma Jiaga (马甲尕), a Muslim woman, and Kong Yanrong (孔彦嵘), 59th generation descendant of Confucius in the year 1480 and are found among the Hui and Dongxiang peoples. The new genealogy includes the Muslims. Kong Dejun (孔德軍) is a prominent Islamic scholar and Arabist from Qinghai province and a 77th generation descendant of Confucius.\nBecause of the huge interest in the Confucius family tree, there was a project in China to test the DNA of known family members of the collateral branches in mainland China. Among other things, this would allow scientists to identify a common Y chromosome in male descendants of Confucius. If the descent were truly unbroken, father-to-son, since Confucius' lifetime, the males in the family would all have the same Y chromosome as their direct male ancestor, with slight mutations due to the passage of time. The aim of the genetic test was the help members of collateral branches in China who lost their genealogical records to prove their descent. However, in 2009, many of the collateral branches decided not to agree to DNA testing. Bryan Sykes, professor of genetics at Oxford University, understands this decision: \"The Confucius family tree has an enormous cultural significance,\" he said. \"It's not just a scientific question.\" The DNA testing was originally proposed to add new members, many of whose family record books were lost during 20th-century upheavals, to the Confucian family tree. The main branch of the family which fled to Taiwan was never involved in the proposed DNA test at all.\nIn 2013 a DNA test performed on multiple different families who claimed descent from Confucius found that they shared the same Y chromosome as reported by Fudan University.\nThe fifth and most recent edition of the Confucius genealogy was printed by the Confucius Genealogy Compilation Committee (CGCC). It was unveiled in a ceremony at Qufu on September 24, 2009. Women are now included for the first time.\nThere is also a \"Sacrificial Official to Mencius\" for a descendant of Mencius, a \"Sacrificial Official to Zengzi\" for a descendant of Zengzi, and a \"Sacrificial Official to Yan Hui\" for a descendant of Yan Hui.\nThe descendants of Confucius still use generation poems for their names given to them by the Ming dynasty and Qing dyasty Emperors along with the descendants of the other Four Sages 四氏, Mencius, Zengzi, and Yan Hui.\n\n\n== See also ==\n\nClassic of Poetry\nConfucius Institute\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n=== References ===\nAhmad, Mirza Tahir (n.d.). \"Confucianism\". Ahmadiyya Muslim Community. Retrieved 7 November 2010. \nBonevac, Daniel; Phillips, Stephen (2009). Introduction to world philosophy. New York: Oxford University Press. ISBN 978-0-19-515231-9. \nCreel, Herrlee Glessner (1949). Confucius: The man and the myth. New York: John Day Company. \nDubs, Homer H. (1946). \"The political career of Confucius\". Journal of the American Oriental Society. 66 (4): 273–282. JSTOR 596405. \nHobson, John M. (2004). The Eastern origins of Western civilisation (Reprinted ed.). Cambridge: Cambridge University Press. ISBN 0-521-54724-5. \nChin, Ann-ping (2007). The authentic Confucius: A life of thought and politics. New York: Scribner. ISBN 978-0-7432-4618-7. \n\"Confucius descendents say DNA testing plan lacks wisdom\". Bandao. 21 August 2007. \n\"Confucius family tree to record female kin\". China Daily. 2 February 2007. \n\"Confucius' Family Tree Recorded biggest\". China Daily. 24 September 2009. \n\"Confucius family tree revision ends with 2 mln descendants\". China Economic Net. 4 January 2009. \nKong, Demao; Ke, Lan; Roberts, Rosemary (1988). The house of Confucius (Translated ed.). London: Hodder & Stoughton. ISBN 978-0-340-41279-4. \n\"DNA Testing Adopted to Identify Confucius Descendants\". China Internet Information Center. 19 June 2006. \n\"DNA test to clear up Confucius confusion\". Ministry of Commerce of the People's Republic of China. 18 June 2006. \nParker, John (1977). Windows into China: The Jesuits and their books, 1580–1730. Boston: Trustees of the Public Library of the City of Boston. ISBN 0-89073-050-4. \nPhan, Peter C. (2012). \"Catholicism and Confucianism: An intercultural and interreligious dialogue\". Catholicism and interreligious dialogue. New York: Oxford University Press. ISBN 978-0-19-982787-9. \nRainey, Lee Dian (2010). Confucius & Confucianism: The essentials. Oxford: Wiley-Blackwell. ISBN 978-1-4051-8841-8. \nRiegel, Jeffrey K. (1986). \"Poetry and the legend of Confucius's exile\". Journal of the American Oriental Society. 106 (1). JSTOR 602359. \nRiegel, Jeffrey (2012). \"Confucius\". The Stanford Encyclopedia of Philosophy. Stanford University. \nQiu, Jane (13 August 2008). \"Inheriting Confucius\". Seed Magazine. \nYan, Liang (16 February 2008). \"Updated Confucius family tree has two million members\". Xinhua. \nYao, Xinzhong (1997). Confucianism and Christianity: A Comparative Study of Jen and Agape. Brighton: Sussex Academic Press. ISBN 1-898723-76-1. \nYao, Xinzhong (2000). An Introduction to Confucianism. Cambridge: Cambridge University Press. ISBN 0-521-64430-5. \nZhou, Jing (31 October 2008). \"New Confucius Genealogy out next year\". China Internet Information Center. \n\n\n== Further reading ==\nClements, Jonathan (2008). Confucius: A Biography. Stroud, Gloucestershire, England: Sutton Publishing. ISBN 978-0-7509-4775-6.\nConfucius (1997). Lun yu, (in English The Analects of Confucius). Translation and notes by Simon Leys. New York: W.W. Norton. ISBN 0-393-04019-4.\nConfucius (2003). Confucius: Analects—With Selections from Traditional Commentaries. Translated by E. Slingerland. Indianapolis: Hackett Publishing. (Original work published c. 551–479 BC) ISBN 0-87220-635-1.\nCreel, Herrlee Glessner (1949). Confucius and the Chinese Way. New York: Harper.\nCreel, Herrlee Glessner (1953). Chinese Thought from Confucius to Mao Tse-tung. Chicago: University of Chicago Press. \nCsikszentmihalyi, M. (2005). \"Confucianism: An Overview\". In Encyclopedia of Religion (Vol. C, pp 1890–1905). Detroit: MacMillan Reference USA.\nDawson, Raymond (1982). Confucius. Oxford: Oxford University Press. ISBN 0-19-287536-1. \nFingarette, Hebert (1998). Confucius : the secular as sacred. Long Grove, Ill.: Waveland Press. ISBN 1-57766-010-2. \nNivison, David Shepherd (1999). \"The Classical Philosophical Writings – Confucius\". In Loewe, Michael; Shaughnessy, Edward. The Cambridge History of Ancient China. Cambridge: Cambridge University Press. pp. 752–59. ISBN 0-521-47030-7. \nNylan, Michael and Thomas A. Wilson (2010). Lives of Confucius: Civilization's Greatest Sage through the Ages. ISBN 9780385510691. \nSsu-ma Ch'ien (1974). Records of the Historian. Yang Hsien-yi and Gladys Yang, trans. Hong Kong: Commercial Press. \nVan Norden, B.W., ed. (2001). Confucius and the Analects: New Essays. New York: Oxford University Press. ISBN 0-19-513396-X.\nVan Norden, B.W., trans. (2006). Mengzi, in Philip J. Ivanhoe & B.W. Van Norden, Readings in Classical Chinese Philosophy. 2nd ed. Indianapolis: Hackett Publishing. ISBN 0-87220-780-3.\n\n\n== External links ==\n\"Confucius\". Internet Encyclopedia of Philosophy. \n\nConfucius on In Our Time at the BBC. (listen now)\nMultilingual web site on Confucius and the Analects\nThe Dao of Kongzi, introduction to the thought of Confucius.\nRiegel, Jeffrey. \"Confucius\". Stanford Encyclopedia of Philosophy. \nWorks by Confucius at Project Gutenberg\nWorks by or about Confucius at Internet Archive\nWorks by Confucius at LibriVox (public domain audiobooks) \nConfucian Analects (Project Gutenberg release of James Legge's Translation)\nCore philosophical passages in the Analects of Confucius.", "ns": 0, "pageid": 5823, "title": "Confucius"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}