{"batchcomplete": "", "query": {"normalized": [{"to": "Cora Diamond", "from": "Cora_Diamond"}], "pages": {"3158676": {"extract": "Cora Diamond (born 1937) is an American philosopher who works on Ludwig Wittgenstein, Gottlob Frege, moral philosophy, political philosophy, philosophy of language, and philosophy and literature. She is currently the Kenan Professor of Philosophy Emerita at the University of Virginia.\n\n\n== Work ==\nOne of Diamond's most famous articles, What Nonsense Might Be, criticizes the way that the logical positivists think about nonsense on Fregean grounds (See category mistake). Another well-known article, Eating Meat and Eating People, examines the rhetorical and philosophical nature of contemporary attitudes towards animal rights. Diamond's writings on both \"early\" (Tractatus Logico-Philosophicus era) and \"late\" (Philosophical Investigations era) Wittgenstein have made her a leading influence in the New Wittgenstinian approach advanced by Alice Crary, James F. Conant, and others.\nDiamond has published a collection of essays titled The Realistic Spirit: Wittgenstein, Philosophy, and the Mind. She is the editor of Wittgenstein's Lectures on the Foundations of Mathematics: Cambridge 1939, a collection of lectures assembled from the notes of Wittgenstein's students Norman Malcolm, Rush Rhees, Yorick Smythies, and R.G. Bosanquet.\nWittgenstein and the Moral Life: Essays in Honor of Cora Diamond (edited by Alice Crary) features essays by Crary, John McDowell, Martha Nussbaum, Stanley Cavell, and James F. Conant, among others.\nDiamond received her BA from Swarthmore College in 1957 and her BPhil from St Hugh's College, Oxford in 1961.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nDiamond's home page at UVa\nAn interview with Diamond from 2000 (pdf)\nEating Meat and Eating People (pdf)", "ns": 0, "pageid": 3158676, "title": "Cora Diamond"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}