{"batchcomplete": "", "query": {"normalized": [{"to": "Damon Young", "from": "Damon_Young"}], "pages": {"17435692": {"extract": "Damon Young (born 1975 in Melbourne, Victoria) is an Australian philosopher, writer and commentator, and author of the books Distraction, Philosophy in the Garden and How to Think About Exercise. He is an Honorary Fellow in Philosophy at the University of Melbourne.\n\n\n== Work ==\nIn 2013 Young won the Australasian Association of Philosophy's media prize for his public writing and broadcasting.\nYoung is the author of Distraction, an eclectic popular history of Western philosophy, focusing on themes such as attention to life and distraction from it, work, freedom and necessity. The Australian called it lacking in precision, saying its \"central proposition -- that new information technologies distract us from our common existential challenge -- is never thoroughly probed\" while London's Financial Times called it \"lucid and optimistic\".\nPhilosophy in the Garden, published in Australia in December 2012, was described by The Australian as \"fluent and stylish and never marred by cliches or cliched thinking\". It was published in the UK in April 2014 by Rider, an imprint of Random House, under the title Voltaire's Vine and Other Philosophies: How Gardens Inspired Great Writers.\nYoung's columns, reviews and features have been published in The Age, The Sydney Morning Herald, The Australian, Herald-Sun, BBC and ABC. He has written poetry and fiction for Overland and Meanjin magazines.\nYoung regularly comments on radio, and has appeared on Channel 7 'Sunrise' and ABC TV. He was a regular panellist on ABC Radio National's 'Life Matters', a monthly guest on \"Mornings\" with Alan Brough on ABC 774, and was 'philosopher-in-residence' on \"Afternoons\" with James Valentine on ABC Sydney 702, and \"sports philosopher\" with Francis Leach on SEN 1116.\n\n\n== Selected works ==\nA full list of Young's published works and media appearances can be found at his website.\n\n\n=== Books ===\nPhilosophy in the Garden. Melbourne University Publishing, 2012 (Australian edition). ISBN 978-0-52285-713-9.\nDistraction. Melbourne University Publishing, 2008 (Australian edition). ISBN 978-0-522-85374-2; Acumen Publishing, 2010 (UK/US edition). ISBN 978-1-84465-254-9.\nMartial Arts and Philosophy, edited with Graham Priest, Open Court Publishing, 2010. ISBN 978-0-8126-9684-4.\nHow To Think About Exercise, Macmillan Publishers, 2014. ISBN 978-0-2307-6776-8.\nThe Art of Reading. Melbourne University Publishing, 2016. ISBN 978-0-522-867602\n\n\n=== Essays and opinion ===\n'Familiarity breeds content for grand old gallery's loyal patrons', The Age (21/4/11), p. 13.\n'Super-rich exceptions are closer to being the rule', Sydney Morning Herald, News Review (2/4/11), p. 16.\n'Research the name of the game', The Australian, Higher Education (2/3/11), p. 5.\n'Legalizing mixed martial arts in New York', New York Daily News (16/1/11), p. 13.\n'Turn video games into more than child's play', Sydney Morning Herald (14/1/11), p. 9\n'The crisis and the cure', Sydney Morning Herald, News Review (1/1/11), p. 13.\n'You don't need Jesus to enjoy Christmas', Sydney Morning Herald (20/12/10), p. 7.\n\n\n=== Poetry ===\n'The Idea of a Great Gallery', Overland 179 (2005): 41.\n'Howard Watches the Oscars and Weeps With Joy', Overland 174 (2004): 124.\n\n\n=== Fiction ===\n'The Lesson', Meanjin 67 4 (2008), pp. 128–35.\n\n\n=== Recent academic essays ===\n'Bowing to Your Enemies: Courtesy, Budo and Japan', Philosophy East and West 59 2 (2009): 188-215.\n'The Fine Arts of Distinction: Bourdieu on Society and Art', The Australian and New Zealand Journal of Art 7 2 (2006).\n'Being Grateful for Being: Being, Reverence and Finitude', Sophia 44 2 (2005): 31-53.\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "ns": 0, "pageid": 17435692, "title": "Damon Young"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}