{"batchcomplete": "", "query": {"normalized": [{"to": "Dana Ward", "from": "Dana_Ward"}], "pages": {"13195327": {"extract": "Dana Ward is a professor emeritus of Political Studies at Pitzer College, where he founded and maintains the Anarchy Archives and where he taught from 1982 through 2012. He was the Executive Director of The International Society of Political Psychology from July 1998 to the Fall of 2004. Dana Ward received his BA from University of California, Berkeley, an MA in political science from The University of Chicago, and a double PhD in political science and psychology from Yale University. Ward also served on the Psychology faculty at the Claremont Graduate University. Ward taught at St. Joseph's University during Fall 1981 through Spring 1982, at Ankara University in 1986 on a Fulbright Fellowship, at the Johns Hopkins-Nanjing University Center for Chinese and American Studies, from the fall of 1990 through the spring of 1992, and at Miyazaki International College, Miyazaki, Japan, from January 1995 through January 1997.\n\n\n== Publications ==\n\"Political reasoning and cognition: a Piagetian view,\" Rosenberg, Ward and Chilton (1988). Political Reasoning and Cognition. Durham: Duke University Press. ISBN 0-8223-0856-8. \nReview of \"Emma Goldman: An Exceedingly Dangerous Woman,\" Mel Bucklin, Director, American Historical Review, October 2004, pp. 1248–49.\n\"Occupy, Resist, and Produce: Workers Take Control in Argentina\", Divergences Vol.1, 4 (November 2006)\n\"Herbert Read's Aesthetic Politics: Art and Anarchy,\" in Paraskos, ed., Michael (2007). Re-Reading Read: New Views of Herbert Read. London: Freedom Press. \n\"Alchemy in Clarens: Kropotkin and Reclus, 1877-1881.\" in New Perspectives on Anarchism. eds., Nathan Jun and Shane Wahl, Lexington Books, 2010.\n\"Anarchist Culture on the Cusp of the 20th Century\", in Without Borders or Limits: An Interdisciplinary Approach to Anarchist Studies. Edited by Jorell A. Meleéndez Badillo and Nathan J. Jun. Newcastle upon Tyne: Cambridge Scholars Publishing, 2013, pp. 107–122\n\n\n== External links ==\nHomepage at Pitzer College\nThe Anarchist Archives\nWard's Response to the 2004 Re-election of President Bush\nThe International Society of Political Psychology\nHouses designed and built by Dana Ward and family\n[1]", "ns": 0, "pageid": 13195327, "title": "Dana Ward"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}