{"batchcomplete": "", "query": {"normalized": [{"to": "Daniel Brock", "from": "Daniel_Brock"}], "pages": {"20689455": {"extract": "Daniel (Dan) W. Brock is an American philosopher, bioethicist, and professor emeritus. He is the Frances Glessner Lee Professor Emeritus of Medical Ethics in the Department of Global Health and Social Medicine at Harvard Medical School, the former Director of the Division of Medical Ethics (now the Center for Bioethics) at the Harvard Medical School, and former Director the Director of the Harvard University Program in Ethics and Health (PEH). He has held the Tillinghast Professorship at Brown University and served as a member of the Department of Clinical Bioethics at the National Institutes of Health. Brock earned his B.A. in economics from Cornell University and his Ph.D. in philosophy from Columbia University.\nDan Brock has published over 150 articles relating to bioethics and philosophy and has served on numerous editorial boards. He has also worked with various international organizations on bioethics as a consultant including the World Health Organization and has given papers and talks all over the world.\nHe was President of the American Association of Bioethics (AAB) in 1995-96, and was a founding Board Member of the American Society for Bioethics and Humanities. He is a Fellow of the Hastings Center, a bioethics research institution.\nDr. Brock is currently retired with his wife and spends his time between his Boston and New York residences.\n\n\n== HMS Center for Bioethics ==\nHMS Center for Bioethics site, formerly the HMS Division of Medical Ethics (renamed July 1, 2014)\nPersonnel\n\n\n== Publications ==\nDan Brock's Publications\nGoogle Scholar search for Dan Brock: read portions of Dan Brock's writings\n\n\n== References ==\n\n\n== See also ==\nAmerican philosophy\nHealth equity\nList of American philosophers\nCollaborating Authors\nAllen Buchanan of Duke\nNorman Daniels of HSPH\nDaniel Wikler of HSPH\nInstitutions\nHarvard Medical Schools's DME\nHarvard University's PEH\nNational Institutes of Health\nHarvard Medical Schools's Department of Global Health and Social Medicine\nHSPH Research Ethics Map\nNews\nGoogle News Search for Dan Brock, Harvard Ethicist\nGoogle Search for Dan Brock, Harvard Ethicist", "ns": 0, "pageid": 20689455, "title": "Daniel Brock"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}