{"batchcomplete": "", "query": {"normalized": [{"to": "David Prychitko", "from": "David_Prychitko"}], "pages": {"19923114": {"extract": "David L. Prychitko (born June 22, 1962) is an American economist of the Austrian School. Prychitko is a critic of Marxism, but defends the idea of workers' self-managed firms in a freed market system. Prychitko is a tenured professor at Northern Michigan University.\n\n\n== Early life and education ==\nPrychitko was born in Evergreen Park, Illinois to Harry and Joanne Prychitko. He is of Ukrainian and Italian descent. He was raised in Worth, Illinois, and is a 1980 graduate of Alan Shepard High School in Palos Heights, Illinois. He remained in Worth until he moved to Michigan to attend Northern Michigan University in Marquette, a small city in the Upper Peninsula of Michigan. After completing his B.S. in Economics (1984), Prychitko attended George Mason University in Fairfax, Virginia, where he earned an M.A. (1987) and a Ph.D. (1989) in economics. At George Mason he was a student of Kenneth Boulding, James Buchanan, Don Lavoie, and Thelma Z. Lavine. Lavoie chaired Prychitko's dissertation committee. Michael Alexeev, Jack High, and Karen I. Vaughn served as the economists on the committee, and Tom Burns, a sociologist, served as the \"outside the discipline\" committee member.\nBefore completing his Ph.D., Prychitko was also a Junior Fellow in the Program on Participation and Labor-Managed systems in the Department of Economics at Cornell University in Ithaca, New York (1988). He finished writing his dissertation research there, with some influence under the program's director, Jaroslav Vanek.\n\n\n== Professional history ==\nAfter receiving his doctorate, Prychitko conducted post-doctoral research on a Fulbright Grant in the Philosophical Faculty at the University of Zagreb, in Zagreb, Croatia (1989). While there he had also participated in several courses at the Inter-University Centre of Postgraduate Studies in Dubrovnik, Croatia, including Political Theory and Political Education—Anarchism: Community and Utopia. That course was celebrated as the first gathering in Yugoslavia of scholars of anarchism in forty or more years. During his stay at the Inter-University Centre, Prychitko also critically discussed the theory and practice of workers' self-managed socialism with several members of the Yugoslav Praxis School, including Zagorka Golubovic, Mihailo Markovic, Svetozar Stojanovic, and Rudi Supek.\nAfter his return from Yugoslavia, Prychitko served as a faculty member in the Department of Economics at the State University of New York at Oswego, in Oswego, New York (1989–1997). During that time, he participated as a Summer Fellow in the Faculty Seminar on Economy, Values, and Culture, at the Institute for the Study of Economic Culture, Boston University in Boston, Massachusetts (1992), a program directed by the noted sociologist, Peter Berger.\nPrychitko was also a Faculty Affiliate in the Program in Philosophy, Politics, and Economics of the James M. Buchanan Center for Political Economy, George Mason University (2001–2004). Additionally, he held the Cecil and Ida Green Chair in Economics at Texas Christian University in Fort Worth, Texas (2003–2004). Prychitko has been a faculty member in the Department of Economics at Northern Michigan University since 1997.\nNon-professionally, Prychitko was a college-radio blues disc jockey for several years, a volunteer position he held at radio stations WNYO in Oswego, New York and WUPX in Marquette, Michigan. He is now a member of WUPX's Board of Control. He has since become a devotee of old-time fiddle music, and is one of a handful of Appalachian-style fiddlers in Michigan's Upper Peninsula.\nHe lives in Marquette, Michigan with his wife Julie. They have four children, Sonja, Emily, Anthony, and Anna.\n\n\n== Bibliography ==\n\n\n=== As author or co-author ===\nMarxism and Workers' Self-Management: The Essential Tension (Greenwood Press, 1991) ISBN 0-313-27854-7.\nMarkets, Planning and Democracy: Essays after the Collapse of Communism (Elgar, 2002) ISBN 1-84064-519-9.\nThe Economic Way of Thinking co-authored with Paul Heyne and Peter Boettke (Pearson 2014) ISBN 978-0-13-299129-2. This textbook has been translated into Chinese, Hungarian, Japanese, and Russian.\n\n\n=== As editor or co-editor ===\nMarket Process: Essays in Contemporary Austrian Economics co-edited and introduced with Peter Boettke (Elgar, 1994) ISBN 978-1-85278-854-4.\nIndividuals, Institutions, Interpretations: Hermeneutics Applied to Economics (Avebury, 1995) ISBN 1-85628-968-0.\nAdvances in Austrian Economics, Vol. III with Peter Boettke (JAI Press, 1996) ISBN 978-0-7623-0055-6.\nProducer Cooperatives and Labor-Managed Systems two volumes co-edited and introduced with Jaroslav Vanek (#62 in the International Library of Critical Writings in Economics, Mark Blaug, series editor, Elgar, 1996) ISBN 1-85898-189-1.\nLudwig von Mises and F.A. Hayek, \"O Slobodnom Trzistu: Klesicni Eseji (\"The Free Market: Classic Essays\"). Croatian translations co-edited and introduced with Nevenka Cuckovic (MATE, 1998)\nWhy Economists Disagree: An Introduction to the Alternative Schools of Thought (State University of New York Press, 1998 ) ISBN 0-7914-3569-5 (hardcover) and ISBN 0-7914-3570-9 (paperback)\nMarket Process Theories two volumes co-edited and introduced with Peter Boettke (Elgar Publishing, 1998)\n\n\n== Selected articles ==\n\n\n=== As author or co-author ===\n\"Beyond Equilibrium Economics: Reflections on the Uniqueness of the Austrian Tradition\" (with Peter Boettke and Steven Horwitz), Market Process, 4 (2), Fall 1986\n\"The Welfare State: What is Left?,\" Critical Review, 4 (2), 1990\n\"Ludwig Lachmann and the Interpretive Turn in Economics: A Critical Inquiry into the Hermeneutics of the Plan,\" Advances in Austrian Economics, Vol I (1994)\n\"Expanding the Anarchist Range: A Critical Reappraisal of Rothbard's Contribution to the Contemporary Theory of Anarchism,\" Review of Political Economy, 9 (4), 1997\n\"Hayekian Socialism: Rethinking Burczak, Ellerman, and Kirzner,\" Rethinking Marxism, 10 (2) Summer 1998\n\"Is an Independent Nonprofit Sector Prone to Failure? Toward an Austrian School Interpretation of Nonprofit and Voluntary Action\" (with Peter Boettke), Conversations on Philanthropy Vol. I: Conceptual Foundations, 2004, Lenore Ealy ed.\n\"Communicative Action and the Radical Constitution: The Habermasian Challenge to Hayek, Mises, and their Descendants\" (with Virgil Storr), Cambridge Journal of Economics 31 (2) March 2007\n\"Competing Explanations of the Minsky Moment: The Financial Instability Hypothesis in Light of Austrian Theory,\" Review of Austrian Economics, 23 September 2010\nDavid R. Henderson (ed.), ed. (2008). \"Marxism\". Concise Encyclopedia of Economics (2nd ed.). Indianapolis: Library of Economics and Liberty. ISBN 978-0865976658. OCLC 237794267. \n\n\n== References ==\n\n\n== External links ==\nPrychitko's ResearchGate page\nPrychitko's Academia.edu page\nDavid Prychitko at Goodreads", "ns": 0, "pageid": 19923114, "title": "David Prychitko"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}