{"batchcomplete": "", "query": {"normalized": [{"to": "David Malet Armstrong", "from": "David_Malet_Armstrong"}], "pages": {"2108195": {"extract": "David Malet Armstrong (8 July 1926 – 13 May 2014), often D. M. Armstrong, was an Australian philosopher. He is well known for his work on metaphysics and the philosophy of mind, and for his defence of a factualist ontology, a functionalist theory of the mind, an externalist epistemology, and a necessitarian conception of the laws of nature. He was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 2008.\nKeith Campbell said that Armstrong's contributions to metaphysics and epistemology \"helped to shape philosophy's agenda and terms of debate\", and that Armstrong's work \"always concerned to elaborate and defend a philosophy which is ontically economical, synoptic, and compatibly continuous with established results in the natural sciences\".\n\n\n== Life and career ==\nAfter studying at the University of Sydney, Armstrong did a B.Phil at the University of Oxford and a Ph.D at the University of Melbourne. He taught at Birkbeck College in 1954–55, then at the University of Melbourne from 1956–63. In 1964, he became Challis Professor of Philosophy at the University of Sydney, where he stayed until his retirement in 1992. During his career, he was a visiting lecturer at a number of institutions including Yale, Stanford, the University of Notre Dame, the University of Texas at Austin and Franklin and Marshall College.\nIn 1974, when the University of Sydney's Philosophy department split into two departments—the Department for General Philosophy and the Department for Traditional and Modern Philosophy—Armstrong joined the latter along with David Stove and Keith Campbell, while the former department pursued more radical politics and taught courses on Marxism and feminism. The two departments were reunified in 2000.\nArmstrong married Jennifer Mary de Bohun Clark in 1982 and had step children. He previously married Madeleine Annette Haydon in 1950. He also served in the Royal Australian Navy.\nIn 1950, Armstrong formed an Anti-Conscription Committee with David Stove and Eric Dowling, all three former students of John Anderson, the Australian philosopher, who supported conscription and also believed that anti-conscription opinions ought to be suppressed.\nTo mark the 50th anniversary in 2014 of Armstrong's appointment to the Challis Chair of Philosophy at Sydney University, Quadrant magazine published a tribute to him by David Stove and an overview of Armstrong's work by Andrew Irvine.\n\n\n== Philosophy ==\nArmstrong's philosophy is broadly naturalistic. In Sketch for a Systematic Metaphysics, Armstrong states that his philosophical system rests upon \"the assumption that all that exists is the space time world, the physical world as we say\". He justifies this by saying that the physical world \"seems obviously to exist\" while other things \"seem much more hypothetical\". From this fundamental assumption flows a rejection of abstract objects including Platonic forms.\nArmstrong's development as a philosopher was influenced heavily by John Anderson, David Lewis, and J. J. C. Smart, as well as by Ullin Place, Herbert Feigl, Gilbert Ryle and G. E. Moore. Armstrong collaborated with C. B. Martin on a collection of critical essays on John Locke and George Berkeley.\nArmstrong's philosophy, while systematic, does not spend any time on social or ethical matters, and also does not attempt to build a philosophy of language. He once described his slogan as 'Put semantics last' and, in Universals & Scientific Realism, he rebuts an arguments in favour of Plato's theory of forms that rely on semantics by describing \"a long but, I think, on the whole discreditable tradition which tries to settle ontological questions on the basis of semantic considerations\".\n\n\n=== Metaphysics ===\n\n\n==== Universals ====\nIn metaphysics, Armstrong defends the view that universals exist (although Platonic uninstantiated universals do not exist). Those universals match up with the fundamental particles that science tells us about. Armstrong describes his philosophy as a form of scientific realism.\nArmstrong's universals are \"sparse\": not every predicate will have an accompanying property, but only those which are deemed basic by scientific investigation. The ultimate ontology of universals would only be realised with the completion of physical science. Mass would thus be a universal (subject to mass not being discarded by future physicists). Armstrong realises that we will need to refer to and use properties that are not considered universals in his sparse ontology—for instance, being able to refer to something being a game (to use the example from Wittgenstein's Philosophical Investigations). Armstrong then suggests that a supervenience relation exists between these second order properties and the ontologically authentic universals given to us by physics.\nArmstrong's theory of universals treats relations as having no particular ontological difficulty, they can be treated in the same way non-relational properties are. How Armstrong's theory of universals deals with relations with varying adicities has been raised as an issue by Fraser MacBride. MacBride argues that there can be relations where the number of terms in the relation varies across instances. Armstrong's response is to affirm a theory he describes as the Principle of Instantial Invariance, wherein the adicity of properties are essential and invariant. According to Armstrong, complex relations which seem to challenge the principle are not ontologically real but are second-order properties that can be reduced to more basic properties that subscribe to the Principle of Instantial Invariance.\nArmstrong rejects nominalist accounts of properties that attempt to align properties simply with classes. Coextension is a problem they face: if properties are simply classes, in a world where all blue things are also wet, class nominalists are unable to draw a distinction between the property of being blue and being wet. He provides an analogy to the argument in Euthyphro: to say that electrons are electrons because they are part of the class of electrons puts the cart before the horse. They are part of the class of electrons because they are electrons.\nIn Armstrong's view, nominalisms can also be criticised for producing a blob theory of reality. Objects have structure: they have parts, those parts are made of molecules, which are in turn made up of atoms standing in relation to one another, which are in turn made up of subatomic particles and so on. Blobbiness also threatens Platonic universals: a particular instantiating a universal in a world of Platonic universals becomes a matter of the blob-particular having a relation to a universal elsewhere (in the Platonic heaven, say), rather than having an internal relation in the way that a chemical element does to a constituent atom.\nArmstrong further rejects nominalisms that deny that properties and relations exist in reality because he suggests that these sorts of nominalisms, specifically referring to what he calls class nominalism, and resemblance nominalism, postulate primitives of either class membership or resemblance.  This primitive results in a vicious regress for both kinds of nominalisms, Armstrong suggests, thus motivating his states-of-affairs based system that unites properties by postulating a primitive tie of instantiation  based on a fact-ontology, called states of affairs. \nIn terms of the origin of Armstrong's view of universals, Armstrong says his view of universals is \"relatively unexplored territory\" but points to Hilary Putnam's 1970 paper 'On Properties' as a possible forerunner. He also says that \"Plato in his later works, Aristotle and the Scholastic Realists were ahead of contemporary philosophy in this matter, although handicapped by the relative backwardness of the science and the scientific methodology of their day\".\n\n\n==== States of affairs ====\nCentral to Armstrong's philosophy is the idea of states of affairs (\"facts\" in Russell's terminology): in Sketch for a Systematic Metaphysics, Armstrong claims that states of affairs are \"the fundamental structures in reality\". A state of affairs roughly put is an instantiation of a particular and a universal: a state of affairs might be that a particular atom exists, instantiating a universal (say, that it is of a particular element, if chemical elements are ultimately accepted as part of Armstrong's universals). The particulars in Armstrong's ontology must have at least one universal—just as he rejects uninstantiated universals, he also rejects \"unpropertied particulars\".\nArmstrong argues that states of affairs are distinct things in ontology because they are more than the sum of their parts. If some particular a has a non-symmetric relation R to another particular b, then R (a, b) differs from R (b, a). It may be the case that R (a, b) obtains in the world but R (b, a) does not. Without states of affairs instantiating the particulars and universals (including relations), we cannot account for the truth of the one case and the falsity of the other.\n\n\n==== Laws of nature ====\nArmstrong's theory of universals gives him the basis for an understanding of laws of nature as being relations between universals, a non-Humean account of laws of nature proposed independently by Armstrong, Michael Tooley, and Fred Dretske. This account posits that the relations between universals are truthmakers for the statements about physical laws, and it is realist as it accepts that laws of nature are a feature of the world rather than just a way we talk about the world. Armstrong identifies the laws as holding between universals rather than particulars as an account of laws involving just particulars rather than universals would not adequately explain how laws of nature operate in the case of counterfactuals.\nTo illustrate the theory, Stephen Mumford gives the example of all ravens are black. Under the theory of Armstrong, Tooley and Dretske, there is a relation of necessity between the universals ravenhood and blackness, rather than there being a relationship with every single raven. This allows the explanation of laws of nature that have not been instantiated. Mumford cites the frequently-used example of the moa bird: \"It is supposed that every bird of this now-extinct species died at a young age, though not because of anything in its genetic makeup. Rather, it died mainly because of some virus that just happened to sweep through the population. One bird could have escaped the virus only to be eaten by a predator on the day before its fiftieth birthday.\" Under the theory of Armstrong, Tooley and Dretske, such a coincidence would not be a law of nature.\n\n\n==== Dispositions ====\nArmstrong rejects dispositionalism, the idea that dispositional properties (or powers as they are sometimes referred to) are ontologically significant and have an important role in explaining laws of nature. Armstrong believes that the challenge that dispositionalism presents for his account of laws of nature is not in the case of manifested dispositions (say, a glass dropping on the ground and breaking) but unmanifested dispositions (the fact that counter factually if one were to drop the glass on the ground, it would break). Armstrong simply states that the disposition is simply in the nature of the instantiated properties of the thing which is supposed to have the disposition.\n\n\n==== Truth and truthmakers ====\nRegarding truth, Armstrong holds to what he describes as a \"Maximalist\" version of truthmaker theory: he believes that every truth has a truthmaker, although there doesn't necessarily exist a one-to-one mapping between truth and truthmaker. The possibility of one to many relations between truths and truthmakers is a feature that Armstrong believes allows truthmaker theory to answer some of the criticisms levelled at older correspondence theories of truth (of which he believes truthmaker theory to be an improved version). Negative truths have truthmakers in Armstrong's account: he gives the example of a wall that is painted green. The wall being painted green is a truth for the proposition that it is not painted white and the proposition that it is not painted red and so on.\nThe difficulty in providing an adequate account of truthmakers for events in the past is one reason Armstrong gives for rejecting presentism—the view that only the present exists (another reason being the incompatibility of such a view with special relativity). Presentists, Armstrong argues, must either deny that truthmakers are needed for statements about the past, or account for them \"by postulating rather strange truthmakers\".\n\n\n==== Mind ====\nArmstrong holds to a physicalist, functionalist theory of the mind. He initially was attracted to Gilbert Ryle's The Concept of Mind and the rejection of Cartesian dualism. Armstrong did not accept behaviourism and instead defended a theory he referred to as the \"central-state theory\" which identifies mental states with the state of the central nervous system. In A Materialist Theory of Mind, he accepted that mental states such as consciousness exist, but stated that they can be explained as physical phenomena. Armstrong attributes his adoption of the central-state theory to the work of J. J. C. Smart—specifically the paper 'Sensations and Brain Processes'—and traces the lineage from there to Ullin Place's 1956 paper 'Is Consciousness a Brain Process?'\nStephen Mumford said that Armstrong's A Materialist Theory of Mind \"represents an authoritative statement of Australian materialism and was, and still is, a seminal piece of philosophy\".\n\n\n=== Epistemology ===\nArmstrong's view of knowledge is that the conditions of knowledge are satisfied when you have a justified true belief that you arrived at through a reliable process: that is, the belief was caused by some factor in the external world (hence the label of externalism). Armstrong uses the analogy of a thermometer: as a thermometer changes to reflect the temperature of the environment it is in, so must one's beliefs if they are reliably formed. The connection between knowledge and the external world, for Armstrong, is a nomological relationship (that is, a law of nature relationship). Here, Armstrong's view is broadly similar to that of Alvin Goldman and Robert Nozick. The intuitions that lead to this kind of externalism led Alvin Plantinga towards an account of knowledge that added the requirement for 'properly-functioning' cognitive systems operating according to a design plan.\n\n\n==== Belief ====\nOn the question of the relationship between beliefs and knowledge, Armstrong defends a \"weak acceptance\" of the belief condition, namely that if a person can be said to know some thing p, he or she believes p. In a paper for the Aristotelian Society, Armstrong rejects a series of linguistic arguments for a rejection of the belief condition which argue that one can have knowledge without having belief because a common usage of the word 'belief' is to imply lack of knowledge—Armstrong gives the example of if you asked a man on a railway station whether the train has just left and he said \"I believe it has\", you would take from this that he does not know that it has.\nArmstrong also argues that contradictory beliefs show that there is a connection between beliefs and knowledge. He gives the example of a woman who has learned her husband is dead but cannot bring herself to believe her husband is dead. She both believes and disbelieves her husband is dead: it just happens that one of her two beliefs is justified, true and satisfies some knowledge conditions.\nArmstrong presents a response to Colin Radford's modified version of the \"unconfident examinee\" example. A student is asked when Queen Elizabeth I died, and he hesitatingly answers \"1603\" and exhibits no confidence in his answer. He has forgotten that at some point previously, he studied English history. Radford presents this as an example of knowledge without belief. But Armstrong differs on this: the unconfident examinee has a belief that Queen Elizabeth I died in 1603, he knows that she died in 1603, but he does not know that he knows. Armstrong rejects the KK Principle—that to know some thing p, one must know that one knows p. Armstrong's rejection of the KK Principle is consistent with his wider externalist project.\n\n\n== Bibliography ==\n\n\n=== Books ===\n—— (1960). Berkeley's Theory of Vision. Melbourne University Press. OL 2981233W. \n—— (1961). Perception and the Physical World. Routledge & Kegan Paul. ISBN 978-0-7100-3603-2. \n—— (1962). Bodily Sensations. Routledge & Kegan Paul. OL 5873805M. \n—— (1968). A Materialist Theory of the Mind. Routledge & Kegan Paul. ISBN 978-0-415-10031-1. \n—— (1973). Belief, Truth and Knowledge. Cambridge University Press. ISBN 978-0-521-08706-3. \n—— (1978). Universals and Scientific Realism. Cambridge University Press. ISBN 978-0-521-21741-5. \n—— (1981). The Nature of Mind and Other Essays. Cornell University Press. ISBN 978-0-8014-1353-7. \n—— (1983). What is a Law of Nature?. Cambridge University Press. ISBN 978-0-521-25343-7. \n—— (1989). A Combinatorial Theory of Possibility. Cambridge University Press. ISBN 978-0-521-37427-9. \n—— (1989). Universals: An Opinionated Introduction. Westview Press. ISBN 978-0-8133-0772-5. \n—— (1997). A World of States of Affairs. Cambridge University Press. ISBN 978-0-521-58064-9. \n—— (1999). The Mind-Body Problem: An Opinionated Introduction. Westview Press. ISBN 978-0-8133-9056-7. \n—— (2004). Truth and Truthmakers. Cambridge University Press. ISBN 978-0-521-83832-0. \n—— (2010). Sketch for a Systematic Metaphysics. Oxford University Press. ISBN 978-0-19-959061-2. \n\n\n=== Selected articles ===\n—— (1963). \"Is Introspective Knowledge Incorrigible?\". Philosophical Review. 72 (4): 417–432. JSTOR 2183028. \n—— (1971). \"Meaning and Communication\". Philosophical Review. 80 (4): 427–447. JSTOR 2183752. \n—— (1984). Alan Ker Stout, 1900–1983 (PDF). Proceedings of the Australian Academy of the Humanities. 12. pp. 106–109. ISBN 978-0-909897-07-9. \nForrest, P.; —— (1984). \"An Argument against David Lewis' Theory of Possible Worlds\". Australasian Journal of Philosophy. 62 (2): 164–168. doi:10.1080/00048408412341351. \n—— (1991). \"Classes are States of Affairs\". Mind. 100 (2): 189–200. doi:10.1093/mind/C.398.189. JSTOR 2254866. \n—— (2000). \"Black Swans: The formative influences in Australian philosophy\". In Brogaard, B.; Smith, B. Proceedings of the 23rd International Wittgenstein Symposium. \n\n\n=== Miscellaneous ===\n—— (2001). \"Interview\". In Jobling, Lee; Runcie, Catherine. Matters of the Mind: Poems, Essays and Interviews in Honour of Leonie Kramer. University of Sydney. pp. 322–332. ISBN 978-1-86487-362-7. \n\n\n== See also ==\nThe Nature of Mind\n\n\n== References ==\n\n\n== Further reading ==\nBacon, J.; Campbell, K.; Reinhardt, L., eds. (1993). Ontology, Causality, and Mind: Essays in Honour of D.M. Armstrong. Cambridge University Press. ISBN 978-0-521-41562-0. \nBogdan, R. J., ed. (1984). D.M. Armstrong. D. Reidel. ISBN 978-90-277-1657-6. \nFranklin, J. (2003). Corrupting the Youth: A History of Philosophy in Australia. Macleay Press. Chapters 9, 11, 12. ISBN 978-1-876492-08-3. \nIrvine, A. (1 March 2014). \"David Armstrong and Australian Materialism\". Quadrant. pp. 36–39. \nIrvine, A. (1 March 2014). \"David Armstrong: A Reader's Guide\". Quadrant. pp. 40–41. \nMumford, S. (2007). David Armstrong. Acumen Publishing. ISBN 978-1-84465-100-9. \nStove, D. (1 March 2014). \"A Tribute to David Armstrong\". Quadrant. pp. 42–43. \n\n\n== External links ==\nGuide to the Papers of David Armstrong\nDavid Armstrong's Curriculum Vitae\nP. Forrest, 'Armstrong, D.M.' in A Companion to Philosophy in Australia and New Zealand\nArmstrong's Pufendorf Lectures 2004", "ns": 0, "pageid": 2108195, "title": "David Malet Armstrong"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}