{"batchcomplete": "", "query": {"normalized": [{"to": "David Chalmers", "from": "David_Chalmers"}], "pages": {"258221": {"extract": "David John Chalmers (/ˈtʃælmərz/; born 20 April 1966) is an Australian philosopher and cognitive scientist specializing in the areas of philosophy of mind and philosophy of language. He is Professor of Philosophy and Director of the Centre for Consciousness at the Australian National University. He is also Professor of Philosophy at New York University in the NYU Department of Philosophy. In 2013, he was elected a Fellow of the American Academy of Arts & Sciences.\n\n\n== Life ==\nSince 2004, Chalmers has been Professor of Philosophy, Director of the Centre for Consciousness, and an ARC Federation Fellow at the Australian National University.\nA Rhodes Scholar raised in Australia, Chalmers received his PhD at Indiana University Bloomington under Douglas Hofstadter. He was a postdoctoral fellow in the Philosophy-Neuroscience-Psychology program directed by Andy Clark at Washington University in St. Louis from 1993 to 1995, and his first professorship was at UC Santa Cruz, from August 1995 to December 1998. Chalmers was subsequently appointed Professor of Philosophy (1999–2004) and, later, Director of the Center for Consciousness Studies (2002–2004) at the University of Arizona, sponsor of the Toward a Science of Consciousness conference. After appearing as a plenary speaker at the first meeting, Chalmers has subsequently taken the role of co-organizer, alongside Stuart Hameroff, of this conference.\nChalmers' 1996 book, The Conscious Mind, was described by The Sunday Times as \"one of the best science books of the year\". In the book, Chalmers argues that all forms of physicalism (whether reductive or non-reductive) that have dominated modern philosophy and science fail to account for the existence (that is, presence in reality) of consciousness itself. He proposes an alternative dualistic view he calls naturalistic dualism (but which might also be characterized by more traditional formulations such as property dualism, neutral monism, or double-aspect theory).\nHe is the lead singer of the Zombie Blues band which performed at the Qualia Fest in 2012 in New York.\nOn 14 June 2016 David Chalmers visited Moscow to hold a lecture at Moscow State University focused on solving the Hard problem of consciousness. He also gave an interview about before holding a lecture at the Moscow State University.\nDavid Chalmers is an atheist.\n\n\n== Thought ==\n\n\n=== Philosophy of mind ===\n\nChalmers is best known for his formulation of the notion of a hard problem of consciousness in both his 1996 book and in the 1995 paper \"Facing Up to the Problem of Consciousness\". He makes a distinction between \"easy\" problems of consciousness, such as explaining object discrimination or verbal reports, and the single hard problem, which could be stated \"why does the feeling which accompanies awareness of sensory information exist at all?\" The essential difference between the (cognitive) easy problems and the (phenomenal) hard problem is that the former are at least theoretically answerable via the standard strategy in philosophy of mind: functionalism. Chalmers argues for an \"explanatory gap\" from the objective to the subjective, and criticizes physical explanations of mental experience, making him a dualist. Chalmers characterizes his view as \"naturalistic dualism\": naturalistic because he believes mental states are caused by physical systems (such as brains); dualist because he believes mental states are ontologically distinct from and not reducible to physical systems.\nIn support of this, Chalmers is famous for his commitment to the logical (though, importantly, not natural) possibility of philosophical zombies, although he was not the first to propose the thought experiment. These zombies, unlike the zombie of popular fiction, are complete physical duplicates of human beings, lacking only qualitative experience. Chalmers argues that since such zombies are conceivable to us, they must therefore be logically possible. Since they are logically possible, then qualia and sentience are not fully explained by physical properties alone. Instead, Chalmers argues that consciousness is a fundamental property ontologically autonomous of any known (or even possible) physical properties, and that there may be lawlike rules which he terms \"psychophysical laws\" that determine which physical systems are associated with which types of qualia. He further speculates that all information-bearing systems may be conscious, leading him to entertain the possibility of conscious thermostats and a qualified panpsychism he calls panprotopsychism. Chalmers maintains a formal agnosticism on the issue, even conceding that the viability of panpsychism places him at odds with the majority of his contemporaries.\nAfter the publication of Chalmers's landmark paper, more than twenty papers in response were published in the Journal of Consciousness Studies. These papers (by Daniel Dennett, Colin McGinn, Francisco Varela, Francis Crick, and Roger Penrose, among others) were collected and published in the book Explaining Consciousness: The Hard Problem. John Searle critiqued Chalmers's views in The New York Review of Books.\nWith Andy Clark, Chalmers has written The Extended Mind, an article about the borders of the mind.\n\n\n=== Philosophy of language ===\nChalmers has published works on the \"theory of reference\" concerning how words secure their referents. He, together with others such as Frank Jackson, proposes a kind of theory called two dimensionalism arguing against Saul Kripke. Before Kripke delivered the famous lecture series Naming and Necessity in 1970, the descriptivism advocated by Gottlob Frege and Bertrand Russell was the orthodoxy. Descriptivism suggests that a name is indeed an abbreviation of a description, which is a set of properties or, as later modified by John Searle, a disjunction of properties. This name secures its reference by a process of properties fitting: whichever object fits the description most, then it is the referent of the name. Therefore, the description is seen as the connotation, or, in Fregean terms, the sense of the name, and it is via this sense by which the denotation of the name is determined.\nHowever, as Kripke argued in Naming and Necessity, a name does not secure its reference via any process of description fitting. Rather, a name determines its reference via a historical-causal link tracing back to the process of naming. And thus, Kripke thinks that a name does not have a sense, or, at least, does not have a sense which is rich enough to play the reference-determining role. Moreover, a name, in Kripke's view, is a rigid designator, which refers to the same object in all possible worlds. Following this line of thought, Kripke suggests that any scientific identity statement such as \"Water is H2O\" is also a necessary statement, i.e. true in all possible worlds. Kripke thinks that this is a phenomenon that the descriptivist cannot explain.\nAnd, as also proposed by Hilary Putnam and Kripke himself, Kripke's view on names can also be applied to the reference of natural kind terms. The kind of theory of reference that is advocated by Kripke and Putnam is called the direct reference theory.\nHowever, Chalmers disagrees with Kripke, and all the direct reference theorists in general. He thinks that there are two kinds of intension of a natural kind term, a stance which is now called two dimensionalism. For example, the words,\n\"Water is H2O\"\nare taken to express two distinct propositions, often referred to as a primary intension and a secondary intension, which together compose its meaning.\nThe primary intension of a word or sentence is its sense, i.e., is the idea or method by which we find its referent. The primary intension of \"water\" might be a description, such as watery stuff. The thing picked out by the primary intension of \"water\" could have been otherwise. For example, on some other world where the inhabitants take \"water\" to mean watery stuff, but where the chemical make-up of watery stuff is not H2O, it is not the case that water is H2O for that world.\nThe secondary intension of \"water\" is whatever thing \"water\" happens to pick out in this world, whatever that world happens to be. So if we assign \"water\" the primary intension watery stuff then the secondary intension of \"water\" is H2O, since H2O is watery stuff in this world. The secondary intension of \"water\" in our world is H2O, and is H2O in every world because unlike watery stuff it is impossible for H2O to be other than H2O. When considered according to its secondary intension, water means H2O in every world. Via this secondary intension, Chalmers proposes a way simultaneously to explain the necessity of the identity statement and to preserve the role of intension/sense in determining the reference.\n\n\n=== Philosophy of verbal disputes ===\nIn recent work, Chalmers has concentrated on verbal disputes. He argues that a dispute is best characterized as \"verbal\" when it concerns some sentence S which contains a term T such that (i) the parties to the dispute disagree over the meaning of T, and (ii) the dispute arises solely because of this disagreement. In the same work, Chalmers proposes certain procedures for the resolution of verbal disputes. One of these he calls the \"elimination method\", which involves eliminating the contentious term and observing whether any dispute remains.\n\n\n== Bibliography ==\nThe Conscious Mind: In Search of a Fundamental Theory (1996). Oxford University Press. hardcover: ISBN 0-19-511789-1, paperback: ISBN 0-19-510553-2\nToward a Science of Consciousness III: The Third Tucson Discussions and Debates (1999). Stuart R. Hameroff, Alfred W. Kaszniak and David J. Chalmers (Editors). The MIT Press. ISBN 0-262-58181-7\nPhilosophy of Mind: Classical and Contemporary Readings (2002). (Editor). Oxford University Press. ISBN 0-19-514581-X or ISBN 0-19-514580-1\nThe Character of Consciousness (2010). Oxford University Press. hardcover: ISBN 0-19-531110-8, paperback: ISBN 0-19-531111-6\nConstructing The World (2012). Oxford University Press. hardcover: ISBN 978-0-19-960857-7, paperback: ISBN 978-0199608584\n\n\n== See also ==\nPhilPapers\n\n\n== Notes ==\n\n\n== External links ==\nOfficial website\n\"The Singularity\" a documentary film featuring Chalmers\nThe Moscow Center for Consciousness Studies video interview with David Chalmers\nDavid Chalmers at TED", "ns": 0, "pageid": 258221, "title": "David Chalmers"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}