{"batchcomplete": "", "query": {"normalized": [{"to": "David Crocker", "from": "David_Crocker"}], "pages": {"43244335": {"extract": "David A. Crocker (born 4 October 1937), is Senior Research Scholar in the School of Public Policy, at the University of Maryland, he is also the founder and former president of the International Development Ethics Association (IDEA). His work has also been cited by the United Nations Human Development Report.\n\n\n== Education ==\nDavid Crocker gained his bachelor's degree in psychology from DePauw University, Greencastle, Indiana, in 1959. He also has three degrees from Yale University (M.Div in Philosophy of Religion 1963, MA in Philosophical Theology and Philosophy of Religion 1965, and a Ph.D in Philosophical Theology and Philosophy of Religion 1970).\n\n\n== Academic career ==\nTaught philosophy for 25 years at Colorado State University\nUNESCO Chair in Development at the University of Valencia.\nFellow of the Human Development and Capability Association.\n\n\n== Media ==\nCrocker was one of a number of leading philosophers who, at the 1998 World Congress of Philosophy, were interviewed by Michael Malone for the television series, A parliament of minds: philosophy for a new millennium.\n\n\n== Bibliography ==\n\n\n=== Films ===\nMichael S. Malone (host) Michael Tobias (dir) (1999). A parliament of minds: philosophy for a new millennium (Democracy, ethics and the relevance of philosophy / David Crocker) (TV Mini-Series documentary / VHS video). produced for PBS by KTEH/San Jose Public Television and JMT Productions in association with the Wisdom Channel. OCLC 48127065. \n\n\n=== Books ===\nCrocker, David (2008). Ethics of global development: agency, capability, and deliberative democracy. Cambridge New York: Cambridge University Press. ISBN 9780521885195. \n\n\n=== Chapters in books ===\nCrocker, David A (1995), \"Functioning and capability: the foundations of Sen's and Nussbaum's development ethic\", in Nussbaum, Martha; Glover, Jonathan, Women, culture, and development: a study of human capabilities, Oxford New York: Clarendon Press Oxford University Press, pp. 153–199, ISBN 9780198289647 \nCrocker, David; Robeyns, Ingrid (2009), \"Well-being and agency\", in Morris, Christopher W, The philosophy of Amartya Sen, Cambridge New York: Cambridge University Press, pp. 86–90, ISBN 9780521618069 \n\n\n=== Journal articles ===\nCrocker, David A (May 1991). \"Toward development ethics\". World Development. Elseivier. 19 (5): 457–483. doi:10.1016/0305-750X(91)90188-N. \nCrocker, David A (November 1992). \"Functioning and capability: the foundations of Sen's and Nussbaum's development ethic\". Political Theory. Sage. 20 (4): 584–612. doi:10.1177/0090591792020004003. \nCrocker, David A (2007). \"Deliberative participation in local development\". Journal of Human Development and Capabilities | Special issue: selected papers from the 2006 International Conference of the Human Development and Capability Association. Taylor and Francis. 8 (3): 431–455. doi:10.1080/14649880701462379. \n\n\n== Further reading ==\nTobias, Michael; Rothenberg, David; Fitzgerald, J. Patrick (2000). A parliament of minds philosophy for a new millennium. Albany, New York: State University of New York Press. ISBN 9780791444849. \n\n\n== References ==\n\n\n== External links ==\nProfile: David Crocker School of Public Policy, University of Maryland\nProfile: David Crocker Ethics of Employment\nDavid Crocker IMDB profile", "ns": 0, "pageid": 43244335, "title": "David Crocker"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}