{"batchcomplete": "", "query": {"normalized": [{"to": "David Pearce (philosopher)", "from": "David_Pearce_(philosopher)"}], "pages": {"253714": {"extract": "David Pearce is co-founder of Humanity+, formerly the World Transhumanist Association, and a prominent figure within the transhumanism movement.\nBased in Brighton, England, Pearce maintains a series of websites devoted to transhumanist topics and what he calls the \"hedonistic imperative\", a moral obligation to work towards the abolition of suffering in all sentient life. His book-length internet manifesto, The Hedonistic Imperative (1995), outlines how pharmacology, genetic engineering, nanotechnology and neurosurgery could converge to eliminate all forms of unpleasant experience from human and non-human life, replacing suffering with \"gradients of bliss\". Pearce calls this the \"abolitionist project\".\nA vegan, Pearce argues that humans have a responsibility not only to avoid cruelty to animals within human society but also to redesign the global ecosystem so that animals do not suffer in the wild.\n\n\n== Hedonistic transhumanism ==\nIn 1995 Pearce set up BLTC Research, a network of websites publishing texts about transhumanism and related topics in pharmacology and biopsychiatry. (BLTC initially stood for Better Living Through Chemistry.) He published The Hedonistic Imperative that year, arguing that \"[o]ur post-human successors will rewrite the vertebrate genome, redesign the global ecosystem, and abolish suffering throughout the living world.\"\nPearce's ideas inspired an abolitionist school of transhumanism, or \"hedonistic transhumanism\", based on his idea of \"paradise engineering\" and his argument that the abolition of suffering—which he calls the \"abolitionist project\"—is a moral imperative. He defends a version of negative utilitarianism:\n\nEthical negative-utilitarianism ... attaches value in a distinctively moral sense of the term only to actions which tend to minimise or eliminate suffering. ... It stems from a deep sense of compassion at the sheer scale and intensity of suffering in the world. No amount of happiness or fun enjoyed by some organisms can notionally justify the indescribable horrors of Auschwitz. Nor can it outweigh the sporadic frightfulness of pain and despair that occurs every second of every day.\n\nOutlining how drugs and technologies, including intracranial self-stimulation (\"wireheading\"), designer drugs and genetic engineering, could end suffering for all sentient life, Pearce believes that \"over the next thousand years or so, the biological substrates of suffering will be eradicated completely.\" Mental suffering will be a relic of the past, just as physical suffering during surgery was eliminated by anaesthesia. The function of pain will be provided by some other signal, without the unpleasant experience. Using paradise engineering, human beings will be \"animated by gradients of genetically preprogrammed bliss orders of magnitude richer than anything physiologically accessible today.\"\nThe increasing number of vegans and vegetarians in the transhumanism movement has been attributed in part to Pearce's influence. A vegan himself, he has argued in favour of a \"cross-species global analogue of the welfare state\", suggesting that humanity might eventually \"reprogram predators\" to limit predation, reducing the suffering of prey animals. Fertility regulation could maintain herbivore populations at sustainable levels, \"a more civilised and compassionate policy option than famine, predation and disease.\"\n\n\n== Humanity+ ==\nIn 1998 Pearce co-founded the World Transhumanist Association, known from 2008 as Humanity+, with Nick Bostrom, now the director of the Future of Humanity Institute at the University of Oxford. Humanity+ is an international nonprofit membership organization that \"advocates the ethical use of technology to expand human capacities.\" Pearce is a member of the board of advisors.\nPearce is also a fellow of the Institute for Ethics and Emerging Technologies, and sits on the futurist advisory board of the Lifeboat Foundation. Until 2013 he was on the editorial advisory board of Medical Hypotheses. He has been interviewed by Vanity Fair (Germany) and on BBC Radio 4's The Moral Maze, among others.\n\n\n== References ==\n\n\n== External links ==\nThe Hedonistic Imperative", "ns": 0, "pageid": 253714, "title": "David Pearce (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}