{"batchcomplete": "", "query": {"normalized": [{"to": "David Wiggins", "from": "David_Wiggins"}], "pages": {"2156921": {"extract": "David Wiggins (born 8 March 1933) is a British moral philosopher, metaphysician, and philosophical logician working especially on identity and issues in meta-ethics. His 2006 book, Ethics. Twelve Lectures on the Philosophy of Morality defends a position he calls \"moral objectivism\".\n\n\n== Life ==\nWiggins read philosophy at Brasenose College, Oxford, and had J. L. Ackrill as a tutor. He was the Wykeham Professor of Logic from 1993 to 2000. He was president of the Aristotelian Society from 1999 to 2000. He is Fellow of the British Academy, and Foreign Honorary Member of the American Academy of Arts and Sciences.\n\n\n== Work ==\nAccording to philosopher Harold Noonan:\nThe most influential part of Wiggins's work has been in metaphysics, where he has developed a fundamentally Aristotelian conception of substance, enriched by insights drawn from Putnam (1975) and Kripke (1980). His works also contain influential discussions of the problem of personal identity, which Wiggins elucidates via a conception that he calls the \"Animal Attribute View.\"\n\n\n== Legacy ==\nWiggins' distinguished pupils include:\nJohn McDowell\nDerek Parfit\nJonathan Westphal\nTimothy Williamson\n\n\n== Selected writings ==\n\n\n=== Books ===\nEthics. Twelve Lectures on the Philosophy of Morality (Cambridge, 2006)\nSameness and Substance Renewed (Cambridge, 2001)\nNeeds, Values, Truth: Essays in the Philosophy of Value (Oxford, 1987; second edition 1998)\nSameness and Substance (Oxford, 1980)\nTruth, Invention, and the Meaning of Life (Proceedings of the British Academy, 1976)\nIdentity and Spatio-Temporal Continuity (Oxford, 1967)\n\n\n=== Articles ===\n\"A Sensible Subjectivism?\" (Needs, Values, Truth: Essays in the Philosophy of Value (New York: Oxford University Press, 1987), 185-214)\n\"Weakness of Will Commensurability, and the Objects of Deliberation and Desire\" (Proceedings of the Aristotelian Society, 1978)\n\"Towards a reasonable libertarianism\" (Essays on Freedom of Action, 1973 - Routledge & Kegan Paul)\n\"On Sentence-sense, Word-sense and Difference of Word-sense: Towards a Philosophical Theory of Dictionaries\" (1971) (link)\n\n\n== References ==\n\n\n== External links ==\nPicture of Wiggins - on the Ryle Room page.", "ns": 0, "pageid": 2156921, "title": "David Wiggins"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}