{"batchcomplete": "", "query": {"normalized": [{"to": "David Korten", "from": "David_Korten"}], "pages": {"178746": {"extract": "David C. Korten (born 1937) is an American author, former professor of the Harvard Business School, political activist, prominent critic of corporate globalization, and \"by training and inclination a student of psychology and behavioral systems\". His best-known publication is, When Corporations Rule the World (1995 and 2001). In 2011, he was named an Utne Reader visionary.\n\n\n== Early life and career ==\nDavid Korten was born in Longview, Washington, in 1937 and is a 1955 graduate of its R. A. Long High School. He received a master of business administration and Ph.D. from the Stanford University Graduate School of Business. He said: \"My early career [after leaving Stanford in 1959] was devoted to setting up business schools in low-income countries—starting with Ethiopia\". He served during the Vietnam War as a captain in the United States Air Force, undertaking U.S.-based teaching and organizational duties; and for five and a half years was a visiting professor in the Harvard Business School. While at Stanford in the 1950s, he married Frances Fisher Korten, with whom he now lives on Bainbridge Island near Seattle, Washington.\n\n\n== Career and main body of work ==\n\nKorten served for five and a half years as a visiting associate professor of the Harvard University Graduate School of Business where he taught in Harvard's middle management, M.B.A., and doctoral programs.\nHe also served as the Harvard Business School adviser to the Nicaragua-based Central American Institute of Business Administration. He subsequently joined the staff of the Harvard Institute for International Development, where he headed a Ford Foundation-funded project to strengthen the organization and management of national family planning programs.\nIn the late 1970s, Korten moved to Southeast Asia, where he lived for nearly fifteen years, serving as a Ford Foundation project specialist and, later, as Asia regional adviser on development management to the United States Agency for International Development (USAID), which involved him in regular travels to Pakistan, India, Bangladesh, Sri Lanka, Thailand, Indonesia, and the Philippines.\nKorten has written that he became disenchanted with the official aid system and devoted his last five years in Asia to \"working with leaders of Asian non-governmental organizations on identifying the root causes of development failure in the region and building the capacity of civil society organizations to function as strategic catalysts of national- and global-level change\". He formed the view that the poverty, growing inequality, environmental devastation, and social disintegration he was observing in Asia also was being experienced in nearly every country in the world, including the United States and other \"developed\" countries. He also concluded that the United States was actively promoting—both at home and abroad—the very policies that were deepening the resulting global crisis.\nHe returned to the U.S. in 1992 and has assisted in raising public consciousness of the political and institutional consequences of economic globalization and the expansion of corporate power at the expense of democracy, equity, and environmental protection.\nKorten is co-founder and board chair of the Positive Futures Network, which publishes the quarterly YES! Magazine. He is also a founding board member, emeritus, of the Business Alliance for Local Living Economies, a former associate of the International Forum on Globalization, and a member of the Club of Rome.\n\n\n== The Post-Corporate World ==\nBuilding on the arguments put forward in his 1995 book When Corporations Rule the World, Korten expands on several of the themes. Having made a case for the unworkability of current economic systems on several grounds - the impoverishment of the majority of the population, the need for indefinitely expanding credit leading to the debasement of the currency, and the finite limits of energy and material resources - he provides a context for discussing alternative ways of life, and explores possible courses of action to establish them.\n\n\n== The Great Turning ==\n\nKorten's 2006 book The Great Turning: From Empire to Earth Community argues that the development of empires about 5,000 years ago, initiated unequal distribution of power and social benefits to the small portion of the population they controlled. He also argues that corporations are modern versions of empire, both being social organizations based on hierarchies, chauvinism, and domination through violence.\nThe rise of powerful, advanced technology combined with the control of corporate- as well as nation-based empires is described as becoming increasingly destructive to communities and the environment. Korten postulates that the world is on the verge of a perfect storm of converging crises, including anthropogenic adverse climate change, post-peak oil production decline, and a financial crisis caused by an unbalanced global economy. This will precipitate major changes to the current economic and social structure.\nKorten believes that these crises will present an opportunity for significant changes that could replace the paradigm of \"Empire\" with one of \"Earth Community\". Although recognizing the potential that the opportunity may not be seized, Korten hopes that this opportunity will result in the emergence of an \"Earth Community\", based on sustainable, just, and caring communities that incorporate the values of mutual responsibility and accountability, and he advocates toward that.\n\n\n== Bibliography ==\nPlanned Change in a Traditional Society: Psychological Problems of Modernization in Ethiopia, 1972, Praeger Publishers\nPeople-Centered Development: Contributions Toward Theory and Planning Frameworks, with Rudi Klauss, 1984, Kumarian Press\nBureaucracy and the Poor: Closing the Gap, with Felipe B. Alfonso, 1985, Kumarian Press\nCommunity Management: Asian Experience and Perspectives, 1986, Kumarian Press\nGetting to the 21st Century: Voluntary Action and the Global Agenda, 1990, Kumarian Press\nThe Post Corporate World: Life After Capitalism, 2000, Berrett-Koehler Publishers\nAlternatives to Economic Globalization: A Better World is Possible, 2004 (Second Edition)\nThe Great Turning: From Empire to Earth Community, 2007 (Second Edition), Berrett-Koehler Publishers, 2006 (First Edition), Kumarian Press, Bloomfield\nAgenda for a New Economy: From Phantom Wealth to Real Wealth – A Declaration of Independence from Wall Street, 2010 (Second Edition), 2009 (First Edition), Berrett-Koehler Publishers\nGlobalizing Civil Society, 2010, ReadHowYouWant\nChange The Story, Change the Future, 2015, Berrett-Koehler Publishers\nWhen Corporations Rule the World, 2015 (Third Edition) 2001 (Second Edition), 1995 (First Edition), Berrett-Koehler Publishers\n\n\n== See also ==\nCorporate libertarianism\nEarth Charter\nSpaceship Earth\nJoanna Macy, collaborator with Korten who uses \"The Great Turning\" idea in her work\n\n\n== References ==\n\n\n== External links ==\nDavid Korten web site, Living Economies Forum\nDavid Korten's Blog on the web of YES! Magazine\nPeople-Centered Development Forum\nGreat Turning Initiative website\nYES! A Journal of Positive Futures (see also YES! Magazine)\nVideo of David Korten with the Dalai Lama during filming of the documentary Dalai Lama Renaissance[1]\nConscious Choice - The end of Business as Usual, 2007 article on Korten, his work, and an assessment of the significance of \"The Great Turning: From Empire to Earth Community\nWhat Can We Learn from the Antiglobalists? - 5,000-word discussion and critique of Korten's book The Great Turning\n\"The Betrayal of Adam Smith\" by David C. Korten\nThe Great Turning – A reference website for the Great Turning book and a resource list for the Great Turning movement\nThe Great Turning Navigators' Wiki\nWe are hard-wired to care and connect by David Korten, July 30, 2008, YES! Magazine\nThe Story of David Korten by Our World in Balance\nEverybody Wants To Rule The World - and interview with David Korten on the Great Turning by Arnie Cooper published in The Sun magazine", "ns": 0, "pageid": 178746, "title": "David Korten"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}