{"batchcomplete": "", "query": {"normalized": [{"to": "David Schmidtz", "from": "David_Schmidtz"}], "pages": {"2172168": {"extract": "David Schmidtz (born 1955) is a Canadian-American philosopher who has appointments in the philosophy and economics departments and the McGuire Center for Entrepreneurship at the University of Arizona.\n\n\n== Education ==\nSchmidtz grew up in Humboldt, Saskatchewan, Canada. In 1983, he received his B.A. in philosophy from the University of Saskatchewan. He earned an M.A. in philosophy from the University of Arizona in 1985, and an M.A. in economics, also from the University of Arizona, in 1987. Schmidtz earned his PhD at the University of Arizona under the direction of Allen Buchanan. He also studied with Joel Feinberg and Keith Lehrer, Holly Martin Smith, Mark Isaac, and Vernon Smith.\n\n\n== Teaching career ==\nIn 1988, Schmidtz took a job as an assistant professor at Yale University. He was promoted to associate professor in 1991. He left Yale after six years, going on to teach three semesters at Bowling Green State University. Schmidtz joined the faculty of the University of Arizona in 1995. He was promoted to professor of philosophy and joint professor of economics in 1998.\nSchmidtz taught first-year property as a visiting professor at Florida State University College of Law in 2007. In the 2014-15 academic year, he was a national Phi Beta Kappa Visiting Scholar and John Stuart Mill Professor at Hamburg University. Schmidtz is the founding director of the Freedom Center at the University of Arizona.\nAmong his former doctoral students are Walter Glannon, Lainie Friedman Ross, Linda Radzik, Steve Scalet, Rhonda Smith, Matt Zwolinski, Cara Nine, Jason Brennan, Matt Bedke, Chris Brown, Chris Freiman, Daniel Silvermint, Keith Hankins, and John Thrasher.\n\n\n== Writing ==\n\n\n=== Books ===\nHe is author of Elements of Justice, Rational Choice and Moral Agency, co-author of Social Welfare and Individual Responsibility (a “For & Against” book with Robert Goodin) and editor of a volume on Robert Nozick in the Cambridge University Press \"Contemporary Philosophy in Focus\" series. He also co-edited Environmental Ethics: What Really Matters, What Really Works (Oxford) with Elizabeth Willott; a second edition of this book appeared in 2012. His first book, The Limits of Government: An Essay on the Public Goods Argument, combined his interests in moral philosophy and economic analysis. Schmidtz has also written on rational choice theory and environmental ethics.\n\n\n=== Journals ===\nHe has published articles in many journals, including the Journal of Philosophy, Ethics, and Political Theory along with reviews in journals such as Philosophical Review, Canadian Journal of Philosophy, and Mind. Over eighty of his essays have been (or are in the process of being) reprinted, including Russian, Spanish, Portuguese, Mandarin, Turkish, Italian, Romanian, Polish, Czech, Slovak, Hebrew, and German translations. Thirteen of his essays (one previously unpublished, on Peter Singer's approach to moral theory) were published by Oxford Press as Person, Polis, Planet in 2008. A Brief History of Liberty (Wiley-Blackwell), with co-author Jason Brennan appeared in 2010. He is now working on Markets In Education (Oxford) with Harry Brighouse.\nSchmidtz is editor-in-chief of the Cambridge Press journal Social Philosophy and Policy.\n\n\n== Selected bibliography ==\n\n\n=== Books ===\nSchmidtz, David (1991). The limits of government: an essay on the public goods argument. Boulder: Westview Press. ISBN 9780813308708. \nSchmidtz, David (1996). Rational choice and moral agency. Princeton, N.J: Princeton University Press. ISBN 9780691029184. \nSchmidtz, David (1998). Social welfare and individual responsibility. Cambridge New York: Cambridge University Press. ISBN 9780521564618. \nSchmidtz, David (2002). Robert Nozick. Cambridge, UK New York: Cambridge University Press. ISBN 9780521782265. \nSchmidtz, David (2006). Elements of justice. Cambridge New York: Cambridge University Press. ISBN 9780521539364. \nSchmidtz, David (2008). Person, Polis, Planet. Oxford New York: Oxford University Press. ISBN 9780521539364. \nSchmidtz, David; Brennan, Jason (2010). A brief history of liberty. Chichester, U.K. Malden, MA: Wiley-Blackwell. ISBN 9781405170796. \nSchmidtz, David; Willott, Elizabeth (2012). Environmental ethics: what really matters, what really works. New York: Oxford University Press. ISBN 9780199793518. \nSchmidtz, David; Scalet, Steven P (2009), \"Famine, poverty, and property rights\", in Morris, Christopher, Amartya Sen, Cambridge New York: Cambridge University Press, pp. 170–190, ISBN 9780521618069 \n\n\n== See also ==\nCanadian philosophy\nList of Canadian philosophers\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nDavid Schmidtz's homepage\nRoberts, Russ (May 7, 2012). \"Schmidtz on Rawls, Nozick, and Justice\". EconTalk. Library of Economics and Liberty. \nDavid Schmidtz at Goodreads\nWorks by or about David Schmidtz in libraries (WorldCat catalog)", "ns": 0, "pageid": 2172168, "title": "David Schmidtz"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}