{"batchcomplete": "", "query": {"pages": {"1280290": {"extract": "Dignāga (c. 480 – c. 540 CE) was an Indian Buddhist scholar and one of the Buddhist founders of Indian logic (hetu vidyā). Dignāga's work laid the groundwork for the development of deductive logic in India and created the first system of Buddhist logic and epistemology (Pramana). According to Georges B Dreyfus, his philosophical school brought about an Indian \"epistemological turn\" and became the \"standard formulation of Buddhist logic and epistemology in India and Tibet.\" Dignāga's thought influenced later Buddhist philosophers like Dharmakirti and also Hindu thinkers of the Nyaya school. Dignāga's epistemology accepted only \"perception\" (pratyaksa) and \"inference\" (anumāṇa) are valid instruments of knowledge.\nDignāga was born into a South Indian Brahmin family in Simhavakta near Kanchipuram and very little is known of his early years, except that he took as his spiritual preceptor Nagadatta of the Pudgalavada school before being expelled and becoming a student of Vasubandhu.\n\n\n== Philosophy ==\n\nDignāga's epistemology holds that there are only two 'instruments of knowledge' or 'valid cognitions' (pramāṇa); \"perception\" (pratyaksa) and \"inference\" (anumāṇa). Perception is a non-conceptual knowing of particulars which is bound by causality, while inference is reasonable, linguistic and conceptual. This conservative epistemic theory was in contrast to the Nyaya school who accepted other means of knowledge such as Upamāṇa (comparison and analogy).\nDuring Dignāga's time, the Nyaya school of Hinduism had begun to hold debates using their five-step approach to making and evaluating arguments with logic. Buddhist debaters such as Dignāga wanted to engage in these debates, and also have a way to logically evaluate arguments, but a premise such as \"all dogs are mammals\" proved problematic for his idealist Yogacara philosophy. Dignāga was a student of Vasubandhu, and therefore believed that \"dharmas are empty.\" In other words, there are not universal qualities such as \"dog-ness\" or \"mammal-ness.\" Such universals would have to be unchanging, and since all things are subject to change and are lacking in essential essence according to his school of philosophy, Dignāga attempted to find a way to engage in argument within the Nyaya school without positing metaphysical Universals.\nTo do this he employed what is referred to in formal logic in the West as contraposition, or in Sanskrit, Apoha, where one switches the terms and swaps them for their term complement. Therefore, the example premise above, \"all dogs are mammals\" becomes \"all non-mammals are non-dogs.\" These two statements are logically equivalent. Once this had been done, Dignāga could make arguments about non-mammals without explicitly positing that mammals have an essential nature. While this move gets off the ground towards his goal, reflection shows that making universal statements about non-mammals still implies that there are mammals who share an essential nature, and everything else, which lacks this \"mammal-ness.\" Still, using this method Dignāga and other Buddhist logicians were able to further their logical discourse and felt more comfortable engaging in Nyaya structured debates.\n\n\n== Works ==\nAmong Dignāga's works there is Hetucakra (The wheel of reason), considered his first work on formal logic, advancing a new form of deductive reasoning. It may be regarded as a bridge between the older doctrine of trairūpya and Dignāga's own later theory of vyapti which is a concept related to the Western notion of implication.\nDignāga's most important work, the Pramāṇa-samuccaya (Compendium of Valid Cognition), examined perception, language and inferential reasoning. It presents perception as a bare cognition, devoid of conceptualization and sees language as useful fictions created through a process of exclusion (Apoha).\nOther works include:\nAlambana-parīkṣā, (The Treatise on the Objects of Cognition)\nAbhidharmakośa-marma-pradīpa - a condensed summary of Vasubandhu's seminal work\nA summary of the Aṣṭasāhasrika-prajñāpāramitā sūtra\nTrikāla-parikṣa\nNyāya-mukha\n\n\n== Philosophical school ==\nDignāga founded a tradition of Buddhist logic, and this school is sometimes called the \"School of Dignāga\" or the \"Dignāga-Dharmakīrti school\". In Tibetan it is often called “those who follow reasoning” (Tibetan: rigs pa rjes su ‘brang ba); in modern literature it is sometimes known by the Sanskrit 'pramāṇavāda', often translated as \"the Epistemological School\" or \"The logico-epistemological school.\"\nBuddhist philosophers who wrote on pramana include:\nDharmakīrti (c. 7th century)\nJinendrabuddhi\nDharmapala of Nalanda\nSantabhadra\nŚāntarakṣita (725–788)\nDharmottara (8th century)\nPrajñakaragupta\nSamkarananda\nRatnākaraśānti (c.1000)\nJñanasrimitra (975-1025)\nRatnakīrti (11th century)\nThis tradition of logic and epistemology continued in Tibet, where it was expanded by thinkers such as Cha-ba (1182-1251) and Sakya Pandita (1182–1251).\n\n\n== See also ==\nBuddhist logic\nCritical Buddhism\nDharmakirti\nEpistemology\nNyaya\n\n\n== References ==\n\n\n== Further reading ==\nChu, Junjie (2006).On Dignāga's theory of the object of cognition as presented in PS (V) 1, Journal of the International Association of Buddhist Studies 29 (2), 211–254\nFrauwallner, Erich, Dignāga, sein Werk und seine Entwicklung. (Wiener Zeitschrift für die Kunde Süd- und Ostasiens 2:83–164, 1959)\nHattori Masaaki, Dignāga, On Perception, being the Pratyakṣapariccheda of Dignāga's Pramāṇasamuccaya from the Sanskrit fragments and the Tibetan Versions (Cambridge, Mass.: Harvard University Press, 1968)\nHayes, Richard, Dignāga on the Interpretation of Signs (Dordrecht: Reidel Publishing Company, 1982)\nKatsura Shoryu, Dignāga and Dharmakīrti on apoha in E. Steinkellner ed., Studies in the Buddhist Epistemological Tradition (Vienna, Österreichische Akademie der Wissenschaften, 1991), pp. 129–146\nMookerjee, S. The Buddhist Philosophy of Universal Flux, an Exposition of the Philosophy of Critical Realism as expounded by the School of Dignāga (Calcutta, 1935)\nSastri, N. Aiyaswami, Diṅnāga's Ālambanaparīkṣā and Vṛtti. Restored with the commentary of Dharmapāla into Sanskrit from the Tibetan and Chinese versions and edited with English translations and notes with extracts from Vinītadeva's commentary. (Madras: The Adyar Library. 1942)[1]\nTucci, G The Nyāyamukha of Dignāga, the oldest Buddhist Text on Logic after Chinese and Tibetan Materials (Materialien zur Kunde des Buddhismus, 15 Heft, Heidelberg, 1930)\nVidyabhusana, S.C. A History of Indian Logic – Ancient, Mediaeval and Modern Schools (Calcutta, 1921)\n\n\n== External links ==\nDignaga's Logic of Invention, by Volker Peckhaus\nDas Rad der Gründe, German translation of The Wheel of Reason\nVidhabhusana, Satis Chandra (1907). History of the Mediaeval School of Indian Logic. Calcutta University.\n佛家因明的理性思考 蔡禮德 Hetu－Vidyā Of Rational Thinking, Choy L.T.(2008)\n逻辑学(Logic)及简单枚举归纳法(Induction by Simple Enumeration)\n科学方法(Scientific Method)及假设演绎法(Hypothetico-Deductive Method)\n\n佛家因明的理性思考再探 蔡禮德 Hetu－Vidyā Of Rational Thinking(II), Choy L.T.(2009)\n因明的辨义理(Meaning & Argument Analysis)方法，具有语理分析(Linguistic – conceptual Analysis)及谬误剖析(Fallacy Analysis)的元素。\n\n佛家因明的理性思考三探 蔡禮德 Hetu－Vidyā Of Rational Thinking(III), Choy L.T.(2010)\n「现量」及「比量」意谓真\n「似现量」及「似比量」意谓非真。\n\n因明邏輯真值量化的探索 李潤生、 蔡禮德 (2006)\n「因明逻辑真值的量化公式」与贝尔斯学派统计学 蔡禮德 Quantification Formula Of Hetu－Vidyā Logical Truth－Value And Bayesian School Statistics, Choy L.T.(2008)\n佛家因明提綱 蔡禮德 A Hetu－Vidyā Framework, Choy L.T.(2013)\n因明與菩薩行五明\n\n佛家因明的概念功能與分類 蔡禮德 A Hetu－Vidyā Framework(II), Choy L.T. (2013)\n唯識宗的世界概念：由假說我法(一) 蔡禮德 A Hetu－Vidyā Framework(III), Choy L.T.(2014)\n佛家「因明」指导「内明」 蔡礼德 A Hetu－Vidyā Framework(IV), Choy L.T. (2014)", "ns": 0, "pageid": 1280290, "title": "Dignāga"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}