{"batchcomplete": "", "query": {"normalized": [{"to": "Dimitris Dimitrakos", "from": "Dimitris_Dimitrakos"}], "pages": {"13988922": {"extract": "Dimitris Dimitrakos (Greek: Δημήτρης Δημητράκος; born 1936) is a Greek philosopher, currently Professor Emeritus of Political Philosophy in the Philosophy of Science Department of the University of Athens. He originally studied economics at the London School of Economics), taking part in seminars given there by Karl Popper, before obtaining a Ph.D. in Political Philosophy at the University of Paris with a thesis on Antonio Gramsci. Since then he has taught at the Universities of Paris, Reims, Thessaly and Athens and as a visiting professor at the LSE.\nDimitrakos' work covers many areas of epistemology, political philosophy and social theory which include Karl Popper's philosophy of science and society, analytical aspects of Marxism, the role of rationalism and liberalism in social and political theory as well as individual rights and democratic theory.\nHe has also written extensively on civil society, nationalism and current political problems. His research interests focus on economic theory, liberalism and the epistemology of social sciences.\nIn July 2002, he was a speaker at the Karl Popper centenary conference held in Vienna.\nHe is currently President of the \"Open Society\", an association for the promotion of principles of democracy, liberalism, the rule of law, human rights and civil society in Greece.\n\n\n== Select bibliography ==\n\"Science politique\", Encyclopédie Weber (Paris, 1971).\nGramsci et le problème de la conquête du pouvoir (Paris, 1980).\nA Vision of Liberty (Athens, 1997).\n\"Gramsci and the contemporary debate on Marxism\", Philosophy of Social Sciences, January 1992.\n\n\n== References ==\n\n\n== External links ==\nDimitris Dimitrakos' page at the Department of Philosophy and History of Science at the University of Athens", "ns": 0, "pageid": 13988922, "title": "Dimitris Dimitrakos"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}