{"batchcomplete": "", "query": {"normalized": [{"to": "Diodorus Cronus", "from": "Diodorus_Cronus"}], "pages": {"2437676": {"extract": "Diodorus Cronus (Greek: Διόδωρος Κρόνος; died c. 284 BCE) was a Greek philosopher and dialectician connected to the Megarian school. He was most notable for logic innovations, including his master argument formulated in response to Aristotle's discussion of future contingents.\n\n\n== Life ==\nDiodorus was a son of Ameinias of Iasus in Caria. He lived at the court of Alexandria in the reign of Ptolemy I Soter, who is said to have given him the surname of Cronus (\"old fogey\") on account of his inability to solve at once some dialectic problem proposed by Stilpo, when the two philosophers were dining with the king. Diodorus is said to have taken that disgrace so much to heart that after his return from the meal, and writing a treatise on the problem, he died in despair. However, according to Strabo, Diodorus himself adopted the surname of Cronus from his teacher, Apollonius Cronus. Diodorus is thought to have died around 284 BCE; his date of birth is unknown. It was once thought that he was old enough to have influenced Aristotle (384–322 BCE), but there is no strong evidence for this.\nDiodorus was particularly celebrated for his great dialectic skill, for which he was called The Dialectician. This effectively became his surname, and descended even to his five daughters, Menexene, Argia, Theognis, Artemesia, and Pantaclea, who were likewise distinguished as dialecticians. His pupils included Philo the Dialectician, and Zeno of Citium — the founder of the Stoic school. Although influenced by the Megarian school it is not clear how closely Diodorus and his fellow dialecticians were connected to that particular philosophical school.\n\n\n== Philosophy ==\nOn the doctrines of Diodorus we possess only fragmentary information, and not even the titles of his works are known. He seems to have fully developed the dialectic art of the Megarian school. He was much occupied with the theory of proof and of hypothetical propositions. In the same manner as he rejected in logic the divisibility of the fundamental notion, he also maintained, in his physical doctrines, that space was indivisible, and consequently that motion was impossible. He further denied the coming into existence and all multiplicity both in time and in space; but he considered the things that fill up space as one whole composed of an infinite number of indivisible particles.\nDiodorus made use of the Sorites paradox, and is said to have invented two others of the same kind, viz. The Masked Man and The Horns, which are, however, also ascribed to Eubulides. He also rejected the view that words are ambiguous, any uncertainty in understanding was always due to speakers expressing themselves obscurely.\n\n\n=== Master Argument ===\n\nAristotle, in his work On Interpretation, had wrestled with the problem of future contingents. In particular whether one can meaningfully regard future contingents as true or false now, if the future is open, and if so, how?\nIn response, Diodorus maintained that possible was identical with necessary (e.g., not contingent); so that the future is as certain and defined as the past. Alexander of Aphrodisias tells us that Diodorus believed that that alone is possible which either is happening now, or will happen at some future time. When speaking about facts of an unrecorded past, we know well that a given fact either occurred or did not occur, yet without knowing which of the two is true — and therefore we affirm only that the fact may have occurred: so also about the future, either the assertion that a given fact will at some time occur, is positively true, or the assertion that it will never occur, is positively true: the assertion that it may or may not occur some time or other, represents only our ignorance, which of the two is true. That which will never at any time occur, is impossible.\nDiodorus went on to formulate an argument that became known as the Master Argument (or Ruling Argument: ho kurieuôn logos). The most succinct description of it is provided by Epictetus:\n\nThe argument called the Master Argument appears to have been proposed from such principles as these: there is in fact a common contradiction between one another in these three propositions, each two being in contradiction to the third. The propositions are: (1) every past truth must be necessary; (2) that an impossibility does not follow a possibility; (3) something is possible which neither is nor will be true. Diodorus observing this contradiction employed the probative force of the first two for the demonstration of this proposition: That nothing is possible which is not true and never will be.\n\nEpictetus' description of the Master Argument is not in the form as it would have been presented by Diodorus, which makes it difficult to know the precise nature of his argument. To modern logicians, it is not obvious why these three premises are inconsistent, or why the first two should lead to the rejection of the third. Modern interpretations therefore assume that there must have been extra premises in the argument tacitly assumed by Diodorus and his contemporaries.\nOne possible reconstruction is as follows: For Diodorus, if a future event is not going to happen, then it was true in the past that it would not happen. Since every past truth is necessary (proposition 1), it was necessary that in the past it would not happen. Since the impossible cannot follow from the possible (proposition 2), it must have always been impossible for the event to occur. Therefore if something will not be true, it will never be possible for it to be true, and thus proposition 3 is shown to be false.\nEpictetus goes on to point out that Panthoides, Cleanthes, and Antipater of Tarsus made use of the second and third proposition to demonstrate that the first proposition was false. Chrysippus, on the other hand, agreed with Diodorus that everything true as an event in the past is necessary, but attacked Diodorus' view that the possible must be either what is true or what will be true. He thus made use of the first and third proposition to demonstrate that the second proposition was false.\n\n\n== Notes ==\n\n\n== References ==\nDorandi, Tiziano (1999). \"Chapter 2: Chronology\". In Algra, Keimpe; et al. The Cambridge History of Hellenistic Philosophy. Cambridge: Cambridge University Press. p. 52. ISBN 9780521250283. \n Laërtius, Diogenes (1925). \"Socrates, with predecessors and followers: Euclides\". Lives of the Eminent Philosophers. 1:2. Translated by Hicks, Robert Drew (Two volume ed.). Loeb Classical Library. § 106–111. \n\n\n== Further reading ==\nGaskin, Richard, The Sea-Battle and the Master Argument. Aristotle and Diodorus Cronus on the Metaphysics of the Future. Berlin, Walter de Gruyter, 1995.\nSedley, David. Diodorus Cronus and Hellenistic Philosophy. Proceedings of the Cambridge Philological Society 203, N.S. 23 (1977), P. 74-120.\nVuillemin, Jules. Nécessité ou contingence. L'aporie de Diodore et les systèmes philosophiques. Paris 1984. (English translation: Necessity or Contingency. The Master Argument, Stanford: CSLI Publications, 1996. ISBN 1-881526-86-0, paperback ISBN 1-881526-85-2).\n\n\n== External links ==\nSelected Bibliography on the \"Master Argument\", Diodorus Cronus, Philo the Dialectician with a bibliography on the problem of future contingents", "ns": 0, "pageid": 2437676, "title": "Diodorus Cronus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}