{"batchcomplete": "", "query": {"normalized": [{"to": "Dirk van Dalen", "from": "Dirk_van_Dalen"}], "pages": {"26828544": {"extract": "Dirk van Dalen (born 20 December 1932, Amsterdam) is a Dutch mathematician and historian of science.\nVan Dalen studied mathematics and physics and astronomy at the University of Amsterdam. Inspired by the work of LEJ Brouwer and Arend Heyting, he received his Ph.D. in 1963 from the University of Amsterdam for the thesis Extension problems in intuitionistic plane Projective geometry. From 1964 to 1966 Van Dalen taught logic and mathematics at MIT, and later Oxford. From 1967 he was professor at the University of Utrecht. In 2003 Dirk van Dalen was awarded the Academy Medal 2003 of the Royal Dutch Academy of Sciences for bringing the works of Brouwer to international attention.\n\n\n== Works ==\nFoundations of Set Theory, in samenwerking met Yehoshua Bar-Hillel en Azriel Levy, uitgeverij North Holland Amsterdam, 1958.\nExtension problems in intuitionistic plane projective geometry, 1963.\nStructure and Logic, Springer Universitext, 1980. ISBN 3-540-20879-8\nBrouwer's Cambridge Lectures on Intuitionism, Dirk van Dalen (redactie), Cambridge University Press, Cambridge, 1981.\nTroelstra, Anne; van Dalen, Dirk (1988). Constructivism in Mathematics, Vol. 2. Studies in Logic and the Foundations of Mathematics. ISBN 0-444-70358-6. \nZermelo and the Skolem Paradox, Dirk van Dalen en Heinz-Dieter Ebbinghaus in: The Bulletin of Symbolic Logic, Volume 6, Nr 2, Juni 2000.\nIntuitionistic Logic, in: The Blackwell Guide to Philosophical Logic, Lou Goble (redactie), Blackwell New York, 2001.\nL.E.J. Brouwer - Topologist, Institionalist, Philosopher, Dirk van Dalen, Springer-Verlag, London, 2013.\n\n\n== References ==\nThe article was originally created as a translation (Google) of the corresponding article in Dutch Wikipedia.\n\n\n== Further reading ==\nDirk van Dalen Festschrift, Henk Barendregt en anderen (redactie), University of Utrecht, Department of Philosophy, 1993\nSpecial issue: a tribute to Dirk van Dalen, Yuri Gurevich (redactie), uitgeverij North-Holland, Amsterdam, 1995.\n\n\n== External links ==\nKoninklijke bibliotheek over Dirk van Dalen\nHomepage aan de Universiteit van Utrecht\nPersbericht KNAW 2003\nDirk van Dalen at the Mathematics Genealogy Project", "ns": 0, "pageid": 26828544, "title": "Dirk van Dalen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}