{"batchcomplete": "", "query": {"normalized": [{"to": "Donna Haraway", "from": "Donna_Haraway"}], "pages": {"233258": {"extract": "Donna J. Haraway (born September 6, 1944) is a Distinguished Professor Emerita in the History of Consciousness Department and Feminist Studies Department at the University of California, Santa Cruz, United States. Haraway, a prominent scholar in the field of science and technology studies, was described in the early 1990s as a \"feminist, rather loosely a neo-Marxist and a postmodernist\". She is the author of numerous books and essays that bring together questions of science and feminism, such as \"A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century\" (1985) and Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective (1988).\nHaraway has taught Women's Studies and the History of Science at the University of Hawaii and Johns Hopkins University. In September 2000, Haraway was awarded the highest honor given by the Society for Social Studies of Science (4S), the J. D. Bernal Award, for lifetime contributions to the field. Haraway's works have contributed to the study of both human-machine and human-animal relations. Her works have sparked debate in primatology, philosophy, and developmental biology. Haraway participated in a collaborative exchange with the eminent feminist theorist Lynn Randolph from 1990 to 1996. Their engagement with specific ideas relating to feminism, technoscience, political consciousness, and other social issues, formed the images and narrative of Haraway's book.\n\n\n== Early life ==\nDonna Jeanne Haraway was born in 1944 in Denver, Colorado. Haraway's father was a sportswriter for The Denver Post and her mother, who came from a heavily Irish Catholic background, died when Haraway was 16 years old. Haraway attended high school at St. Mary’s Academy in Cherry Hills Village, Colorado. Haraway triple majored in zoology, philosophy and literature at the Colorado College. After college, Haraway moved to Paris and studied evolutionary philosophy and theology at the Fondation Teilhard de Chardin on a Fulbright scholarship. She completed her Ph.D. in biology at Yale in 1970 writing a dissertation about the use of metaphor in shaping experiments in experimental biology titled The Search for Organizing Relations: An Organismic Paradigm in Twentieth-Century Developmental Biology, later edited into a book and published under the title Crystals, Fabrics, and Fields: Metaphors of Organicism in Twentieth-Century Developmental Biology. Haraway was the recipient of a number of scholarships, to which she wittily accepted (alluding to the Cold War and post-war American hegemony) saying, “...people like me became national resources in the national science efforts. So, there was money available for educating even Irish Catholic girls’ brains.\"\n\n\n== Major themes ==\n\n\n=== Primate Visions ===\nHaraway’s work is grounded in the history of science and biology. In Primate Visions: Gender, Race, and Nature in the World of Modern Science, she focuses on the metaphors and narratives that direct the science of primatology. She asserts that there is a tendency to masculinize the stories about \"reproductive competition and sex between aggressive males and receptive females [that] facilitate some and preclude other types of conclusions\". She contends that female primatologists focus on different observations that require more communication and basic survival activities, offering very different perspectives of the origins of nature and culture than the currently accepted ones. Drawing on examples of Western narratives and ideologies of gender, race and class, Haraway questions the most fundamental constructions of scientific human nature stories based on primates. In Primate Visions, she writes:\n\n\"My hope has been that the always oblique and sometimes perverse focusing would facilitate revisionings of fundamental, persistent western narratives about difference, especially racial and sexual difference; about reproduction, especially in terms of the multiplicities of generators and offspring; and about survival, especially about survival imagined in the boundary conditions of both the origins and ends of history, as told within western traditions of that complex genre\".\n\nHaraway's aim for science is \"to reveal the limits and impossibility of its 'objectivity' and to consider some recent revisions offered by feminist primatologists\". Haraway presents an alternative perspective to the accepted ideologies that continue to shape the way scientific human nature stories are created. Haraway urges feminists to be more involved in the world of technoscience and to be credited for that involvement. In a 1997 publication, she remarked:\n\nI want feminists to be enrolled more tightly in the meaning-making processes of technoscientific world-building. I also want feminist—activists, cultural producers, scientists, engineers, and scholars (all overlapping categories) — to be recognized for the articulations and enrollment we have been making all along within technoscience, in spite of the ignorance of most \"mainstream\" scholars in their characterization (or lack of characterizations) of feminism in relation to both technoscientific practice and technoscience studies.\n\n\n=== \"A Cyborg Manifesto\" ===\n\nIn 1985, Haraway published the essay \"A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century\" in Socialist Review. Although most of Haraway's earlier work was focused on emphasizing the masculine bias in scientific culture, she has also contributed greatly to feminist narratives of the twentieth century. For Haraway, the Manifesto came at a critical juncture at which feminists, in order to have any real-world significance, had to acknowledge their situatedness within what she terms the \"informatics of domination.\" Feminists must, she proclaims, unite behind \"an ironic dream of a common language for women in the integrated circuit.\" Women were no longer on the outside along a hierarchy of privileged binaries but rather deeply imbued, exploited by and complicit within networked hegemony, and had to form their politics as such.\nAccording to Haraway's \"Manifesto\", \"there is nothing about being female that naturally binds women together into a unified category. There is not even such a state as 'being' female, itself a highly complex category constructed in contested sexual scientific discourses and other social practices\" (p. 155). A cyborg does not require a stable, essentialist identity, argues Haraway, and feminists should consider creating coalitions based on \"affinity\" instead of identity. To ground her argument, Haraway analyzes the phrase \"women of color\", suggesting it as one possible example of affinity politics. Using a term coined by theorist Chela Sandoval, Haraway writes that \"oppositional consciousness\" is comparable with a cyborg politics, because rather than identity it stresses how affinity comes as a result of \"otherness, difference, and specificity\" (p. 156).\n\n\n=== Cyborg feminism ===\nIn her updated essay \"A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century\", in her book Simians, Cyborgs and Women: The Reinvention of Nature (1991), Haraway uses the cyborg metaphor to explain how fundamental contradictions in feminist theory and identity should be conjoined, rather than resolved, similar to the fusion of machine and organism in cyborgs. \"A Cyborg Manifesto\" is also an important feminist critique of capitalism.\n\n\n=== \"Situated Knowledges\" ===\nSituated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective sheds light on Haraway's vision for a feminist science. This essay originated as a commentary on Sandra Harding's The Science Question in Feminism (1986) and is a reply to Harding's \"successor science\". Haraway offers a critique of the feminist intervention into masculinized traditions of scientific rhetoric and the concept of objectivity. The essay identifies the metaphor that gives shape to the traditional feminist critique as a polarization. At one end lies those who would assert that science is a rhetorical practice and, as such, all \"science is a contestable text and a power field\" (p. 577). At the other are those interested in a feminist version of objectivity, a position Haraway describes as a \"feminist empiricism\" .\n\n\n== Criticisms ==\nHaraway's work has been criticized for being \"methodologically vague\" and using noticeably opaque language that is \"sometimes concealing in an apparently deliberate way.\" Several reviewers have argued that her understanding of the scientific method is questionable, and that her explorations of epistemology at times leave her texts virtually meaning-free.\nA 1991 review of Haraway's Primate Visions, published in the International Journal of Primatology, provides examples of some of the most common critiques of her view of science:\n\nThis is a book that contradicts itself a hundred times; but that is not a criticism of it, because its author thinks contradictions are a sign of intellectual ferment and vitality. This is a book that systematically distorts and selects historical evidence; but that is not a criticism, because its author thinks that all interpretations are biased, and she regards it as her duty to pick and choose her facts to favor her own brand of politics. This is a book full of vaporous, French-intellectual prose that makes Teilhard de Chardin sound like Ernest Hemingway by comparison; but that is not a criticism, because the author likes that sort of prose and has taken lessons in how to write it, and she thinks that plain, homely speech is part of a conspiracy to oppress the poor. This is a book that clatters around in a dark closet of irrelevancies for 450 pages before it bumps accidentally into its index and stops; but that is not a criticism, either, because its author finds it gratifying and refreshing to bang unrelated facts together as a rebuke to stuffy minds. This book infuriated me; but that is not a defect in it, because it is supposed to infuriate people like me, and the author would have been happier still if I had blown out an artery. In short, this book is flawless, because all its deficiencies are deliberate products of art. Given its assumptions, there is nothing here to criticize. The only course open to a reviewer who dislikes this book as much as I do is to question its author’s fundamental assumptions—which are big-ticket items involving the nature and relationships of language, knowledge, and science.\n\nAnother review of the same book, appearing in a 1990 issue of the American Journal of Primatology, offers a similar criticism of Haraway's literary style and scholarly methods:\n\nThere are many places where an editorial hand appears absent altogether. Neologisms are continually coined, and sentences are paragraph-long and convoluted. Biography, history, propaganda, science, science fiction, and cinema are intertwined in the most confusing way. Perhaps the idea is to induce a slightly dissociated state, so that readers can be lulled into belief. If one did not already possess some background, this book would give no lucid history of anthropology or primatology.\n\n\n== Publications ==\nCrystals, Fabrics, and Fields: Metaphors of Organicism in Twentieth-Century Developmental Biology, 1976. ISBN 978-0-300-01864-6\n\"A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century\", Socialist Review, no. 80 (1985): 65–108.\n\"Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspectives\", in Feminist Studies, pp. 575–599, 1988.\nPrimate Visions: Gender, Race, and Nature in the World of Modern Science, Routledge: New York and London, 1989. ISBN 978-0-415-90294-6\nSimians, Cyborgs and Women: The Reinvention of Nature, New York: Routledge, and London: Free Association Books, 1991 (includes \"A Cyborg Manifesto: Science, Technology, and Socialist-Feminism in the Late Twentieth Century\"). ISBN 978-0-415-90387-5\nModest_Witness@Second_Millennium.FemaleMan©Meets_OncoMouse™: Feminism and Technoscience, New York: Routledge, 1997 (winner of the Ludwig Fleck Prize). ISBN 0-415-91245-8\nHow Like a Leaf: A Conversation with Donna J. Haraway, Thyrza Nichols Goodeve, Routledge, 1999. ISBN 978-0-415-92402-3\nThe Companion Species Manifesto: Dogs, People, and Significant Otherness, Chicago: Prickly Paradigm Press, 2003. ISBN 0-9717575-8-5\nWhen Species Meet, Minnesota: University of Minnesota Press, 2008. ISBN 0-8166-5045-4\n\n\n== See also ==\nA Cyborg Manifesto\nCyborg anthropology\nDemocratic transhumanism\nEcofeminism\nPostgenderism\nPosthumanism\nPostmodernism\nSandy Stone\nTechno-progressivism\nTechnoscience\nFeminist technoscience\n\n\n== Sources ==\nBurow-Flak, Elizabeth, \"Background Information on Cyborg Manifesto\", 17 September 2000.\nCachel, Susan. \"Partisan primatology. Review of Primate Visions: Gender, Race, and Nature in the World of Modern Science\". American Journal of Primatology. 22:2 (1990) 139–142.\nCampbell, Kirsten, \"The Promise of Feminist Reflexivities: Developing Donna Haraway's Project for Feminist Science Studies\", in Hypatia, 2004, pp. 162–182.\nCartmill, Matt. \"Book Review - Primate Visions: Gender, Race, and Nature in the world of Modern Science\". International Journal of Primatology. 12:1 (1991) 67–75.\nCarubia, Josephine M., \"Haraway on the Map\", in Semiotic Review of Books. 9:1 (1998): 4–7.\nElkins, Charles, \"The Uses of Science Fiction\", in Science Fiction Studies, 17:2 (1990).\n\"Feminist Epistemology and Philosophy of Science\", in Stanford Encyclopedia of Philosophy, January 30, 2006.\nFlanagan, Mary and Austin Booth, Reload: Rethinking Women + Cyberculture, 2002.\nDelphine, Gardey (May 2014). \"The Reading of an Œuvre. Donna Haraway: The Poetics and Politics of Life\". Feministische Studien (in German). Lucius Lucius Verlag MBH. 32 (1): 86–100. \nHamner, M. Gail. \"The Work of Love: Feminist Politics and the Injunction to Love\". In Joerg Rieger, ed. Opting for the Margins: Postmodernity and Liberation in Christian Theology, Oxford University Press, 2003.\nHaraway, Donna, \"A Cyborg Manifesto: Science, Technology and Socialist-‐Feminism in the Late Twentieth Century’.\" The Cybercultures Reader, Routledge, London (2000): 291.\nKunzru, Hari. \"You Are Cyborg\", in Wired Magazine, 5:2 (1997): 1–7.\nLibrary of Congress. Catalog of Copyright Entries Third Series: 1973: January–June, Washington: The Library of Congress Copyright Office, 1975, 674. Retrieved February 16, 2015.\nO'Riley, Patricia Ann, \"Technology, culture, and socioeconomics: a rhizoanalysis of educational discourses\", New York: P. Lang, 2003.\nPackman, Carl, \"God(desses) and the Jouissance of Woman, or The (Cyborg) Future of Enjoyment\"\nRusson, Anne. \"Deconstructing Primatology?\", in Semiotic Review of Books, 2:2 (1991): 9–11.\nSandoval, Chela, \"New Sciences: Cyborg Feminism and the Methodology of the Oppressed\", in Chris Hables Gray (ed.), The Cyborg Handbook, New York: Routledge, 1995.\nSenft, Theresa M. \"Reading Notes on Donna Haraway's 'Cyborg Manifesto'\", October 21, 2001. Retrieved February 1, 2006.\nYoung, Robert M, \"Science, Ideology & Donna Haraway\", in Science as Culture, 15.3 (1992): 165–207.\n\n\n== Footnotes ==\n\n\n== External links ==\nDonna Haraway Faculty Webpage at UC Santa Cruz, History of Consciousness Program\n1997 Interview in Wired", "ns": 0, "pageid": 233258, "title": "Donna Haraway"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}