{"batchcomplete": "", "query": {"normalized": [{"to": "Duns Scotus", "from": "Duns_Scotus"}], "pages": {"34293405": {"extract": "John Duns, commonly called Duns Scotus (/dʌnz ˈskoʊtəsˌ ˈskɒtəs/; c. 1266 – 8 November 1308), is generally considered to be one of the three most important philosopher-theologians of the High Middle Ages. Scotus has had considerable influence on both Catholic and secular thought. The doctrines for which he is best known are the \"univocity of being,\" that existence is the most abstract concept we have, applicable to everything that exists; the formal distinction, a way of distinguishing between different aspects of the same thing; and the idea of haecceity, the property supposed to be in each individual thing that makes it an individual. Scotus also developed a complex argument for the existence of God, and argued for the Immaculate Conception of Mary.\nDuns Scotus was given the scholastic accolade Doctor Subtilis (Subtle Doctor) for his penetrating and subtle manner of thought. He was beatified by Pope John Paul II in 1993.\n\n\n== Life ==\n\nLittle is known of Duns Scotus apart from his work. His date of birth is thought to have been between 23 December 1265 and 17 March 1266, born into a leading family of the region. The site of his birth, in front of the Pavilion Lodge, near the North Lodge of Duns Castle, is now marked by a cairn which was erected in 1966 by the Franciscan friars of the United Kingdom to mark the 700th anniversary of his birth. Duns Scotus received the religious habit of the Friars Minor at Dumfries, where his uncle, Elias Duns, was guardian.\nDuns Scotus's age is based on the first certain date for his life, that of his ordination to the priesthood at St Andrew's, Northampton, England on 17 March 1291. The minimum canonical age for receiving holy orders is 25 and it is generally assumed that he would have been ordained as soon as it was permitted. That his contemporaries called him Johannes Duns, after the medieval practice of calling people by their Christian name followed by their place of origin, suggests that he came from Duns, in Berwickshire, Scotland.\nAccording to tradition, Duns Scotus was educated at a Franciscan studium (a medieval university), a house behind St Ebbe's Church, Oxford, in a triangular area enclosed by Pennyfarthing Street and running from St Aldate's to the Castle, the Baley and the old wall, where the Friars Minor had moved when the University of Paris was dispersed in 1229–30. At that time there would have been about 270 persons living there, of whom about 80 would have been friars.\nDuns Scotus appears to have been in Oxford by 1300, as he is listed among a group of friars for whom the provincial superior of the English ecclesiastical province (which included Scotland) requested faculties from the Bishop of Lincoln for the hearing of confessions. He took part in a disputation under the regent master, Philip of Bridlington. He began lecturing on Peter Lombard's Sentences at the prestigious University of Paris towards the end of 1302. Later in that academic year, however, he was expelled from the University of Paris for siding with Pope Boniface VIII in his feud with King Philip IV of France over the taxation of church property.\nDuns Scotus was back in Paris before the end of 1304, probably returning in May. He continued lecturing there until, for reasons that are still mysterious, he was dispatched to the Franciscan studium at Cologne, probably in October 1307. According to the 15th-century writer William Vorilong, his departure was sudden and unexpected. He was relaxing or talking with students in the Prato clericorum or Pre-aux-Clercs – an open area of the Rive Gauche used by scholars for recreation – when orders arrived from the Franciscan Minister General; Scotus left immediately, taking few or no personal belongings.\nDuns Scotus died unexpectedly in Cologne in November 1308; the date of his death is traditionally given as 8 November. He is buried in the Church of the Friars Minor there. His sarcophagus bears the Latin inscription:\n\nThe story about Duns Scotus being buried alive, in the absence of his servant who alone knew of his susceptibility to coma, is probably a myth. It was reported by Francis Bacon in his Historia vitae et mortis.\nThe colophon of Codex 66 of Merton College, Oxford says that Scotus was also at Cambridge, but we do not know for certain if this is true, or, if it was, when he was there.\n\n\n== Work ==\nScotus’s great work is his commentary on the Sentences of Peter Lombard, which contains nearly all the philosophical views and arguments for which he is well known, including the univocity of being, the formal distinction, less than numerical unity, individual nature or ‘thisness' (haecceity), his critique of illuminationism and his renowned argument for the existence of God. His commentary exists in several versions. The standard version is the Ordinatio (also known as the Opus oxoniense), a revised version of lectures he gave as a bachelor at Oxford. The initial revision was probably begun in the summer of 1300 — see the remarks in the Prologue, question 2, alluding to the Battle of Wadi al-Khazandar in 1299, news of which probably reached Oxford in the summer of 1300. It was still incomplete when Scotus left for Paris in 1302. The original lectures were also transcribed and recently published as the Lectura.\nThe two other versions of the work are Scotus's notes for the Oxford lectures, recently published as the Lectura, the first book of which was probably written in Oxford in the late 1290s, and the Reportatio parisiensis (or Opus parisiense), consisting of transcriptions of the lectures on the Sentences given by Scotus when he was in Paris. A reportatio is a student report or transcription of the original lecture of a master. A version that has been checked by the master himself is known as a reportatio examinata.\nBy the time of Scotus, these 'commentaries' on the Sentences were no longer literal commentaries. Instead, Peter Lombard's original text was used as a starting point for highly original discussions on topics of theological or philosophical interest. For example, Book II Distinction 2, about the location of angels, is a starting point for a complex discussion about continuous motion, and whether the same thing can be in two different places at the same time (bilocation). In the same book, Distinction 3, he uses the question of how angels can be different from one another, given that they have no material bodies, to investigate the difficult question of individuation in general.\n\nScotus wrote purely philosophical and logical works at an early stage of his career, consisting of commentaries on Aristotle's Organon. These are the Questions on Porphyry's Isagoge and Aristotle's Categories, Peri hermeneias, and De sophisticis elenchis, probably dating to around 1295. His commentary on Aristotle's Metaphysics was probably written in stages, the first version having started around 1297, with significant additions and amendments possibly after the completion of the main body of the Ordinatio. His Expositio on the Metaphysics was lost for centuries but was recently rediscovered and edited by Giorgio Pini.\nIn addition, there are 46 short disputations called Collationes, probably dating from 1300–1305; a work in natural theology (De primo principio); and his Quaestiones Quodlibetales, probably dating to Advent 1306 or Lent 1307.\nA number of works once believed to have been written by Scotus are now known to have been misattributed. There were already concerns about this within two centuries of his death, when the 16th-century logician Jacobus Naveros noted inconsistencies between these texts and his commentary on the Sentences, leading him to doubt whether he had written any logical works at all. The Questions on the Prior Analytics (In Librum Priorum Analyticorum Aristotelis Quaestiones) were also discovered to be mistakenly attributed. In 1922, Grabmann showed that the logical work De modis significandi was actually by Thomas of Erfurt, a 14th-century logician of the modist school. Thus the claim that Martin Heidegger wrote his Habilitationsschrift on Scotus is only half true, as the second part is actually based on the work by Erfurt.\n\n\n== Metaphysics ==\n\n\n=== Realism ===\nScotus is generally considered to be a realist (as opposed to a nominalist) in that he treated universals as real. He attacks a position close to that later defended by Ockham, arguing that things have a common nature – for example the humanity common to Socrates, Plato, and Plutarch.\n\n\n=== Univocity of being ===\nHe followed Aristotle in asserting that the subject matter of metaphysics is \"being qua being\" (ens inquantum ens). Being in general (ens in communi), as a univocal notion, was for him the first object of the intellect. Metaphysics includes the study of the transcendentals, so called because they transcend the division of being into finite and infinite and the further division of finite being into the ten Aristotelian categories. Being itself is a transcendental, and so are the \"attributes\" of being—\"one,\" \"true,\" and \"good\"—which are coextensive with being, but which each add something to it.\nThe doctrine of the univocity of being implies the denial of any real distinction between essence and existence. Aquinas had argued that in all finite being (i.e. all except God) the essence of a thing is distinct from its existence. Scotus rejected the distinction. Scotus argued that we cannot conceive of what it is to be something, without conceiving it as existing. We should not make any distinction between whether a thing exists (si est) and what it is (quid est), for we never know whether something exists, unless we have some concept of what we know to exist.\n\n\n=== Individuation ===\nScotus elaborates a distinct view on hylomorphism, with three important strong theses that differentiate him. He held: 1) that there exists matter that has no form whatsoever, or prime matter, as the stuff underlying all change, against Aquinas (cf. his Quaestiones in Metaphysicam 7, q. 5; Lectura 2, d. 12, q. un.), 2) that not all created substances are composites of form and matter (cf. Lectura 2, d. 12, q. un., n. 55), that is, that purely spiritual substances do exist, and 3) that one and the same substance can have more than one substantial form—for instance, humans have at least two substantial forms, the soul and the form of the body (forma corporeitas) (cf. Ordinatio 4, d. 11, q. 3, n. 54). He argued for an original principle of individuation (cf. Ordinatio 2, d. 3, pars 1, qq. 1–6), the \"haecceity\" as the ultimate unity of a unique individual (haecceitas, an entity's 'thisness'), as opposed to the common nature (natura communis), feature existing in any number of individuals. For Scotus, the axiom stating that only the individual exists is a dominating principle of the understanding of reality. For the apprehension of individuals, an intuitive cognition is required, which gives us the present existence or the non-existence of an individual, as opposed to abstract cognition. Thus the human soul, in its separated state from the body, will be capable of knowing the spiritual intuitively.\n\n\n=== Formal distinction ===\nLike other realist philosophers of the period (such as Aquinas and Henry of Ghent) Scotus recognised the need for an intermediate distinction that was not merely conceptual but not fully real or mind-dependent either. Scotus argued for a formal distinction (distinctio formalis a parte rei), which holds between entities which are inseparable and indistinct in reality but whose definitions are not identical. For example, the personal properties of the Trinity are formally distinct from the Divine essence. Similarly, the distinction between the 'thisness' or haecceity of a thing is intermediate between a real and a conceptual distinction. There is also a formal distinction between the divine attributes and the powers of the soul.\n\n\n== Theology ==\n\n\n=== Voluntarism ===\nScotus was an Augustinian theologian. He is usually associated with theological voluntarism, the tendency to emphasize God's will and human freedom in all philosophical issues. The main difference between Aquinas's rational theology and that of Scotus is that Scotus believed certain predicates may be applied univocally – with exactly the same meaning – to God and creatures, whereas Aquinas insisted that this is impossible and that only analogical predication can be employed, in which a word as applied to God has a meaning different from, although related to, the meaning of that same word as applied to creatures. Duns struggled throughout his works in demonstrating his univocity theory against Aquinas's analogy doctrine.\n\n\n=== Metaphysical argument for the existence of God ===\nDuns Scotus argued that it is better to construct a metaphysical argument for the existence of God, rather than the more common physical argument from motion favoured by Aquinas, following Aristotle. Though the version in De Primo Principio is the most complete and final version, the Ordinatio proof is usually offered. However, the De Primo version is fascinating and worth looking into for a wider understanding of the argument as well as Scotus's metaphysical underpinnings for his argument for God's existence, but we shall base this section of the article on the Ordinatio version. Let us briefly outline Scotus’s argument. He begins his proof by explaining that there are two angles we must take in arguing for the existence of an actually infinite being. First we must approach from the view of the Relative Properties of God; second, from the Absolute Properties of God. Relative properties are those which are predicable of God in relation to creation; absolute properties are those which belong to God whether or not He chose to create. Under the first heading of Relative Properties, Scotus argues for a triple primacy of efficiency, finality and pre-eminence. From there he shows that one primacy implies the others, and finally there can only be one nature that is the First Efficient Cause, Ultimate End, and the Most Perfect Nature. From there the Subtle Doctor discusses the Absolute Properties of God. The First Being is intellectual and volitional, and the intellect and will are identical with the essence of this supreme nature. The First Being is also infinite being. While discussing the infinity of God, Scotus resurrects Anselm’s That Than Which argument and responds to the criticism that Anselm makes an illicit leap from concept to reality. Finally, he gives a definite answer of ‘yes’ to the question of whether there exists an actually infinite being. The very next question of the Ordinatio deals with the unicity of the nature thus proved to exist. However, the De Primo Principio version concludes with this argument.\nSince the argument is very long and has many parts, we shall content ourselves in this article with stating the premises for the existence of the first efficient cause, assuming that the reader will follow the citations to read the rest of the argument. The proof for the conclusion that \"some efficient cause is simply first such that neither can it be an effect nor can it, by virtue of something other than itself, cause an effect\" Ordinatio I.2.43 runs something like this:\nSomething, A, is produced.\nIt is produced either by itself, nothing, or another.\nNot by nothing, for nothing causes nothing.\nNot by itself, for an effect never causes itself.\nTherefore, by another; call it B.\nWe return to 2). B is produced either by itself, nothing, or another. The ascending series will either continue infinitely or we finally reach something which has nothing prior to it.\nAn infinite ascending series is impossible.\nTherefore, a simply first efficient cause exists.\nScotus acknowledges two objections and deals with them accordingly. First is that he begs the question in assuming a first in the series. Here he argues that while many admit an infinite regress in an accidentally ordered series of causes, no philosopher admits infinite regress in an essentially ordered series. Scotus explains the differences between the two and offers proofs for the conclusion that an infinity of essentially order causes in a series is impossible. Second, it is objected that his proof is not really a demonstration since it begins with a contingent premise. That something is produced is contingent and not necessary. Therefore, the proof proceeds from a contingent and not a necessary premise. Scotus says that while that is true, it is utterly manifest that things are produced or effected. But in order to respond, Scotus makes a modal move and reworks the argument. Now he argues from the possibility of production. \"It is possible that something can be produced\" is a necessary proposition. From there he is able to conclude that it is possible that the first efficient cause exists, and if it is possible that it exists, then it does exist. He assures us that the last claim will be proved later in the argument. In the Lectura proof, Scotus argues the following way:\nAlthough beings different from God are actually contingent with respect to their factual existence, nevertheless, they are not with respect to their possible existence. Hence, those entities which are called contingent with respect to their factual existence are necessary with respect to their possible existence – for instance, although “There exists a man” is contingent, nevertheless “It is possible that he exists” is necessary, because his existence does not include any contradiction. Therefore, “Something – different from God – is possible” is necessary, because being is divided into the contingent and the necessary. Just as necessity belongs to a necessary being in virtue of its condition or its quiddity, so possibility belongs to a possible being in virtue of its quiddity. If the first argument is alternatively qualified with the notion of ontological possibility, then we have necessary propositions as follows: It is possible that there is something different from God – it is not of itself (because then it would not be the case that it were possible), nor from nothing. Therefore, it is possible that it is from something else. Either it is possible that the other agent acts by virtue of itself – and not by virtue of something else, not being from something else – or it is not possible. If so, then it is possible that there is a first agent, and if it [is] possible that it exists, then it exists, just as we have proved before. If not and if there is no infinite regress, then the argument at once comes to a standstill.\nMore can and should be said about this fascinating argument, but we leave it to the reader to search out more of the argument. See especially http://www.logicmuseum.com/wiki/Authors/Duns_Scotus/Ordinatio/Ordinatio_I/D2/Q2B.\n\n\n=== Illuminationism ===\nScotus argued against the version of illuminationism that had been defended earlier in the century by Henry of Ghent. In his Ordinatio (I.3.1.4) he argued against the sceptical consequences that Henry claimed would follow from abandoning divine illumination. Scotus argued that if our thinking were fallible in the way Henry had believed, such illumination could not, even in principle, ensure \"certain and pure knowledge.\"\nWhen one of those that come together is incompatible with certainty, then certainty cannot be achieved. For just as from one premise that is necessary and one that is contingent nothing follows but a contingent conclusion, so from something certain and something uncertain, coming together in some cognition, no cognition that is certain follows (Ordinatio I.3.1.4 n.221).\n\n\n=== Immaculate conception ===\nPerhaps the most influential point of Duns Scotus's theology was his defense of the Immaculate Conception of Mary (i.e., that Mary herself was conceived without sin). At the time, there was a great deal of argument about the subject. The general opinion was that it was appropriately deferential to the Mother of God, but it could not be seen how to resolve the problem that only with Christ's death would the stain of original sin be removed. The great philosophers and theologians of the West were divided on the subject (indeed, it appears that even Thomas Aquinas sided with those who denied the doctrine, though some Thomists dispute this). The feast day had existed in the East (though in the East, the feast is just of the Conception of Mary) since the seventh century and had been introduced in several dioceses in the West as well, even though the philosophical basis was lacking. Citing Anselm of Canterbury's principle, \"potuit, decuit, ergo fecit\" (He [i.e., God] could do it, it was appropriate, therefore He did it), Duns Scotus devised the following argument: Mary was in need of redemption like all other human beings, but through the merits of Jesus' crucifixion, given in advance, she was conceived without the stain of original sin. God could have brought it about (1) that she was never in original sin, (2) she was in sin only for an instant, (3) she was in sin for a period of time, being purged at the last instant. Whichever of these options was most excellent should probably be attributed to Mary. This apparently careful statement provoked a storm of opposition at Paris, and suggested the line 'fired France for Mary without spot' in the famous poem \"Duns Scotus's Oxford,\" by Gerard Manley Hopkins.\nScotus's argument appears in Pope Pius IX's 1854 declaration of the dogma of the Immaculate Conception, \"at the first moment of Her conception, Mary was preserved free from the stain of original sin, in view of the merits of Jesus Christ.\" Scotus's position was hailed as \"a correct expression of the faith of the Apostles.\"\nAnother of Scotus's positions also gained official approval of the Roman Catholic Church: his doctrine on the universal primacy of Christ became the underlying rationale for the feast of Christ the King instituted in 1925.\nDuring his pontificate, Pope John XXIII recommended the reading of Duns Scotus's theology to modern theology students.\n\n\n== Veneration ==\nLong honored as a Blessed by the Order of Friars Minor, as well as in the Archdioceses of Edinburgh and Cologne, in the 19th-century the process was started seeking his recognition as such by the Holy See, on the basis of a cultus immemorabilis, i.e., one of ancient standing. He was declared Venerable by Pope John Paul II in 1991, who officially recognized his liturgical cult, effectively beatifying him on 20 March 1993.\n\n\n== Later reputation and influence ==\n\n\n=== Later medieval period ===\nOwing to Scotus's early and unexpected death, he left behind a large body of work in an unfinished or unedited condition. His students and disciples extensively edited his papers, often confusing them with works by other writers, in many cases leading to misattribution and confused transmission. Most 13th-century Franciscans followed Bonaventura, but the influence of Scotus (as well as that of his arch-rival William of Ockham) spread in the fourteenth century. Franciscan theologians in the late Middle Ages were thus divided between so-called Scotists and Ockhamists. Fourteenth century followers included Francis of Mayrone (died 1325), Antonius Andreas (died 1320), William of Alnwick (died 1333), and John of Bassolis (died 1347), supposedly Scotus's favourite student.\n\n\n=== Sixteenth to nineteenth centuries ===\nHis reputation suffered during the English reformation, probably due to its association with the Franciscans. In a letter to Thomas Cromwell about his visit to Oxford in 1535, Richard Layton described how he saw the court of New College full of pages from Scotus's work, \"the wind blowing them into every corner.\" John Leland described the Oxford Greyfriar's library in 1538 (just prior to its dissolution) as an accumulation of 'cobwebs, moths and bookworms.'\nDespite this, Scotism grew in Catholic Europe. Scotus's works were collected into many editions, particularly in the late fifteenth century with the advent of printing. His school was probably at the height of its popularity at the beginning of the seventeenth century; during the sixteenth and the seventeenth centuries there were even special Scotist chairs, e.g. at Paris, Rome, Coimbra, Salamanca, Alcalá, Padua, and Pavia. It flourished well into the seventeenth century, and its influence can be seen in such writers as Descartes and Bramhall. Interest dwindled in the eighteenth century, and the revival of scholastic philosophy, known as Neo-Scholasticism, was essentially a revival of Thomistic thinking.\n\n\n=== Twentieth century ===\nThe twentieth century saw a resurgence of interest in Scotus, with a range of assessments of his thought.\nOn the one hand, Scotus has received interest from secular philosophers such as Peter King, Gyula Klima, Paul Vincent Spade, and others.\nFor some today, Scotus is one of the most important Franciscan theologians and the founder of Scotism, a special form of Scholasticism. He came out of the Old Franciscan School, to which Haymo of Faversham (died 1244), Alexander of Hales (died 1245), John of Rupella (died 1245), William of Melitona (died 1260), St. Bonaventure (died 1274), Cardinal Matthew of Aquasparta (died 1289), John Peckham, Archbishop of Canterbury (died 1292), Richard of Middletown (died c. 1300), etc., belonged. He was known as \"Doctor Subtilis\" because of the subtle distinctions and nuances of his thinking. Later philosophers in the sixteenth century were less complimentary about his work and accused him of sophistry. This led to the word \"dunce,\" which developed from the name \"Dunse\" given to his followers in the 1500s, becoming used for \"somebody who is incapable of scholarship.\"\nAn important question since the 1960s has revolved over whether Scotus's thought heralded a change in thinking on the nature of 'being,' a change which marked a shift from Aquinas and other previous thinkers; this question has been particularly significant in recent years because it has come to be seen as a debate over the origins of 'modernity.' This line of argument first emerged in the 1960s among popular French philosophers who, in passing, singled out Duns Scotus as the figure whose theory of univocal being changed an earlier approach which Aquinas had shared with his predecessors. Then, in 1990, the historian of philosophy Jean-Francois Courtine argued that, between the time of Aquinas in the mid-thirteenth century and Francisco Suárez at the turn of the seventeenth, a fundamentally new approach to being was developed, with Scotus taking a major part in its development. During the 1990s, various scholars extended this argument to locate Scotus as the first thinker who succumbed to what Heidegger termed 'onto-theology'. In recent years, this criticism of Scotus has become disseminated in particular through the writings of the 'Radical Orthodox' group of theologians, centred around John Milbank and Catherine Pickstock.\n\n\n== Bibliography ==\nWorks in rough chronological order\nBefore 1295:\nParva logicalia\nQuaestiones super Porphyrii Isagogem\nQuaestiones in librum Praedicamentorum\nQuaestiones in I et II librum Perihermeneias\nOcto quaestiones in duos libros Perihermeneias\nQuaestiones in libros Elenchorum\n\nQuaestiones super libros De anima (1295–1298?)\nQuaestiones super libros Metaphysicorum Aristotelis (1298–1300?; revised later)\nNotabilia Scoti super Metaphysicam (a set of notes concerning books II-X and XII of Aristotle’s Metaphysics, discovered only in 1996)\nLectura (Early Oxford Lectures on the four books of the Sentences of Peter Lombard)\nBooks 1 and 2 (1300–1301)\nBook 3 (probably written in Paris, 1303–04)\nBook 4 (not extant)\n\nOrdinatio or Opus Oxoniense (Oxford Lectures: a revision of the lectures given at Oxford, books 1 and 2 summer 1300-1302, books 3 and 4, 1303–1304)\nCollationes oxonienses (1303–04 or 1305–08)\nCollationes parisienses (1302–07)\nReportatio parisiensis (Paris Lectures, 1302–07)\nQuaestiones Quodlibetales (edited by Felix Alluntis in ‘’Obras del Doctor Sutil, Juan Duns Escoto,’’ Madrid, Biblioteca de Autores Cristianos, 1963)\nTractatus de Primo Principio (Treatise on the First Principle) English Translation\nTheoremata (uncertain date)\nDubious works\nTheoremata\nSpurious works\nDe Rerum Principio (Of the Beginning of Things). An inauthentic work once attributed to Scotus.\nLatin editions\nOPERA OMNIA. (Wadding Edition, so-called after its editor Luke Wadding) Lyon, 1639; reprinted Hildesheim: Georg Olms Verlagsbuchhandlung, 1968. [Despite the title, this edition does not represent all the works of Scotus. Certain works printed in it are no longer attributed to Scotus; certain works by Scotus are omitted (including his early ‘’Lectura‘’ on the Sentences of Peter Lombard); what the book presents as Book I of Scotus's late ‘’Reportatio’’ is in fact an entirely separate work whose authenticity and authority are vigorously disputed.]\nOPERA OMNIA. ('Vatican Edition” = VE) Civitas Vaticana: Typis Polyglottis Vaticanis, 1950–.\nORDINATIO (complete critical edition)\nI, De Ordinatione Ioannis Duns Scoti disquisitio historico critica. Prologus totius operis, 1950.\nII, Ordinatio. Liber Primus. Distinctiones 1-2, 1950.\nIII, Ordinatio. Liber Primus. Distinctio 3, 1954.\nIV, Ordinatio. Liber Primus. Distinctiones 4-10, 1956.\nV, Ordinatio. Liber Primus. Distinctiones 11-25, 1959.\nVI, Ordinatio. Liber Primus. Distinctiones 26-48, 1963.\nVII, Ordinatio. Liber Secundus. Distinctiones 1-3, 1973.\nVIII, Ordinatio. Liber Secundus. Distinctiones 4-44, 2001.\nIX, Ordinatio. Liber Tertius. Distinctiones 1-17, 2006.\nX, Ordinatio. Liber Tertius. Distinctiones 26-40, 2007.\nXI, Ordinatio. Liber Quartus. Distinctiones 1-7, 2008.\nXII, Ordinatio. Liber Quartus. Distinctiones 8-13, 2010.\nXIII, Ordinatio. Liber Quartus, Distinctiones 14-42, 2011.\nXIV, Ordinatio. Liber Quartus, Distinctiones 43-49, 2013.\nLECTURA\nXVI, Lectura in Librum Primum Sententiarum. Prologus et Distinctiones 1-7, 1960.\nXVII, Lectura in Librum Primum Sententiarum. Distinctiones 8-45, 1966.\nXVIII, Lectura in Librum Secundum Sententiarum. Distinctiones 1-6, 1982.\nXIX, Lectura in Librum Secundum Sententiarum. Distinctiones 7-44, 1993.\nXX, Lectura in Librum Tertium Sententiarum. Distinctiones 1-17, 2003.\nXXI, Lectura in Librum Tertium Sententiarum. Distinctiones 18-40, 2004.\n\nOPERA PHILOSOPHICA (= OP). St. Bonaventure, NY: The Franciscan Institute:, 1997–2006:\nVol. I: Quaestiones super Porphyrius Isagoge et Aristoteles Categoriae, Franciscan Institute Publications, 1999. ISBN 978-1-57659-121-5\nVol. II: Quaestiones super Peri hermeneias et Sophistici Elenchis (along with) Theoremata, Franciscan Institute Publications, 2004, ISBN 978-1-57659-122-2.\nVol. III-IV: Quaestiones super libros Metaphysicorum Aristotelis Franciscan Institute Publications, 2004. ISBN 978-1-57659-124-6.\nVol. V: Quaestiones super Secundum et Tertium de Anima. Franciscan Institute Publications, 2006. ISBN 978-0-8132-1422-1.\n\nThe Examined Report of the Paris Lecture, Reportatio I-A, Volume 1, edited and translated by Allan B. Wolter, OFM and Oleg Bychkov. Franciscan Institute Publications, 2004 ISBN 978-1-57659-193-2\nThe Examined Report of the Paris Lecture, Reportatio I-A, Volume 2, edited and translated by Allan B. Wolter, OFM and Oleg Bychkov. Franciscan Institute Publications, 2008. ISBN 978-1-57659-150-5\nEnglish translations\nJohn Duns Scotus, A Treatise on God as First Principle. Chicago: Franciscan Herald Press 1982. A Latin text and English translation of the De Primo Principio. Second edition, revised, with a commentary by Allan Wolter, (First edition 1966).\nJohn Duns Scotus, God and Creatures. The Quodlibetal Questions, Translated by Wolter, Allan B., OFM, and Felix Alluntis, Washington, D.C.: The Catholic University of America Press, 1975.\nDuns Scotus on the Will and Morality, Translated by Wolter, Allan B., OFM, Washington, DC: The Catholic University of America Press, 1986.\nDuns Scotus: Philosophical Writings, Translated by Wolter, Allan B., OFM, Indianapolis: Hackett Publishing Company, 1987.\nDuns Scotus’ Parisian Proof for the Existence of God, edited By Allan B. Wolter and Marilyn McCord Adams, Franciscan Studies 42, 1982, pp. 248–321. (Latin text and English translation).\nJohn Duns Scotus, Contingency and Freedom. Lectura I 39, translation, commentary and introduction by A. Vos Jaczn, H. Veldhuis, A.H. Looman-Graaskamp, E. Dekker and N.W. den Bok. The New Synthese Historical Library 4. Dordrecht/Boston/London: Kluwer, 1994.\nQuestions on the Metaphysics of Aristotle by John Duns Scotus, Translated by Etzkorn, Girard J., and Allan B. Wolter, OFM, St. Bonaventure, NY: The Franciscan Institute, 1997–1998.\nJohn Duns Scotus. Four Questions on Mary, Introduction with Latin text and English translation and notes by Allan B. Wolter, OFM, Franciscan Institute Publications, 2000.\nJohn Duns Scotus. A Treatise on Potency and Act. Questions on the Metaphysics of Aristotle Book IX, Introduction with Latin text and English translation and notes by Allan B. Wolter, OFM, Franciscan Institute Publications, 2000.\nJohn Duns Scotus. Political and Economic Philosophy, Introduction with Latin text and English translation and notes by Allan B. Wolter, OFM, Franciscan Institute Publications, 2001.\nDuns Scotus on Divine Love: Texts and Commentary on Goodness and Freedom, God and Humans, translated by A. Vos, H. Veldhuis, E. Dekker, N.W. den Bok and A.J. Beck (ed.). Aldershot: Ashgate 2003.\nJohn Duns Scotus. Early Oxford Lecture on Individuation, Introduction with Latin text and English translation and notes by Allan B. Wolter, OFM, Franciscan Institute Publications, 2005.\nJohn Duns Scotus. Questions on Aristotle's Categories, Translated by Lloyd A. Newton, Washington, DC: Catholic University of America Press, 2014.\nDuns Scotus on Time and Existence: The Questions on Aristotle's 'De interpretatione,' Translated with Introduction and Commentary by Edward Buckner and Jack Zupko, Washington, DC: Catholic University of America Press, 2014.\n\n\n== See also ==\nOxford Franciscan school\nVirgin and Child with Saint Anne – early depictions of the Immaculate Conception in three generations\n\n\n== Notes ==\n\n\n== References ==\nBos, Egbert P. (1998). John Duns Scotus: Renewal of Philosophy. Acts of the Third Symposium organized by the Dutch Society for Medieval Philosophy Medium Aevum. Amsterdam: Rodopi. ISBN 978-90-420-0081-0. \nCross, Richard (ed.), The Opera Theologica of John Duns Scotus. Proceedings of “The Quadruple Congress” on John Duns Scotus, Part 2. Archa Verbi. Subsidia 4, Franciscan Institute Publications, 2012, ISBN ISBN 978-3-402-10214-5.\nCross, Richard (2014). Duns Scotus's Theory of Cognition. Oxford: Oxford University Press. ISBN 978-0-19-968488-5. \nFrank, William A.; Wolter, Allan B. (1995). Duns Scotus, Metaphysician. West Lafayette: Purdue University Press. ISBN 978-1-55753-072-1. \nGracia, Jorge J. E.; Noone, Timothy B. (2003). A Companion to Philosophy in the Middle Ages. Cambridge: Blackwell Pub. ISBN 978-0-631-21672-8. \nGrenz, Stanley (2005). The Named God And The Question Of Being: A Trinitarian Theo-ontology. Louisville: Westminster John Knox Press. ISBN 978-0-664-22204-8. \nHonderich, Ted (1995). \"Duns Scotus\". The Oxford Companion to Philosophy. Oxford: Oxford University Press. ISBN 978-0-19-866132-0. \nHonnefelder Ludger, Möhle Hannes, Speer Andreas, Kobusch Theo, Bullido del Barrio Susana (eds.), Johannes Duns Scotus 1308-2008: Die philosophischen Perspektiven seines Werkes/Investigations into his Philosophy. Proceedings of \"The Quadruple Congress\" on John Duns Scotus, Part 3. Archa Verbi. Subsidia 5, Franciscan Institute Publications, 2011,ISBN 978-3-402-10215-2.\nIngham, Mary Beth CSJ, and Bychkof, OLef (eds.), John Duns Scotus, Philosopher. Proceedings of “The Quadruple Congress” on John Duns Scotus, Part 1. Archa Verbi. Subsidia 3, Franciscan Institute Publications, 2010, ISBN 978-3-402-10213-8.\nIngham, Mary Beth CSJ, Scotus for Dunces: An Introduction to the Subtle Doctor, Franciscan Institute Publications, 2003.\nIngham, Mary Beth CSJ, The Harmony of Goodness: Mutuality and Moral Living According to John Duns Scotus, Franciscan Institute Publications, 1997.\nKretzmann, Norman; Kenny, Anthony; Pinborg, Jan; Stump, Eleonore (1982). The Cambridge History of Later Medieval Philosophy. Cambridge: Cambridge University Press. ISBN 978-0-521-36933-6. \nShannon, Thomas The Ethical Theory of John Duns Scotus, Franciscan Institute Publications, 1995.\nVos, Antonie (2006). The Philosophy of John Duns Scotus. Edinburgh: Edinburgh University Press. ISBN 978-0-7486-2462-1. \nWilliams, Thomas (2002). The Cambridge Companion to Duns Scotus. Cambridge: Cambridge University Press. ISBN 978-0-521-63563-9. \nWolter, Allan B. OFM and O'Neil, Blane OFM, John Duns Scotus: Mary's Architect, Franciscan Institute Publications, 1993.\nWolter, Allan B. OFM, The Philosophical Theology of John Duns Scotus, IUthaca, Cornell University Press, 1990.\nWolter, Allan B. OFM, Scotus and Ockham. Selected Essays, Franciscan Institute Publications, 2003.\n\n\n== External links ==\n Works related to Duns Scotus at Wikisource\n Quotations related to Duns Scotus at Wikiquote\nSite of the International Scotistic Commission (Rome, Italy)\nWilliams, Thomas. \"John Duns Scotus\". Stanford Encyclopedia of Philosophy. \nJohn Duns Scotus (1266–1308) entry by Jeffrey Hause in the Internet Encyclopedia of Philosophy\nBibliography on Duns Scotus from 1950 by Tobias Hoffmann\nCatholic Encyclopedia article on John Duns Scotus\nSite about Duns Scotus of the Research Group John Duns Scotus (Utrecht, NL)\nThomas Williams' pages on Scotus\nThe Realist Ontology of John Duns Scotus with an annotated bibliography\nArticle by Parthenius Minges on Scotists and Scotism at the Jacques Maritain Center\nLocal history site of Blessed John Duns Scotus' birthplace, Duns, Berwickshire, Scotland\nOnline Galleries, History of Science Collections, University of Oklahoma Libraries High resolution images of works by Duns Scotus in .jpg and .tiff format.", "ns": 0, "pageid": 34293405, "title": "Duns Scotus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}