{"batchcomplete": "", "query": {"normalized": [{"to": "Edmund Gettier", "from": "Edmund_Gettier"}], "pages": {"210105": {"extract": "Edmund L. Gettier III (born October 31, 1927 in Baltimore, Maryland) is an American philosopher and Professor Emeritus at the University of Massachusetts Amherst. He is best known for his short 1963 paper, \"Is Justified True Belief Knowledge?,\" which generated an enormous philosophical literature trying to respond to what became known as the Gettier problem.\n\n\n== Biography ==\nGettier was educated at Cornell University, where his mentors included Max Black and Norman Malcolm. Gettier, himself, was originally attracted to the views of the later Ludwig Wittgenstein. His first teaching job was at Wayne State University in Detroit, Michigan, where his colleagues included Keith Lehrer, R. C. Sleigh, and Alvin Plantinga. Because he was short on publications, his colleagues urged him to write up any ideas he had just to satisfy the administration. The result was a three-page paper that remains one of the most famous in recent philosophical history. According to anecdotal comments that Plantinga has given in lectures, Gettier was originally so unenthusiastic about the paper that he wrote it, had someone translate it into Spanish, and published in a South American journal. The paper was later published in the United States. Gettier has since published nothing, but he has invented and taught to his graduate students new methods for finding and illustrating countermodels in modal logic, as well as simplified semantics for various modal logics.\nIn his article, Gettier challenges the \"justified true belief\" definition of knowledge that dates back to Plato's Theaetetus, but is discounted at the end of that very dialogue. This account was accepted by most philosophers at the time, most prominently the epistemologist Clarence Irving Lewis and his student, Roderick Chisholm. Gettier's article offered counter-examples to this account in the form of cases where subjects held true belief that were also justified, but in which the beliefs were true for reasons unrelated to the justification. Some philosophers, however, thought the account of knowledge as justified true belief had already been put into question in a general way by the work of Wittgenstein. (Later, a similar argument was found in the papers of Bertrand Russell).\n\n\n== Gettier problem ==\n\nGettier provides several examples of beliefs that are both true and justified, but that we should not intuitively call knowledge. Cases of this sort are now called \"Gettier (counter-) examples.\" Because Gettier's criticism of the Justified True Belief model is systemic, a cottage industry has sprung up around imagining increasingly fantastical counterexamples. For example, I am watching the men's Wimbledon Final and John McEnroe is playing Jimmy Connors, it is match point, and McEnroe wins. I say to myself \"John McEnroe is this year's men's champion at Wimbledon\". Unbeknownst to me, however, the BBC were experiencing a broadcasting fault and so had stuck in a tape of last year's final, when McEnroe also beat Connors. I had been watching last year's Wimbledon final so I believed that McEnroe had beaten Connors. But at that same time, in real life, McEnroe was repeating last year's victory and beating Connors! So my belief that McEnroe beat Connors to become this year's Wimbledon champion is true, and I had good reason to believe so (my belief was justified)—and yet, there is a sense in which I could not really have claimed to 'know' that McEnroe had beaten Connors because I was only accidentally right that McEnroe beat Connors—my belief was not based on the right kind of justification.\nGettier inspired a great deal of work by philosophers attempting to recover a working definition of knowledge. Major responses include:\nGettier's use of \"justification\" is too broad, and only some kinds of justification count;\nGettier's examples do not count as justification at all, and only some kinds of evidence are justificatory;\nKnowledge must have a fourth condition, such as \"no false premises\" or \"indefeasibility\";\nRobert Nozick suggests knowledge must consist of justified true belief that is \"truth-tracking\"—belief held in such a way that if it turned out to be false it would not have been held, and vice versa;\nColin McGinn suggests knowledge is atomic (it is not divisible into smaller components). We have knowledge when we have knowledge, and an accurate definition of knowledge may even contain the word \"knowledge.\"\nA 2001 study by Weinberg, Nichols, and Stich suggests that the impact of the Gettier problem varies by culture. In particular, individuals from Western countries appear more likely to agree with the judgments described in the story than do those from East Asia. Subsequent studies were unable to replicate these results.\n\n\n== Selected works ==\nEdmund L. Gettier, \"Is Justified True Belief Knowledge?\" Analysis, Vol. 23, pp. 121–23 (1963).\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nGettier page at UMass Amherst", "ns": 0, "pageid": 210105, "title": "Edmund Gettier"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}