{"batchcomplete": "", "query": {"normalized": [{"to": "Edward Nelson", "from": "Edward_Nelson"}], "pages": {"387561": {"extract": "Edward Nelson (May 4, 1932 – September 10, 2014) was a professor in the Mathematics Department at Princeton University. He was known for his work on mathematical physics and mathematical logic. In mathematical logic, he was noted especially for his internal set theory, and his controversial views on ultrafinitism and the consistency of arithmetic. He also wrote on the relationship between religion and mathematics.\n\n\n== Career ==\nNelson was born in Decatur, Georgia. He received his Ph.D. in 1955 from the University of Chicago, where he worked with Irving Segal. He was a member of the Institute for Advanced Study from 1956 to 1959. He held a position at Princeton University starting in 1959, attaining the rank of professor there in 1964 and retiring in 2013.\nIn 2012 he became a fellow of the American Mathematical Society. He died in Princeton, New Jersey on September 10, 2014.\n\n\n== Early work ==\nNelson made contributions to the theory of infinite-dimensional group representations, the mathematical treatment of quantum field theory, the use of stochastic processes in quantum mechanics, and the reformulation of probability theory in terms of non-standard analysis.\nFor many years he worked on mathematical physics and probability theory, and he retained a residual interest in these fields, particularly in connection with possible extensions of stochastic mechanics to field theory.\nIn 1950, Nelson formulated a popular variant of the four color problem: What is the chromatic number, denoted \n  \n    \n      \n        χ\n      \n    \n    {\\displaystyle \\chi }\n  , of the plane? In more detail, what is the smallest number of colors sufficient for coloring the points of the Euclidean plane in such a way that no two points of the same color are unit distance apart? We know by simple arguments that 4 ≤ χ ≤ 7. The problem was introduced to a wide mathematical audience by Martin Gardner in his October 1960 Mathematical Games column. The chromatic number problem, also now known as the Hadwiger–Nelson problem, was a favorite of Paul Erdős, who mentioned it frequently in his problems lectures.\n\n\n== Work on foundations ==\nIn the later part of his career, he worked on mathematical logic and the foundations of mathematics. One of his goals was to extend IST (Internal Set Theory—a version of a portion of Abraham Robinson's non-standard analysis) in a natural way to include external functions and sets, in a way that provides an external function with specified properties unless there is a finitary obstacle to its existence. Other work centered on fragments of arithmetic, studying the divide between those theories interpretable in Raphael Robinson's Arithmetic and those that are not; computational complexity, including the problem of whether P is equal to NP or not; and automated proof checking.\nIn September 2011, Nelson announced that he had proved that Peano arithmetic was logically inconsistent. An error was found in the proof, and he retracted the claim.\n\n\n== Publications ==\nDynamical theory of Brownian motion. Princeton University Press 1967\nTopics in Dynamics 1: Flows. Princeton University Press 1969\nTensor analysis. Princeton University Press 1967\nQuantum Fluctuations. Princeton University Press, 1985\nPredicative Arithmetic. Princeton University Press, 1986\nRadically elementary probability theory. Annals of Mathematical Studies, Princeton 1987\n\n\n== Notes ==\n\n\n== See also ==\nInfluence of non-standard analysis\n\n\n== References ==\nCurriculum Vitae\nMathematics and Faith (PDF)\n\"Professor Emeritus Edward Nelson Passed Away September 10th\". Princeton University. \nObituary: Katz, Mikhail; Kutateladze, Semen (2015), \"Edward Nelson (1932-2014)\", Review of Symbolic Logic: 886–904, doi:10.1017/S1755020315000015 .\n\n\n== External links ==\nEdward Nelson's Homepage", "ns": 0, "pageid": 387561, "title": "Edward Nelson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}