{"batchcomplete": "", "query": {"normalized": [{"to": "Ehud Hrushovski", "from": "Ehud_Hrushovski"}], "pages": {"3132981": {"extract": "Ehud Hrushovski (Hebrew: אהוד הרושובסקי‎‎; born 1959) is a mathematical logician. He is a Professor of Mathematics at the Hebrew University of Jerusalem.\n\n\n== Early life and education ==\nHrushovski's father, Benjamin Harshav (né Hruszowski; 1928-2015), was a literary theorist, a Yiddish and Hebrew poet and a translator, Professor at Yale University and Tel Aviv University in comparative literature. Hrushovski earned his PhD from the University of California, Berkeley in 1986 under Leo Harrington He was Professor of Mathematics at the Massachusetts Institute of Technology until 1998 before he went to Jerusalem.\n\n\n== Career ==\nHrushovski is well known for several fundamental, outstanding, and important contributions to model theory, in particular in the branch that has become known as geometric model theory, and its applications. His PhD thesis revolutionized stable model theory (a part of model theory arising from the stability theory introduced by Saharon Shelah). Shortly afterwards he found counterexamples to the Trichotomy Conjecture of Boris Zilber and his method of proof has become well known as Hrushovski constructions and found many other applications since.\nOne of the most famous results of Hrushovski is his proof of the geometric Mordell–Lang conjecture in all characteristics using model theory in 1996. This deep proof was a landmark in logic and geometry. He has had many other famous and notable results in model theory and its applications to geometry, algebra, and combinatorics.\nHrushovski is a fellow of the American Academy of Arts and Sciences (2007), and Israel Academy of Sciences and Humanities (2008). He is a recipient of the Erdos Prize of the Israel Mathematical Union in 1994, the Rothschild Prize in 1998, the Carol Karp Prize of the Association of Symbolic Logic in 1993 (jointly with Alex Wilkie), and the Carol Karp Prize in 1998. He was a Plenary speaker of the ICM in 1998.\n\n\n== See also ==\nZariski geometry\n\n\n== References ==\n\n\n== External links ==\nEhud Hrushovski at the Hebrew University of Jerusalem", "ns": 0, "pageid": 3132981, "title": "Ehud Hrushovski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}