{"batchcomplete": "", "query": {"normalized": [{"to": "Emil Leon Post", "from": "Emil_Leon_Post"}], "pages": {"362382": {"extract": "Emil Leon Post (February 11, 1897 – April 21, 1954) was a Polish-born American mathematician and logician. He is best known for his work in the field that eventually became known as computability theory.\n\n\n== Life ==\nPost was born in Augustów, Suwałki Governorate, Russian Empire (now Poland) into a Polish-Jewish family that immigrated to New York City in May 1904. His parents were Arnold and Pearl Post.\nPost had been interested in astronomy, but at the age of twelve lost his left arm in a car accident. This loss was a significant obstacle to being a professional astronomer. He decided to pursue mathematics, rather than astronomy.\nPost attended the Townsend Harris High School and continued on to graduate from City College of New York in 1917 with a B.S. in Mathematics.\nAfter completing his Ph.D. in mathematics at Columbia University, supervised by Cassius Jackson Keyser, he did a post-doctorate at Princeton University in the 1920-1921 academic year. Post then became a high school mathematics teacher in New York City.\nPost married Gertrude Singer in 1929, with whom he had a daughter, Phyllis Goodman. Post spent at most three hours a day on research on the advice of his doctor in order to avoid manic attacks, which he had been experiencing since his year at Princeton.\nIn 1936, he was appointed to the mathematics department at the City College of New York. He died in 1954 of a heart attack following electroshock treatment for depression; he was 57.\n\n\n== Early work ==\nIn his doctoral thesis, later shortened and published as \"Introduction to a General Theory of Elementary Propositions\" (1921), Post proved, among other things, that the propositional calculus of Principia Mathematica was complete: all tautologies are theorems, given the Principia axioms and the rules of substitution and modus ponens. Post also devised truth tables independently of Wittgenstein and C.S. Peirce and put them to good mathematical use. Jean Van Heijenoort's well-known source book on mathematical logic (1966) reprinted Post's classic article setting out these results.\nWhile at Princeton, Post came very close to discovering the incompleteness of Principia Mathematica, which Kurt Gödel proved in 1931. Post initially failed to publish his ideas as he believed he needed a 'complete analysis' for them to be accepted.\n\n\n== Recursion theory ==\nIn 1936, Post developed, independently of Alan Turing, a mathematical model of computation that was essentially equivalent to the Turing machine model. Intending this as the first of a series of models of equivalent power but increasing complexity, he titled his paper Formulation 1. This model is sometimes called \"Post's machine\" or a Post-Turing machine, but is not to be confused with Post's tag machines or other special kinds of Post canonical system, a computational model using string rewriting and developed by Post in the 1920s but first published in 1943. Post's rewrite technique is now ubiquitous in programming language specification and design, and so with Church's lambda-calculus is a salient influence of classical modern logic on practical computing. Post devised a method of 'auxiliary symbols' by which he could canonically represent any Post-generative language, and indeed any computable function or set at all.\nThe unsolvability of his Post correspondence problem turned out to be exactly what was needed to obtain unsolvability results in the theory of formal languages.\nIn an influential address to the American Mathematical Society in 1944, he raised the question of the existence of an uncomputable recursively enumerable set whose Turing degree is less than that of the halting problem. This question, which became known as Post's problem, stimulated much research. It was solved in the affirmative in the 1950s by the introduction of the powerful priority method in recursion theory.\n\n\n== Polyadic groups ==\nPost made a fundamental and still influential contribution to the theory of polyadic, or n-ary, groups in a long paper published in 1940. His major theorem showed that a polyadic group is the iterated multiplication of elements of a normal subgroup of a group, such that the quotient group is cyclic of order n − 1. He also demonstrated that a polyadic group operation on a set can be expressed in terms of a group operation on the same set. The paper contains many other important results.\n\n\n== Selected papers ==\nPost, Emil Leon (1921). \"Introduction to a General Theory of Elementary Propositions\". American Journal of Mathematics. 43: 163–185. doi:10.2307/2370324. \nPost, Emil Leon (1936). \"Finite Combinatory Processes - Formulation 1\". Journal of Symbolic Logic. 1: 103–105. doi:10.2307/2269031. \nPost, Emil Leon (1940). \"Polyadic groups\". Transactions of the American Mathematical Society. 48: 208–350. doi:10.2307/1990085. \nPost, Emil Leon (1943). \"Formal Reductions of the General Combinatorial Decision Problem\". American Journal of Mathematics. 65: 197–215. doi:10.2307/2371809. \nPost, Emil Leon (1944). \"Recursively enumerable sets of positive integers and their decision problems\". Bulletin of the American Mathematical Society. 50: 284–316. doi:10.1090/s0002-9904-1944-08111-1.  Introduces the important concept of many-one reduction.\n\n\n== See also ==\nArithmetical hierarchy\nFunctional completeness\nList of multiple discoveries\nPost's inversion formula\nPost's lattice\nPost's theorem\n\n\n== Notes ==\n\n\n== References ==\nUrquhart, Alasdair (2008). \"Emil Post\" (PDF). In Gabbay, Dov M.; Woods, John Woods. Logic from Russell to Church. Handbook of the History of Logic. 5. Elsevier BV. \n\n\n== Further reading ==\nAnshel, Iris Lee; Anshel, Michael (November 1993). \"From the Post-Markov Theorem Through Decision Problems to Public-Key Cryptography\". The American Mathematical Monthly. Mathematical Association of America. 100 (9): 835–844. doi:10.2307/2324657. \nDedicated to Emil Post and contains special material on Post. This includes \"Post's Relation to the Cryptology and Cryptographists of his Era: ... Steven Brams, the noted game theorist and political scientist, has remarked to us that the life and legacy of Emil Post represents one aspect of New York intellectual life during the first half of the twentieth century that is very much in need of deeper exploration. The authors hope that this paper serves to further this pursuit\". (pp. 842–843)\n\nDavis, Martin, ed. (1993). The Undecidable. Dover. pp. 288–406. ISBN 0-486-43228-9. \nReprints several papers by Post.\n\nDavis, Martin (1994). \"Emil L. Post: His Life and Work\". Solvability, Provability, Definability: The Collected Works of Emil L. Post. Birkhäuser. pp. xi—xxviii. \nA biographical essay.\n\nJackson, Allyn (May 2008). \"An interview with Martin Davis\". Notices of the AMS. 55 (5): 560–571. \nMuch material on Emil Post from his first-hand recollections.\n\n\n== External links ==\nEmil Leon Post at the Mathematics Genealogy Project\nEmil Leon Post Papers 1927-1991, American Philosophical Society, Philadelphia, Pennsylvania.", "ns": 0, "pageid": 362382, "title": "Emil Leon Post"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}