{"batchcomplete": "", "query": {"normalized": [{"to": "Emma Rush", "from": "Emma_Rush"}], "pages": {"43305151": {"extract": "Emma Rush, PhD is a lecturer in philosophy and ethics at Charles Sturt University Faculty of Arts, School of Humanities and Social Sciences, notable for her work on sexualisation of children.\nIn 2006, Rush worked on a series of reports for The Australia Institute. Two of the reports which she co-authored led to a senate inquiry into the sexualisation of children.\nRush has also been consulted by the media, including Australia's ABC News and The Sydney Morning Herald.\n\n\n== Research ==\nRush's main areas of research are: environmental ethics and ethics in public life, particularly, sexualisation of children and the corporatisation of child care.\n\n\n== Media ==\nRush has acted as a media consultant over issues relating to sexualisation, advertising and pornography debates by ABC Radio, Australia, ABC News, Australia, The Sydney Morning Herald, The Conversation, and Melinda Tankard Reist's website.\n\n\n== Selected bibliography ==\n\n\n=== Ph.D thesis ===\nRush, Emma (September 2006). Consume with care: ethics, economics and industrialised world over-consumption (Ph.D. thesis). Melbourne: Department of Philosophy/Centre for Applied Philosophy and Public Ethics, University of Melbourne. OCLC 224910719. \n\n\n=== 2006 papers for The Australia Institute ===\n2006 discussion papers for the Australia Institute\nRush, Emma (April 2006). Child care quality in Australia (discussion paper number 84). Canberra: The Australia Institute. ISSN 1322-5421. OCLC 156571048.  Pdf version.\nRush, Emma; Downie, Christian (June 2006). ABC learning centres: a case-study of Australia's largest child care corporation (discussion paper number 87). Canberra: The Australia Institute. ISSN 1322-5421. OCLC 156757390.  Pdf version.\nRush, Emma; La Nauze, Andrea (October 2006). Corporate paedophilia: the sexualisation of children in Australia (discussion paper number 90). Canberra: The Australia Institute. ISSN 1322-5421. OCLC 156752334.  Pdf version.\nRush, Emma; La Nauze, Andrea (December 2006). Letting children be children: stopping the sexualisation of children in Australia (discussion paper number 93). Canberra: The Australia Institute. ISSN 1322-5421. OCLC 225513585.  Pdf version.\n2006 web papers for the Australia Institute\nRush, Emma (February 2006). Skip dipping in Australia (web paper number 85). Canberra: The Australia Institute. OCLC 224947742.  Pdf version.\nRush, Emma (April 2006). Skip dipping in Australia (web paper number 85). Canberra: The Australia Institute. OCLC 224947742.  Pdf version.\nRush, Emma; Hamilton, Clive (September 2006). The attitudes of Australians to happiness and social well-being (web paper number 90). Canberra: The Australia Institute. OCLC 225280784.  Pdf version.\n\n\n=== Chapters in books ===\nRush, Emma (2007), \"Plastic fantastic: the sexualisation of children\", in Fleetwood, Julian, The sex mook: what is our sex?, Melbourne, Australia: Vignette Press, pp. 108–110, ISBN 9781876110000 \nRush, Emma (2007), \"Employees' views on quality\", in Hill, Elizabeth; Pocock, Barbara; Elliott, Alison, Kids count: better early childhood education and care in Australia, Sydney, Australia: Sydney University Press, pp. 154–178, ISBN 9781920898700 \nRush, Emma (2009), \"What are the risks of premature sexualisation for children?\", in Tankard Reist, Melinda, Getting real: challenging the sexualisation of girls, Melbourne, Australia: Spinifex Press, pp. 41–54, ISBN 9781876756758 \nRush, Emma (2012), \"Children, media and ethics\", in Warburton, Wayne; Braunstein, Danya, Growing up fast and furious, Sydney, Australia: The Federation Press, pp. 159–174, ISBN 9781862878235 \nRush, Emma (2013), \"Ethics of food security\", in Farmar-Bowers, Quentin; Higgins, Vaughan; Millar, Joanne, Food security in Australia: challenges and prospects for the future, New York: Springer, pp. 35–48, ISBN 9781461444831 \n\n\n=== Journal articles ===\nRush, Emma; Gleeson, Brendan; Low, Nicholas (2005). \"A multivalent conception of path dependence: The case of transport planning in metropolitan Melbourne, Australia\". Environmental Sciences. Taylor and Francis. 2 (4): 391–408. doi:10.1080/15693430500405146. \nRush, Emma (December 2011). \"Response to Taylor: the full picture of the sexualisation debate\". Australasian Journal of Early Childhood. Early Childhood Australia. 36 (4): 111–119.  ISSN 1836-9391\nRush, Emma; Mungai, Ndungi wa; Wairire, Gidraph G. (2014). \"The challenges of maintaining social work ethics in Kenya\". Ethics and Social Welfare, special issue: Ethical Challenges & Human Rights in Africa. Taylor and Francis. 8 (2): 170–186. doi:10.1080/17496535.2014.895401. \n\n\n== References ==\n\n\n== External links ==\nProfile page: Dr Emma Rush School of Humanities and Social Sciences, Charles Sturt University\nEmma Rush OCLC WorldCat Identities", "ns": 0, "pageid": 43305151, "title": "Emma Rush"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}