{"batchcomplete": "", "query": {"normalized": [{"to": "Enrique Dussel", "from": "Enrique_Dussel"}], "pages": {"11847004": {"extract": "Enrique Domingo Dussel Ambrosini (born December 24, 1934) is an Argentine-Mexican writer and philosopher.\n\n\n== Biography ==\nDussel was born in Argentina, but since he was attacked with a bomb in his house by a military group in 1973, he was forced into exile in Mexico in 1975, and today he is a Mexican citizen. He is a professor in the Department of Philosophy in the Metropolitan Autonomous University (UAM), Campus Iztapalapa in Mexico City and has also taught at the National Autonomous University of Mexico (UNAM). He has acquired a doctorate in philosophy in the Complutense University of Madrid and a doctorate in history from the Sorbonne of Paris. He also has a license in theology from Paris and Münster. He has been awarded doctorates honoris causa from the University of Fribourg in Switzerland and the Higher University of San Andrés in Bolivia, and has been visiting professor for one semester at Frankfurt University, Notre Dame University, California State University, Los Angeles, Union Theological Seminary (New York), Loyola University Chicago, Vanderbilt University, Duke University, Harvard University, and others. In March 2013 he was named President of the Autonomous University of Mexico City for an extraordinary period of one year.\nDussel has maintained dialogue with philosophers such as Karl-Otto Apel, Gianni Vattimo, Jürgen Habermas, Richard Rorty and Emmanuel Lévinas \nHe is the founder with others of the movement referred to as the Philosophy of Liberation, and his work is concentrated in the field of Ethics and Political Philosophy. Through his critical thinking he proposed a new way (a critical way) to read the universal history, criticizing the Eurocentric discourse. Author of more than 50 books, his thoughts cover many themes including: theology, politics, philosophy, ethics, political philosophy, aesthetics, and ontology. He has been a critic of postmodernity, preferring instead the term \"transmodernity.\"\n\n\n== Select bibliography ==\nEthics of Liberation: In the Age of Globalization and Exclusion, Duke University Press, Durham, 2013.\nPolitics of Liberation (Reclaiming Liberation Theology), SCM Press, Manila, Philippines, 2011.\nTwenty Theses on Politics, Silliman University Press, Durham, 2008.\nBeyond Philosophy: History, Marxism, and Liberation Theology, Rowman and Littlefield, Maryland, 2003.\nPhilosophy of Liberation, Wipf & Stock Publishers, 2003 [1980]\nTowards an Unknown Marx: A Commentary on the Manuscripts of 1861-1863, Routledge, London, 2001\nThe Underside of Modernity: Apel, Ricoeur, Rorty, Taylor and the Philosophy of Liberation, Humanity Books, 1996.\nThe Invention of the Americas: Eclipse of \"the Other\" and the Myth of Modernity, Continuum Intl Pub Group, 1995\nEthics & Community (Liberation & Theology), Hyperion Books, 1994\nThe History of the Church in Latin America: Colonialism to Liberation (1492-1979), Eerdmans, 1981\nHistory and the theology of liberation. A Latin American perspective, Orbis Books, New York, 1976.\nEthics and the theology of liberation, Orbis Books, New York, 1978.\nHipótesis para el estudio de Latinoamérica en la historia universal. Investigacion del “mundo” donde se constituyen y evolucionan las “Weltanschauungen, 1966.\nEl humanismo semita, 1969.\nPara una de-strucción de la historia de la ética I, 1972.\nLa dialéctica hegeliana. Supuestos y superación o del inicio originario del filosofar, 1972 (2a. ed.: Método para una filosofía de la liberación. Superación analéctica de la dialéctica hegeliana, 1974).\nAmérica Latina dependencia y liberación. Antología de ensayos antropológicos y teológicos desde la proposición de un pensar latinoamericano, 1973.\nPara una ética de la liberación latinoamericana I, 1973.\nPara una ética de la liberación latinoamericana II, 1973.\nEl dualismo en la antropología de la cristiandad, 1974.\nLiberación latinoaméricana y Emmanuel Levinas, 1975.\nEl humanismo helénico, 1975.\nFilosofía ética latinoamericana III, 1977.\nIntroducción a una filosofía de la liberación latinoaméricana, 1977.\nIntroducción a la filosofía de la liberación, 1977.\nFilosofía de la liberación, 1977.\nReligión, 1977.\nFilosofía de la poiesis. Introducción histórica, 1977 (Reedición aumentada: Filosofía de la producción, 1984).\nFilosofía ética latinoamericana IV: La política latinoamericana. Antropológica III, 1979.\nFilosofía ética latinoamericana V: Arqueológica latinoamericana. Una filosofía de la religión antifetichista, 1980.\nLiberación de la mujer y erótica latinoamericana. Ensayo filosófico, 1980.\nLa pedagógica latinoamericana, 1980.\nPraxis latinoamericana y filosofía de la liberación, 1983.\nLa producción teórica de Marx. Un comentario a los Grundrisse, 1985.\nÉtica comunitaria, 1986.\nHacia un Marx desconocido. Un comentario de los Manuscritos del 61-63, 1988.\nEl último Marx (1863–1882) y la liberación latinoamericana. Un comentario a la tercera y cuarta redacción de “El Capital”, 1990.\n1492: El encubrimiento del Otro. Hacia el origen del “mito de la Modernidad”, 1992.\nLas metáforas teológicas de Marx, 1994.\nApel, Ricoeur, Rorty y la Filosofía de la Liberación con respuestas de Karl-Otto Apel y Paul Ricoeur, 1994.\nHistoria de la filosofía y filosofía de la liberación, 1994.\nÉtica de la liberación en la edad de la globalización y la exlusión, 1998.\nÉtica de la liberación ante Apel, Taylor y Vattimo con respuesta crítica inedita de K.-O. Apel, 1998.\nHacia una filosofía política crítica, 2001.\nÉtica del discurso y ética de la liberación (con Karl-Otto Apel), 2005.\n20 tesis de política, 2006.\nFilosofía de la cultura y la liberación, 2006.\nPolítica de la liberación. Historia mundial y crítica, 2007.\nMateriales para una política de la liberación, 2007.\nFrigørelsesfilosofi, Forlaget Politisk Revy, København, 2008.\nPolítica de la liberación: Arquitectónica, 2009.\n\n\n== See also ==\nTheology of liberation\nSocialism\nMarxism\n\n\n== Notes ==\n\n\n== External links ==\nWeb Page Complete Work and references about author.\nArticle on Enrique Dussel from Spanish Wikipedia\nPhilosophy of Liberation, link to complete text online\nThe Underside of Modernity, link to complete text online\nThe Invention of the Americas, link to complete text online", "ns": 0, "pageid": 11847004, "title": "Enrique Dussel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}