{"batchcomplete": "", "query": {"normalized": [{"to": "Ernest Sosa", "from": "Ernest_Sosa"}], "pages": {"4240618": {"extract": "Ernest Sosa (born June 17, 1940) is an American philosopher primarily interested in epistemology. He is Board of Governors Professor of Philosophy at Rutgers University since 2007, but spent most of his career at Brown University.\n\n\n== Education and career ==\nBorn in Cárdenas, Cuba on June 17, 1940, Sosa earned his BA and MA from the University of Miami and his PhD from the University of Pittsburgh in 1964 where his dissertation was supervised by Nicholas Rescher.\nHe has been at Rutgers full-time since January 2007; he had been at Brown University since 1964. While full-time at Brown, he was also a distinguished visiting professor at Rutgers every spring from 1998-2006. Sosa has been described as \"one of the most important epistemologists of the last half-century.\"\nSosa is a past president of the American Philosophical Association and a Fellow of the American Academy of Arts & Sciences. He edits the philosophical journals Noûs and Philosophy and Phenomenological Research. In 2005, he delivered the John Locke Lectures at Oxford, which formed the basis of his 2007 book.\nHe was also the 2010 recipient of the Nicholas Rescher Prize for contributions to systematic philosophy, conferred by the University of Pittsburgh biennially.\nHis son, David Sosa, is a professor and chair of the philosophy department at the University of Texas, Austin.\n\n\n== Philosophy ==\nIn addition to epistemology, Sosa has also written on metaphysics, modern philosophy and philosophy of mind. In his books Knowledge in Perspective (1991) and A Virtue Epistemology (2007), Sosa defends a form of virtue epistemology called \"virtue perspectivism\", which distinguishes animal knowledge from reflective knowledge.\n\n\n== Bibliography ==\nKnowledge in Perspective (Cambridge University Press, 1991)\nEpistemic Justification (Blackwell Publishers, 2003), with L. BonJour\nErnest Sosa and his Critics, ed by J. Greco (Blackwell, 2004)\nA Virtue Epistemology (Oxford University Press, 2007)\nReflective Knowledge (Oxford University Press, 2009)\nKnowing Full Well (Princeton University Press, 2011)\nVirtuous Thoughts: The Philosophy of Ernest Sosa, ed by J. Turri (Springer 2013)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nErnest Sosa's home page", "ns": 0, "pageid": 4240618, "title": "Ernest Sosa"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}