{"batchcomplete": "", "query": {"normalized": [{"to": "Ernst Bloch", "from": "Ernst_Bloch"}], "pages": {"571418": {"extract": "Ernst Bloch (German: [ˈɛʁnst ˈblɔx]; July 8, 1885 – August 4, 1977) was a German Marxist philosopher.\nBloch was influenced by Georg Wilhelm Friedrich Hegel and Karl Marx, as well as by apocalyptic and religious thinkers such as Thomas Müntzer, Paracelsus, and Jacob Boehme. He established friendships with György Lukács, Bertolt Brecht, Kurt Weill, Walter Benjamin, and Theodor W. Adorno. Bloch's work focuses on the thesis that in a humanistic world where oppression and exploitation have been eliminated there will always be a truly revolutionary force.\n\n\n== Life ==\nBloch was born in Ludwigshafen, the son of a Jewish railway-employee. After studying philosophy, he married Else von Stritzky, daughter of a Baltic brewer in 1913, who died in 1921. His second marriage with Linda Oppenheimer lasted only a few years. His third wife was Karola Piotrowska, a Polish architect, whom he married in 1934 in Vienna. When the Nazis came to power, they had to flee, first into Switzerland, then to Austria, France, Czechoslovakia, and finally the USA. Bloch returned to the GDR in 1949 and obtained a chair in philosophy at Leipzig.\n1948 he was offered the chair of philosophy at the University of Leipzig. In 1955 he was awarded the National Prize of the GDR. In addition, he became a member of the German Academy of Sciences at Berlin (AdW). He had more or less become the political philosopher of the GDR. Among his many academic students from this period was his assistant Manfred Buhr, who earned his doctorate with him in 1957, and was later professor in Greifswald, then director of the Central Institute of Philosophy of the Academy of Sciences (ADC) in Berlin and who become a critic of Bloch.\nBut the Hungarian uprising in 1956 brought the convinced Marxist Bloch to reverse course for the SED regime. Because he taught his humanistic ideas of freedom, he was retired in 1957 for political reasons – not because of his age, 72 years. A number of scientists and students spoke publicly against this forced retirement, among them the renowned professor and colleague Emil Fuchs and his students as well as Fuchs's grandson Klaus Fuchs-Kittowski.\nWhen the Berlin Wall was built in 1961, he did not return to the GDR, but went to Tübingen in West Germany, where he received an honorary chair in Philosophy. He died in Tübingen.\n\n\n== Thought ==\nBloch's The Principle of Hope was written during his emigration in the USA, where he lived briefly in New Hampshire before settling in Cambridge, Massachusetts. He wrote the lengthy three volume work in the reading room of Harvard's Widener Library. Bloch originally planned to publish it there under the title Dreams of a Better Life. The Principle of Hope tries to provide an encyclopedic account of mankind's and nature's orientation towards a socially and technologically improved future.\n\n\n== Influence ==\n\nBloch's work became very influential in the course of the student protest movements in 1968 and in liberation theology. It is cited as a key influence by Jürgen Moltmann in his Theology of Hope (1967, Harper and Row, New York), by Dorothee Sölle, and by Ernesto Balducci. Psychoanalyst Joel Kovel has praised Bloch as, \"the greatest of modern utopian thinkers\". Robert S. Corrington has been influenced by Bloch, though he has tried to adapt Bloch's ideas to serve a liberal rather than a Marxist politics. Bloch's concept of concrete utopias found in The Principle of Hope was used by José Esteban Muñoz to shift the field of performance studies. This shift allowed for the emergence of utopian performativity and a new wave of performance theorizing as Bloch's formulation of utopia shifted how scholars conceptualize the ontology and the staging of performances as imbued with an enduring indeterminacy, as opposed to dominant performance theories found in the work of Peggy Phelan, who view performance as a live event without reproduction.\n\n\n== Bibliography ==\n\n\n=== Books ===\nGeist der Utopie (1918) (The Spirit of Utopia, Stanford, 2000)\nThomas Müntzer als Theologe der Revolution (1921) (Thomas Müntzer as Theologian of Revolution)\nSpuren (1930) (Traces, Stanford University Press, 2006)\nErbschaft dieser Zeit (1935) (Bequest of This Time)\nFreiheit und Ordnung (1947) (Freedom and Order)\nSubjekt-Objekt (1949)\nChristian Thomasius (1949)\nAvicenna und die aristotelische Linke (1949) (Avicenna and the aristotelian Left)\nDas Prinzip Hoffnung (3 vols.: 1938–1947) (The Principle of Hope, MIT Press, 1986)\nNaturrecht und menschliche Würde (1961) (Natural Law and Human Dignity, MIT Press 1986)\nTübinger Einleitung in die Philosophie (1963) (The Tübingen Introduction in Philosophy)\nReligion im Erbe (1959–66) (trans.: Man on His Own, Herder and Herder, 1970)\nAtheismus im Christentum (1968) (trans.: Atheism in Christianity, 1972)\nPolitische Messungen, Pestzeit, Vormärz (1970) (Political Measurements, the Plague, Pre-March)\nDas Materialismusproblem, seine Geschichte und Substanz (1972) (The Problem of Materialism, Its History and Substance)\nExperimentum Mundi. Frage, Kategorien des Herausbringens, Praxis (1975) (Experimentum Mundi. Question, Categories of Realization, Praxis)\n\n\n=== Articles ===\n“Causality and Finality as Active, Objectifying Categories:Categories of Transmission”. TELOS 21 (Fall 1974). New York: Telos Press\n\n\n== See also ==\nExilliteratur\nNon-simultaneity\n\n\n== References ==\n\n\n== Further reading ==\nAdorno, Theodor W. (1991). \"Ernst Bloch's Spuren,\" Notes to Literature, Volume One, New York, Columbia University Press\nThompson, Peter and Slavoj Žižek (eds.) (2013) \"The Privatization of Hope: Ernst Bloch and the Future of Utopia. Durham, NC: Duke University Press\nBoldyrev, Ivan (2014) Ernst Bloch and His Contemporaries: Locating Utopian Messianism. L. and N. Y.: Bloomsbury.\nGeoghegan, Vincent (1996). Ernst Bloch, London, Routledge\nHudson, Wayne (1982). The Marxist philosophy of Ernst Bloch, New York, St. Martin's Press\nSchmidt, Burghard. (1985) Ernst Bloch, Stuttgart, Metzler\nMünster, Arno (1989). Ernst Bloch: messianisme et utopie, PUF, Paris\nJones, John Miller (1995). Assembling (Post)modernism: The Utopian Philosophy of Ernst Bloch, New York, P Lang. (Studies in European thought, v. 11)\nKorstvedt, Benjamin M. (2010). Listening for utopia in Ernst Bloch’s musical philosophy, Cambridge, Cambridge University Press\nWest, Thomas H. (1991). Ultimate hope without God : the atheistic eschatology of Ernst Bloch, New York, P. Lang (American university studies series 7 theology religion; vol 97)\n\n\n== External links ==\nIlluminations: Ernst Bloch, Utopia and Ideology Critique By Douglas Kellner\nErnst-Bloch-Zentrum\nErnst Bloch Assoziation\nCentre for Ernst Bloch Studies, University of Sheffield", "ns": 0, "pageid": 571418, "title": "Ernst Bloch"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}