{"batchcomplete": "", "query": {"normalized": [{"to": "Fatema Mernissi", "from": "Fatema_Mernissi"}], "pages": {"295871": {"extract": "Fatema (or Fatima) Mernissi (Arabic: فاطمة مرنيسي‎‎; 1940 – 30 November 2015) was a Moroccan feminist writer and sociologist.\n\n\n== Biography ==\nFatema Mernissi was born in Fez, Morocco. She grew up in the harem of her affluent paternal grandmother along with various female kin and servants. She received her primary education in a school established by the nationalist movement, and secondary level education in an all-girls school funded by the French protectorate. In 1957, she studied political science at the Sorbonne and at Brandeis University, gaining her doctorate there. She returned to work at the Mohammed V University and taught at the Faculté des Lettres between 1974 and 1981 on subjects such as methodology, family sociology and psychosociology. She became known internationally mainly as an Islamic feminist.\nMernissi was a lecturer at the Mohammed V University of Rabat and a research scholar at the University Institute for Scientific Research, in the same city. She died in Rabat on 30 November 2015.\n\n\n== Scholarship and Recognition ==\nAs an Islamic feminist, Mernissi was largely concerned with Islam and women's roles in it, analyzing the historical development of Islamic thought and its modern manifestation. Through a detailed investigation of the nature of the succession to Muhammad, she cast doubt on the validity of some of the hadith (sayings and traditions attributed to him), and therefore the subordination of women that she sees in Islam, but not necessarily in the Qur'an. She wrote extensively about life within harems, gender, and public and private spheres.\nAs a sociologist, Mernissi mainly did field work in Morocco. On several occasions in the late 1970s and early 1980s, she conducted interviews in order to map prevailing attitudes to women and work. She did sociological research for UNESCO and ILO as well as for the Moroccan authorities. In the same period, Mernissi contributed articles to periodicals and other publications on women in Morocco and women and Islam from a contemporary as well as from a historical perspective. Her work has been cited as an inspiration by other Muslim feminists, such as those who founded Musawah.\nIn 2003, Mernissi was awarded the Prince of Asturias Award along with Susan Sontag. In 2004 she was awarded the Erasmus Prize, alongside Sadik Al-Asm and Abdolkarim Soroush.\n\n\n== Works ==\nMernissi’s first monograph, Beyond the Veil, was published in 1975. A revised edition was published in Britain in 1985 and in the US in 1987. Beyond the Veil has become a classic, especially in the fields of anthropology and sociology on women in the Arab World, the Mediterranean area or Muslim societies in general.\nHer most famous book, as an Islamic feminist, The Veil and the Male Elite: A Feminist Interpretation of Islam, is a quasi-historical study of role of the wives of Muhammad. It was first published in French in 1987, and translated into English in 1991. The book was banned in Morocco, Iran, and the Gulf states.\nFor Doing Daily Battle: Interviews with Moroccan Women (1991), she interviewed peasant women, women labourers, clairvoyants and maidservants. In 1994, Mernissi published a memoir, Dreams of Trespass: Tales of a Harem Girlhood (in the US, the book was originally titled The Harem Within: Tales of a Moroccan Girlhood, and is still known by that title in the UK).\nShe contributed the piece \"The merchant's daughter and the son of the sultan\" to the anthology Sisterhood Is Global: The International Women's Movement Anthology (1984), edited by Robin Morgan.\n\n\n== Bibliography ==\n1975: Beyond the Veil: Male-Female Dynamics in a Muslim Society. revised ed. 1985, 1987, reprinted London: Saqi Books. ISBN 0-86356-412-7\n1983: Le Maroc raconté par ses femmes.\n1984: L’amour dans les pays musulmans\n1985: Femmes du Gharb\n1987: Le harem politique – Le Prophète et les femmes (trans. 1992: The Veil and the Male Elite: A Feminist Interpretation of Islam. New York: Basic Books. ISBN 978-0201-63221-7)\n1988: Shahrazad n’est pas marocaine\n1990: Sultanes oubliées – Femmes chefs d’Etat en Islam (trans. 1993: Forgotten Queens of Islam)\n1992: La Peur-Modernité\n1993: Women’s Rebellion and Islamic Memory\n1994: The Harem Within (retitled. 1995: Dreams of Trespass – Tales of a Harem Girlhood New York: Perseus Books. ISBN 0-201-48937-6)\n1997: Les Aït-Débrouille\n1998: Etes-vous vacciné contre le Harem?\n2001: Scheherazade Goes West. New York: Washington Square Press. ISBN 0-7434-1243-5\n2002: Islam and Democracy: Fear of the Modern World. New York: Basic Books. ISBN 0-7382-0745-4\n2009: Les Femmes Du Maroc. Brooklyn: PowerHouse Books. ISBN 1-57687-491-5\nEdited by Mernissi:\n1989: Doing Daily Battle: Interviews with Moroccan Women translated by Mary Jo Lakeland. New Brunswick: Rutgers University Press.\n\n\n== See also ==\nIslamic feminism\nLiberal movements within Islam\nAsiya Andrabi\nMohamed Guessous\n\n\n== References ==\n\n\n== External links ==\nFatema Mernissi's website\nObituary on Morocco World News\nChronological Overview of books by Fatema Mernissi\nAnnouncement of the Asturias Prize, 2003\nInterview: El País (Spanish) 6-7-2008\nInterview: El Pais (Spanish) 31-10-1989\nInterview: Encuentros Digitales El Mundo.es (Spanish)\nArticles in El Pais about Fatima Mernissi (Spanish)\nRebel for the sake of women\nThe Prophet and Freedom of the Individual\nPolitics and the Prophet, review of Mernissi's Islam and Democracy, by Martin Kramer\nFatema Mernissi at the Internet Movie Database", "ns": 0, "pageid": 295871, "title": "Fatema Mernissi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}