{"batchcomplete": "", "query": {"normalized": [{"to": "Francis Ernest Jackson", "from": "Francis_Ernest_Jackson"}], "pages": {"25701945": {"extract": "F. Ernest Jackson ARA (1872–1945) was a British painter, draughtsman, poster designer and lithographer.\n\n\n== Background ==\nFrancis Ernest Jackson was born on 15 August 1872 in Huddersfield, the son of a printer. He was apprenticed as a lithographer, and later attended life-drawing classes at the Yorkshire College. He then studied in Paris at the Académie Julian and the École des Beaux-Arts under Bouguereau, Ferrier, J.-P. Laurens and Constant.\nOn his return to Britain he designed posters and practised lithography. In 1907 he became a co-founder of The Neolith and member of the Senefelder Club.\nBetween 1913 and 1925 Jackson designed posters for the London Underground. In addition, throughout the First World War, he was in charge of propaganda lithography for the Ministry of Information.\nFrom 1926 to 1940 he was principal of the Byam Shaw School of Art.\nIn 1944 he was elected an Associate of the Royal Academy.\nHe died at Oxford, on 11 March 1945 from injuries after he was knocked down by a motor-cycle.\nA memorial exhibition to Jackson was held at the Beaux Arts Gallery in 1946.\n\n\n== Philosophy of Art ==\nDiscussing his influence on him, the former painter Lancelot Glasson wrote in 1947 that \"his thoughts on Art, and on Life, of which he deemed Art to the expression, were based, not on abstract thinking nor on his own more than ordinary erudition, but on that understanding which the daily practice of a craft gives to man.\" He himself believed unity to be the first quality of any picture, in which the simplest conception will be found always to be the most beautiful. Reality and art were not connected, but running in parallel one unto the other, and therefore in the final conception of the painting there ought to be no instant of accident, as though nature itself were allowed a role in the process.\n\n\n== References ==", "ns": 0, "pageid": 25701945, "title": "Francis Ernest Jackson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}