{"batchcomplete": "", "query": {"normalized": [{"to": "Fred Dretske", "from": "Fred_Dretske"}], "pages": {"2847218": {"extract": "Frederick Irwin Dretske (December 9, 1932 – July 24, 2013) was an American philosopher noted for his contributions to epistemology and the philosophy of mind.\nBorn to Frederick and Hattie Dretske, he first planned to be an engineer, attending Purdue University. He changed his mind after taking the university's only philosophy course, deciding philosophy was the only thing he wanted to do in his life.\nAfter graduating in 1954 with a degree in electrical engineering and serving in the Army, he enrolled in graduate school in philosophy at the University of Minnesota, where he received his PhD in 1960. His dissertation, supervised by May Brodbeck, was on the philosophy of time.\nDretske’s first academic appointment was to the University of Wisconsin–Madison in 1960, where he rose to the rank of full Professor. In 1988 he was recruited to Stanford University, where he was the Bella and Eloise Mabury Knapp Professor of Philosophy. He remained at Stanford until his retirement in 1998, after which he was Professor Emeritus in Philosophy at Stanford and Senior Research Scholar in Philosophy at Duke University until his death.\nDretske held externalist views about the mind, and thus he tried in various writings to show that by means of mere introspection one actually learns about his or her own mind less than might be expected. His later work centered on conscious experience and self-knowledge, and he was awarded the Jean Nicod Prize in 1994.\nHe was elected a Fellow of the American Academy of Arts & Sciences in 2003.\nUpon his death, he was survived by his second wife Judith Fortson, by his children Kathleen Dretske and Ray Dretske, and by a stepson, Ryan Fortson.\n\n\n== Major philosophical contributions ==\nDretske’s first book, Seeing and Knowing, deals with the question of what is required to know that something is the case on the basis of what is seen. According to the theory presented in Seeing and Knowing, for a subject S to be able to see that an object b has property P is:\n(i) for b to be P (ii) for S to see b (iii) for the conditions under which S sees b to be such that b would not look the way it now looks to S unless it were P and (iv) for S, believing that conditions are as described in (iii), to take b to be P.\nFor instance, for me to see that the soup is boiling - to know, by seeing, that it is boiling - is for the soup to be boiling, for me to see the soup, for the conditions under which I see the soup to be such that it would not look the way it were not boiling, and for me to believe that the soup is boiling on that basis.\nDretske’s next book, Knowledge and the Flow of Information (1981), returns to the topic of knowledge gained via perception but substantially changes the theory. Dretske had become convinced that information theory was required to make sense of knowledge (and also belief). He signaled this change at the beginning of the new book, opening the Preface with the lines “In the beginning there was information. The word came later.” Information, understood in Dretske’s sense, is something that exists as an objective and mind-independent feature of the natural world and can be quantified. Dretske offers the following theory of information:\nA signal r carries the information that s is F = The conditional probability of s’s being F, given r (and k), is 1 (but, given k alone, less than 1).\nThus, for a red light (r) to carry the information that a goal (s) has been scored (is F) is for the probability that a goal has been scored, given that the light is red (and given my background knowledge of the world, k), to be one (but less than one given just my background knowledge).\nWith this theory of information, Dretske then argued that for a knower, K, to know that s is F = K’s belief that s is F is caused (or causally sustained) by the information that s is F.\nHis theory of knowledge thus replaced conscious appearances with the idea that the visual state of the observer carries information, thereby minimizing appeal to the mysteries of consciousness in explaining knowledge.\nDretske’s work on belief begins in the last third of Knowledge and the Flow of Information, but the theory changed again in the book that followed, Explaining Behavior (1988). There Dretske claims that actions are the causing of movements by mental states, rather than the movements themselves. Action is thus a partly mental process itself, not a mere product of a mental process. For the meaning - the content - of a belief to explain an action, on this view, is for the content of the belief to explain why it is that the mental state is part of a process that leads to the movement it does.\nAccording to Explaining Behavior, a belief that s is F is a brain state that has been recruited (through operant conditioning) to be part of movement-causing processes because of the fact that it did, when recruited, carry the information that s is F. Being recruited because of carrying information gives a thing (such as a brain state) the function of carrying that information, on Dretske’s view, and having the function of carrying information makes that thing a representation.\nBeliefs are thus mental representations that contribute to movement production because of their contents (saying P is why the brain state is recruited to cause movement), and so form components of the process known as acting for a reason.\nAn important feature of Dretske’s account of belief is that, although brain states are recruited to control action because they carry information, there is no guarantee that they will continue to do so. Yet, once they have been recruited for carrying information, they have the function of carrying information, and continue to have that function even if they no longer carry information. This is how misrepresentation enters the world.\nDretske’s last monograph is on consciousness: this is 1995’s Naturalizing the Mind. Between the representational theory of belief, desire, and action in Explaining Behavior and the representational theory of consciousness found in Naturalizing the Mind, Dretske aimed to give full support to what he calls the “Representational Thesis.” This is the claim that:\n(1) All mental facts are representational facts, and (2) All representational facts are facts about informational functions.\nIn Naturalizing the Mind Dretske argues that when a brain state acquires, through natural selection, the function of carrying information, then it is a mental representation suited (with certain provisos) to being a state of consciousness. Representations that get their functions through being recruited by operant conditioning, on the other hand, are beliefs, just as he held in Explaining Behavior.\nIn addition to the subjects tackled in Dretske’s book-length projects, he was also known as a leading proponent, along with David Armstrong and Michael Tooley, of the view that laws of nature are relations among universals.\n\n\n== Relevant Alternatives Theory ==\nIn his 1970 article \"Epistemic Operators\", Fred Dretske discusses epistemic closure and its relationship to philosophical skepticism. The principle of epistemic closure holds the following to be valid:\nS knows p.\nS knows p entails q.\nS knows q.\nFor example,\nJohn knows that he is eating oatmeal.\nJohn knows that eating oatmeal entails that he is not eating scrambled eggs.\nJohn knows that he is not eating scrambled eggs.\nEpistemic closure, however, is vulnerable to exploitation by the skeptic. Eating oatmeal entails not eating scrambled eggs. It also entails not eating scrambled eggs while being deceived by an evil demon into believing one is eating oatmeal. Because John does not have evidence to suggest that he is not being deceived by an evil demon, the skeptic argues that John does not know he is eating oatmeal. To combat this attack by the skeptic, Dretske develops relevant alternatives theory (RAT).\nRAT holds that an agent need only be able to rule out all relevant alternatives in order to possess knowledge. According to RAT, every knowledge claim is made against a spectrum of relevant alternatives entailed by the original knowledge claim. Also entailed by a knowledge claim are irrelevant alternatives. The skeptic's alternatives fall into this irrelevant category. The following applies RAT to Johns oatmeal:\nJohn knows that he is eating oatmeal (as opposed to eating scrambled eggs, eating a bagel, bathing in oatmeal, etc.)\nJohn knows that eating oatmeal entails that he is not eating scrambled eggs.\nJohn knows that he is not eating scrambled eggs.\nJohn knows that eating oatmeal entails that he is not eating scrambled eggs while being deceived by an evil demon into believing he is eating oatmeal.\nJohn does not know that he is not eating scrambled eggs while being deceived by an evil demon. (This alternative is irrelevant; it does not lie within the spectrum of relevant alternatives implied by his initial claim.)\nAlthough it provides a defense from the skeptic, RAT requires a denial of the principle of epistemic closure. Epistemic closure does not hold if one does not know all of the known entailments of a knowledge claim. The denial of epistemic closure is rejected by many philosophers who regard the principle as intuitive and essential for rational thought.\nAnother issue with RAT is how one defines \"relevant alternatives.\" \"A relevant alternative,\" Dretske writes, \"is an alternative that might have been realized in the existing circumstances if the actual state of affairs had not materialized.\"  Some philosophers have argued that this definition is vague.\nIt is also unclear if RAT is sufficient to defeat skepticism. Although RAT is capable of defending against one of the skeptic's attack on knowledge, the skeptic may have other tools that RAT cannot defeat.\n\n\n== Selected publications ==\n1969, Seeing and Knowing, Chicago: The University of Chicago Press. ISBN 0-7100-6213-3\n1981, Knowledge and the Flow of Information, Cambridge, Mass. The MIT Press. ISBN 0-262-04063-8\n1988, Explaining Behavior: Reasons in a World of Causes, Cambridge, Mass. The MIT Press. ISBN 0-262-04094-8\n1995, Naturalizing the Mind, Cambridge, Mass.: The MIT Press. ISBN 0-262-04149-9\n2000, Perception, Knowledge and Belief, Cambridge: Cambridge University Press. ISBN 0-521-77742-9\n\n\n== See also ==\nRelevant alternatives theory\nJean Nicod Prize\n\n\n== References ==\n\n\n== External links ==\nIn Memoriam website of Duke University in favour of Fred Dretske\nAn Interview with Fred Dretske where colleagues ask about his work. From The Dualist, Stanford's Undergraduate Journal of Philosophy\nWHAT GOOD IS CONSCIOUSNESS?\nTHE MIND'S AWARENESS OF ITSELF\nWhere is the Mind when the Body Performs?\nFirst Person Warrant: Comments On Siewert's The Significance Of Consciousness\nPerception without Awareness\nPSYCHOLOGICAL VS. BIOLOGICAL EXPLANATIONS OF BEHAVIOR\nEXPERIENCE AS REPRESENTATION\nHOW DO YOU KNOW YOU ARE NOT A ZOMBIE?\nKNOWING WHAT YOU THINK vs KNOWING THAT YOU THINK IT, or Externalism: Thought and Their Content\nWhat We See, Howison Lectures in Philosophy, 14 November 2007, University of California, Berkeley", "ns": 0, "pageid": 2847218, "title": "Fred Dretske"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}