{"batchcomplete": "", "query": {"normalized": [{"to": "Friedrich Adolf Trendelenburg", "from": "Friedrich_Adolf_Trendelenburg"}], "pages": {"1284870": {"extract": "Friedrich Adolf Trendelenburg (November 30, 1802 – January 24, 1872) was a German philosopher and philologist.\n\n\n== Life ==\nHe was born at Eutin, near Lübeck. He was educated at the universities of Kiel, Leipzig, Berlin. He became more and more attracted to the study of Plato and Aristotle, and his doctoral dissertation (1826) was an attempt to reach through Aristotle's criticisms a more accurate knowledge of the Platonic philosophy (Platonis de ideis et numeris doctrina ex Aristotele illustrata).\nHe declined the offer of a classical chair at Kiel, and accepted a post as tutor to the son of an intimate friend of Karl vom Stein zum Altenstein, the Prussian minister of education. He held this position for seven years (1826–1833), occupying his leisure time with the preparation of a critical edition of Aristotle's De anima (1833; 2nd ed. by Christian Belger, 1877). In 1833 Altenstein appointed Trendelenburg extraordinary professor in Berlin, and four years later he was advanced to an ordinary professorship.\n\n\n== Teaching ==\nFor nearly 40 years, he proved himself markedly successful as a teacher, during the greater part of which time he had to examine in philosophy and pedagogics all candidates for the scholastic profession in Prussia. His teaching method was highly regarded by Søren Kierkegaard who called him \"one of the most sober philosophical philologists I know.\" He was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1861.\n\n\n== Philosophy ==\n\n\n=== Defense of teleology ===\nTrendelenburg's philosophizing is conditioned throughout by his loving study of Plato and Aristotle, whom he regards not as opponents but as building jointly on the broad basis of idealism. His own standpoint may be called a modern version of Aristotelianism. While denying the possibility of an absolute method and an absolute philosophy, as contended for by Hegel and others, Trendelenburg was emphatically an idealist in the ancient or Platonic sense; his whole work was devoted to the demonstration of the ideal in the real. But he maintained that the procedure of philosophy must be analytic, rising from the particular facts to the universal in which we find them explained. We divine the system of the whole from the part we know, but the process of reconstruction must remain approximative. Our position forbids the possibility of a final system. Instead, therefore, of constantly beginning afresh in speculation, it should be our duty to attach ourselves to what may be considered the permanent results of historic developments.\nThe classical expression of these results Trendelenburg finds mainly in the Platonico-Aristotelian system. The philosophical question is stated thus: How are thought and being united in knowledge? How does thought get at being? And how does being enter into thought? Proceeding on the principle that like can only be known by like, Trendelenburg next reaches a doctrine peculiar to himself (though based upon Aristotle) that plays a central part in his speculations. Motion is the fundamental fact common to being and thought; the actual motion of the external world has its counterpart in the constructive motion involved in every instance of perception or thought. From motion he proceeds to deduce time, space and the categories of mechanics and natural science. These, being thus derived, are at once subjective and objective in their scope. It is true that matter can never be completely resolved into motion, but the irreducible remainder may be treated, like Aristotle, as an abstraction we asymptotically approach but never reach.\nThe facts of existence, however, are not adequately explained by the mechanical categories. The ultimate interpretation of the universe can only be found in the higher category of End or final cause. Here Trendelenburg finds the dividing line, between philosophical systems. On the one side stand those that acknowledge none but efficient causes, which make force prior to thought, and explain the universe, as it were, a tergo (\"from the back\"). This may be called, typically, Democritism. On the other side stands the organic or teleological view of the world, which interprets the parts through the idea of the whole, and sees in the efficient causes only the vehicle of ideal ends. This may be called in a wide sense Platonism. Systems like Spinozism, which seem to form a third class, neither sacrificing force to thought nor thought to force, yet by their denial of final causes inevitably fall back into the Democritic or essentially materialistic standpoint, leaving us with the great antagonism of the mechanical and the organic systems of philosophy. The latter view, which receives its first support in the facts of life, or organic nature as such, finds its culmination and ultimate verification in the ethical world, which essentially consists in the realization of ends.\nTrendelenburg's Naturrecht [the right of nature] may, therefore, be taken as in a manner the completion of his system, his working out of the ideal as present in the real. The ethical end is taken to be the idea of humanity, not in the abstract as formulated by Kant, but in the context of the state and of history. Law is treated throughout as the vehicle of ethical requirements. In Trendelenburg's treatment of the state, as the ethical organism in which the individual (the potential man) may be said first to emerge into actuality, we may trace his nurture on the best ideas of Hellenic antiquity.\n\n\n=== The Fischer–Trendelenburg debate ===\nIn 1865 he became involved in an acrimonious controversy on the interpretation of Kant's doctrine of space with Kuno Fischer, whom he attacked in Kuno Fischer und sein Kant (1869), which drew forth the reply Anti-Trendelenburg (1870). The controversy became known in the history of philosophy as the Fischer–Trendelenburg debate.\nTrendelenburg's position on the debate (the position that \"Kant may establish that space and time are a priori and intuitive conditions for experience in the \"Transcendental Aesthetic,\" but this in no way entails that space and time have nothing to do with the objects outside of possible experience\") has been variously dubbed as \"Neglected Alternative,\" \"Trendelenburg's gap\" [die trendelenburgische Lücke], \"Pistorius's gap [die pistorische Lücke]\" (named after Hermann Andreas Pistorius), or \"third possibility\" [die dritte Möglichkeit].\n\n\n== Family ==\nHis son, Friedrich Trendelenburg, was a prominent surgeon; several medical techniques and matters are named for him.\n\n\n== Works (selection) ==\nTrendelenburg was also the author of the following:\nElementa Logices Aristotelicae (1836; 9th ed., 1892; Eng. trans. 1881), a selection of passages from the Organon with Latin translation and notes, containing the substance of Aristotle's logical doctrine, supplemented by Erlauterungen zu den Elementen der Aristotelischen Logik (1842; 3rd ed., 1876).\nLogische Untersuchungen (Logical Investigations), 2 vols. (1840; 3rd ed. 1870), and Die logische Frage in Hegels System (1843), important factors in the reaction against Hegel.\nHistorische Beitrage zur Philosophie (1846–1867), in three volumes, the first of which (Geschichte der Kategorienlehre) contains a history of the doctrine of the Categories.\nGeschichte der Kategorienlehre I: Aristotle Kategorienlehre; II: Die Kategorienlehre in der Geschichte der Philosophie (1846, reprint: Hildesheim, Olms, 1979).\nDes Naturrecht aufdem Grunde der Ethik (1860).\nLücken im Völkerrecht (1870), a treatise on the defects of international law, occasioned by the war of 1870.\nKleine Schriften (1871), papers dealing with non-philosophical, chiefly national and educational subjects.\n\n\n=== Translations ===\nA Contribution to the History of the Word Person: A Posthumous Treatise, Open Court Pub. Co., 1910\nOutlines of Logic: An English Translation of Trendelenburg's Elementa ... (1898), Archive.org\n\n\n== Notes ==\n\nAttribution\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Trendelenburg, Friedrich Adolf\". Encyclopædia Britannica. 27 (11th ed.). Cambridge University Press. \n\n\n== References ==\nFrederick Beiser, Late German Idealism: Trendelenburg and Lotze, Oxford University Press, 2013 [Currently the most complete discussion of Trendelenburg's philosophy.]\nGraham Bird, A Companion to Kant, John Wiley and Sons, 2009 p. 486ff has an article about Trendelenburg's dispute with Fisher over Kant's definition of space\nHermann Bonitz, Zur Erinnering an Friedrich Adolf Trendelenburg (Berlin, 1872)\nBuchholtz, Georg (1904). Die ethischen Grundgedanken Friedrich Adolf Trendelenburgs. Blankenhain: Schlimper. \nErnst Bratuschek, Adolf Trendelenburg (Berlin, 1873) [The first complete intellectual biography of Trendelenburg.]\nGeorge Sylvester Morris in the New Englander (1874), xxxiii.\nPaul Kleinert, Grabrede (Berlin, 1872)\nCarl von Prantl, Gedächtnisrede (Munich, 1873)", "ns": 0, "pageid": 1284870, "title": "Friedrich Adolf Trendelenburg"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}