{"batchcomplete": "", "query": {"normalized": [{"to": "Fyodor Shcherbatskoy", "from": "Fyodor_Shcherbatskoy"}], "pages": {"2469690": {"extract": "Fyodor Ippolitovich Shcherbatskoy or Stcherbatsky (Фёдор Ипполи́тович Щербатско́й) (30 August 1866 – 18 March 1942), often referred to in the literature as F. Th. Stcherbatsky, was a Russian Indologist who, in large part, was responsible for laying the foundations in the Western world for the scholarly study of Buddhism and Buddhist philosophy. He was born in Kielce, Poland (Russian Empire), and died at the Borovoye Resort in northern Kazakhstan.\nStcherbatsky studied in the famous Tsarskoye Selo Lyceum (graduating in 1884), and later in the Historico-Philological Faculty of Saint Petersburg University (graduating in 1889), where Ivan Minayeff and Serge Oldenburg were his teachers. Subsequently sent abroad, he studied Indian poetry with Georg Bühler in Vienna, and Buddhist philosophy with Hermann Jacobi in Bonn. In 1897, he and Oldenburg inaugurated Bibliotheca Buddhica, a library of rare Buddhist texts.\nReturning from a trip to India and Mongolia, in 1903 Stcherbatsky published (in Russian) the first volume of Theory of Knowledge and Logic of the Doctrine of Later Buddhists ( 2 vols., St. Petersburg, 1903-1909 ). In 1928 he established the Institute of Buddhist Culture in Leningrad. His The Conception of Buddhist Nirvana (Leningrad, 1927), written in English, caused a sensation in the West. He followed suit with his main work in English, Buddhist Logic (2 vols., 1930–32), which has exerted an immense influence on Buddhology.\nAlthough Stcherbatsky remained less well known in his own country, his extraordinary fluency in Sanskrit and Tibetan languages won him the admiration of Jawaharlal Nehru and Rabindranath Tagore. According to Debiprasad Chattopadhyaya, \"Stcherbatsky did help us – the Indians – to discover our own past and to restore the right perspective of our own philosophical heritage.\" The Encyclopædia Britannica (2004 edition) acclaimed Stcherbatsky as \"the foremost Western authority on Buddhist philosophy\".\n\n\n== References ==\n\n\n== Bibliography ==\nBapat, P. V. (1943), Fedore Ippolitorich Stcherbatsky, Annals of the Bhandarkar Oriental Research Institute 24 (3/4), 284-285  – via JSTOR (subscription required)\nRuegg, D. Seyfort (1971, Dedication to Th. Stcherbatsky, Journal of Indian Philosophy 1 (3), 213-216  – via JSTOR (subscription required)\n\n\n== External links ==\nThe Scholarly Activity of Fyodor Stcherbatsky – an Epoch in World Buddhology (in English)\nBibliotheca Buddhica (in English)\nStcherbatsky's biography (in Russian)", "ns": 0, "pageid": 2469690, "title": "Fyodor Shcherbatskoy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}