{"batchcomplete": "", "query": {"normalized": [{"to": "Gabriele Taylor", "from": "Gabriele_Taylor"}], "pages": {"32724256": {"extract": "Gabriele Taylor is a philosopher and university teacher. She was Fellow and Tutor in Philosophy at St Anne's College, Oxford until her retirement in 1996. Since then she has continued work as a Senior Research Fellow of the College, pursuing her own particular interests in ethics.\n\n\n== Early life and education ==\nTaylor was born on 11 October 1927 and grew up in Berlin. Her early education was disturbed by the war and at the conclusion of hostilities she and her family found themselves in the British sector of the occupied city. She worked for a while with the Red Cross but ultimately was able to travel to England in 1947 to join a relative already in the country. She then worked part-time whilst also studying and then was successful in gaining a place at St Anne’s in 1952 to read Philosophy, Politics and Economics (PPE). She went on to study for the BPhil in Philosophy, which she completed in 1957.\n\n\n== Academic career ==\nOn completing her BPhil, Taylor started her teaching career as a lecturer in Philosophy at St Anne’s, working alongside Iris Murdoch, who had been a Fellow of the College since 1948. Following a spell in Australia teaching at Canberra University College, on her return to England she rejoined the College as a lecturer in 1962 and became a Fellow of the College in 1964. During her career as Fellow and Tutor she taught undergraduates reading most of the Honour Schools involving philosophy as well as supervising graduate students. In the Faculty of Philosophy, University of Oxford, Taylor also examined and lectured on moral philosophy, Kant and the British Empiricists and gave revision classes on the history of philosophy.\n\n\n== Academic interests ==\nIn her role as tutor for the PPE school, Taylor taught the general and moral philosophy courses and special papers for PPE final examinations, and also taught elementary formal logic to first year undergraduates.\nHer own research has focused on moral psychology, with a particular interest in the ‘ordinary’ vices traditionally seen as death to the soul. Her best-known works are probably Pride, Shame and Guilt (Oxford University Press 1985) and Deadly Vices (Clarendon Press 2006), which examine the beliefs involved in the experience of these emotions. Tom Hurka described Deadly Vices as 'deeply illuminating ... she takes the neo-Aristotelian view of virtue further than any other writer I know'.\n\n\n== References ==", "ns": 0, "pageid": 32724256, "title": "Gabriele Taylor"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}