{"batchcomplete": "", "query": {"normalized": [{"to": "Gaisi Takeuti", "from": "Gaisi_Takeuti"}], "pages": {"2593847": {"extract": "Gaisi Takeuti (竹内 外史, Takeuchi Gaishi, born January 25, 1926) is a Japanese mathematician, known for his work in proof theory.\nAfter graduating from Tokyo University, he went to Princeton to study under Kurt Gödel. He later became a professor at the University of Illinois at Urbana-Champaign. Takeuti was president (2003-2009) of the Kurt Gödel Society, having worked on the respected book Memoirs of a Proof Theorist: Godel and Other Logicians. His goal was to prove the consistency of the real numbers. To this end, Takeuti's conjecture speculates that a sequent formalisation of second-order logic has cut-elimination. He is also known for his work on ordinal diagrams with Akiko Kino.\n\n\n== Publications ==\nTakeuti, Gaisi (1953). \"On a generalized logic calculus\". Japanese Journal of Mathematics. 23: 39–96. ISSN 0075-3432. \nTakeuti, Gaisi; Zaring, Wilson M. (1971), Introduction to axiomatic set theory, Graduate Texts in Mathematics, 1, New York-Berlin: Springer-Verlag, ISBN 0-387-90683-5, MR 0349390 \nTakeuti, Gaisi; Zaring, Wilson M. (1973), Axiomatic set theory, Graduate Texts in Mathematics, 8, New York-Berlin: Springer-Verlag, MR 0416914 \nTakeuti, Gaisi (2013) [1975]. Proof theory (Second ed.). Mineola, New York: Dover Publications. ISBN 978-0-486-49073-1. \nTakeuti, Gaisi (1978), Two applications of logic to mathematics, Publications of the Mathematical Society of Japan, 13, Princeton, N.J.: Princeton University Press, ISBN 0-691-08212-X, MR 0505474 \nTakeuti, Gaisi (2003) [1998], Memoirs of a proof theorist. Gödel and other logicians, River Edge, NJ: World Scientific Publishing Co., Inc., ISBN 9789812382795, MR 1984952 \n\n\n== Notes ==\n\n\n== External links ==\n\nPresidents of the Kurt Gödel Society\nTakeuti Symposium (contains relevant birthdate information)\nLogic Colloqium ’98 Proceedings (contains biography) at the Wayback Machine (archived September 26, 2006)\nGaisi Takeuti at the Mathematics Genealogy Project", "ns": 0, "pageid": 2593847, "title": "Gaisi Takeuti"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}