{"batchcomplete": "", "query": {"normalized": [{"to": "Gary Chartier", "from": "Gary_Chartier"}], "pages": {"24081508": {"extract": "Gary William Chartier (born December 30, 1966) is an American legal scholar who currently serves as Distinguished Professor of Law and Business Ethics and Associate Dean of the Tom and Vi Zapara School of Business at La Sierra University in Riverside, California.\n\n\n== Biography ==\n\n\n=== Early years ===\nChartier was born on December 30, 1966, in Glendale, California, at what is now Glendale Adventist Medical Center, to physician Stanley E. Chartier and Helen L. Bloodworth Chartier, later a realtor. His parents were socially conservative Seventh-day Adventists; his physician father had previously worked as an accountant and had taught the subject at local colleges. When Chartier was in high school he became interested in political theory after reading books by Robert Nozick, Murray Rothbard, Robert Anton Wilson, and Friedrich Hayek. He appeared as a guest on Wally George's Hot Seat television show in 1986 to defend an anarchist manifesto he submitted to the show's producers.\n\n\n=== College and graduate school ===\nChartier received a bachelor's degree at what is now La Sierra University in 1987; he graduated magna cum laude and received the University President's Award. Though he had majored in history and political science, his undergraduate study of philosophy and religion led to his enrollment in a doctoral program in the philosophy of religion and theology at what was then Claremont Graduate School. While at Claremont, where he studied under John Hick, he applied and was accepted into a PhD program in the Faculty of Divinity at the University of Cambridge, where his teachers included Nicholas Lash and Brian Hebblethwaite, and from which he was graduated in 1991. His dissertation, supervised by Hebblethwaite, focused on the idea of friendship; his examiners were Stephen R. L. Clark and Michael Banner. By this time, his political views had taken a conventionally social democratic turn.\n\n\n=== Law school and La Sierra University faculty appointment ===\nAfter working as the editor of a newspaper in Temecula, California, and of a journal published by La Sierra University, and teaching courses in religion and philosophy at Loma Linda University and California Baptist University, Chartier enrolled at the UCLA School of Law. At UCLA, he studied with philosophers including Stephen R. Munzer, Seana Shiffrin, and Pamela Hieronymi, with the political theorist Stephen Gardbaum, with former California Supreme Court Justice Cruz Reynoso, and with constitutional law scholar Kenneth L. Karst; he graduated in 2001 as a member of the Order of the Coif and as the recipient of the Judge Jerry Pacht Memorial Award in Constitutional Law. He had served during law school as Lecturer in Business Ethics at La Sierra; a full-time academic appointment began in September 2001. Following a 2005 stint as Lecturer in Law at Brunel University, Chartier was promoted to the rank of Associate Professor and tenured at La Sierra in 2008. He became Associate Dean of La Sierra's business school in 2009; he was promoted to the rank of Professor in 2012.\n\n\n=== University of Cambridge recognition ===\nIn 2015, the University of Cambridge presented Chartier with an earned LLD in recognition of his work in legal theory.\n\n\n=== Professional and community involvement ===\nChartier serves as a member of the editorial board of the Libertarian Papers, as a member of the advisory board of and an article reviewer for the Journal of Philosophical Economics, as a trustee and senior fellow of the Center for a Stateless Society, a contributor to Spectrum magazine, and treasurer (formerly chair and Western Region vice-chair) of the Riverside County Libertarian Party. He is a contributor to the Bleeding Heart Libertarians weblog; he has used the website to argue in favor of anarchy, and against having a criminal justice system.\n\n\n== Intellectual development ==\nChartier had abandoned his earlier libertarian views by the time he entered graduate school. Despite his support for the anti-authoritarian New Left and the fact that his doctoral dissertation had called for radical political decentralization, his earlier work in political theory was, perhaps somewhat inconsistently, statist. It assumed, without criticism, that remedying poverty and reducing subordination, especially in the workplace, required the activity of the state.\nBy contrast, Chartier's current work in political theory is libertarian and anarchist in flavor. His return to his libertarian roots reflects the impact of his encounters with the thought of contemporary left-libertarians Kevin Carson, Roderick T. Long, and Charles Johnson, as well as a renewed appreciation for Stephen R. L. Clark's critique of state authority. Carson's work, in particular, provided a model for Chartier's reconciliation of his leftist politics with opposition to the state, and helped him to frame a version of left-libertarian market anarchism informed by insights from a version of natural law theory.\n\n\n=== Moral, political, and legal philosophy ===\n\n\n==== General themes ====\nChartier defends a variant of natural law thinking, which he has employed in discussions of anarchism, economic life, and the moral status and claims of non-human animals, as well as such other topics as sexuality and lying.\n\n\n==== Property and economic life ====\nChartier offers an understanding of property rights as contingent but tightly constrained social strategies—reflective of the importance of multiple, overlapping rationales for separate ownership and of natural law principles of practical reasonableness, defending robust but non-absolute protections for these rights in a manner similar to that employed by David Hume. This account is distinguished both from Lockean and neo-Lockean views which deduce property rights from the idea of self-ownership and from consequentialist accounts that might license widespread ad hoc interference with the possessions of groups and individuals. Chartier uses this account to ground a clear statement of the natural law basis for the view that solidaristic wealth redistribution by individual persons is often morally required, but as a response by individuals and grass-roots networks to particular circumstances rather than as a state-driven attempt to achieve a particular distributive pattern. He advances detailed arguments for workplace democracy rooted in such natural law principles as subsidiarity, defending it as morally desirable and as a likely outcome of the elimination of injustice rather than as something to be mandated by the state. He discusses natural law approaches to land reform and to the occupation of factories by workers. He objects on natural-law grounds to intellectual property protections, drawing on his theory of property rights more generally. And he develops a general natural law account of boycotts.\n\n\n==== Anarchism ====\nChartier identifies himself as a \"left-wing market anarchist.\" His approach to market anarchism reflects his indebtedness to Kevin Carson's mutualism, the new classical natural law theory elaborated by Germain Grisez and John Finnis, the \"anarcho-conservatism\" of Stephen R. L. Clark, the New Left-influenced left-libertarian decentralism of Karl Hess, and the socialism and individualist anarchism of Benjamin Tucker.\nChartier argues for anarchism on the basis that the state is unnecessary, illegitimate, and dangerous, and that the elimination of the state will unleash human creativity. His affinity for anarchism differentiates him from other proponents of natural-law ethics. Natural law theorists from St. Thomas Aquinas to the present have frequently been statists. They have often rejected consent-based theories of state authority as unrealistic, arguing instead, in a manner similar to David Hume's, that actually existing states deserve allegiance because of their capacity to preserve order. Chartier contends that the state is not needed to maintain social order, and that natural law theorists need not be attached to it in preference to other means of maintaining order, including custom, convention, and various voluntary arrangements. He has also linked his concerns with anarchism and natural law theory indirectly by defending anarchism against objections levelled by natural law theorist Mark C. Murphy. Murphy has maintained that all arguments for \"philosophical anarchism\" fail because they misconstrue the nature of many people's support for the authority of state-made law and that people who believe in the authority of state-made law are entitled to retain their beliefs in the face of anarchist criticism. Chartier argues in response that for many people, at least, belief in state authority is defeasible and can rightly be undermined by positive arguments against particular justifications for the authority of state-made law. Also important to his defense of anarchism is his detailed justification for the conclusion that, appearances to the contrary notwithstanding, the institutions of a consensual, polycentric legal order can enforce the law without becoming morally indistinguishable from states. Even in Economic Justice and Natural Law, which is not concerned particularly with anarchism, he explicitly challenges the necessity of the state, and his discussion of law in a natural law context focuses on \"communal norms, rules, and institutions\"—which need not be maintained using force and which are intended to be understood as elements of a polycentric legal order—rather than on state-made laws.\n\n\n==== \"Capitalism\" and \"freed markets\" ====\nChartier has been an active participant in discussions among market anarchists and others about the aptness of \"capitalism\" as a label for what some participants in the conversation have termed \"freed markets\"in order to distinguish them from existing economic arrangements, which they see as shot through with statist privilege. He has argued that proponents of genuinely freed markets should explicitly reject capitalism and identify with the global anti-capitalist movement, while emphasizing that the abuses the anti-capitalist movement highlights result from state-tolerated violence and state-secured privilege rather than from voluntary cooperation and exchange. According to Chartier, \"it makes sense for [left-libertarians] to name what they oppose 'capitalism.' Doing so . . . ensures that advocates of freedom aren't confused with people who use market rhetoric to prop up an unjust status quo, and expresses solidarity between defenders of freed markets and workers—as well as ordinary people around the world who use 'capitalism' as a short-hand label for the world-system that constrains their freedom and stunts their lives.\" He has joined Kevin Carson, Charles Johnson, and others (echoing the language of Benjamin Tucker and Thomas Hodgskin) in maintaining that, because of its heritage and its emancipatory goals and potential, radical market anarchism should be seen—by its proponents and by others—as part of the socialist tradition, and that market anarchists can and should call themselves \"socialists.\"\n\n\n==== Non-human animals ====\nWhile supporting vegetarianism and affirming that non-human animals have moral standing, Chartier follows Stephen R. L. Clark in rejecting consequentialist defenses of vegetarianism like those offered by Peter Singer. Singer acknowledges that, on consequentialist grounds, it might seem as if there is little reason for individuals to be concerned about their dietary choices, since few of those choices will actually have consequences for any actual animals. But Singer maintains that some few dietary choices will, by crossing certain demand thresholds, dramatically increase production of animals for food and that taking this possibility into account provides good reason to avoid purchasing meat, since there is a small chance that a single meat purchase might lead to substantial negative consequences for many animals. Chartier dissects Singer's argument, maintaining that it is unsuccessful because it fails to take proper account of the actual characteristics of the meat production market (or any similarly enormous market). He examines in detail consequentialist, natural law, and virtue theoretic accounts of boycotting the meat industry, concluding that both natural law and virtue theory provide limited grounds on which a boycott might be defended, but that consequentialism does not. While he maintains, in tandem with the new classical natural law theorists, that consequentialism is in principle incoherent, he also challenges the factual predictions made by consequentialist proponents of the meat industry boycott.\n\n\n=== Philosophy of religion and philosophical theology ===\n\n\n==== General topics ====\nChartier's work in the philosophy of religion and philosophical theology has focused especially on theodicy and divine action, but he has also addressed a range of other topics, including the significance of talk about God as personal, Christology, the relationship between God and ethics, and the idea of substitutionary atonement.\n\n\n==== The meaning of God-language ====\nChartier has offered a reading of language about God as personal that partly parallels logical behaviorist interpretations of talk about consciousness. He suggests that, because we cannot pretend to know what God is like in se, this sort of reading, while inappropriate when applied to finite persons, could be helpful when used in relation to God.\n\n\n==== Divine action and theodicy ====\nHe suggests that talk about divine action provides a necessary starting point for theological reflection, and argues that the only reasonable way to think about divine action, in turn, is to begin by considering the constraints on credible talk about divine providence imposed by the reality of suffering and evil. Reviewing a range of options in theodicy, he concludes that, while their underlying assumptions (and accounts of creation) are different, classical free will theism and process theology lead to very similar predictions regarding what kinds of divine action are to be expected, and that, in connection with the task of constructive theology, there is therefore no need to choose between them, though the differences continue to matter with respect to questions in the philosophy of religion and philosophical theology.\nWhen he does directly addresses questions related to theodicy, he implies that process philosophy offers a more satisfactory theodicy than any alternative approach to theism, but he argues that even the process approach has significant difficulty taking proper account of the reality of animal suffering. He maintains that Christian attempts to use the Incarnation as a component of theodicy are rendered problematic by the need to articulate belief in incarnational Christology using a robust account of divine action, which seems likely itself to make it harder to resolve the problem of evil (if God is in the business of working miracles, as such a robust view implies, why aren't there more of them?).\n\n\n==== Theism and ethics ====\nChartier argues that divine command views of ethics turn out to be inconsistent with talk about God's love for the world. Talk about love in this context is meaningful only if some intelligible sense can be given to the notion of the beloved's well being that is independent of the choice of the lover, so the theist cannot maintain that God is love without acknowledging that some objective sense can be given to the notion of creaturely flourishing apart from God's will. The range of reasonable moral principles is constrained by facts about flourishing, and basic moral norms seem credible independently of the divine volition. And imposing obligations over and above those following from these principles would itself be an unloving thing to do.\n\n\n==== Atonement ====\nCriticizing substitutionary accounts of atonement, Chartier notes that such theories purport to be committed to belief in retributive justice, and thus fall victim to standard objections to retributivism. At the same time, however, by allowing for substituted punishment, they imply a view of justice unlikely to be satisfactory to retributivists themselves.\n\n\n== Publications ==\nChartier is the author of five scholarly books—Anarchy and Legal Order, Radicalizing Rawls, Economic Justice and Natural Law, The Analogy of Love, and The Conscience of an Anarchist—and of articles in journals including the Oxford Journal of Legal Studies, Law and Philosophy, Legal Theory, the UCLA Law Review, and Religious Studies, and the co-editor (with Charles Johnson) of Markets Not Capitalism.\n\n\n=== Reactions to publications ===\nDavid Gordon praised Radicalizing Rawls: \"Chartier has written a book of outstanding merit. Radicalizing Rawls confirms his place as one of the best political philosophers of our time.\"\nReactions to Anarchy and Legal Order have been mixed, though frequently positive.\nReviewing the book in Common Knowledge, Peter Leeson described it as \"intriguing\" and classed it \"among the most sophisticated ethical defenses of anarchy I have encountered.\" In Anarchist Studies, Eric Roark wrote: \"Gary Chartier’s Anarchy and Legal Order offers nothing less than a tremendous contribution to contemporary libertarian and anarchist thought.\" Roark highlighted what he characterized as a \"compelling and rich vision of anarchy forged by a just legal regime.\" Edward Stringham characterized the book as \"well written, thought provoking, and a welcome addition to the literature.\"\nAeon Skoble of Bridgewater State University suggested in a Reason review that Chartier’s \"arguments [in the book] are laid out with such elegance and precision that any intelligent lay reader should be able to understand them.\" Skoble writes: \"Anarchy and Legal Order is an impressive contribution to libertarian thought generally, and in particular to the ongoing debates on anarchism versus minarchism and on libertarianism's place vis-a-vis the left/right dichotomy. It's a must-read for those interested in political philosophy, and it may well challenge readers' long-held beliefs about the nature of government.” In a symposium in Studies in Emergent Order devoted to the book, Skoble added: \"Chartier's argument demonstrates not only that natural law theory is compatible with spontaneous order theory, but also that what this confluence points to is a voluntary, polycentric legal order. The book is thus valuable not only for offering a robust defense of polycentrism, but for doing so in a way that ties together two important threads from the liberal tradition, natural law and spontaneous order, and in doing so, enhances our understanding of both.” Also writing in the symposium, Jason Brennan criticized Chartier's reliance on the controversial new natural law theory and objected to his embrace of the theory's view that basic aspects of well being are incommensurable, a view Brennan suggested led to counterintuitive, implausible conclusions. While expressing some concerns about the feasibility of Chartier’s proposals, Paul Dragos Aligica concluded: \"Anarchy and Legal Order is currently the book to read if one wants to explore the potential and limits of natural law, non-aggression maxim, praxeology based doctrines of stateless social order. Austrian scholars of all persuasions will benefit immensely from engaging with its arguments and the intellectual precedent it creates.\"\nJonathan Crowe called Economic Justice and Natural Law \"important and original.\" Timothy Chappell declared that it was \"[e]ssential reading\" and maintained that it was \"elegant, clear, and well-informed.\" According to Stephen Munzer, it was \"perceptive, timely, and beautifully ordered\" and featured arguments that were \"probing and trenchant.\" By contrast, St. John’s University economist Charles Clarke criticized the book’s anarchism, evaluating it as insufficiently attentive to the need for governmental involvement in the economy and as unduly similar in tone to the work of Austrian economists. The book was the focus of a Molinari Society session at the April 2011 San Diego convention of the American Philosophical Association's Pacific Division.\nThe Analogy of Love received mixed reviews. In the course of a tepidly favorable assessment, Timothy Gorringe maintained that some passages disposed him to \"reach for the whiskey bottle,\" though he also observed that the book did \"not parade its erudition\" and suggested that it was \"consistently on the side of the angels.\" By contrast, Ian Markham characterized the book as \"a rare treat,\" labelling it \"[c]ompelling, well-argued, crystal clear and deeply creative\" and identifying it as \"[a]n absolute must-read.\" Paul Ballard described Analogy as \"extremely well informed and researched,\" as \"comprehensive,\" and as \"rich, sensitive and insightful.\" Ballard evaluated the book's \"style of presentation\" as \"remarkably lucid and jargon free\" and as \"spare, simple, direct and logical, cutting to the heart of a discussion.\" \nStephan Kinsella has described Chartier's third book as \"the best of the crop of political 'conscience' books.\" Jeff Riggenbach maintains that \"[l]ibertarians who are now in their teens and twenties could do far worse than to let their own attention be captured by Gary Chartier's Conscience of an Anarchist.\" According to Aeon Skoble, \"Chartier’s arguments are logically well structured and rhetorically effective. His writing style is clear and straightforward.\" Skoble emphasizes that \"[p]eople with a background in philosophy or economics will find the arguments interesting and not simplistic, yet any intelligent lay reader will find the book accessible.\" Skoble says the book features \"five chapters of convincing argument that the state causes terrible problems for no justifiable reason.\"\n\n\n=== Authored Scholarly Books ===\nPublic Practice, Private Law: An Essay on Love, Marriage, and the State. New York: CUP 2016. ISBN 978-1107140608.\nRadicalizing Rawls: Global Justice and the Foundations of International Law. Philosophy, Public Policy, and Transnational Law 2. New York: Palgrave 2014. ISBN 978-1137382900.\nAnarchy and Legal Order: Law and Politics for a Stateless Society. New York: CUP 2013. ISBN 978-1107032286. OCLC 795645156\nThe Conscience of an Anarchist. Apple Valley, CA: Cobden 2011. ISBN 978-1439266991. OCLC 760097242\nEconomic Justice and Natural Law. Cambridge: CUP 2009. ISBN 978-0521767200. OCLC 318871444\nThe Analogy of Love: Divine and Human Love at the Center of Christian Theology. Exeter: Imprint Academic 2007. ISBN 978-1845400910. OCLC 173182241. ISSN 0040-571X.\n\n\n=== Edited Books ===\nThe Future of Adventism: Theology, Society, Experience. Ann Arbor, MI: Griffin 2015. ISBN 978-0692520215.\nChartier, Gary, and Johnson, Charles W., eds. Markets Not Capitalism: Individualist Anarchism against Bosses, Inequality, Corporate Power, and Structural Poverty. New York: Minor Compositions-Autonomedia 2011. ISBN 978-1570272424. OCLC 757148527\n\n\n=== Edited Symposium ===\nChartier, Gary, ed. Law and Anarchism: Legal Order and the Idea of a Stateless Society. Griffith Law Review 21.2 (2012): 293-498.\n\n\n=== Articles ===\n\"Left-Wing Market Anarchism and Natural Law.\" Studies in Emergent Order 7 (2014): 314-24.\n\"Reconciling Rawls and Hayek?\" Essay rev. of Free Market Fairness, by John Tomasi. Independent Review 17.4 (Spring 2013): 577-88.\n\"Anarchism as a Research Program in Law.\" Griffith Law Review 21.2 (2012): 293-306.\n\"Enforcing the Law and Being a State.\" Law and Philosophy 31.1 (2012): 99–123. ISSN 0167-5249\n\"Intellectual Property and Natural Law.\" Australian Journal of Legal Philosophy 36 (2011): 58–88.\n\"Response to Charles Clark.” Conversations in Religion and Theology 9.1 (2011): 188-99.\n\"Pirate Constitutions and Workplace Democracy.\" Jahrbuch für Recht und Ethik [Annual Review of Law and Ethics] 18 (2010): 449–67.\n\"Natural Law and Non-Aggression.\" Acta Juridica Hungarica [Hungarian Journal of Jurisprudence] 51.2 (June 2010): 79–96. ISSN 1216-2574\n\"Natural Law and Animal Rights.\" Canadian Journal of Law and Jurisprudence 23.1 (2010): 33–46.\n\"Proudhon in Green.\" Rev. of Organization Theory: A Libertarian Perspective, by Kevin A. Carson. Conversations in Religion and Theology 7.2 (Nov. 2009): 230–43. ISSN 1479-2206\n\"In Defence of the Anarchist.\" Oxford Journal of Legal Studies 29.1 (2009): 115–38. ISSN 0143-6503\n\"Sweatshops, Labor Rights, and Competitive Advantage.\" Oregon Review of International Law 10.1 (2008): 149–88.\n\"Divorce: A Normative Analysis.\" Florida Coastal Law Review 10.1 (Fall 2008): 1–32.\n\"Marriage: A Normative Framework.\" Florida Coastal Law Review 9.3 (Spring 2008): 347–434.\n\"Response to Hebblethwaite.\" Conversations in Religion and Theology 6.1 (2008): 17-23.\n\"The Incarnation and the Problem of Evil.\" Heythrop Journal 49 (2008): 110–27. ISSN 0018-1196\n\"Consumption, Development Aid, and Natural Law.\" Washington and Lee Journal of Civil Rights and Social Justice 13.2 (Spring 2007): 205–57.\n\"Self-Integration as a Basic Good: A Response to Chris Tollefsen.\" American Journal of Jurisprudence 52 (2007): 293-6.\n\"Niebuhr's Ghost?\" Essay rev. of The Good Fight: Why Liberals—and Only Liberals—Can Win the War on Terror and Make America Great Again, by Peter Beinart. Conversations in Religion and Theology 5.1 (2007): 91–115.\n(Dunn, Deborah K., and Chartier, Gary.) \"Pursuing the Millennium Goals at the Grassroots: Selecting Development Projects Serving Rural Women in Sub-Saharan Africa.\" UCLA Women's Law Journal 15.1 (Fall 2006): 71–114.\n\"A Progressive Case for a Universal Transaction Tax.\" Maine Law Review 58.1 (2006): 1–16.\n\"Toward a Consistent Natural Law Ethics of False Assertion.\" American Journal of Jurisprudence 51 (2006): 43–64.\n\"On the Threshold Argument against Consumer Meat Purchases.\" Journal of Social Philosophy 37.2 (Sum. 2006): 235–51. ISSN 0047-2786\n\"Non-Human Animals and Process Theodicy.\" Religious Studies 42.1 (2006): 3–26. ISSN 0034-4125\n\"Toward a New Employer-Worker Compact.\" Employee Rights and Employment Policy Journal 9.1 (2005): 51–119. ISSN 0065-8995. OCLC 774694419\n\"Urban Redevelopment and Land Reform: Theorizing Eminent Domain after Kelo.\" Legal Theory 11 (2005): 363–85. ISSN 1352-3252\n\"The Law of Peoples or a Law for People: Consumers, Boycotts, and Non-Human Animals.\" Buffalo Environmental Law Journal 12 (Spring 2005): 123–94. ISSN 1066-8837. OCLC 779197162\n[\"Reason and the Resurrection.\"] Essay rev. of The Resurrection of God Incarnate, by Richard Swinburne. Conversations in Religion and Theology 2.1 (May 2004): 11–28.\n(Chartier, Gary, and Thomas, John.) \"Taking Mission to Market: Revisioning Adventist Business Curricula in the New Millennium.\" Journal of Adventist Education 66 (April–May 2004): 12–9.\n\"Peoples or Persons? Revising Rawls on Global Justice.\" Boston College International and Comparative Law Review 27.1 (Winter 2004): 1–97. ISSN 0277-5778. OCLC 773546947\n\"Victims and Parole Decisions.\" Jahrbuch für Recht und Ethik 11 (2003): 405–32.\n\"Friendship, Identity, and Solidarity: An Approach to Rights in Plant Closing Cases.\" Ratio Juris 16.3 (Sep. 2003): 324–51. ISSN 0952-1917\n\"Richard Rorty's American Faith.\" Anglican Theological Review 85.2 (Spring 2003): 255–82.\n\"Truth-Telling, Incommensurability, and the Ethics of Grading.\" Brigham Young University Education and Law Journal 3.1 (2003): 37–81.\n\"Contested Practices: Arthur Isak Applbaum's Ethics for Adversaries.\" Jahrbuch für Recht und Ethik 10 (2002): 254–77\n\"Righting Narrative: Robert Chang, Poststructuralism, and the Limits of Critique.\" UCLA Asian Pacific American Law Journal 7.1 (Spring 2001): 105–32.\n\"Civil Rights and Economic Democracy.\" Washburn Law Journal 40.2 (Winter 2001): 267–87.\n\n\n=== Book Reviews ===\nRev. of Anarchy, State, and Public Choice, ed. Edward Stringham. Review of Austrian Economics 28.3 (Sep. 2015): 361-3.\n\"Liberating Capitalism?\" Rev. of Why Not Capitalism?, by Jason Brennan. Journal of Ayn Rand Studies 15.1 (2015): 97-103.\nRev. of Anarchy Unbound, by Peter Leeson. Canadian Journal of Law and Jurisprudence 28.1 (Jan. 2015): 237-40.\n\"Who Rules America?\" Rev. of The New Class Conflict, by Joel Kotkin. Reason. Reason Foundation, Sep. 20, 2014.\n“In Us We Trust?” Rev. of The Moral Foundations of Economic Behavior, by David C. Rose. The Freeman: Ideas on Liberty. Foundation for Economic Education, March 7, 2014.\nRev. of The Problem of Political Authority: An Examination of the Right to Coerce and the Duty to Obey, by Michael Huemer. Canadian Journal of Law and Jurisprudence 26.2 (July 2013): 515-20.\nRev. of Libertarianism: What Everyone Needs to Know, by Jason Brennan. Independent Review 17.4 (Spring 2013): 807-12.\nRev. of Ministers of the Law: A Natural Law Theory of Legal Authority, by Jean Porter. Notre Dame Philosophical Reviews (College of Arts and Letters, U of Notre Dame, Sep. 7, 2011).\nRev. of Political Philosophy, Clearly: Essays on Freedom and Fairness, Property and Equalities, by Anthony de Jasay. Independent Review 15.4 (Spring 2011): 603–6.\nRev. of Why Animal Suffering Matters, by Andrew Linzey. Ethics 120.3 (April 2010): 614–7. ISSN 0014-1704\nRev. of Nature Red in Tooth and Claw: Theism and the Problem of Animal Suffering, by Michael Jr. Murray. Religious Studies 45.3 (2009): 370–2.ISSN 0034-4125\nRev. of The Politics of Praise: Naming God and Friendship in Aquinas and Derrida, by William W. Young. Theological Book Review 19.2 (2007): 78.\nRev. of All That Is: A Naturalistic Faith for the Twenty-First Century, by Arthur Peacocke, ed. Philip Clayton. Theological Book Review 19.2 (2007): 74.\nRev. of Revelation: From Metaphor to Analogy, by Richard Swinburne. Theological Book Review 20.1 (2008): 153–4.\nRev. of The Dissenting Tradition in American Education, by James C. Carper and Thomas C. Hunt. Journal of Research on Christian Education 16.2 (July–Dec. 2007): 269–73. ISSN 1065-6219\n(Dunn, Deborah K., and Chartier, Gary.) \"Which Human Rights? Which God?\" Rev. of Does Human Rights Need God?, ed. Elizabeth M. Bucar and Barbara Barnett. Religion and Human Rights 1 (2006): 105–7.\n\"Tradition, Dialogue, and Human Rights.\" Rev. of The Global Face of Public Faith: Politics, Human Rights, and Christian Ethics, by David Hollenbach. Religion and Human Rights 1 (2006): 97–100.\nRev. of The Ethics of Sex, by Mark Jordan. Theology and Sexuality 16 (March 2002): 121–3. ISSN 1355-8358\nRev. of Marriage after Modernity: Christian Marriage in Postmodern Times, by Adrian Thatcher. Theology and Sexuality 12 (Mar. 2000): 120–4. ISSN 1355-8358\nRev. of The Beginning and the End of 'Religion', by Nicholas Lash. Andrews University Seminary Studies 37 (Aut. 1999): 125–8.\nRev. of Eros for the Other: Retaining Truth in a Pluralistic World, by Wendy Farley. Andrews University Seminary Studies 37 (Aut. 1999): 113–7.\nRev. of Ethics and Religion in a Pluralistic Age: Collected Essays, by Brian Hebblethwaite. Andrews University Seminary Studies 36 (Spring 1998): 128–31.\nRev. of The Challenge of Postmodernism: An Evangelical Engagement, ed. David S. Dockery. Andrews University Seminary Studies 35 (Spring 1997): 111–4.\nRev. of Clark H. Pinnock on Biblical Authority: An Evolving Position, by Ray C. W. Roennfeldt. Andrews University Seminary Studies 33 (Aut. 1995): 322–4.\n\"A Definitive History of Millerism.\" Rev. of Millennial Fever and the End of the World: A Comprehensive Survey of Millerism and America's Fascination with the Millennium in the Nineteenth Century, by George R. Knight. Adventist Heritage 16.3 (Spring 1995): 41–3.\nRev. of Keeping the Sabbath Wholly: Ceasing, Resting, Embracing, Feasting, by Marva J. Dawn. Religious Studies Review 18.2 (April 1992): 125–6.\nRev. of Understanding the Trinity, by Alister E. McGrath. Religious Studies Review 17.2 (April 1991): 143.\n\n\n=== Other Publications ===\nVulnerability and Community: Meditations on the Spiritual Life. Ann Arbor, MI: Griffin 2015. 978-0692494127.\nIn the Open Hand: Sonnets from the Californian. Encino, CA: Steepletop 2015. 978-0692477458.\n\"We Should Abandon the Term 'Capitalism'.\" The Freeman: Ideas on Liberty 63.7 (Sep. 2013): 22.\n\"Beyond Bossism.\" The Industrial Radical 1.2 (Win. 2013): 37-9.\n\"The Distinctiveness of Left-Libertarianism.\" The Industrial Radical 1.2 (Win. 2013): 27-31.\n\"Just Say 'No.'\" The Industrial Radical 1.1 (Aut. 2012): 30-3.\n\"Any (Good) Thing the State Can Do, We Can Do Better.\" The Industrial Radical 1.1 (Aut. 2012): 3-4.\n\"Leaders Need Better Followers? It Just Ain’t So!\" The Freeman: Ideas on Liberty 62.8 (Oct. 2012): 6-7.\n\"What's Wrong with Right-to-Work.\" The Freeman: Ideas on Liberty 62.4 (May 2012): 16-8.\n\"Government Is No Friend of the Poor.\" The Freeman: Ideas on Liberty 62.1 (Jan.-Feb. 2012): 15-8.\n\"Anti-Interventionism Is Cold Indifference? It Just Ain’t So!\" The Freeman: Ideas on Liberty 61.6 (July-Aug. 2011): 4-5.\n\"Gary Chartier.\" Environmental Non-Policy: A Collection of Interviews. By Gene Basler. [Houston, TX]: Basler 2011. 58–90.\nSocialist Ends, Market Means: 5 Essays. Tulsa, OK: Tulsa Alliance of the Libertarian Left 2009.\n\"Richard Swinburne.\" Blackwell Companion to the Theologians. 2 vols. Ed. Ian Markham. Oxford: Blackwell 2009. 2: 467–74.\n\"Sine Wave.\" Songs of Freedom: Tales from the Revolution. By Darryl W. Perry et al. Sandpoint, ID: BookCrossing 2009. 39.\n\"Love, Subsidiarity, Equality, and Inclusiveness.\" Christianity and Homosexuality: Some Seventh-day Adventist Perspectives. Ed. David Ferguson, Fritz Guy, and David Larson. Roseville, CA: Association of Adventist Forums 2008. [329-39]\n\"Two Faces of the Right to Privacy in Litigators' Ethics.\" Litigation Ethics (American Bar Association, Litigation Section, Ethics and Professionalism Committee) 4.2 (Spring 2006): 1+.\n\"An Adventist Law School?\" Dialog (La Sierra University) 8 (April 2006): 3–4.\n\"Scholarship as a Requirement for Promotion and Tenure at La Sierra University.\" Dialogue (La Sierra University) 6 (June 2005): 1–3.\n\"The Christian in Business: Beyond Honesty.\" College and University Dialogue 17.1 (2005): 5–8.\n\"The Rule of Double Effect: A Valuable Contemporary Resource.\" Update (Loma Linda University Center for Christian Bioethics) 16.4 (Dec. 2000): 1+.\n\"Service: An Everyday Opportunity.\" La Sierra Today Fall 1997: 23.\n(editor, compiler, and contributing writer) \"A Tradition of Progress: A Brief History of La Sierra University.\" La Sierra Today Fall 1997: 6+.\n\"La Sierra University.\" Seventh-day Adventist Encyclopædia. 2nd rev. ed. Hagerstown, MD: Review 1996\n(assoc. ed.) Teel, Charles, ed. Remnant and Republic: Adventist Themes for Personal and Social Ethics. Loma Linda, CA: Loma Linda U Center for Christian Bioethics 1995.\n(Daily, Steve, with Chartier, Gary.) \"The Religious Significance of Campus Diversity.\" La Sierra Today Winter 1994: 12.\n\"Student Life and the Future of Adventist Higher Education.\" Journal of Adventist Education 38 (Dec. 1992-Jan. 1993): 22–7.\n\"Divine Creation and Human Caring.\" Dialogue [Loma Linda University Church] 3.3 (Mar. 1992): 3\n\"Undercover Notes.\" Insight 15.4 (Jan. 28, 1984): 17.\n\n\n== References ==\n\n\n== External links ==\nBlogger.com Profile\nChartier’s appearance on Mental Self-Defense Radio with Jake Shannon (AM 630, Salt Lake City)\nChartier’s appearance on Reason TV discussing Markets Not Capitalism\nDavid Schmidtz's interview with Chartier on America's Fabric.\nStudies in Emergent Order symposium focused on Chartier's Anarchy and Legal Order\nCenter for a Stateless Society bloggers' teleconference featuring Chartier\n\"Advocates of Freed Markets Should Embrace 'Anti-Capitalism'\" (advance version of a presentation delivered on April 13, 2010, at the annual conference of the Association of Private Enterprise Education, available via the Center for a Stateless Society)\nFoundation for Economic Education author link\nGary Chartier at Goodreads", "ns": 0, "pageid": 24081508, "title": "Gary Chartier"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}