{"batchcomplete": "", "query": {"normalized": [{"to": "Gene Callahan (economist)", "from": "Gene_Callahan_(economist)"}], "pages": {"489564": {"extract": "Gene Callahan is an American economist and writer. He is a charter member of the Michael Oakeshott Association, and is the author of two books, Economics for Real People and Oakeshott on Rome and America. He currently teaches at State University of New York at Purchase and is Honorary Fellow at Cardiff University.\nCallahan has written for Reason, The Freeman, The Free Market, The American Conservative, Slick Times, Java Developer's Journal, Software Development, Dr. Dobb's Journal, Human Rights Review, Independent Review, NYU Journal of Law and Liberty, Review of Austrian Economics, and other publications. He was also a frequent contributor to LewRockwell.com, prior to 2008.\nOriginally from Connecticut, Callahan has a master's degree from the London School of Economics, a PhD from Cardiff University, and currently lives in Brooklyn, New York.\n\n\n== Economics For Real People ==\nDavid Gordon's review of Callahan's Economics for Real People in the Mises Review states:\n\nWittgenstein famously said, \"whatever can be said, can be said clearly\"; but does this apply to economics? Callahan, like his great predecessor, Henry Hazlitt, shows that it does. If the theme of Hazlitt's Economics in One Lesson is the indirect effects of intervention in the economy, Callahan's dominant thread is the role of monetary calculation in making possible cooperative activity on a vast scale.\n\nAccording to economist Richard Ebeling, Callahan's book:\n\n...neatly explains why socialist central planning must inevitably result in failure because the abolition of private property, market competition, and money prices eliminates the institutional prerequisites for economic calculation, without which the central planner is left with no rational method to determine whether or not the resources under his control are being applied in an efficient manner.\n\n\n== Notes ==\n\n\n== External links ==\nCallahan's blog\nArchive of articles on lewrockwell.com\nArchive of articles on mises.org\nReason contributor profile/archive\nArticles on The American Conservative\nGene Callahan at Goodreads", "ns": 0, "pageid": 489564, "title": "Gene Callahan (economist)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}