{"batchcomplete": "", "query": {"normalized": [{"to": "Geoffrey Sayre-McCord", "from": "Geoffrey_Sayre-McCord"}], "pages": {"11457292": {"extract": "Geoffrey Sayre-McCord (né McCord, born December 10, 1956) is a philosopher who works in moral theory, meta-ethics, the history of ethics, and epistemology. He has written extensively in these areas. He is known especially for his work on moral realism and on David Hume's moral theory. He has also written on contractualism. His Essays on Moral Realism is widely used in undergraduate and graduate courses on meta-ethics and he was, for five years, a co-editor of the highly regarded journal Noûs. Sayre-McCord received his BA from Oberlin College and his PhD (under the direction of David Gauthier) from the University of Pittsburgh. The recipient of several university-wide teaching awards, Sayre-McCord is the Morehead-Cain Alumni Distinguished Professor of Philosophy and Director of the Philosophy, Politics, and Economics Program at the University of North Carolina, where he has taught since 1985.\n\n\n== Publications ==\n\n\n=== Some articles ===\n\"Coherence and Models for Moral Theorizing,\" Pacific Philosophical Quarterly (1985)\n\"Deontic Logic and the Priority of Moral Theory,\" Noûs (1986)\n\"The Many Moral Realisms,\" Southern Journal of Philosophy, Spindel Conference Supplement, (1986)\n\"Moral Theory and Explanatory Impotence,\" Midwest Studies (1988)\n\"Deception and Reasons to be Moral,\" American Philosophical Quarterly, (1989)\n\"Functional Explanations and Reasons as Causes,\" Philosophical Perspectives (1990)\n\"Being a Realist about Relativism,\" Philosophical Studies (1991)\n\"Normative Explanations,\" Philosophical Perspectives (1992)\n\"On Why Hume's General Point of View Isn't Ideal -- and Shouldn't Be,\" Social Philosophy and Policy (1994)\n\"Coherentist Epistemology and Moral Theory,\" in Moral Knowledge?, ed. by Sinnott-Armstrong and Timmons (1996)\n\"Hume and the Bauhaus Theory of Ethics,\" Midwest Studies (1996)\n\"Hume's Representation Argument Against Rationalism,\" Manuscrito (1997)\n\"The Meta-Ethical Problem,\" Ethics (1997)\n\"'Good' on Twin Earth,\" Philosophical Issues (1997)\n\"Contractarianism,\" Blackwell Guide to Ethical Theory (1999)\n\"Criminal Justice and Legal Reparations,\" Philosophical Issues (2001)\n\"Mill's 'Proof': A More than Half-Hearted Defense,\" Social Philosophy and Policy (2001)\n\"On the Relevance of Ignorance to the Demands of Morality,\" Rationality, Rules, and Ideals, ed. by Sinnott-Armstrong (2002)\n\"Moral Realism,\" Oxford Handbook of Moral Theory, ed. by Copp (2006)\n\"Moral Semantics and Empirical Enquiry,\" Moral Psychology, ed. by Sinnott-Armstrong (2008)\n\"Hume on Practical Morality and Inert Reason,\" Oxford Studies in Metaethics, ed. by Shafer-Landau (2008)\n\"Sentiments and Spectators: Adam Smith's Theory of Moral Judgment,\" The Philosophy of Adam Smith, ed. by Brown and Fleischacker (2010)\n\n\n=== Edited volumes ===\nEssays on Moral Realism (Cornell University Press, 1988)\nHume: Moral Philosophy (Hackett Publishing, 2006)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== External links ==\nGeoffrey Sayre-McCord's webpage at UNC-Chapel Hill\nGeoffrey Sayre-McCord's curriculum vita\nGeoffrey Sayre-McCord's personal webpage\nPapers available on-line\nStanford Encyclopedia entry on Meta-Ethics, on-line\nStanford Encyclopedia entry on Moral Realism, on-line\nSayre-McCord on Bloggingheads.tv discussing meta-ethics\nSayre-McCord on Bloggingheads.tv discussing ethics and evolution\nSayre-McCord lecture on Adam Smith's Moral Theory on YouTube\nSayre-McCord lecture on The Nature of Normative Concepts", "ns": 0, "pageid": 11457292, "title": "Geoffrey Sayre-McCord"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}