{"batchcomplete": "", "query": {"normalized": [{"to": "George Croom Robertson", "from": "George_Croom_Robertson"}], "pages": {"250745": {"extract": "George Croom Robertson (10 March 1842 – 20 September 1892) was a Scottish philosopher.\n\n\n== Biography ==\nHe was born in Aberdeen. In 1857 he gained a bursary at Marischal College, and graduated MA in 1861, with the highest honours in classics and philosophy. In the same year he won a Fergusson scholarship of £100 a year for two years, which enabled him to pursue his studies outside Scotland. He went first to University College, London; at the University of Heidelberg he worked on his German; at the Humboldt University in Berlin he studied psychology, metaphysics and also physiology under Emil du Bois-Reymond, and heard lectures on Hegel, Kant and the history of philosophy, ancient and modern. After two months at the University of Göttingen, he went to Paris in June 1863. In the same year he returned to Aberdeen and helped Alexander Bain with the revision of some of his books.\nIn 1864 he was appointed to help William Duguid Geddes with his Greek classes, but he devoted his vacations to working on philosophy. In 1866 he was appointed professor of philosophy of mind and logic at University College, London. He remained there until he was forced by ill-health to resign a few months before his death, lecturing on logic, deductive and inductive, systematic psychology and ethics.\nHe left little published work. A comprehensive work on Hobbes was never completed, though part of the materials were used for an article in the Encyclopædia Britannica, and another portion was published as one of Blackwood's \"Philosophical Classics.\" Together with Bain, he edited George Grote's Aristotle, and was the editor of Mind from its foundation in 1876 till 1891. Robertson had a keen interest in German philosophy, and took every opportunity to make German works on English writers known in the United Kingdom. In philosophy he was principally a follower of Bain and John Stuart Mill. He and his wife (a daughter of Mr Justice Crompton) were involved in many kinds of social work; he sat on the Committee of the National Society for Women's Suffrage, and was actively associated with its president, John Stuart Mill. He also supported the admission of women students to University College.\n\n\n== Works ==\n\"Prefatory Words\", from Mind, Volume I, Number 1 (January 1876).\nReview of Hughlings Jackson's Researches on the Nervous System, from Mind, Volume I, Number 1 (January 1876).\nReview of Cairnes's Logical Method of Political Economy, from Mind, Volume I, Number 1 (January 1876).\n\"Sense of Doubleness with Crossed Fingers\", from Mind, Volume I, Number 1 (January 1876).\n\"Logic and the Elements of Geometry\", from Mind, Volume I, Number 1 (January 1876).\n\"The Physical Basis of Mind,\" Mind, Vol. III, 1878.\n\"Philosophy in Education,\" Mind, Vol. III, 1878.\n\"Psychology and Philosophy,\" Mind, Vol. VIII, 1883.\nHobbes (1886).\nPhilosophical Remains ...: with a Memoir (1894)\nElements of General Philosophy (1896).\nElements of Psychology (1896).\n\n\n== References ==\n\n\n== Sources ==\nAlexander Bain: \"George Croom Robertson\" Mind (N. S.), Vol. 2 (1893), 1–14.\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"article name needed\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== External links ==\n Works written by or about George Croom Robertson at Wikisource\nWorks by George Croom Robertson, at Hathi Trust", "ns": 0, "pageid": 250745, "title": "George Croom Robertson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}