{"batchcomplete": "", "query": {"normalized": [{"to": "Georg Jellinek", "from": "Georg_Jellinek"}], "pages": {"2998052": {"extract": "Georg Jellinek (16 June 1851 – 12 January 1911) was a German public lawyer, considered of Austrian origin. Along with Hans Kelsen and the Hungarian Félix Somló he belonged to the group of Austrian legal positivists and was considered to be \"the exponent of public law in Austria“.\nFrom 1867, Jellinek studied law, history of art and philosophy at the University of Vienna. He also studied philosophy, history and law in Heidelberg and Leipzig up until 1872. He was the son of Adolf Jellinek, the then famous preacher in Vienna's Jewish community. In 1872 he completed his Dr. phil. thesis in Leipzig (The Soci-Ethical Meaning of Justice, Injustice and Punishment) and in 1874 also his Dr. jur. in Vienna.\nIn 1879 he qualified as a professor at the University of Vienna. Jellinek was later visiting professor of legal philosophy in Vienna, in 1881 he was named a member of the commission for state exams and one year later he published his seminal work, The Theory of the Unifications of States (1882). In 1883 he was given the predigious title of Professor of Public Law at the University of Vienna. In 1889 he was duly given a professorship in Basel and left the academic service of Austria-Hungary. From 1891 he was Ordinarius for general Public Law and International Law at the University of Heidelberg. In 1900 he compiled his main work, the General Theory of the State.\nHe was married to Camilla Jellinek, born in Wertheim (1860–1940), who was persuaded to join the Women's Movement by Marianne Weber in 1900 and became famous there especially for her work with providing women with legal aid and the production of draft reforms of the criminal law. The couple had six children, born between 1884 and 1896, of which just four survived childhood: son Walter, and daughter Dora, who were deported to the Theresienstadt concentration camp by the Nazis and youngest son, Otto, who died in 1943 as a result of abuse at the hands of the Gestapo.\nJellinek is best known for his essay The Declaration of the Rights of Man and the Citizen (1895), which argues for a universal theory of rights, as opposed to the culturally and nationally specific arguments then in vogue (particularly that of Émile Boutmy). Jellinek argued that the French Revolution, which was the focal point of 19th century political theory, should not be thought of as arising from a purely French tradition (namely the tradition stemming from Jean-Jacques Rousseau) but as a close analogue of revolutionary movements and ideas in England and the United States.\n\n\n== Career ==\n\nJellinek studied law in 1867 in Vienna at the Alma Mater Rudolphina along with art history and philosophy. In addition he continued studies until 1872 in philosophy, history and law at the Heidelberg University in Heidelberg and at the Alma Mater Lipsiensis. Jellinek attended Leipzig in 1872 writing a dissertation on The Worldviews of Leibnitz and Schopenhauer and received his Dr. phil. In 1874, he also received the Dr. jur.\nJellinek followed this in 1879 with his Habilitation at the University of Vienna. Jellinek then became a lecturer in the philosophy of law in Vienna, and in 1881 he was appointed a member of the State Examination Commission. In the following year, Jellinek published one of his seminal works titled 'The doctrine of Federated States' (1882). In 1883 he was appointed extraordinary professor of Constitutional Law in Vienna. In 1889 he became a full professor in Basel and retired from his academic position in Austria-Hungary. In 1891 Jellinek became a Professor of law at the University of Heidelberg and wrote, in 1900, his magnum opus, the General Theory of State.\n\n\n== Writings ==\nThe majority of Jellinek's writings remain untranslated out of the original German language.\nDie Weltanschauungen Leibnitz’ und Schopenhauer’s: Ihre Gründe und ihre Berechtigung. Eine Studie über Optimismus und Pessimismus. Hölder, Wien 1872 (phil. Dissertation, Universität Leipzig; Digitalisat).\nDie Lehre von den Staatenverbindungen. Haering, Berlin 1882 (Digitalisat).\nDie socialethische Bedeutung von Recht, Unrecht und Strafe. Hölder, Wien 1878 (Digitalisat).\nDie rechtliche Natur der Staatenverträge: Ein Beitrag zur juristischen Construction des Völkerrechts. Hölder, Wien 1880 (Digitalisat).\nÖsterreich-Ungarn und Rumänien in der Donaufrage: Eine völkerrechtliche Untersuchung. Hölder, Wien 1884 (Digitalisat).\nGesetz und Verordnung: Staatsrechtliche Untersuchungen auf rechtsgeschichtlicher und rechtsvergleichender Grundlage. Mohr, Freiburg im Breisgau 1887 (Digitalisat).\nSystem der subjektiven öffentlichen Rechte. Mohr, Freiburg im Breisgau 1892 (Digitalisat).\nAllgemeine Staatslehre (= Recht des modernen Staates. Bd. 1). Berlin 1900; 2. Auflage 1905 (Digitalisat); 3. Auflage 1914 (Digitalisat).\n\n\n== Literature ==\nAlexander Hollerbach (1974), \"Jellinek, Georg\", Neue Deutsche Biographie (NDB) (in German), 10, Berlin: Duncker & Humblot, pp. 391–392 ; (full text online)\nCamilla Jellinek: Georg Jellinek. Ein Lebensbild. In: Georg Jellinek, Ausgewählte Schriften und Reden, Bd. 1, Neudruck Aalen 1970, S. 5–140.\nChristian Keller: Victor Ehrenberg und Georg Jellinek. Briefwechsel 1872–1911, Frankfurt am Main 2005, ISBN 978-3-465-03406-3.\nKlaus Kempter: Die Jellineks 1820–1955. Eine familienbiographische Studie zum deutschjüdischen Bildungsbürgertum. Düsseldorf 1998.\nJens Kersten: Georg Jellinek und die klassische Staatslehre. Verlag Mohr-Siebeck, Tübingen 2000, ISBN 3-16-147348-5.\nStanley L. Paulson (Hrsg.): Georg Jellinek: Beiträge zu Leben und Werk. Verlag Mohr-Siebeck, Tübingen 2000, ISBN 3-16-147377-9.\nAndreas Anter (Hrsg.): Die normative Kraft des Faktischen: das Staatsverständnis Georg Jellineks. Nomos-Verlag, Baden-Baden 2004, ISBN 3-8329-0733-5.\nRealino Marra: La religione dei diritti. Durkheim – Jellinek – Weber. Giappichelli, Turin 2006, ISBN 88-348-6617-7.\n\n\n== References ==\n\n\n== Further reading ==\nKelly, Duncan (2004). \"Revisiting the Rights of Man: Georg Jellinek on Rights and the State\". Law and History Review. American Society for Legal History. 22 (3): 493–529. JSTOR 4141687. \n\n\n== External links ==\nThe majority of weblinks for Jellinek are in his native German language as are his major writings.\nWorks by Georg Jellinek at Project Gutenberg\nWorks by or about Georg Jellinek at Internet Archive\nLiterature by and about Georg Jellinek in the German National Library catalogue\nFamilienpapiere Jellinek 1850–1960\nDr. Matthias Hartwig: Der Staat als Gegenstand des Staatsrechts Kurzer Text beim Max-Planck-Institut für ausländisches öffentliches Recht und Völkerrecht, Heidelberg, Online-Ressource, zur Drei-Elementen-Lehre\nJens Kersten: Georg Jellinek. In: Enzyklopädie zur Rechtsphilosophie, im Auftrag der Deutschen Sektion der Internationalen Vereinigung für Rechts- und Sozialphilosophie (IVR), hrsg. von Michael Anderheiden (u. a.)", "ns": 0, "pageid": 2998052, "title": "Georg Jellinek"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}