{"batchcomplete": "", "query": {"normalized": [{"to": "George Kateb", "from": "George_Kateb"}], "pages": {"9195251": {"extract": "George Kateb is William Nelson Cromwell Professor of Politics, Emeritus, at Princeton University. A staunch individualist, Kateb has written scholarly works on Ralph Waldo Emerson, John Stuart Mill, and Hannah Arendt, and the ethical dimensions of the individual in a constitutional democracy. More recently Kateb has turned his attention to what he sees as the increasing erosion of individual liberty wrought by the Bush administration and the poisonous influence of religious, ethnic and statist group identity on morality.\nKateb earned his A.B., A.M. and Ph.D. at Columbia University and was a Junior Fellow at Harvard University. He then taught at Amherst College for thirty years before joining the faculty at Princeton in 1987. As a member of the executive committee of the University Center for Human Values he was involved with the search committee that somewhat controversially appointed noted Australian philosopher Peter Singer to a chair in bioethics at Princeton in 1999. Kateb is a member of the American Academy of Arts and Sciences. He has also served as vice president of the American Society of Political and Legal Philosophy and president of the New England Political Science Association. In addition, Kateb has served as a member of the editorial board or consulting editor of the Journal of the History of Ideas, the Library of America, Alternative Futures, the American Political Science Review, Political Theory, and Raritan Quarterly Review. He is also a recipient of the Behrman Award for Distinguished Achievement in the Humanities from Princeton. Kateb retired from teaching in 2002.\n\n\n== Bibliography ==\nUtopia and Its Enemies (1963)\nPolitical Theory: Its Nature and Uses (1968)\nHannah Arendt: Politics, Conscience, Evil (1984)\nThe Inner Ocean: Individualism and Democratic Culture (1992)\nEmerson and Self-Reliance (1994)\nPatriotism and Other Mistakes (2006)\nHuman Dignity (2011)\n\n\n== External links ==\nPrinceton Report On Knowledge Forum with Kateb\nKateb's contributions to the New York Review of Books\nKateb's Princeton faculty page", "ns": 0, "pageid": 9195251, "title": "George Kateb"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}