{"batchcomplete": "", "query": {"normalized": [{"to": "George Pappas", "from": "George_Pappas"}], "pages": {"12272": {"extract": "George Sotiros Pappas (born 1942) is a professor of philosophy at Ohio State University. Pappas specializes in epistemology, the history of early modern philosophy, philosophy of religion, and metaphysics. He is of Greek and English origin.\nHe is the author of the Stanford Encyclopedia of Philosophy entry on Internalist versus Externalist conceptions of epistemic justification.\nHe was co-editor (with Marshall Swain) of Essays on Knowledge and Justification (1978), regarded as a key anthology of essays relating to the Gettier problem and used as a core text in undergraduate epistemology courses.\nGeorge Pappas is an editorial consultant of Berkeley Studies.\n\n\n== Studies in Berkeley's philosophy ==\nGeorge S. Pappas is known to be a leading Berkeley scholar; his essay “Berkeley and Scepticism” was in 1993 awarded the International Berkeley Prize. Professor Pappas is a regular participant of International Berkeley Conferences. At one such conference, celebrating the 300th anniversary of George Berkeley’s birth, Mr. Pappas propounded a new approach to the relationship between Berkeley’s anti-abstractionism and \"esse est percipi\" principle. On Pappas reading, Berkeley’s two theses — that there are no abstract ideas and that sensible objects must be perceived in order to exist — entail one another.\n\nPappas’ formulation of the relationship between these two propositions is ingenious and merits his verdict that it is a ‘very exciting result’ … So far as I know, his thesis is original. Some writers, to be sure, have some close to suggesting that the first proposition is a necessary condition for the truth of the second, but I cannot think of a commentator who holds that it is both a necessary and sufficient condition.\n\nPappas' interpretation of Berkeley's ‘esse is percipi’ thesis has sparked much discussion. In 1989, the Garland Publishing Company brought out a 15-volume collection of major works on Berkeley; Pappas' paper “Abstract ideas and the 'esse is percipi' thesis” was included in the third volume, as it was considered to be a significant contribution to Berkeley scholarship.\nPappas developed his treatment of Berkeley’s “esse est percipi” principle to repudiate the \"inherence interpretation of Berkeley\", upon which Edwin E. Allaire, among others, elaborated\n\n“That account is put forward to answer an extremely perplexing question in the history of philosophy: Why did Berkeley embrace idealism, i. e., why did he hold that esse est percipi, that to be is to be perceived? (Hausman 1984, pp. 421–2)\n\nAfter emerging in the early 1960s, the “inherence account” attracted numerous proponents and became an influential element of contemporary Berkeley scholarship. In his paper “Ideas, minds, and Berkeley” Pappas revealed some discrepancies between fountain-head evidences and Allaire’s approach to a reconstruction of Berkeley’s idealism. Pappas' critical examination of the “inherence account” is greatly appreciated by Berkeley scholars. Pappas’ penetrating remarks compelled Edwin B. Allaire to revise and improve his conception. Even those who share Allaire’s account of Berkeley’s idealism acknowledge Pappas’ article to be “an excellent review and critique of the IA [inherence account].”\nIn 2000 George Pappas published his monograph Berkeley's thought in which some parts were based on earlier papers of his. While writings by A. A. Luce or Geoffrey Warnock are long out dated, the book Berkeley's thought written by Dr Pappas is often included in lists of recommended literature on Berkeley’s philosophy.\n\n\n== Publications ==\nPappas, George S. (2000). Berkeley's Thought. Cornell University Press. ISBN 0-8014-3700-8. \n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nGeorge Berkeley\n\n\n== References ==", "ns": 0, "pageid": 12272, "title": "George Pappas"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}