{"batchcomplete": "", "query": {"normalized": [{"to": "George Ohsawa", "from": "George_Ohsawa"}], "pages": {"1803753": {"extract": "George Ohsawa, born Nyoichi Sakurazawa (櫻澤 如一, , October 18, 1893 – April 23, 1966), was the founder of the Macrobiotic diet and philosophy. When living in Europe he went by the pen names of Musagendo Sakurazawa, Nyoiti Sakurazawa, and Yukikazu Sakurazawa. He also used the French first name Georges while living in France, and his name is sometimes also given this spelling. George Ohsawa introduced the oriental concept of health to Westerners in the mid-20th century, writing about 300 books in Japanese and 20 in French during a 40-year period. He defined health with seven criteria: lack of tiredness or fatigue; good appetite; good sleep; good memory; good humour; precision of thought and action; gratitude.\n\n\n== Life ==\nOhsawa was born into a poor samurai family during the Meiji Restoration in Shingu City Wakayama pref Japan. He had no money for higher education. Around this time, his spiritual path started. Around 1913, Ohsawa joined the Shoku-yo Kaimovement, studying with Manabu Nishibata (a direct disciple of the late Sagen Ishizuka) in Tokyo. William Dufty described the circumstances of Nyoiti’s family:\nThe gradual introduction of sugar into the Japanese diet brought in its wake the beginning of Western diseases. A Japanese midwife, trained in the techniques of Western medicine as a nurse, fell ill and was abandoned as incurable by the Western doctors she had espoused. Three of her children died the same way. The fourth, Nyoiti Sakurazawa, rebelled at the notion of dying of tuberculosis and ulcers in his teens. He took up the study of ancient Oriental medicine which had been officially outlawed in Japan. Sakurazawa was attracted to the unorthodox career of a famous Japanese practitioner, Dr. Sagan Isiduka. Thousands of patients had been cured by Isiduka (through traditional use of food) after they had been abandoned as incurable by the new medicine of the West.\nOhsawa states in his books that he cured himself from tuberculosis at age 19 by applying the ancient concept of yin and yang that originated in China, as well as the teachings of Sagen Ishizuka.\nLater he traveled to Europe, particularly Paris, France where he began to spread his philosophy (it is in this period he supposedly adopted his new pen name \"Ohsawa\", after the French \"oh, ça va\" which means \"all right\" or \"I'm doing fine\" as a reply to the question \"how are you doing ?\"). After several years, he returned to Japan to start a foundation, and gather recruits for his now formalized philosophy. In 1931, he published The Unique Principle explaining the yin and yang order of the universe.\nAfter drawing attention during World War II for his pacifist ideals, he wrote a book which predicted Japan's defeat and was incarcerated, narrowly escaping death for his views. After being freed from prison by U.S. General McArthur, he moved his institution to a remote area in the mountains of Yamanashi prefecture.\nIt is presumed that he got the Western name for his movement from a book written by Christoph Wilhelm Hufeland, a famous Prussian physician. It is known that he spent time in Europe with a descendant of Hufeland.\nSeveral of his Japanese disciples were also instrumental in disseminating Macrobiotics in the West. They are, in particular, Herman Aihara in California, Roland Yasuhara in Belgium (where LIMA, the well-known manufacturer of macrobiotic products was born), Tomio Kikuchi in Brazil, Clim Yoshimi in France, and Michio Kushi in Massachusetts.\nAnother famous student of Ohsawa was Noburo Muramoto, a Japanese native who became head of the Tokyo Macrobiotic Center before being invited by Herman Aihara to Aihara's and his wife Cornelia's study center in San Francisco in the 1970s, the George Ohsawa Macrobiotic Foundation (GOMF). After spending some time teaching Macrobiotics and Traditional Oriental Medicine with the Aiharas, Muramoto founded his own center called Asunaro Institute in Glen Ellen, California. During this time Muramoto wrote \"Healing Ourselves\" with the collaboration of Michel Abehsera, a student of George Ohsawa who compiled the book from lectures Muramoto gave while he was on tour in the USA. Abehsera, a noted author in his own right, most notably of \"Zen Macrobiotic Cooking\" and \"Our Earth, Our Cure\", as well as several other books on natural health, diet, and philosophy, through his association with Swan House Publishers in Binghamton, New York, was able to publish and distribute the book through health food stores and metaphysical outlets.\nWhile in France Ohsawa wrote a number of books in French related to the Macrobiotic world view, which were published by Vrin Publishers in Paris, France. Among them were \"L'Ere Atomique\", The Atomic Age, written during the Cuban Missile Crisis. Ohsawa was motivated to write the book because of the looming possibility of atomic war and the consequences on life as we know it. In this book, as was typical of all books Ohsawa wrote, he devotes considerable time to explaining his views regarding how Macrobiotics can shed light on many social problems as well as causes of war and how Macrobiotics can help bring about a world in which war will be seen as an outcome of an error of judgment, and discarded as an effective solution to social conflict.\nOhsawa also created a stir by predicting the deaths of several notables including USA President John F. Kennedy based on the condition known in Japan as \"Sanpaku\" (three-spaces empty). Sanpaku refers to traditional Japanese physiognomic diagnosis in which eyes can be seen to present a white area below as well as to each side of the iris when viewed straight on. This anomaly was considered a sign of extreme fatigue that made one accident-prone and slow to react. In ancient Japan, Samurai warriors were trained to watch for this feature to assist in determining how formidable an enemy would be in hand-to-hand combat. Sakurazawa Nyoichi used this diagnosis in his teachings and Ohsawa adapted it to a more general diagnostic indication of one's general state of health.\nThe assassination of the President led Tom Wolfe to write:\nAbdul Karim Kassem, Ngo Dihn Diem, and President Kennedy, all sanpaku and, now, shot to death, all destroyed by the fate of the sanpaku, which is more than coincidence and should be an alarm signal to men and nations, say the Macrobiotics, for thus it has been demonstrated by their leader, George Ohsawa, Japanese prophet of the Unique Principle.\nThis article caught the attention of William Dufty, plagued by illness, and finding relief in the brown rice diet recommended by Ohsawa. Dufty became an advocate of macrobiotics, traveled to Paris to meet with Ohsawa and publisher Felix Morrow. Ohsawa handed Dufty a package, and said, \"Here is a lifetime of writing. Do your best with them. It's your turn.\" In 1965 Morrow's firm, University Books, published Ohsawa's writings under the provocative title You Are All Sanpaku.\nOhsawa died of a heart attack at the age of 74.\n\n\n== Books ==\nThe following bibliography of the writings of George Ohsawa is from page 218 of You Are All Sanpaku:\n1931: Le Principle Unique de la Philosophie et de la Science d’Extreme Orient, Paris: Vrin.\n1932: Le Livre des Fleurs, Paris : Plon.\n1934: Le Medecine Chinoise, Paris : Le Francois.\n1952: Le Livre du Judo, Tokyo : Sekai Seihu.\n1954: The Two Great Indians in Japan, Sri Rash Benhari Bose and Netaji Subhas Chandra Bose, India: Sri K.C. Das.\n1956: Jack et Madame Mitie (Deux Erewhoniens dans la Jungle dire \"Civilization\"), Paris: E.D.\n1956 : La Philosophie de la Medecin d’Extreme Orient, Paris : Vrin.\n1961 : Zen Macrobiotique, Bruxelles : I.D.M..\n1961 : Acupuncutre Macrobiotique, Paris : Sesam.\n\n\n=== Japanese works ===\nMacrobiotics\nHistory of China From 2000 B.C. Until Today\nFranklin: A physiological and biological biography\nGandhi: A physiological and biological biography\nClara Schumann and Her Father: A physiological and biological Study\nTranslation and critique: The Encounter Between East and West by F.S.C. Northrup\nTranslation and critique: Man the Unknown by Alexis Carrell\nThe Fatality of Science\n\n\n== See also ==\nJapanese resistance to the Empire of Japan in World War II\n\n\n== References ==\n\n\n== External links ==\nOriginal teachings of George Ohsawa on www.prise1.ca (French)", "ns": 0, "pageid": 1803753, "title": "George Ohsawa"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}