{"batchcomplete": "", "query": {"normalized": [{"to": "Georg Kreisel", "from": "Georg_Kreisel"}], "pages": {"11761785": {"extract": "Georg Kreisel FRS (September 15, 1923 – March 1, 2015) was an Austrian-born mathematical logician who studied and worked in Great Britain and America.\n\n\n== Biography ==\nKreisel was born in Graz and came from a Jewish background; his family sent him to the United Kingdom before the Anschluss, where he studied mathematics at Trinity College, Cambridge, and then, during World War II, worked on military subjects. Kreisel never took a Ph.D., though in 1962 he was awarded the Cambridge degree of Sc.D., a `higher doctorate' given on the basis of published research. He taught at the University of Reading until 1954 and then worked at the Institute for Advanced Study from 1955 to 1957. Subsequently he taught at Stanford University and the University of Paris. Kreisel was appointed a professor at Stanford University in 1962 and remained on the faculty there until he retired in 1985.\nKreisel worked in various areas of logic, and especially in proof theory, where he is known for his so-called \"unwinding\" program, whose aim was to extract constructive content from superficially non-constructive proofs.\nKreisel was elected to the Royal Society in 1966; Kreisel remained a close friend of Francis Crick whom he had met in the Royal Navy during WWII.\nWhile a student at Cambridge, Kreisel was the student most respected by Ludwig Wittgenstein. Ray Monk writes, \"In 1944--when Kreisel was still only twenty-one--Wittgenstein shocked Rush Rhees by declaring Kreisel to be the most able philosopher he had ever met who was also a mathematician.\"\nKreisel was also a close friend of the Anglo-Irish philosopher and novelist Iris Murdoch. They met at Cambridge in 1947 during Murdoch's year of study there. Peter Conradi reports that Murdoch transcribed Kreisel's letters into her journals over the next fifty years. According to Conradi, \"For half a century she nonetheless records variously Kreisel's brilliance, wit and sheer 'dotty' solipsistic strangeness, his amoralism, cruelty, ambiguous vanity and obscenity.\" Murdoch dedicated her 1971 novel An Accidental Man to Kreisel and he became a (partial) model for several characters in other novels, including Marcus Vallar in The Message to the Planet and Guy Openshaw in Nuns and Soldiers.*\nAfter retirement Kreisel lived in Salzburg, Austria. He wrote several biographies of mathematicians including Kurt Gödel, Bertrand Russell and Luitzen Egbertus Jan Brouwer. He died in Salzburg, aged 91.\n\n\n== Anecdotes ==\nWhile teaching at The University of Reading, he would frequently take the train into London. There was a particularly fast train that was timed just right for the shows in London, and he would go to the station at that time. He checked the timetable one day, and that train was canceled. But out of habit one day he showed up at the station at the usual time and the train was there. It seems that it was going from Bristol to London, stopping at Reading only to get water. He got on the train anyway, and from then on took that train regularly. One day he was accosted by the conductor after he got on. \"The train doesn't stop here sir!\" \"In that case I didn't get on here.\"\n\n\n== See also ==\nKreisel–Putnam logic\n\n\n== References ==\n\n\n== External links and further reading ==\nGeorg Kreisel at Find a Grave\nKreiseliana: About and Around George Kreisel, Piergiorgio Odifreddi, ed., Wellesley, Massachusetts: A. K. Peters, 1996. ISBN 1-56881-061-X.\nKreisel, lambda calculus, a windmill and a castle Contains personal recollections about Kreisel by his student Henk Barendregt.\nGeorg Kreisel at the Mathematics Genealogy Project", "ns": 0, "pageid": 11761785, "title": "Georg Kreisel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}