{"batchcomplete": "", "query": {"normalized": [{"to": "Georges Bataille", "from": "Georges_Bataille"}], "pages": {"209215": {"extract": "Georges Albert Maurice Victor Bataille (French: [ʒɔʁʒ batɑj]; 10 September 1897 – 9 July 1962) was a French intellectual and literary figure working in literature, philosophy, anthropology, economics, sociology and history of art. His writing, which included essays, novels, and poetry, explored such subjects as eroticism, mysticism, surrealism, and transgression. His work would prove influential on subsequent schools of philosophy and social theory, including poststructuralism.\n\n\n== Life and work ==\nGeorges Bataille was the son of Joseph-Aristide Bataille (b. 1851), a tax collector (later to go blind and paralysed on account of neurosyphilis), and Antoinette-Aglaë Tournarde (b. 1865). Born in Billom in the region of Auvergne, his family moved to Reims in 1898, where he was baptized. He went to school in Reims and then Épernay. Although brought up without religious observance, he converted to Catholicism in 1914, and became a devout Catholic for about nine years. He considered entering the priesthood and attended a Catholic seminary briefly. However, he quit, apparently in part in order to pursue an occupation where he could eventually support his mother. He eventually renounced Christianity in the early 1920s.\nBataille attended the École Nationale des Chartes in Paris, graduating in February 1922. Though he is often referred to as an archivist and a librarian because of his employment at the Bibliothèque Nationale, his work there was with the medallion collections (he also published scholarly articles on numismatics). His thesis at the École des Chartes was a critical edition of the medieval manuscript L’Ordre de chevalerie which he produced directly by classifying the eight manuscripts from which he reconstructed the poem. After graduating he moved to the School of Advanced Spanish Studies in Madrid. As a young man, he befriended, and was much influenced by, the Russian existentialist, Lev Shestov.\nFounder of several journals and literary groups, Bataille is the author of a large and diverse body of work: readings, poems, essays on innumerable subjects (on the mysticism of economy, poetry, philosophy, the arts, eroticism). He sometimes published under pseudonyms, and some of his publications were banned. He was relatively ignored during his lifetime and scorned by contemporaries such as Jean-Paul Sartre as an advocate of mysticism, but after his death had considerable influence on authors such as Michel Foucault, Philippe Sollers, and Jacques Derrida, all of whom were affiliated with the journal Tel Quel. His influence is felt most explicitly in the phenomenological work of Jean-Luc Nancy, but is also significant for the work of Jean Baudrillard, the psychoanalytic theories of Jacques Lacan and Julia Kristeva, and recent anthropological work from the likes of Michael Taussig.\nInitially attracted to Surrealism, Bataille quickly fell out with its founder André Breton, although Bataille and the Surrealists resumed cautiously cordial relations after World War II. Bataille was a member of the extremely influential College of Sociology which included several other renegade surrealists. He was heavily influenced by Hegel, Freud, Marx, Marcel Mauss, the Marquis de Sade, Alexandre Kojève, and Friedrich Nietzsche, the last of whom he defended in a notable essay against appropriation by the Nazis.\nFascinated by human sacrifice, he founded a secret society, Acéphale, the symbol of which was a headless man. According to legend, Bataille and the other members of Acéphale each agreed to be the sacrificial victim as an inauguration; none of them would agree to be the executioner. An indemnity was offered for an executioner, but none was found before the dissolution of Acéphale shortly before the war. The group also published an eponymous review of Nietzsche's philosophy which attempted to postulate what Derrida has called an \"anti-sovereignty\". Collaborators in these projects included André Masson, Pierre Klossowski, Roger Caillois, Jules Monnerot, Jean Rollin and Jean Wahl.\nBataille drew from diverse influences and used various modes of discourse to create his work. His novel Story of the Eye (Histoire de l'oeil), published under the pseudonym Lord Auch (literally, Lord \"to the shithouse\" — \"auch\" being short for \"aux chiottes,\" slang for telling somebody off by sending him to the toilet), was initially read as pure pornography, while interpretation of the work has gradually matured to reveal the same considerable philosophical and emotional depth that is characteristic of other writers who have been categorized within \"literature of transgression\". The imagery of the novel is built upon a series of metaphors which in turn refer to philosophical constructs developed in his work: the eye, the egg, the sun, the earth, the testicle.\nOther famous novels include the posthumously published My Mother (which would become the basis of Christophe Honoré's film Ma Mère), The Impossible and Blue of Noon, which, with its incest, necrophilia, politics, and autobiographical undertones, is a much darker treatment of contemporary historical reality.\nDuring World War II Bataille produced Summa Atheologica (the title parallels Thomas Aquinas' Summa Theologica) which comprises his works Inner Experience, Guilty, and On Nietzsche. After the war he composed The Accursed Share, which he said represented thirty years' work. The singular conception of \"sovereignty\" expounded there would become an important topic of discussion for Derrida, Giorgio Agamben, Jean-Luc Nancy and others. Bataille also founded the influential journal Critique.\nBataille's first marriage was to actress Silvia Maklès, in 1928; they divorced in 1934, and she later married the psychoanalyst Jacques Lacan. Bataille also had an affair with Colette Peignot, who died in 1938. In 1946 Bataille married Diane de Beauharnais, with whom he had a daughter.\nIn 1955 Bataille was diagnosed with cerebral arteriosclerosis, although he was not informed at the time of the terminal nature of his illness. He died seven years later, on 9 July 1962.\n\n\n== Key concepts ==\n\n\n=== Base materialism ===\nBataille developed base materialism during the late 1920s and early 1930s as an attempt to break with mainstream materialism. He argues for the concept of an active base matter that disrupts the opposition of high and low and destabilises all foundations. In a sense the concept is similar to Baruch Spinoza's neutral monism of a substance that encompasses both the mind and the matter posited by René Descartes; however, it defies strict definition and remains in the realm of experience rather than rationalisation. Base materialism was a major influence on Derrida's deconstruction, and both thinkers attempt to destabilise philosophical oppositions by means of an unstable \"third term.\" Bataille's notion of materialism may also be seen as anticipating Louis Althusser's conception of aleatory materialism or \"materialism of the encounter,\" which draws on similar atomist metaphors to sketch a world in which causality and actuality are abandoned in favor of limitless possibilities of action.\n\n\n=== The accursed share ===\nLa Part maudite is a book written by Bataille between 1946 and 1949, when it was published by Les Éditions de Minuit. It was translated into English and published in 1991, with the title The Accursed Share. It presents a new economic theory, which Bataille calls \"general economy,\" as distinct from the \"restricted\" economic perspective of most economic theory. Thus, in the theoretical introduction, Bataille writes the following:\n\nI will simply state, without waiting further, that the extension of economic growth itself requires the overturning of economic principles—the overturning of the ethics that grounds them. Changing from the perspectives of restrictive economy to those of general economy actually accomplishes a Copernican transformation: a reversal of thinking—and of ethics. If a part of wealth (subject to a rough estimate) is doomed to destruction or at least to unproductive use without any possible profit, it is logical, even inescapable, to surrender commodities without return. Henceforth, leaving aside pure and simple dissipation, analogous to the construction of the Pyramids, the possibility of pursuing growth is itself subordinated to giving: The industrial development of the entire world demands of Americans that they lucidly grasp the necessity, for an economy such as theirs, of having a margin of profitless operations. An immense industrial network cannot be managed in the same way that one changes a tire… It expresses a circuit of cosmic energy on which it depends, which it cannot limit, and whose laws it cannot ignore without consequences. Woe to those who, to the very end, insist on regulating the movement that exceeds them with the narrow mind of the mechanic who changes a tire.\n\nThus, according to Bataille's theory of consumption, the accursed share is that excessive and non-recuperable part of any economy which is destined to one of two modes of economic and social expenditure. This must either be spent luxuriously and knowingly without gain in the arts, in non-procreative sexuality, in spectacles and sumptuous monuments, or it is obliviously destined to an outrageous and catastrophic outpouring in war.\nThe notion of \"excess\" energy is central to Bataille's thinking. Bataille's inquiry takes the superabundance of energy, beginning from the infinite outpouring of solar energy or the surpluses produced by life's basic chemical reactions, as the norm for organisms. In other words, an organism in Bataille's general economy, unlike the rational actors of classical economy who are motivated by scarcity, normally has an \"excess\" of energy available to it. This extra energy can be used productively for the organism's growth or it can be lavishly expended. Bataille insists that an organism's growth or expansion always runs up against limits and becomes impossible. The wasting of this energy is \"luxury.\" The form and role luxury assumes in a society are characteristic of that society. \"The accursed share\" refers to this excess, destined for waste.\nCrucial to the formulation of the theory was Bataille's reflection upon the phenomenon of potlatch. It is influenced by Marcel Mauss's The Gift, as well as by Friedrich Nietzsche's On the Genealogy of Morals.\n\n\n=== Other ===\n\n\n== Bibliography ==\nComplete works\nGeorges Bataille, Œuvres complètes (Paris: Gallimard):\nVolume 1: Premiers écrits, 1922–1940: Histoire de l'œil - L'Anus solaire - Sacrifices - Articles\nVolume 2: Écrits posthumes, 1922–1940\nVolume 3: Œuvres littéraires: Madame Edwarda - Le Petit - L'Archangélique - L'Impossible - La Scissiparité - L'Abbé C. - L'être indifférencié n'est rien - Le Bleu du ciel\nVolume 4: Œuvres littéraires posthumes: Poèmes - Le Mort - Julie - La Maison brûlée - La Tombe de Louis XXX - Divinus Deus - Ébauches\nVolume 5: La Somme athéologique I: L'Expérience intérieure - Méthode de méditation - Post-scriptum 1953 - Le Coupable - L'Alleluiah\nVolume 6: La Somme athéologique II: Sur Nietzsche - Mémorandum - Annexes\nVolume 7: L'économie à la mesure de l'univers - La Part maudite - La limite de l'utile (Fragments) - Théorie de la Religion - Conférences 1947-1948 - Annexes\nVolume 8: L'Histoire de l'érotisme - Le surréalisme au jour le jour - Conférences 1951-1953 - La Souveraineté - Annexes\nVolume 9: Lascaux, ou La naissance de l’art - Manet - La littérature et le mal - Annexes\nVolume 10: L’érotisme - Le procès de Gilles de Rais - Les larmes d’Eros\nVolume 11: Articles I, 1944–1949\nVolume 12: Articles II, 1950–1961\n\nGeorges Bataille: Une liberté souveraine: Textes et entretiens, 2004 (articles, book reviews and interviews not included in Oeuvres Complètes, Michel Surya Ed.)\nWorks published in French\nHistoire de l'oeil, 1928 (Story of the Eye) (under pseudonym of Lord Auch)\nL'Anus solaire, 1931 (The Solar Anus)\nThe Notion of Expenditure, 1933\nL'Amitié, 1940 (Friendship) (under pseudonym of Dianus; early version of Part One of Le Coupable)\nMadame Edwarda, 1941 (under pseudonym of Pierre Angélique, fictitiously dated 1937; 2nd Edition: 1945; 3rd Edition: 1956 published with preface in Bataille's name)\nLe Petit, 1943 (under pseudonym of Louis Trente; fictitious publication date of 1934)\nL'expérience intérieure, 1943 (Inner Experience)\nL'Archangélique, 1944 (The Archangelical)\nLe Coupable, 1944 (Guilty)\nSur Nietzsche, 1945 (On Nietzsche)\nDirty, 1945\nL'Orestie, 1945 (The Oresteia)\nHistoire de rats, 1947 (A Story of Rats)\nL'Alleluiah, 1947 (Alleluia: The Catechism of Dianus)\nMéthode de méditation, 1947 (Method of Meditation)\nLa Haine de la Poésie, 1947 (The Hatred of Poetry; reissued in 1962 as The Impossible)\nLa Scissiparité, 1949 (The Scission)\nLa Part maudite, 1949 (The Accursed Share)\nL'Abbé C, 1950\nL'expérience intérieure, 1954 (second edition of Inner Experience, followed by Method of Meditation and Post-scriptum 1953)\nL'Être indifférencié n'est rien, 1954 (Undifferentiated Being is Nothing)\nLascaux, ou la Naissance de l'Art, 1955\nManet, 1955\nLe paradoxe de l'érotisme, Nouvelle Revue Française, n°29, 1er Mai 1955.\nLe Bleu du ciel, 1957 (written 1935–36) (Blue of Noon)\nLa littérature et le Mal, 1957 (Literature and Evil)\nL'Erotisme, 1957 (Erotism)\nLe Coupable, 1961 (Guilty, second, revised edition, followed by Alleluia: The Catechism of Dianus)\nLes larmes d'Éros, 1961 (The Tears of Eros)\nL'Impossible : Histoire de rats suivi de Dianus et de L'Orestie, 1962 (The Impossible)\nPosthumous works\nMa Mère, 1966 (My Mother)\nLe Mort, 1967 (The Dead Man)\nThéorie de la Religion, 1973 (Theory of Religion)\nTranslated works\nLascaux; or, the Birth of Art, the Prehistoric Paintings, Austryn Wainhouse, 1955, Lausanne: Skira.\nManet, Austryn Wainhouse and James Emmons, 1955, Editions d'Art Albert Skira.\nLiterature and Evil, Alastair Hamilton, 1973, Calder & Boyars Ltd.\nVisions of Excess: Selected Writings 1927-1939, Allan Stoekl, Carl R. Lovitt, and Donald M. Leslie, Jr., 1985, University of Minnesota Press.\nErotism: Death and Sensuality, Mary Dalwood, 1986, City Lights Books.\nStory of the Eye, Joachim Neugroschel, 1987, City Lights Books.\nThe Accursed Share: An Essay On General Economy. Volume I: Consumption, Robert Hurley, 1988, Zone Books.\nThe College of Sociology, 1937–39 (Bataille et al.), Betsy Wing, 1988, University of Minnesota Press.\nGuilty, Bruce Boone, 1988, The Lapis Press.\nInner Experience, Leslie Anne Boldt, 1988, State University of New York.\nMy Mother, Madame Edwarda, The Dead Man, Austryn Wainhouse, with essays by Yukio Mishima and Ken Hollings, 1989, Marion Boyars Publishers.\nThe Tears of Eros, Peter Connor, 1989, City Lights Books.\nTheory of Religion, Robert Hurley, 1989, Zone Books.\nThe Accursed Share: Volumes II and III, Robert Hurley, 1991, Zone Books.\nThe Impossible, Robert Hurley, 1991, City Lights Books.\nThe Trial of Gilles de Rais, Richard Robinson, 1991, Amok Press.\nOn Nietzsche, Bruce Boone, 1992, Paragon House.\nThe Absence of Myth: Writings on Surrealism, Michael Richardson, 1994, Verso.\nEncyclopaedia Acephalica (Bataille et al.), Iain White et al., 1995, Atlas Press.\nL'Abbé C, Philip A Facey, 2001, Marion Boyars Publishers.\nBlue of Noon, Harry Mathews, 2002, Marion Boyars Publishers.\nThe Unfinished System of Nonknowledge, Stuart Kendall and Michelle Kendall, 2004, University of Minnesota Press.\nThe Cradle of Humanity: Prehistoric Art and Culture, Stuart Kendall, Michelle Kendall, 2009, Zone Books.\nDivine Filth: Lost Scatology and Erotica, Mark Spitzer, 2009, Solar Books.\nW.C., (fragmented) novel by Georges Bataille and Antonio Contiero; edited by Transeuropa Edizioni (Massa, 9/2011), ISBN 978-88-7580-150-2; accompanied with music by Alessandra Celletti and Jaan Patterson (Bubutz Records).\nCollected Poems of Georges Bataille, Mark Spitzer, 1998, 1999, Dufour Editions. Hardback is titled Collected Poetry of Georges Bataille, 1998.\n\n\n== References ==\n\n\n== Further reading ==\nAdes, Dawn, and Simon Baker, Undercover Surrealism: Georges Bataille and Documents. (Cambridge: The MIT Press, 2006).\nBarthes, Roland. \"The Metaphor of the Eye\". In Critical Essays. Trans. Richard Howard. (Evanston, IL: Northwestern University Press, 1972). 239-248.\nBlanchot, Maurice. \"The Limit-Experience\". In The Infinite Conversation. Trans. Susan Hanson. (Minneapolis: University of Minnesota Press, 1993). 202-229.\nBlanchot, Maurice. The Unavowable Community. Trans. Pierre Joris. (Barrytown, NY: Station Hill Press, 1988).\nDerrida, Jacques, \"From Restricted to General Economy: A Hegelianism without Reserve,\" in Writing and Difference (London: Routledge, 1978).\nFoucault, Michel. \"A Preface to Transgression\". Trans. Donald F. Bouchard and Sherry Simon. In Aesthetics, Method and Epistemology: Essential Works of Foucault, 1954-1984. Ed. James D. Faubion (New York: New Press, 1998). 103-122.\nHussey, Andrew, Inner Scar: The Mysticism of Georges Bataille (Amsterdam: Rudopi, 2000).\nKendall, Stuart, Georges Bataille (London: Reaktion Books, Critical Lives, 2007).\nKrauss, Rosalind, No More Play in The Originality of the Avant-Garde and Other Modernist Myths (MIT Press, 1985).\nLand, Nick. The Thirst for Annihilation: Georges Bataille and Virulent Nihilism (London: Routledge, 1992)\nLawtoo, Nidesh, The Phantom of the Ego: Modernism and the Mimetic Unconscious (East Lansing: Michigan State University Press, 2013).\nNancy, Jean-Luc, The Inoperative Community (Minneapolis & Oxford: University of Minnesota Press, 1991).\nRoudinesco, Élisabeth, Jacques Lacan & Co.: a history of psychoanalysis in France, 1925-1985, 1990, Chicago: Chicago University Press.\nRoudinesco, Élisabeth, Jacques Lacan, Outline of a Life, History of a System of Thought, 1999, New York, Columbia University Press.\nRoudinesco, Élisabeth, Our Dark Side, A History of Perversion, Cambridge, Polity Press, 2009.\nSkorin-Kapov, Jadranka, The Aesthetics of Desire and Surprise: Phenomenology and Speculation (Lexington Books, 2015).\nSollers, Philippe, Writing and the Experience of Limits (Columbia University Press, 1982).\nSontag, Susan. \"The Pornographic Imagination.\" Styles of Radical Will. (Picador, 1967).\nSurya, Michel, Georges Bataille: an intellectual biography, trans. by Krzysztof Fijalkowski and Michael Richardson (London: Verso, 2002).\nVanderwees, Chris, \"Complicating Eroticism and the Male Gaze: Feminism and Georges Bataille's Story of the Eye.\" Studies in 20th & 21st Century Literature. 38.1 (2014): 1–19.\n\n\n== External links ==\nWorks by or about Georges Bataille in libraries (WorldCat catalog)\n\"Architecture\" - short essay by Georges Bataille\nPetri Liukkonen. \"Georges Bataille\". Books and Writers (kirjasto.sci.fi). Archived from the original on 4 July 2013.\nPopsubculture, Bio Project, George Bataille biography\nSOFT TARGETS Journal, Bataille's Apocalypse\nUniversity of Wolverhampton, Extract from Bataille's Eroticism\nIMDb entry for Ma mère\nHayward Gallery's 'Undercover Surrealism' site\nNew Statesman, Bataille's exhibition\nJanus Head: Journal of Interdisciplinary Studies in Literature, Continental Philosophy, Phenomenological Psychology, and the Arts. Geoffrey Roche, \"Bataille on Sade\"\nRevue Silène, From Heterogeneity to the Sacred\nCentre National de la Recherche Scientifique, Jérome Bourgon's Bataille essay\nOut of line theatre's devised theatre creation based upon Bataille's \"The Dead Man\"\n\"Toward General Economy,\" in the journal Scapegoat, issue 05, 2013", "ns": 0, "pageid": 209215, "title": "Georges Bataille"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}