{"batchcomplete": "", "query": {"normalized": [{"to": "Georg Anton Friedrich Ast", "from": "Georg_Anton_Friedrich_Ast"}], "pages": {"1621359": {"extract": "Georg Anton Friedrich Ast (29 December 1778 – 31 October 1841) was a German philosopher and philologist.\n\n\n== Life ==\nHe was born at Gotha. Educated there and at the University of Jena, he became a privatdozent at Jena in 1802. In 1805 he became professor of classical literature in the University of Landshut, where he remained until 1826, when it was transferred to Munich. He lived there until his death in 1841. \nIn recognition of his work, the Bavarian Academy of Sciences made him a member and aulic councillor. He is known principally for his work during the last twenty-five years of his life on the dialogues of Plato. His Plato's Leben and Schriften (1816)—which originated in the Introductions of Friedrich Schleiermacher and the historical scepticism of Niebuhr and Wolf—was the first of those critical inquiries into the life and works of Plato.\nDistrusting tradition, he took a few of the finest dialogues as his standard, and from internal evidence denounced as spurious not only those generally admitted to be so (Epinomis, Minos, Theages, Rivales, Clitophon, Hipparchus, Eryxias, Letters and Definitions), but also the Meno, Euthydemus, Charmides, Lysis, Laches, First and Second Alcibiades, Hippias Major and Minor, Ion, Euthyphro, Apology, Crito, and even (against Aristotle's explicit assertion) The Laws. The genuine dialogues he divides into three series:\nthe earliest, marked chiefly by the poetical and dramatic element, i.e. Protagoras, Phaedrus, Gorgias, Phaedo;\nthe second, marked by dialectic subtlety, i.e. Theaetetus, Sophist, Statesman, Parmenides, Cratylus; and\nthe third group, combining both qualities harmoniously, i.e., the Philebus, Symposium, Republic, Timaeus, Critias.\nThe work was followed by a complete edition of Plato's works (2 vols., 1819–1832) with a Latin translation and commentary. His last work was the Lexicon Platonicum (3 vols., 1834–1839), which is both valuable and comprehensive. In his works on aesthetics he combined the views of Schelling with those of Winckelmann, Lessing, Kant, Herder, Schiller and others. His histories of philosophy are marked more by critical scholarship than by originality of thought, though they are interesting as asserting the now familiar principle that the history of philosophy is not the history of opinions, but of reason as a whole; he was among the first to attempt to formulate a principle of the development of thought. \nBeside his works on Plato, he wrote, on aesthetics, System der Kunstlehre (1805) and Grundriß der Aesthetik (1807); on the history of philosophy, Grundlinien der Philosophie (1807, republished 1809, but soon forgotten), Grundriß einer Geschichte der Philosophie (1807 and 1825), and Hauptmomente der Geschichte der Philosophie (1829); in philology, Grundlinien der Philologie (1808), and Grundlinien der Grammatik, Hermeneutik und Kritik (1808).\n\n\n== See also ==\nHermeneutics\nHermeneutic circle\n\n\n== References ==\n\nAttribution\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Ast, Georg Anton Friedrich\". Encyclopædia Britannica. 2 (11th ed.). Cambridge University Press. \n\n\n== External links ==\nAst's Lexicon Platonicum from Google Books: vol. 1, vol. 2, vol. 3\nHermeneutics (Stanford Encyclopedia of Philosophy)", "ns": 0, "pageid": 1621359, "title": "Georg Anton Friedrich Ast"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}