{"batchcomplete": "", "query": {"normalized": [{"to": "George Santayana", "from": "George_Santayana"}], "pages": {"182082": {"extract": "Jorge Agustín Nicolás Ruiz de Santayana y Borrás, known in English as George Santayana (/ˌsæntiˈænə/ or /-ˈɑːnə/; December 16, 1863 – September 26, 1952), was a philosopher, essayist, poet, and novelist. Originally from Spain, Santayana was raised and educated in the United States from the age of eight and identified himself as an American, although he always kept a valid Spanish passport. He wrote in English and is generally considered an American man of letters. At the age of forty-eight, Santayana left his position at Harvard and returned to Europe permanently, never to return to the United States. His last wish was to be buried in the Spanish pantheon in Rome.\nSantayana is popularly known for aphorisms, such as \"Those who cannot remember the past are condemned to repeat it\", \"Only the dead have seen the end of war\", and the definition of beauty as \"pleasure objectified\". Although an atheist, he always treasured the Spanish Catholic values, practices, and worldview in which he was raised. Santayana was a broad-ranging cultural critic spanning many disciplines.\n\n\n== Early life ==\nBorn Jorge Agustín Nicolás Ruiz de Santayana y Borrás on December 16, 1863, in Madrid, he spent his early childhood in Ávila, Spain. His mother, Josefina Borrás, was the daughter of a Spanish official in the Philippines, and Jorge was the only child of her second marriage. She was the widow of George Sturgis, a Boston merchant with whom she had five children, two of whom died in infancy. She lived in Boston for a few years following her husband's death in 1857, but in 1861 moved with her three surviving children to live in Madrid. There she encountered Agustín Ruiz de Santayana, an old friend from her years in the Philippines. They married in 1862. A colonial civil servant, Ruiz de Santayana was also a painter and minor intellectual.\nThe family lived in Madrid and Ávila until 1869, when Josefina Borrás de Santayana returned to Boston with her three Sturgis children, as she had promised her first husband to raise the children in the United States. She left the six-year-old Jorge with his father in Spain. Jorge and his father followed her in 1872, but his father, finding neither Boston nor his wife's attitude to his liking, soon returned alone to Ávila. He remained there the rest of his life. Jorge did not see him again until he entered Harvard College and took his summer vacations in Spain. Sometime during this period, Jorge's first name was anglicized as George, the English equivalent.\n\n\n== Education ==\n\nSantayana attended Boston Latin School and Harvard College, where he studied under the philosophers William James and Josiah Royce and was involved in eleven clubs as an alternative to athletics. He was founder and president of the Philosophical Club, a member of the literary society known as the O.K., an editor and cartoonist for The Harvard Lampoon, and co-founder of the literary journal The Harvard Monthly. In December, 1885, he played the role of Lady Elfrida in the Hasty Pudding theatrical Robin Hood, followed by the production Papillonetta in the spring of his senior year.\nAfter graduating Phi Beta Kappa from Harvard in 1886, Santayana studied for two years in Berlin. He then returned to Harvard to write his dissertation on Hermann Lotze and teach philosophy, becoming part of the Golden Age of the Harvard philosophy department. Some of his Harvard students became famous in their own right, including T. S. Eliot, Robert Frost, Gertrude Stein, Horace Kallen, Walter Lippmann, and W. E. B. Du Bois. Wallace Stevens was not among his students but became a friend. From 1896 to 1897, Santayana studied at King's College, Cambridge.\n\n\n== Later life ==\nIn 1912, Santayana resigned his position at Harvard to spend the rest of his life in Europe. He had saved money and been aided by a legacy from his mother. After some years in Ávila, Paris and Oxford, after 1920, he began to winter in Rome, eventually living there year-round until his death. During his forty years in Europe, he wrote nineteen books and declined several prestigious academic positions. Many of his visitors and correspondents were Americans, including his assistant and eventual literary executor, Daniel Cory. In later life, Santayana was financially comfortable, in part because his 1935 novel, The Last Puritan, had become an unexpected best-seller. In turn, he financially assisted a number of writers, including Bertrand Russell, with whom he was in fundamental disagreement, philosophically and politically.\nSantayana never married. His romantic life, if any, is not well understood. Some evidence, including a comment Santayana made late in life comparing himself to A. E. Housman, and his friendships with people who were openly homosexual and bisexual, has led scholars to speculate that Santayana was perhaps homosexual or bisexual himself, but it remains unclear whether he had any actual heterosexual or homosexual relationships.\n\n\n== Philosophical work and publications ==\n\nSantayana's main philosophical work consists of The Sense of Beauty (1896), his first book-length monograph and perhaps the first major work on aesthetics written in the United States; The Life of Reason five volumes, 1905–6, the high point of his Harvard career; Scepticism and Animal Faith (1923); and The Realms of Being (4 vols., 1927–40). Although Santayana was not a pragmatist in the mold of William James, Charles Sanders Peirce, Josiah Royce, or John Dewey, The Life of Reason arguably is the first extended treatment of pragmatism written.\nLike many of the classical pragmatists, and because he was well-versed in evolutionary theory, Santayana was committed to metaphysical naturalism. He believed that human cognition, cultural practices, and social institutions have evolved so as to harmonize with the conditions present in their environment. Their value may then be adjudged by the extent to which they facilitate human happiness. The alternate title to The Life of Reason, \"the Phases of Human Progress,\" is indicative of this metaphysical stance.\nSantayana was an early adherent of epiphenomenalism, but also admired the classical materialism of Democritus and Lucretius (of the three authors on whom he wrote in Three Philosophical Poets, Santayana speaks most favorably of Lucretius). He held Spinoza's writings in high regard, calling him his \"master and model.\"\nAlthough an atheist, he held a fairly benign view of religion, in contrast to Bertrand Russell who held that religion was harmful. Santayana's views on religion are outlined in his books Reason in Religion, The Idea of Christ in the Gospels, and Interpretations of Poetry and Religion. Santayana described himself as an \"aesthetic Catholic.\" He spent the last decade of his life at the Convent of the Blue Nuns of the Little Company of Mary on the Celian Hill at 6 Via Santo Stefano Rotondo in Rome, where he was cared for by the Irish sisters.\n\n\n== Man of letters ==\n\nSantayana's one novel, The Last Puritan, is a bildungsroman, centering on the personal growth of its protagonist, Oliver Alden. His Persons and Places is an autobiography. These works also contain many of his sharper opinions and bons mots. He wrote books and essays on a wide range of subjects, including philosophy of a less technical sort, literary criticism, the history of ideas, politics, human nature, morals, the influence of religion on culture and social psychology, all with considerable wit and humor.\nWhile his writings on technical philosophy can be difficult, his other writings are far more accessible and pithy. He wrote poems and a few plays, and left an ample correspondence, much of it published only since 2000.\nLike Alexis de Tocqueville, Santayana observed American culture and character from a foreigner's point of view. Like William James, his friend and mentor, he wrote philosophy in a literary way. Ezra Pound includes Santayana among his many cultural references in The Cantos, notably in \"Canto LXXXI\" and \"Canto XCV\". Santayana is usually considered an American writer, although he declined to become an American citizen, resided in fascist Italy for decades, and said that he was most comfortable, intellectually and aesthetically, at Oxford University.\n\n\n== Awards ==\nRoyal Society of Literature Benson Medal, 1925.\nColumbia University Butler Gold Medal, 1945.\nHonorary degree from the University of Wisconsin, 1911.\n\n\n== Legacy ==\n\nSantayana is remembered in large part for his aphorisms, many of which have been so frequently used as to have become clichéd. His philosophy has not fared quite as well. He is regarded by most as an excellent prose stylist, and Professor John Lachs (who is sympathetic with much of Santayana's philosophy) writes, in On Santayana, that his eloquence may ironically be the very cause of this neglect.\nSantayana influenced those around him, including Bertrand Russell, who Santayana single-handedly steered away from the ethics of G. E. Moore. He also influenced many prominent people such as Harvard students T. S. Eliot, Robert Frost, Gertrude Stein, Horace Kallen, Walter Lippmann, W. E. B. Du Bois, Conrad Aiken, Van Wyck Brooks, and Supreme Court Justice Felix Frankfurter, as well as Max Eastman and the poet Wallace Stevens. Stevens was especially influenced by Santayana's aesthetics and became a friend even though Stevens did not take courses taught by Santayana.\nSantayana is quoted by the Canadian-American sociologist Erving Goffman as a central influence in the thesis of his famous book The Presentation of Self in Everyday Life (1959). Religious historian Jerome A. Stone credits Santayana with contributing to the early thinking in the development of religious naturalism. English mathematician and philosopher Alfred North Whitehead quotes Santayana extensively in his magnum opus Process and Reality.\nChuck Jones used Santayana's description of fanaticism as \"redoubling your effort after you've forgotten your aim\" to describe his cartoons starring Wile E. Coyote and Road Runner.\n\n\n== In popular culture ==\nSantayana is referenced in the lyrics to singer Billy Joel's 1989 music single, \"We Didn't Start the Fire\".\n\n\n== Bibliography ==\n\n1894. Sonnets And Other Verses.\n1896. The Sense of Beauty: Being the Outline of Aesthetic Theory.\n1899. Lucifer: A Theological Tragedy.\n1900. Interpretations of Poetry and Religion.\n1901. A Hermit of Carmel And Other Poems.\n1905–1906. The Life of Reason: or the Phases of Human Progress, 5 vols.\n1910. Three Philosophical Poets: Lucretius, Dante, and Goethe.\n1913. Winds of Doctrine: Studies in Contemporary Opinion.\n1915. Egotism in German Philosophy.\n1920. Character and Opinion in the United States: With Reminiscences of William James and Josiah Royce and Academic Life in America.\n1920. Little Essays, Drawn From the Writings of George Santayana. by Logan Pearsall Smith, With the Collaboration of the Author.\n1922. Soliloquies in England and Later Soliloquies.\n1922. Poems.\n1923. Scepticism and Animal Faith: Introduction to a System of Philosophy.\n1926. Dialogues in Limbo\n1927. Platonism and the Spiritual Life.\n1927–40. The Realms of Being, 4 vols.\n1931. The Genteel Tradition at Bay.\n1933. Some Turns of Thought in Modern Philosophy: Five Essays\n1935. The Last Puritan: A Memoir in the Form of a Novel.\n1936. Obiter Scripta: Lectures, Essays and Reviews. Justus Buchler and Benjamin Schwartz, eds.\n1944. Persons and Places.\n1945. The Middle Span.\n1946. The Idea of Christ in the Gospels; or, God in Man: A Critical Essay.\n1948. Dialogues in Limbo, With Three New Dialogues.\n1951. Dominations and Powers: Reflections on Liberty, Society, and Government.\n1953. My Host The World\nPosthumous edited/selected works\n1955. The Letters of George Santayana. Daniel Cory, ed. Charles Scribner's Sons. New York. (296 letters)\n1956. Essays in Literary Criticism of George Santayana. Irving Singer, ed.\n1957. The Idler and His Works, and Other Essays. Daniel Cory, ed.\n1967. The Genteel Tradition: Nine Essays by George Santayana. Douglas L. Wilson, ed.\n1967. George Santayana's America: Essays on Literature and Culture. James Ballowe, ed.\n1967. Animal Faith and Spiritual Life: Previously Unpublished and Uncollected Writings by George Santayana With Critical Essays on His Thought. John Lachs, ed.\n1968. Santayana on America: Essays, Notes, and Letters on American Life, Literature, and Philosophy. Richard Colton Lyon, ed.\n1968. Selected Critical Writings of George Santayana, 2 vols. Norman Henfrey, ed.\n1969. Physical Order and Moral Liberty: Previously Unpublished Essays of George Santayana. John and Shirley Lachs, eds.\n1979. The Complete Poems of George Santayana: A Critical Edition. Edited, with an introduction, by W. G. Holzberger. Bucknell University Press.\n1995. The Birth of Reason and Other Essays. Daniel Cory, ed., with an Introduction by Herman J. Saatkamp, Jr. Columbia Univ. Press.\n2009. The Essential Santayana. Selected Writings Edited by the Santayana Edition, Compiled and with an introduction by Martin A. Coleman. Bloomington: Indiana University Press.\nThe Works of George Santayana\nUnmodernized, critical editions of George Santayana’s published and unpublished writing. The Works is edited by the Santayana Edition and published by The MIT Press.\n1986. Persons and Places. Santayana's autobiography, incorporating Persons and Places, 1944; The Middle Span, 1945; and My Host the World, 1953.\n1988 (1896). The Sense of Beauty: Being the Outline of Aesthetic Theory.\n1990 (1900). Interpretations of Poetry and Religion.\n1994 (1935). The Last Puritan: A Memoir in the Form of a Novel.\nThe Letters of George Santayana. Containing over 3,000 of his letters, many discovered posthumously, to more than 350 recipients.\n2001. Book One, 1868–1909.\n2001. Book Two, 1910–1920.\n2002. Book Three, 1921–1927.\n2003. Book Four, 1928–1932.\n2003. Book Five, 1933–1936.\n2004. Book Six, 1937–1940.\n2006. Book Seven, 1941–1947.\n2008. Book Eight, 1948–1952.\n\n2011. George Santayana's Marginalia: A Critical Selection, Books 1 and 2. Compiled by John O. McCormick and edited by Kristine W. Frost.\nThe Life of Reason in five books.\n2011 (1905). Reason in Common Sense.\n2013 (1905). Reason in Society.\n2014 (1905). Reason in Religion.\n\n\n== See also ==\n\nAmerican philosophy\nList of American philosophers\nThe Harvard Monthly\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nWorks by George Santayana at Project Gutenberg\nWorks by or about George Santayana at Internet Archive\nWorks by George Santayana at LibriVox (public domain audiobooks) \nSaatkamp, Herman. \"George Santayana\". Stanford Encyclopedia of Philosophy.  Includes a complete bibliography of the primary literature, and a fair selection of the secondary literature\nThe Internet Encyclopedia of Philosophy: George Santayana by Matthew C. Flamm\nThe Santayana Edition\nOverheard in Seville: Bulletin of the Santayana Society\n\"George Santayana: Catholic Atheist\" by Richard Butler in Spirituality Today, Vol. 38 (Winter 1986), p. 319\nGeorge Santayana at DMOZ\nGeorge Santayana at Find a Grave\nGeorge Santayana, Many Nations in One Empire (1934)", "ns": 0, "pageid": 182082, "title": "George Santayana"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}