{"batchcomplete": "", "query": {"normalized": [{"to": "Georg Henrik von Wright", "from": "Georg_Henrik_von_Wright"}], "pages": {"12250": {"extract": "Georg Henrik von Wright (Swedish: [ˈjeːɔrj ˈhɛnːrɪk fɔnˈvrɪkːt], 14 June 1916 – 16 June 2003) was a Finnish philosopher, who succeeded Ludwig Wittgenstein as professor at the University of Cambridge. He published in English, Finnish, German, and Swedish, having belonged to the Swedish-speaking minority of Finland. Von Wright was of both Finnish and 17th-century Scottish ancestry.\n\n\n== Work ==\nVon Wright's writings come under two broad categories. The first is analytic philosophy and philosophical logic in the Anglo-American vein. His 1951 books, An Essay in Modal Logic and Deontic Logic, were landmarks in the postwar rise of formal modal logic and its deontic version. He was an authority on Wittgenstein, editing his later works. He was the leading figure in the Finnish philosophy of his time, specializing in philosophical logic, philosophical analysis, philosophy of action, philosophy of language, philosophy of mind, and the close study of Charles Sanders Peirce.\nThe other vein in von Wright's writings is moralist and pessimist. During the last twenty years of his life, under the influence of Oswald Spengler, Jürgen Habermas and the Frankfurt School's reflections about modern Rationality, he wrote prolifically. His best known article from this period is entitled The Myth of Progress, and it questions whether our apparent material and technological progress can really be considered \"progress\".\nIn the last year of his life, among his other honorary degrees, he held an honorary degree at the University of Bergen.\n\n\n== Bibliography ==\n\nThe Logical Problem of Induction, PhD thesis, 31 May 1941\nDen logiska empirismen (Logical Empirism), in Swedish, 1945\nÜber Wahrscheinlichkeit (On Chance), in German, 1945\nAn Essay in Modal Logic, 1951\nA Treatise on Induction and Probability, 1951\nDeontic Logic, 1951\nTanke och förkunnelse (Thought and Preaching), in Swedish, 1955\nLogical Studies, 1957\nLogik, filosofi och språk (Logic, philosophy and language), in Swedish, 1957\nThe Varieties of Goodness, 1963. (1958-60 Gifford Lectures in the University of St. Andrews, online) He considered this his best and most personal work.\nNorm and Action, 1963 (1958-60 Gifford Lectures, St. Andrews, online)\nThe Logic of Preference, 1963\nEssay om naturen, människan och den vetenskaplig-tekniska revolutionen (Essay on Nature, Man and the Scientific-Technological Revolution), in Swedish, 1963\nAn Essay in Deontic Logic, 1968\nTime, Change and Contradiction, 1969\nTieteen filosofian kaksi perinnettä (The Two Traditions of the Philosophy of Science), in Finnish, 1970\nExplanation and Understanding, 1971\nCausality and Determinism, 1974\nHandlung, Norm und Intention (Action, Norm and Intention), in German, 1977\nHumanismen som livshållning (Humanism as an approach to Life), in Swedish, 1978\nFreedom and Determination, 1980\nWittgenstein, 1982\nPhilosophical Papers I-III, 1983–1984\nOf Human Freedom, 1984. (1984 Tanner Lectures at the University of Helsinki, online)\nFilosofisia tutkielmia (Philosophical Dissertations), in Finnish, 1985\nVetenskapen och förnuftet (Science and Reason), in Swedish, 1986\nMinervan Pöllö (The Owl of Minerva), in Finnish, 1991\nMyten om framsteget (The Myth of Progress), in Swedish, 1993\nThe Tree of Knowledge, 1993\nAtt förstå sin samtid (To Understand one's own Time), in Swedish, 1994\nSix Essays in Philosophical Logic, 1996\nViimeisistä ajoista. Ajatusleikki (On the End Times. A Thought Experiment.), in Finnish, 1997\nLogiikka ja humanismi (Logic and Humanism), in Finnish, 1998\nIn the Shadow of Descartes, 1998\nMitt liv som jag minns det (My Life as I Remember it), in Swedish, 2001\nVon Wright edited posthumous publications by Wittgenstein, which were published by Blackwell (unless otherwise stated):\n1961. Notebooks 1914-1916.\n1967. Zettel (Translated into English as Culture and Value).\n1969. On Certainty.\n1971. ProtoTractatus—An Early Version of Tractatus Logico- Philosophicus. Cornell University Press.\n1973. Letters to C.K. Ogden with Comments on the English Translation of the Tractatus Logico-Philosophicus.\n1974. Letters to Russell, Keynes and Moore.\n1978 (1956). Remarks on the Foundations of Mathematics.\n1980. Remarks on the Philosophy of Psychology. Vols 1,2.\n1980. Culture and Value (English translation of Zettel).\n1982. Last Writings on the Philosophy of Psychology, Vol. 1. Vol. 2, 1992.\nVon Wright also edited extracts from the diary of David Pinsent, also published by Blackwell:\n1990. A Portrait of Wittgenstein as a Young Man: From the Diary of David Hume Pinsent 1912-1914\", ISBN 978-0-63117-5117.\n\n\n== Notes ==\n\n\n== References ==\nObituary – The Guardian\nG.H. von Wright – Britannica.com\n\n\n== External links ==\nGeorg Henrik von Wright in 375 humanists. Faculty of Arts, University of Helsinki, 13 May 2015.", "ns": 0, "pageid": 12250, "title": "Georg Henrik von Wright"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}