{"batchcomplete": "", "query": {"normalized": [{"to": "Gerald Cohen", "from": "Gerald_Cohen"}], "pages": {"40980045": {"extract": "Gerald Allan \"Jerry\" Cohen, FBA (14 April 1941 – 5 August 2009) was a Marxist political philosopher who held the positions of Quain Professor of Jurisprudence, University College London and Chichele Professor of Social and Political Theory, All Souls College, Oxford. Born into a communist family in Montreal, Cohen was educated at McGill University, Canada (BA, philosophy and political science) and the University of Oxford (BPhil, philosophy) where he studied under Isaiah Berlin and Gilbert Ryle.\nCohen was assistant lecturer (1963–1964), lecturer (1964–1979) then reader (1979–1984) in the Department of Philosophy at University College London, before being appointed to the Chichele chair at Oxford in 1985. Several of his students, such as Alan Carter, Cécile Fabre, Will Kymlicka, John McMurtry, David Leopold, Michael Otsuka, Seana Shiffrin, Jonathan Wolff and Michael E. Rosen have gone on to be important moral and political philosophers in their own right.\nKnown as a proponent of Analytical Marxism and a founding member of the September Group, Cohen's 1978 work Karl Marx's Theory of History: A Defence defends an interpretation of Marx's historical materialism often referred to as 'technological determinism' by its critics. In Self-Ownership, Freedom, and Equality, Cohen offers an extensive moral argument in favour of socialism, contrasting his views with those of John Rawls and Robert Nozick, by articulating an extensive critique of the Lockean principle of self-ownership as well as the use of that principle to defend right – as well as left – libertarianism. In If You're an Egalitarian, How Come You're So Rich? (which covers the topic of his Gifford Lectures) Cohen addresses the question of what egalitarian political principles imply for the personal behaviour of those who subscribe to them.\nCohen was close friends with Marxist political philosopher Marshall Berman.\n\n\n== Works ==\nKarl Marx's Theory of History: A Defence (1978, 2000)\nHistory, Labour, and Freedom (1988)\nSelf-Ownership, Freedom, and Equality. Cambridge: Cambridge University Press. 1995. ISBN 978-0-5214-7174-9. OCLC 612482692. \nIf You're an Egalitarian, How Come You're So Rich? (2000)\nChapter in Dworkin and his Critics, with replies by Dworkin (2004)\nRescuing Justice and Equality (2008)\nWhy Not Socialism? (2009) [Trad. esp.: ¿Por qué no el socialismo?, Buenos Aires/Madrid, Katz editores, 2011, ISBN 978-84-92946-13-6]\nOn the Currency of Egalitarian Justice, and Other Essays in Political Philosophy (2011)\nFinding Oneself in the Other (2012)\nLectures on the History of Moral and Political Philosophy (2013)\n\n\n== See also ==\nList of people from Montreal\nLuck egalitarianism\n\n\n== References ==\n\n\n== Further reading ==\nThe Egalitarian Conscience: Essays in Honour of G. A. Cohen (2006); edited by Christine Sypnowich\nTomey, Simon (2012), \"An interview with Jerry Cohen.\", in Browning, Gary; Dimova-Cookson, Maria; Prokhovnik, Raia, Dialogues with contemporary political theorists, Houndsmill, Basingstoke, Hampshire New York: Palgrave Macmillan, pp. 74–85, ISBN 9780230303058 \nVrousalis, Nicholas. The Political Philosophy of G.A. Cohen. Bloomsbury. ISBN 9781472532701. \nRobeyns, Ingrid (July 2015). \"On G.A. Cohen's \"On the currency of egalitarian justice\"\". Ethics. Chicago Journals via JSTOR. 125 (4): 1132–1135. doi:10.1086/680879. JSTOR 10.1086/680879. \n\n\n== External links ==\nSocialist Studies Special Edition on the Life and Work of G.A. Cohen\nImprints interview\nCohen's Tanner Lectures: \"Incentives, Inequality, and Community\"\nCohen interview at Philosophy Bites (mp3 audio)\nObituary to Gerald Cohen at The Third Estate\nObituary in The Monthly Review\nObituary in The Times\nObituary in The Guardian\nObituary in The Independent\nRemembering Jerry Cohen: A Tribute in Socialist Worker\nReview of Why Not Socialism? in The Oxonian Review\nJournal of Ethics volume for Jerry Cohen\nCohen Against Capitalism on Channel 4 on YouTube", "ns": 0, "pageid": 40980045, "title": "Gerald Cohen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}