{"batchcomplete": "", "query": {"normalized": [{"to": "Gerald Dworkin", "from": "Gerald_Dworkin"}], "pages": {"18631303": {"extract": "Gerald Dworkin (born 1937) is a professor of moral, political and legal philosophy. He is Distinguished Professor of Philosophy Emeritus at the University of California, Davis. In 2016–17 he is the Brady Distinguished Visiting Professor of Ethics and Civic Life at Northwestern University.\n\n\n== Early life and education ==\nDworkin earned his Ph.D. at the University of California, Berkeley in 1966.\n\n\n== Career ==\nDworkin has also taught at Harvard, MIT, and the University of Illinois, Chicago. He has been a visiting Fellow of All Souls College (Oxford), the Australian National University, and the Hastings Center. He was the Centennial Visiting Professor at the London School of Economics. In 2006, he was a Distinguished Visitor at the Chinese University of Hong Kong where he gave a series of lectures on paternalism.\nDworkin's main areas of research include the nature and justification of autonomy, paternalism in the criminal law, and the issue of which acts may legitimately be criminalized by the state. Most recently he has been working on the ethics of lying and deception. An article in the New York Times \"Are these 10 Lies Justified?\" which listed lies he thought permissible and asked for readers to respond if they disagreed received more than 10,000 responses.\nOne of Dworkin's books is a defense of physician-assisted suicide. In it, he argues that doctors who approve of withdrawing patients from life support at their request, or administering pain-relief medication that is foreseen to kill the patient, or who approve of terminal sedation, are inconsistent if they condemn physician-assisted suicide. This book has been published in Spanish- and Korean-language editions.\nHe has published an e-book, Philosophy: A Commonplace Book, which is a collection of aphorisms, jokes, witty comments on philosophy, and other interesting quotations.\n\n\n== References ==", "ns": 0, "pageid": 18631303, "title": "Gerald Dworkin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}