{"batchcomplete": "", "query": {"normalized": [{"to": "Gerhard Vollmer", "from": "Gerhard_Vollmer"}], "pages": {"8232660": {"extract": "Gerhard Vollmer (born 17 November 1943 in Speyer) is a German physicist and philosopher. He is perhaps best known for his development of an evolutionary theory of knowledge.\n\n\n== Life ==\nVollmer studied in Munich, Berlin, Hamburg and Freiburg. After finishing his degree in physics in 1968 he studied philosophy and linguistics in Freiburg. He worked as a trainee in Deutschen Elektronen-Synchrotron (DESY) in Hamburg. In Freiburg he attained a doctorate (1971) in theoretical physics. He stayed here after completing a year's stint as a research assistant in Montreal in 1975. In 1974, Vollmer attained an additional doctorate in philosophy.\nFrom 1975 Vollmer taught at the University of Hanover. From 1981 he lectured on the Philosophy of Biology at the University of Giessen. From 1991 he has taught philosophy at the TU Braunschweig. He holds lectures and classes in logic, epistemology and philosophy of science, natural philosophy, and artificial intelligence. He has also worked on evolutionary ethics, which he says consists of attempts to add evolutionary points of view to philosophical ethics.\n\n\n== Honours and associations ==\nIn 1963 he was awarded the Magnus Schwerd Prize for outstanding achievements in mathematics at school.\nVollmer became a member in 1998 of the Leopoldina Academy of Sciences Halle. He is a member of Giordano Bruno Foundation (a society dedicated to a sort of evolutionary humanism, weblink below) and (in 2001) was elected to the learned society, Braunschweig Sciences Society (Braunschweigische Wissenschaftliche Gesellschaft). On his 60th birthday in 2003 a Festschrift was produced in his honour called \"Cold-blooded: Philosophy from a rational standpoint\" (\"Kaltblütig. Philosophie von einem rationalen Standpunkt\" edited by Wolfgang Buschlinger and Christoph Lütge, published by Hirzel Verlag, Stuttgart).\nIn 2004 he received the Eduard Rhein Foundation Cultural Prize for having laid down the “foundation of an evolutionary theory of knowledge and for his outstanding achievement in bridging natural sciences and the social and humanistic disciplines”.\nHe is one of the editors of the periodical Aufklärung und Kritik. He is a member of the Science Advisory Committee of the Gesellschaft zur wissenschaftlichen Untersuchung von Parawissenschaften (GWUP), a German-speaking organisation supporting scientific skepticism. Vollmer is also a member of the Brights movement.\n\n\n== Publications ==\nEvolutionäre Erkenntnistheorie (Evolutionary epistemology) (1975, 8. Aufl. 2002)\nWas können wir wissen? (What can we know?) (2 Bde. 2. Aufl. 1988)\nWissenschaftstheorie im Einsatz (Philosophy of Science in practice) (1993)\nAuf der Suche nach der Ordnung (In search of order) (1995)\nBiophilosophie (Philosophy of Biology) (1995)\nWieso können wir die Welt erkennen? (How can we grasp the nature of the world?) (2002)\nThere is a chapter by Vollmer in English in\nBartley, W W. and Radnitzky, Gerard (eds) Evolutionary epistemology, rationality and the sociology of knowledge. La Salle, IL : Open Court, 1987. ISBN 0-8126-9038-9  ; ISBN 0-8126-9039-7 (pbk)\nHösle, Vittorio and Illies, Christian (eds) Darwinism and philosophy University of Notre Dame Press, 2005. ISBN 0-268-03072-3 (hbk) ; ISBN 0-268-03073-1 (pbk) (Chapter 13. How Is It That We Can Know This World? New Arguments in Evolutionary Epistemology, by G Vollmer)\n\n\n== References ==\n\n\n== External links ==\nGerhard Vollmer at TU Braunschweig", "ns": 0, "pageid": 8232660, "title": "Gerhard Vollmer"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}