{"batchcomplete": "", "query": {"normalized": [{"to": "Gianfranco Sanguinetti", "from": "Gianfranco_Sanguinetti"}], "pages": {"3687242": {"extract": "Gianfranco Sanguinetti (born July 16, 1948, Pully, Switzerland), was a writer and member of the Situationist International (SI), a political art movement. He is Teresa Mattei's son.\n\n\n== Biography ==\nSanguinetti was deported from France in 1971 and settled in Italy.\nBy 1972, Sanguinetti and Guy Debord were the only two remaining members of the SI. Together they wrote \"The Veritable Split In The International\" a book detailing the rise and fall of the SI.\nAgain working with Debord, in August 1975, Sanguinetti wrote a pamphlet titled Rapporto veridico sulle ultima opportunita di salvare il capitalismo in Italia (Eng: The Real Report on the Last Chance to Save Capitalism in Italy), which (inspired by Bruno Bauer) purported to be the cynical writing of \"Censor\", a powerful industrialist. The pamphlet was to show how the ruling class of Italy supported the Piazza Fontana bombing and other covert, false flag mass slaughter, for the higher goal of defending the capitalist status quo from the communist claims. The pamphlet was mailed to 520 of Italy's most powerful individuals. It was received as genuine, and powerful politicians, industrialists and journalist praised its content and guessed on the identity of its high-profile author. After reprinting the tract into a small book, Sanguinetti revealed himself to be the true author. Scandal raised after the revelation, as it successfully exposed the truth and hypocrisy on the mass slaughters, and under pressure from Italian authorities, Sanguinetti left Italy in February 1976, and was denied entry to France.\n\n\n== Published works ==\nThe Real Report on the Last Chance to Save Capitalism in Italy (1975)\nOn Terrorism and the State (1979)\nRemedy to Everything (1980)\n\n\n== Notes and references ==\n\n\n== Sources ==\nÉditions Champ Libre, Correspondance, volume 2, éditions Champ Libre, 1981\nGuy Debord, Correspondance, volumes 4 et 5, Fayard\nChristophe Bourseiller, Histoire générale de l'ultra-gauche, Denoël, ISBN 2207251632\n\n\n== External links ==\nGianfranco Sanguinetti: Texts in translation by Not Bored!\n(French) Brief story of the Italian section of the International situationist by Miguel Amorós", "ns": 0, "pageid": 3687242, "title": "Gianfranco Sanguinetti"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}