{"batchcomplete": "", "query": {"normalized": [{"to": "Giannina Braschi", "from": "Giannina_Braschi"}], "pages": {"9550804": {"extract": "Giannina Braschi (born February 5, 1953) is a Puerto Rican writer. She is credited with writing the first Spanglish novel Yo-Yo Boing! (1998), the post-modern poetry trilogy Empire of Dreams (Yale, 1994) and the philosophical fiction United States of Banana (AmazonCrossing, 2011), which chronicles the Latin American immigrants' experiences in the United States. \"For decades, Dominican and Puerto Rican authors have carried out a linguistic revolution\", noted The Boston Globe, \"and Giannina Braschi, especially in her novel YO-YO BOING!, testify to it\". She is considered an influential and revolutionary voice in contemporary Latin American literature. Her work has been described as a \"synergetic fusion that marks in a determinant fashion the lived experiences of U.S. Hispanics.\" Written in English, Spanglish, and Spanish, Braschi's work seeks to capture the cultural experience of the 50 million Hispanics in the United States and also seeks to explore the three political options of Puerto Rico: Nation, Colony or Statehood. On the subject of the Island's lack of sovereignty, Braschi stated, \"Liberty is not an option — it is a human right.\"\n\n\n== Literary influences ==\nIn the 1970s, Giannina Braschi was a student of literature in Madrid, Rome, Paris and London, before she settled in New York City. She obtained a PhD in Hispanic Literatures (State University of New York, Stony Brook, 1980) and has taught at Rutgers University, City University of New York, and Colgate University, where she served as a Distinguished Chair of Creative Writing (1997). She was a foreign correspondent for Grazie magazine (2001–2002).\nAs an adolescent in San Juan, Giannina Braschi ranked first place in the U.S. Tennis Association's national tournament in Puerto Rico, becoming the youngest female tennis player to win the Women's Division (1966) on the island. Her father Euripides (\"Pilo\") Braschi was also a tennis champion. She was also a founding member of the San Juan Children's Choir (\"Coro de niños de San Juan\") under music director Evy Lucio and a fashion model during her teen years.\nIn the 1980s, Braschi's early writings were scholarly in nature and focused on the titans of the Spanish Golden Age, as well as the vanguard poets of Latin America and Spain. She published a book on the Romantic poet Gustavo Adolfo Becquer and essays on Cervantes, Garcilaso, César Vallejo, Juan Ramon Jimenez and Federico García Lorca. She later became obsessed with the dramatic and philosophical works of French, German, Polish, Irish, and Russian authors. Though categorized as novels, her later mixed-genre works are experimental in style and format and celebratory of foreign influences. In the 50th anniversary edition of Evergreen Review, Braschi notes that she considers herself \"more French than Beckett, Picasso and Gertrude Stein\", and believes that she is the \"granddaughter of Alfred Jarry and Antonin Artaud, bastard child of Samuel Beckett and James Joyce, half-sister to Heiner Müller, kissing cousin of Tadeusz Kantor, and lover of Witkiewicz\".\n\n\n== Pivotal works ==\nIn the 1980s, Giannina Braschi burst onto the downtown Nuyorican poetry scene with spoken word performances of rhythmic intensity, humorous gusto, and anti-imperialistic politics. Her prose poems were written, recited, and published entirely in Spanish during this period. Her first collection of Spanish prose poetry, Asalto al tiempo, debuted in Barcelona in 1980 and was followed by La Comedia profana in 1985 and El imperio de los sueños in 1988. New York is the site and subject of much of her work. In a climatic episode of \"Pastoral or the Inquisition of Memories\", shepherds invade 5th Avenue on the Puerto Rican Day Parade and take over the City of New York; the shepherds ring the bells of St. Patrick's Cathedral and seize the observation deck of the Empire State Building.\nPoet and feminist scholar Alicia Ostriker has praised Braschi's Empire of Dreams, which features gender role-playing and transvestism, for having \"sheer erotic energy that defies definition and dogma.\" \"Those three award winning books were published together as the inaugural volume of the Yale Library of Literature in Translation.\" (Braschi 1998: Yo-Yo Boing!: 13)\nIn the 1990s, Giannina Braschi began writing dramatic dialogues in English, Spanish, and Spanglish. Her bilingual novel Yo-Yo Boing! (AmazonCrossing) is experimental in format and radical in its defiance of English-only laws, ethnic cleansing campaigns, and the corporate censorship.\nIn 2011, Giannina Braschi debuted \"United States of Banana,” her first work written entirely in English; it is a postmodern dramatic novel about the powers of the world shifting after September 11. The work is a poetic critique of 21st century capitalism and corporate censorship. In 2012, \"The Economist cited \"United States of Banana\" among the best sources for bold statements on the economy: \"Banks are the temples of America. This is a holy war. Our economy is our religion\". \"United States of Banana,” takes as a springboard the collapse of the World Trade Center, the event which displaced her from the Battery Park neighborhood that became known as the Ground Zero vicinity. Braschi writes about the death of the businessman, the end of democracy, and the delusion that all men are created equal. “Revolutionary in subject and form, \"United States of Banana\" is a beautifully written declaration of personal independence,” declared the late publisher Barney Rosset former owner of Grove Press of \"Evergreen Review.” The main characters are Zarathustra, Segismundo, Hamlet, Giannina and the Statue of Liberty; cameos are made by Latin American left wing leaders Fidel Castro, Raul Castro, Hugo Chavez, Cristina Kirchner, and Evo Morales.\n\n\n== Translations ==\nIn 2011, AmazonCrossing for World Literature in Translation released all of Braschi's works under three separate English titles: \"Empire of Dreams,\" \"Yo-Yo Boing!\" and \"United States of Banana\". Excerpts of Braschi's work have appeared in Swedish, French, Italian, and Serbian translations. Her collected poetry was translated into English by Tess O'Dwyer, who won the Columbia University Translation Center Award in 1991 for her rendition of \"Empire of Dreams\", which inaugurated the Yale Library of World Literature in Translation in 1994. Literary journals that have published Tess O'Dwyer's translations include: The Best of Review: Art and Literature of the Americas, Agni, Ars Interpres, Dickinson Review, Callaloo, Artful Dodge, Evergreen Review, Prose Poem, and Poet Magazine. A number of critics have commented on Braschi's texts, including Jean Franco, Harold Augenbraum, David William Foster, Julia Carroll, Kristian Van Haesendonck, Francine Masiello, Ilan Stavans, Julio Ortega, Lawrence La Fountain-Stokes, Madelena Gonzalez, Laura Loustau, Daniela Daniele, Arnaldo Cruz-Malavé, María Mercedes Carrión, Cristina Garrigos, Francisco José Ramos, Dennis Nurkse, Maritza Stanchich, and Doris Sommer.\n\n\n== Books ==\nEstados Unidos de Banana, AmazonCrossing, Madrid, 2015.\nUnited States of Banana, AmazonCrossing, Seattle, 2011.\nYo-Yo Boing!, AmazonCrossing, Seattle, 2011.\nBraschi's Empire of Dreams, AmazonCrossing, Seattle, 2011.\nEl imperio de los sueños, Editorial de la Universidad de Puerto Rico, Rio Piedras, 2000.\nYo-Yo Boing!, Latin American Literary Review, Pittsburgh, 1998.\nEmpire of Dreams (English translation by Tess O'Dwyer), Yale University Press, New Haven/London, 1994.\nEl imperio de los sueños, Anthropos Editorial del hombre, Barcelona, 1988.\nLibro de payasos y bufones, Grafica Uno, Giorgio Upiglio, Milan, 1987.\nLa comedia profana, Anthropos Editorial del hombre, Barcelona, 1985.\nAsalto al tiempo, Ambitos Literarios, Barcelona, 1980.\n\n\n== Scholarly works ==\nBreve tratado del poeta artista', Cuadernos Hispanoamericanos, No. 433-36, 1986.\nLa gravedad de la armonía en ‘Soledades galerías y otros pomas’ de Machado, Plural, 1983.\nLa poesía de Bécquer: El tiempo de los objetos o los espacios de la luz, Costa Amic, Mexico City, 1982.\nLa Metamorfosis del ingenio en la Égloga III de Garcilaso, Revista canadiense de estudios hispánicos, 1979.\nCinco personajes fugaces en el camino de Don Quijote, Cuadernos Hispanoamericanos, No. 328, 1977.\n\n\n== Awards/honors ==\nDanforth Scholarship\nEl Diario La Prensa's Outstanding Women of 1998\nFord Foundation Fellowship\nNational Endowment for the Arts Fellowship\nNew York Foundation for the Arts Fellowship\nPeter S. Reed Foundation/InterAmericas\nPEN American Center's Open Book Award\nInstituto de Cultura Puertorriqueña/grant\n\n\n== See also ==\n\nBraschi's Empire of Dreams\nList of Latin American writers\nList of Famous Puerto Ricans\nMulti-Ethnic Literature of the United States\nCorsican immigration to Puerto Rico\nYo-Yo Boing!\nPuerto Rican Day Parade\nPostmodern\nPastoral\nNuyorican Movement\nMcOndo\nSpanglish\nList of Puerto Rican writers\nPuerto Rican literature\n\n\n== References ==\n\n\n== Further reading ==\nLjudmila Mila Popovich (2010). \"Metafictions, Migrations, Metalives: Narrative Innovations and Migrant Women’s Aesthetics in Giannina Braschi and Etel Adnan.\" International Journal of the Humanities 9:10. pp. 117–128.\nDiane E. Marting (2010). \"New/Nueva York in Giannina Braschi's 'Poetic Egg': Fragile Identity, Postmodernism, and Globalization.\" The Global South 4:1.\nMarc Zimmerman (2011). \"Defending Their Own in the Cold: The Cultural Turns of U.S. Puerto Ricans\", University of Illinois, Chicago.\nGonzales, Madelena and Laplace-Claverie, Helene, “Minority Theatre on the Global Stage: Challenging Paradigms from the Margins,\" Cambridge Scholars, Newcastle, England, page xix and pages 255-264, 2012.\n\n\n== External links ==\n[4] NY1 Noticias TV program PURA POLITICA, Juan Manuel Benitez, interview in Spanish Giannina Braschi on the political options of Puerto Rico, October 2011.\n[5], The Evergreen Review, featuring reviews of \"United States of Banana\" by Cristina Garrigos and Daniela Daniele and videos of Giannina Braschi, November 2011.\n[6], WAPA TV, \"Escritora puertorriqueña que poco a poco se ha abierto paso en Estados Unidos\" by Normando Valentín, December 2011.\n\"Nuyorican Power,\" program on Nuyorican culture, featuring Giannina Braschi, Produced By: Evan B. Stone & Carrie Pyle for CURRENT TV.\nVideo on YouTube, television program in Spanish, \"Celebrities desde Nueva York,\" con Alfonso Diaz, featuring Giannina Braschi (on the collapse of the American Empire on September 11), November 2011.\n[7] \"Howdy Amiga Bienvenida,\" audio file of Giannina Braschi reading poems in Stockholm, Ars Interpress, 2006.\n[8], \"What to Read Now: Mixed-Genre Literature,\" World Literature Today, September–October 2012.\n\"Ground Zero,\" by Giannina Braschi, featured in Evergreen Review, edited by Barney Rosset.\n\"El futuro del idioma Español\", Oppenheimer Presenta #276, on YouTube(featuring Director of La Real Academia Espanola Victor, Garcia de la Concha, and author Giannina Braschi).\n\"A la Vieille Russie\" by Giannina Braschi.", "ns": 0, "pageid": 9550804, "title": "Giannina Braschi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}