{"batchcomplete": "", "query": {"normalized": [{"to": "Gilbert Simondon", "from": "Gilbert_Simondon"}], "pages": {"2492259": {"extract": "Gilbert Simondon (2 October 1924 – 7 February 1989) was a French philosopher best known for his theory of individuation, a major source of inspiration for Gilles Deleuze and Bernard Stiegler.\n\n\n== Career ==\nBorn in Saint-Étienne, Simondon was a student of philosopher of science Georges Canguilhem, philosopher Martial Guéroult, and phenomenologist Maurice Merleau-Ponty. He studied at the Ecole Normale Supérieure and the Sorbonne. He defended his doctoral dissertations in 1958. His main thesis, L'individuation à la lumière des notions de Forme et d'Information (Individuation in the light of the notions of Form and Information), was published in two parts, the first in 1964 under the title L'individu et sa génèse physico-biologique (Individuation and its physical-biological genesis) at the Presses Universitaires de France, while it is only in 1989 that Aubier published the second part, L'individuation psychique et collective (Psychic and collective individuation). While his main thesis, which laid the foundations of his thinking, was not widely read until it was commented upon by Gilles Deleuze and, more recently, Bruno Latour and Bernard Stiegler, his complementary thesis, Du mode d'existence des objets techniques (On the mode of existence of technical objects) was published by Aubier immediately after being completed (in 1958) and had an instant impact on a wide audience. It was only in 2005 that Jérôme Millon published a complete edition of the main thesis.\n\n\n== Individuation and technology ==\nIn L'individuation psychique et collective, Simondon developed a theory of individual and collective individuation, in which the individual subject is considered as an effect of individuation, rather than as a cause. Thus the individual atom is replaced by the neverending process of individuation. Simondon also conceived of \"pre-individual fields\" as the funds making individuation itself possible. Individuation is an always incomplete process, always leaving a \"pre-individual\" left-over, itself making possible future individuations. Furthermore, individuation always creates both an individual and a collective subject, which individuate themselves together. Simondon criticized Norbert Wiener's theory of cybernetics, arguing that \"Right from the start, Cybernetics has accepted what all theory of technology must refuse: a classification of technological objects conducted by means of established criteria and following genera and species.\" Simondon aimed to overcome the shortcomings of cybernetics by developing a \"general phenomenology\" of machines.\n\n\n== Influence ==\nSimondon's theory of individuation through transduction in a metastable environment was an important influence on the thought of Gilles Deleuze, whose Différence et répétition (1968), Logique du sens (1969) and L'île déserte (2002) make explicit reference to Simondon's work. Gilbert Simondon: une pensée de l'individuation et de la technique (1994), the proceedings of the first conference devoted to Simondon's work, further charts his influence on such thinkers as François Laruelle, Gilles Châtelet, Anne Fagot-Largeau, Yves Deforge, René Thom, and Bernard Stiegler (the latter having placed Simondon's theory of individuation at the very heart of his ongoing and multi-volume philosophical project). Another contributor to Gilbert Simondon: une pensée de l'individuation et de la technique, Simondon's friend John Hart, was the instigator of the very first translation—from French into English c.1980—of Simondon's work (this at University of Western Ontario in Canada where Hart had founded both a Department of Computer Science and a Simondon-inspired network: the ATN, or Audio Tactile Network in 1964). Currently, Simondon can be seen as a major influence on the work of such scholars as Paolo Virno, Jean-Hugues Barthélémy, Thierry Bardini, Luciana Parisi, Brian Massumi, Adrian Mackenzie, Muriel Combes, Carl Mitcham, Andrew Feenberg, Isabelle Stengers, Thomas LaMarre, Bruno Latour and Anne Sauvagnargues.\n\n\n== Bibliography ==\n\n\n=== Primary literature ===\nDu mode d'existence des objets techniques (Méot, 1958; second ed. Paris: Aubier, 1989).\nL'individu et sa genèse physico-biologique (l'individuation à la lumière des notions de forme et d'information) (Paris: PUF, 1964; second ed. J.Millon, coll. Krisis, 1995).\nL'individuation psychique et collective (Paris, Aubier, 1989; reprinted in 2007 with a preface by Bernard Stiegler).\nPosthumous publications\nL’Invention dans les techniques, Cours et conferences (Éd. du Seuil, coll. \"Traces écrites\").\nL’Individuation à la lumière des notions de forme et d’information (Jérôme Millon, coll. Krisis).\nCours sur la perception (1964–1965), Préface de Renaud Barbaras (Editions de La Tansparence).\nImagination et invention (1965–1966) (Editions de La Transparence, 2008).\nCommunication et Information. Cours et Conférences (Éditions de La Transparence, 2010).\nSur la technique (P.U.F., 2014).\nEnglish translations\n\"Technical Mentality,\" trans. Arne De Boever, Parrhesia 07 (2009): 7-27 [1].\n\"Techno Aesthetics,\" trans. Arne De Boever, Parrhesia 14 (2012): 1-8 [2].\n\"Technical Individualization,\" in Joke Brouwer & Arjen Mulder (eds.), Interact or Die! (Rotterdam: NAi, 2007).\n\"The Essence of Technicity,\" trans. Ninian Mellamphy, Dan Mellamphy & Nandita Biswas Mellamphy, Deleuze Studies 5 (11.11.2011): 406-424,[2].\n\"The Genesis of the Individual,\" in Jonathan Crary & Sanford Kwinter (eds.), Incorporations (New York: Zone Books, 1992): 297–319.\n\"The Position of the Problem of Ontogenesis,\" trans. Gregory Flanders, Parrhesia 07 (2009): 4-16. [3].\n\"The Limits of Human Progress,\" trans Sean Cubitt, Cultural Politics, 8(2) (2010): 229-36.Cultural Politics, 8(2) (2010): 229-36\nTwo Lessons on Animal and Man (Minneapolis: Univocal Publishing, 2012).\nAlso see the Online translations section (below) for unpublished translations.\n\n\n=== Secondary literature ===\nAlloa, Emmanuel, \"Prégnances du devenir. Simondon et les images\", in Critique 816 (2015): 356 - 371 (French).\nAlloa, Emmanuel & Judith Michalet, \"Transductive ou intensive? Penser la différence entre Simondon et Deleuze\", La Part de l'oeil 26/27 (2013) 203-215. (French).\nBarthélémy, Jean-Hugues, Life and Technology: An Inquiry Into and Beyond Simondon (tr. B. Norman, Meson Press, 2015).\nBardin, Andrea, Epistemology and Political Philosophy in Gilbert Simondon. Individuation, Technics, Social Systems (Springer, 2015).\nBarthélémy, Jean-Hugues, Simondon (Paris: Les Belles Lettres, 2014).\nBarthélémy, Jean-Hugues (dir.), Cahiers Simondon N° 1 to 6 (Paris: L'Harmattan, 2009-2015).\nBarthélémy, Jean-Hugues, \"Individuation and Knowledge. The refutation of idealism in Simondon's Heritage in France\", translated by M. Hayward and A. De Boever, SubStance, Special Issue \"Gilbert Simondon\", Issue 129, Vol. 41, N°3, 2012.\nBarthélémy, Jean-Hugues, \"What new Humanism today ?\", translated by Chris Turner, Cultural Politics, Vol. 6, Issue 2, Bergs Publishers, 2010.\nBarthélémy, Jean-Hugues, \"Du mort qui saisit le vif. Simondonian ontology today\", trans. Justin Clemens, Parrhesia 7 (2009): 28-35.\nBarthélémy, Jean-Hugues, Simondon ou l'encyclopédisme génétique (Paris: Presses Universitaires de France, 2008)\nBarthélémy, Jean-Hugues, Penser l'individuation. Simondon et la philosophie de la nature (Paris: L'Harmattan, 2005). (French).\nBarthélémy, Jean-Hugues, Penser la connaissance et la technique après Simondon (Paris: L'Harmattan, 2005). (French).\nBidet, Alexandra, Macé, Marielle. \"S'individuer, s'émanciper, risquer un style (autour de Simondon)\", Revue du Mauss, n°38 - Emancipation, subjectivation, individuation. Psychanalyse, philosophie et science sociale, La Découverte, 2011, pp. 269–284.\nCaponi, Saverio, Gilbert Simondon. La tecnica e la vita, Lulu.com, 2010.\nCarrozzini, Giovanni, Gilbert Simondon filosofo della mentalité technique, Mimesis, Milano 2011.\nCarrozzini, Giovanni, Gilbert Simonodn: per un'assiomatica dei saperi. Dall'\"ontologia dell'individuo\" alla filosofia della tecnologia, Manni, San Cesario di Lecce 2006\nChabot, Pascal, La philosophie de Simondon (Paris, Vrin, 2003). (English translation : \"The philosophy of Simondon.Between technology and individuation\", Bloomsbury, 2013)\nCombes, Muriel, Gilbert Simondon and the Philosophy of the Transindividual, translated by Thomas LaMarre, MIT Press 2013 (originally published in French: Simondon, Individu et collectivité, Presses Universitaires de France 1999)\nCritique no. 816 (2015), Special Issue on Gilbert Simondon, with texts by Elie During, Emmanuel Alloa, Irlande Saurin, Anne Sauvegnargues and Gilbert Simondon [4]\nDeleuze, Gilles, \"On Gilbert Simondon,\" in Desert Islands and Other Texts, 1953–1974 (Los Angeles & New York: Semiotext(e), 2004): 86–9. ISBN 1-58435-018-0\nDe Boever, Murray, Roffe & Ashley (eds.), Gilbert Simondon: Being and Technology (Edinburgh University Press, hardback: 2012; paperback: March 2013).\nDumouchel, Paul, \"Gilbert Simondon's Plea for a Philosophy of Technology,\" in The Politics of Knowledge (Bloomington & Indianapolis: Indiana University Press, 1995): 255-71. ISBN 0-253-20940-4.\nDuring, Elie, Simondon au pied du mur. (French).\nHottois, Gilbert, Simondon et la philosophie de la culture technique (Brussels: De Boeck, 1992). (French).\nMackenzie, Adrian, Transductions: Bodies and Machines at Speed (Continuum Press, 2002). ISBN 0-8264-5883-1\nMassumi, Brian, Technical Mentality\" Revisited: Brian Massumi on Gilbert Simondon, Parrhesia 7 (2009): 36-45.\nRevue philosophique de la France et de l'étranger, Gilbert Simondon, n°3/2006.\nStiegler, Bernard, Acting Out (Stanford: Stanford University Press, 2009).\nStiegler, Bernard, The Theater of Individuation: Phase-shift and Resolution in Simondon and Heidegger, trans. Kristina Lebedeva, Parrhesia 7 (2009): 46-57.\nStiegler, Bernard, Technics and Time, 1: The Fault of Epimetheus (Stanford: Stanford University Press, 1998).\nStiegler, Bernard, Temps et individuation technique, psychique, et collective dans l’oeuvre de Simondon. (French).\nToscano, Alberto, \"Technical Culture and the Limits of Interaction: A Note on Simondon,\" in Joke Brouwer & Arjen Mulder (eds.), Interact or Die! (Rotterdam: NAi, 2007): 198-205.\nVirno, Paolo, Angels and the General Intellect: Individuation in Duns Scotus and Gilbert Simondon, Parrhesia 7 (2009): 58-67.\n\n\n== Film ==\nFrançois Lagarde and Pascal Chabot have made a movie on Simondon: Simondon of the Desert (english translation) with Anne Fagot-Largeault, Arne De Boever, Dominique Lecourt, Gilbert Hottois, Giovanni Carrozzini, Jean-Hugues Barthélémy, Jean Clottes, and music by Jean-Luc Guillonet.\n\n\n== References ==\n\n\n== External links ==\n\n\n=== Online translations ===\nSave the Technical Object, link to PDF file of unpublished 2013 translation.\nMEOT / METO, link to PDF file of unpublished 2010 translation.\nAlso see the English translations section (above) for published translations.\n\n\n=== Other links ===\nThe Gilbert Simondon issue of Parrhesia\nFilmed interview of Gilbert Simondon on the subject of mechanology, 1968 (French).\nOn Gilbert Simondon's Unified Theory of Technics and Technology, by François Laruelle\nAutour de Simondon: List of articles about Simondon, by the revue online Appareil (French).\nSissel-Hoel and Van-der-Tuin on Simondon's link to Ernst Cassirer\nGilbert Simondon Biography by Nathalie Simondon\n\"Simondon au pied du mur\" by Elie During (French).\nMode of Existence, English translation.\nOn the Essence of Technicity.\nSimondon biography\nList of articles about Simondon (French).\nOnline Issue on Simondon, by Jean-Hugues Barthélémy (dir.)).\n\"Simondon Week\" on TheFunambulist.net.\n\"Penser l'école avec Gilbert Simondon\" (French).\nCIDES (Centre International des Études Simondoniennes) a.k.a. ICSS (International Center for Simondon Studies)\nConference-video on Gilbert Simondon and the New Enlightenment (French).\nSimondon at Monoskop.org, with extensive bibliography.", "ns": 0, "pageid": 2492259, "title": "Gilbert Simondon"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}