{"batchcomplete": "", "query": {"normalized": [{"to": "Gilbert Harman", "from": "Gilbert_Harman"}], "pages": {"1674106": {"extract": "Gilbert Harman (born 1938) is an American philosopher, teaching at Princeton University since 1963, who has published widely in philosophy of language, cognitive science, philosophy of mind, ethics, moral psychology, epistemology, statistical learning theory, and metaphysics. He and George Miller co-directed the Princeton University Cognitive Science Laboratory. Harman has taught or co-taught courses in Electrical Engineering, Computer Science, Psychology, Philosophy, and Linguistics.\nHe currently holds the James S. McDonnell Distinguished University Professorship in Philosophy. He has been named a Fellow of the Cognitive Science Society and a Fellow of the Association for Psychological Science. He is also a Fellow of the American Academy of Arts & Sciences. He received the Jean Nicod Prize in Paris in 2005. In 2009 he received Princeton University's Behrman award for distinguished achievement in the humanities. His acceptance speech was titled \"We need a linguistics department.\"\nHe has a BA from Swarthmore College and a Ph.D. from Harvard University. His most influential teachers were Michael Scriven, Willard Van Orman Quine, and Noam Chomsky. Some of his well-known students include Stephen Stich at Rutgers, James Dreier at Brown, Nicholas Sturgeon at Cornell, and Joshua Knobe at Yale.\nHis daughter Elizabeth Harman is also a philosopher and a member of the philosophy department and the Center for Human Values at Princeton University.\n\n\n== Epistemology ==\nHarman's 1965 account of the role of \"inference to the best explanation\"—inferring the existence of that which we need for the best explanation of observable phenomena—has been very influential. In later work, he argued that all inference or reasoning should be conceived as rational \"change in view,\" balancing conservatism against coherence, where simplicity and explanatory considerations are relevant to positive coherence and where avoiding inconsistency is relevant to negative coherence. He has expressed doubts about appeals to a priori knowledge and has argued that logic and decision theory are theories of implication and consistency and should not be interpreted as theories that can be followed: they are not theories of inference or reasoning.\nIn Thought and Change in View Harman argued that intuitions about knowledge are useful in thinking about inference. More recently, he and Brett Sherman have suggested that knowledge can rest on assumptions that are not themselves known. He and Sanjeev Kulkarni have suggested that elementary statistical learning theory offers a kind of response to the philosophical problem of induction.\n\n\n== Mind ==\nHarman has also argued that perceptual experience has \"intentional content\" and that it is important not to confuse qualities of the intentional object of experience with qualities of the experience. Perceivers are only aware of qualities that are presented to them in experience, as opposed to properties of experience that represent what we experience as a kind of mental paint.\nHe has also proposed that perceptual and other psychological states are self-reflective so that the content of a perceptual experience might be: this very experience is the result of perceiving a tree with such and such features (except that the experience is not in language). The content of an intention might be: this very intention will lead me to go home by six o'clock.\n\n\n== Ethics ==\nIn \"The Nature of Morality,\" Harman, relying on inference to the best explanation, argued that there are no objective moral facts because we do not need such facts to explain our moral judgments. He has argued that there is not a single true morality. In that respect, moral relativism is true. (This sort of moral relativism is not a theory about what ordinary people mean by their moral judgments.)\nHarman has rejected attempts to base moral theory on conceptions of human flourishing and character traits and has expressed skepticism about the need for a good person to be susceptible to moral guilt or shame.\n\n\n== Works ==\nMonographs:\nThought (Princeton,1973) ISBN 0-691-07188-8\nThe Nature of Morality: An Introduction to Ethics (Oxford,1977) ISBN 0-19-502143-6\nChange in View: Principles of Reasoning (MIT,1986) ISBN 0-262-58091-8\nScepticism and the Definition of Knowledge (Garland,1990) [This is Gilbert Harman's doctoral dissertation which was submitted to Harvard University in 1964]\n(with Judith Jarvis Thomson), Moral Relativism and Moral Objectivity (Blackwell,1996) ISBN 0-631-19211-5\nReasoning, Meaning and Mind (Clarendon,1999) ISBN 0-19-823802-9\nExplaining Value and Other Essays in Moral Philosophy (Clarendon,2000) ISBN 0-19-823804-5\n(with Sanjeev Kulkarni) Reliable Reasoning: Induction and Statistical Learning Theory (MIT Press, 2007)\n(with Sanjeev Kulkarni) An Elementary Introduction to Statistical Learning Theory (Wiley, 2012).\nEdited:\n(with Donald Davidson), Semantics of Natural Language (D. Reidel,1972)\nOn Noam Chomsky: Critical Essays (Anchor,1974)\n(with Donald Davidson), The Logic of Grammar (Dickenson,1975)\nConceptions of the Human Mind: Essays in Honor of George A. Miller (Laurence Erlbaum,1993)\n(with Ernie Lepore), A Companion to W.V.O. Quine (Wiley, 2014)\n\n\n== See also ==\nAmerican philosophy\nList of Jean Nicod Prize laureates\nMoral skepticism\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nhttp://www.princeton.edu/~harman/\nVideo Interview: Gilbert Harman on Epistemology, Philosophy of Mind, and Ethics", "ns": 0, "pageid": 1674106, "title": "Gilbert Harman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}