{"batchcomplete": "", "query": {"normalized": [{"to": "Giovanni Battista Scaramelli", "from": "Giovanni_Battista_Scaramelli"}], "pages": {"16941066": {"extract": "Giovanni Battista Scaramelli (24 November 1687 – 11 January 1752) was an Italian Jesuit, ethicist and ascetical writer.\n\n\n== Biography ==\nHe was born at Rome and died at Macerata in 1752. He entered the Society of Jesus on 21 September 1706. He devoted himself to preaching and the ministry for fifteen years.\n\n\n== Legacy ==\nAccording to Dominican theologian Jordan Aumann, Scaramelli was the first to use the term \"asceticism\" in contradistinction to the older word mystical after the term had been introduced by the Franciscan friar named Dobrosielski into the Latin usage of western theology in 1655. Scaramelli's work on ethics in his Directorium Asceticum has stood the test of time and integrates well with the evidence from modern psychology.\n\n\n== Writings ==\nVita di Suor Maria Crocifissa Satellico Monaca francescana nel monastero di monte Nuovo (1750)\nDiscernimento de' spiriti per il retto regolamento delle azione proprie ed altrui. Operetta utile specialemente ai Direttori delle anime (1753) (English edition Directorium Asceticum)\nDirettorio ascetico in cui s'insegna il modo di condurre l'Anime per vie ordinarie della grazia alla perfezione christiana, indirizzato ai direttori della Anime (1752)\nIl direttorio mistico indirizzato a' direttori di quelle anime che Iddio conduce per la via della contemplazione (1754)\nDottrina di S. Giovanni della Croce (1860)\n\n\n== His books online ==\nworks of Scaramelli at archive.org\n\n\n== Notes ==\n\n\n== References ==\n Herbermann, Charles, ed. (1913). \"Giovanni Battista Scaramelli\". Catholic Encyclopedia. New York: Robert Appleton Company.  This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). \"Giovanni Battista Scaramelli\". Catholic Encyclopedia. New York: Robert Appleton.", "ns": 0, "pageid": 16941066, "title": "Giovanni Battista Scaramelli"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}