{"batchcomplete": "", "query": {"normalized": [{"to": "Gottlob Frege", "from": "Gottlob_Frege"}], "pages": {"48416": {"extract": "Friedrich Ludwig Gottlob Frege (/ˈfreɪɡə/; German: [ˈɡɔtloːp ˈfreːɡə]; 8 November 1848 – 26 July 1925) was a German philosopher, logician, and mathematician. Considered a major figure in mathematics, he is responsible for the development of modern logic and making contributions to the foundations of mathematics. He is also understood by many to be the father of analytic philosophy, where he concentrated on the philosophy of language and mathematics. Though largely ignored during his lifetime, Giuseppe Peano (1858–1932) and Bertrand Russell (1872–1970) introduced his work to later generations of logicians and philosophers.\n\n\n== Life ==\n\n\n=== Childhood (1848–69) ===\nFrege was born in 1848 in Wismar, Mecklenburg-Schwerin (today part of Mecklenburg-Vorpommern). His father Carl (Karl) Alexander Frege (1809–1866) was the co-founder and headmaster of a girls' high school until his death. After Carl's death, the school was led by Frege's mother Auguste Wilhelmine Sophie Frege (née Bialloblotzky, of Polish descent, 12 January 1815 – 14 October 1898).\nIn childhood, Frege encountered philosophies that would guide his future scientific career. For example, his father wrote a textbook on the German language for children aged 9–13, entitled Hülfsbuch zum Unterrichte in der deutschen Sprache für Kinder von 9 bis 13 Jahren (2nd ed., Wismar 1850; 3rd ed., Wismar and Ludwigslust: Hinstorff, 1862), the first section of which dealt with the structure and logic of language.\nFrege studied at a gymnasium in Wismar and graduated in 1869. His teacher Gustav Adolf Leo Sachse (5 November 1843 – 1 September 1909), who was a poet, played the most important role in determining Frege's future scientific career, encouraging him to continue his studies at the University of Jena.\n\n\n=== Studies at University: Jena and Göttingen (1869–74) ===\nFrege matriculated at the University of Jena in the spring of 1869 as a citizen of the North German Confederation. In the four semesters of his studies he attended approximately twenty courses of lectures, most of them on mathematics and physics. His most important teacher was Ernst Karl Abbe (1840–1905; physicist, mathematician, and inventor). Abbe gave lectures on theory of gravity, galvanism and electrodynamics, complex analysis theory of functions of a complex variable, applications of physics, selected divisions of mechanics, and mechanics of solids. Abbe was more than a teacher to Frege: he was a trusted friend, and, as director of the optical manufacturer Carl Zeiss AG, he was in a position to advance Frege's career. After Frege's graduation, they came into closer correspondence.\nHis other notable university teachers were Christian Philipp Karl Snell (1806–86; subjects: use of infinitesimal analysis in geometry, analytical geometry of planes, analytical mechanics, optics, physical foundations of mechanics); Hermann Karl Julius Traugott Schaeffer (1824–1900; analytical geometry, applied physics, algebraic analysis, on the telegraph and other electronic machines); and the philosopher Kuno Fischer (1824–1907; Kantian and critical philosophy).\nStarting in 1871, Frege continued his studies in Göttingen, the leading university in mathematics in German-speaking territories, where he attended the lectures of Rudolf Friedrich Alfred Clebsch (1833–72; analytical geometry), Ernst Christian Julius Schering (1824–97; function theory), Wilhelm Eduard Weber (1804–91; physical studies, applied physics), Eduard Riecke (1845–1915; theory of electricity), and Hermann Lotze (1817–81; philosophy of religion). Many of the philosophical doctrines of the mature Frege have parallels in Lotze; it has been the subject of scholarly debate whether or not there was a direct influence on Frege's views arising from his attending Lotze's lectures.\nIn 1873, Frege attained his doctorate under Ernst Christian Julius Schering, with a dissertation under the title of \"Ueber eine geometrische Darstellung der imaginären Gebilde in der Ebene\" (\"On a Geometrical Representation of Imaginary Forms in a Plane\"), in which he aimed to solve such fundamental problems in geometry as the mathematical interpretation of projective geometry's infinitely distant (imaginary) points.\nFrege married Margarete Katharina Sophia Anna Lieseberg (15 February 1856 – 25 June 1904) on 14 March 1887.\n\n\n== Work as a logician ==\n\nThough his education and early mathematical work focused primarily on geometry, Frege's work soon turned to logic. His Begriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens [Concept-Script: A Formal Language for Pure Thought Modeled on that of Arithmetic], Halle a/S: Verlag von Louis Nebert, 1879  marked a turning point in the history of logic. The Begriffsschrift broke new ground, including a rigorous treatment of the ideas of functions and variables. Frege's goal was to show that mathematics grows out of logic, and in so doing, he devised techniques that took him far beyond the Aristotelian syllogistic and Stoic propositional logic that had come down to him in the logical tradition.\n\nIn effect, Frege invented axiomatic predicate logic, in large part thanks to his invention of quantified variables, which eventually became ubiquitous in mathematics and logic, and which solved the problem of multiple generality. Previous logic had dealt with the logical constants and, or, if... then..., not, and some and all, but iterations of these operations, especially \"some\" and \"all\", were little understood: even the distinction between a sentence like \"every boy loves some girl\" and \"some girl is loved by every boy\" could be represented only very artificially, whereas Frege's formalism had no difficulty expressing the different readings of \"every boy loves some girl who loves some boy who loves some girl\" and similar sentences, in complete parallel with his treatment of, say, \"every boy is foolish\".\nA frequently noted example is that Aristotle's logic is unable to represent mathematical statements like Euclid's theorem, a fundamental statement of number theory that there are an infinite number of prime numbers. Frege's \"conceptual notation\" however can represent such inferences. The analysis of logical concepts and the machinery of formalization that is essential to Principia Mathematica (3 vols., 1910–13) (by Bertrand Russell, 1872–1970, and Alfred North Whitehead, 1861–1947), to Russell's theory of descriptions, to Kurt Gödel's (1906–78) incompleteness theorems, and to Alfred Tarski's (1901–83) theory of truth, is ultimately due to Frege.\nOne of Frege's stated purposes was to isolate genuinely logical principles of inference, so that in the proper representation of mathematical proof, one would at no point appeal to \"intuition\". If there was an intuitive element, it was to be isolated and represented separately as an axiom: from there on, the proof was to be purely logical and without gaps. Having exhibited this possibility, Frege's larger purpose was to defend the view that arithmetic is a branch of logic, a view known as logicism: unlike geometry, arithmetic was to be shown to have no basis in \"intuition\", and no need for non-logical axioms. Already in the 1879 Begriffsschrift important preliminary theorems, for example a generalized form of law of trichotomy, were derived within what Frege understood to be pure logic.\nThis idea was formulated in non-symbolic terms in his The Foundations of Arithmetic (1884). Later, in his Basic Laws of Arithmetic (vol. 1, 1893; vol. 2, 1903; vol. 2 was published at his own expense), Frege attempted to derive, by use of his symbolism, all of the laws of arithmetic from axioms he asserted as logical. Most of these axioms were carried over from his Begriffsschrift, though not without some significant changes. The one truly new principle was one he called the Basic Law V: the \"value-range\" of the function f(x) is the same as the \"value-range\" of the function g(x) if and only if ∀x[f(x) = g(x)].\nThe crucial case of the law may be formulated in modern notation as follows. Let {x|Fx} denote the extension of the predicate Fx, i.e., the set of all Fs, and similarly for Gx. Then Basic Law V says that the predicates Fx and Gx have the same extension iff ∀x[Fx ↔ Gx]. The set of Fs is the same as the set of Gs just in case every F is a G and every G is an F. (The case is special because what is here being called the extension of a predicate, or a set, is only one type of \"value-range\" of a function.)\nIn a famous episode, Bertrand Russell wrote to Frege, just as Vol. 2 of the Grundgesetze was about to go to press in 1903, showing that Russell's paradox could be derived from Frege's Basic Law V. It is easy to define the relation of membership of a set or extension in Frege's system; Russell then drew attention to \"the set of things x that are such that x is not a member of x\". The system of the Grundgesetze entails that the set thus characterised both is and is not a member of itself, and is thus inconsistent. Frege wrote a hasty, last-minute Appendix to Vol. 2, deriving the contradiction and proposing to eliminate it by modifying Basic Law V. Frege opened the Appendix with the exceptionally honest comment: \"Hardly anything more unfortunate can befall a scientific writer than to have one of the foundations of his edifice shaken after the work is finished. This was the position I was placed in by a letter of Mr. Bertrand Russell, just when the printing of this volume was nearing its completion.\" (This letter and Frege's reply are translated in Jean van Heijenoort 1967.)\nFrege's proposed remedy was subsequently shown to imply that there is but one object in the universe of discourse, and hence is worthless (indeed, this would make for a contradiction in Frege's system if he had axiomatized the idea, fundamental to his discussion, that the True and the False are distinct objects; see, for example, Dummett 1973), but recent work has shown that much of the program of the Grundgesetze might be salvaged in other ways:\nBasic Law V can be weakened in other ways. The best-known way is due to philosopher and mathematical logician George Boolos (1940–1996), who was an expert on the work of Frege. A \"concept\" F is \"small\" if the objects falling under F cannot be put into one-to-one correspondence with the universe of discourse, that is, unless: ∃R[R is 1-to-1 & ∀x∃y(xRy & Fy)]. Now weaken V to V*: a \"concept\" F and a \"concept\" G have the same \"extension\" if and only if neither F nor G is small or ∀x(Fx ↔ Gx). V* is consistent if second-order arithmetic is, and suffices to prove the axioms of second-order arithmetic.\nBasic Law V can simply be replaced with Hume's Principle, which says that the number of Fs is the same as the number of Gs if and only if the Fs can be put into a one-to-one correspondence with the Gs. This principle, too, is consistent if second-order arithmetic is, and suffices to prove the axioms of second-order arithmetic. This result is termed Frege's Theorem because it was noticed that in developing arithmetic, Frege's use of Basic Law V is restricted to a proof of Hume's Principle; it is from this, in turn, that arithmetical principles are derived. On Hume's Principle and Frege's Theorem, see \"Frege's Logic, Theorem, and Foundations for Arithmetic\".\nFrege's logic, now known as second-order logic, can be weakened to so-called predicative second-order logic. Predicative second-order logic plus Basic Law V is provably consistent by finitistic or constructive methods, but it can interpret only very weak fragments of arithmetic.\nFrege's work in logic had little international attention until 1903 when Russell wrote an appendix to The Principles of Mathematics stating his differences with Frege. The diagrammatic notation that Frege used had no antecedents (and has had no imitators since). Moreover, until Russell and Whitehead's Principia Mathematica (3 vols.) appeared in 1910–13, the dominant approach to mathematical logic was still that of George Boole (1815–64) and his intellectual descendants, especially Ernst Schröder (1841–1902). Frege's logical ideas nevertheless spread through the writings of his student Rudolf Carnap (1891–1970) and other admirers, particularly Bertrand Russell and Ludwig Wittgenstein (1889–1951).\n\n\n== Philosopher ==\nFrege is one of the founders of analytic philosophy, mainly because of his contributions to the philosophy of language, including the\nFunction–argument analysis of the proposition;\nDistinction between concept and object (Begriff und Gegenstand);\nPrinciple of compositionality;\nContext principle;\nDistinction between the sense and reference (Sinn und Bedeutung) of names and other expressions, sometimes said to involve a mediated reference theory.\nAs a philosopher of mathematics, Frege attacked the psychologistic appeal to mental explanations of the content of judgment of the meaning of sentences. His original purpose was very far from answering general questions about meaning; instead, he devised his logic to explore the foundations of arithmetic, undertaking to answer questions such as \"What is a number?\" or \"What objects do number-words (\"one\", \"two\", etc.) refer to?\" But in pursuing these matters, he eventually found himself analysing and explaining what meaning is, and thus came to several conclusions that proved highly consequential for the subsequent course of analytic philosophy and the philosophy of language.\nIt should be kept in mind that Frege was employed as a mathematician, not a philosopher, and he published his philosophical papers in scholarly journals that often were hard to access outside of the German-speaking world. He never published a philosophical monograph other than The Foundations of Arithmetic, much of which was mathematical in content, and the first collections of his writings appeared only after World War II. A volume of English translations of Frege's philosophical essays first appeared in 1952, edited by students of Wittgenstein, Peter Geach (born 1916) and Max Black (1909–88), with the bibliographic assistance of Wittgenstein (see Geach, ed. 1975, Introduction). Despite the generous praise of Russell and Wittgenstein, Frege was little known as a philosopher during his lifetime. His ideas spread chiefly through those he influenced, such as Russell, Wittgenstein, and Carnap, and through work on logic and semantics by Polish logicians.\n\n\n== Sense and reference ==\n\nFrege's 1892 paper, On Sense and Reference (\"Über Sinn und Bedeutung\"), introduced his influential distinction between sense (\"Sinn\") and reference (\"Bedeutung\", which has also been translated as \"meaning\", or \"denotation\"). While conventional accounts of meaning took expressions to have just one feature (reference), Frege introduced the view that expressions have two different aspects of significance: their sense and their reference.\nReference, (or, \"Bedeutung\") applied to proper names, where a given expression (say the expression \"Tom\") simply refers to the entity bearing the name (the person named Tom). Frege also held that propositions had a referential relationship with their truth-value (in other words, a statement \"refers\" to the truth-value it takes). By contrast, the sense (or \"Sinn\") associated with a complete sentence is the thought it expresses. The sense of an expression is said to be the \"mode of presentation\" of the item referred to, and there can be multiple modes of representation for the same referent.\nThe distinction can be illustrated thus: In their ordinary uses, the name \"Charles Philip Arthur George Mountbatten-Windsor\", which for logical purposes is an unanalyzable whole, and the functional expression \"the Prince of Wales\", which contains the significant parts \"the prince of ξ\" and \"Wales\", have the same reference, namely, the person best known as Prince Charles. But the sense of the word \"Wales\" is a part of the sense of the latter expression, but no part of the sense of the \"full name\" of Prince Charles.\nThese distinctions were disputed by Bertrand Russell, especially in his paper \"On Denoting\"; the controversy has continued into the present, fueled especially by Saul Kripke's famous lectures \"Naming and Necessity\".\n\n\n== 1924 diary ==\nFrege's published philosophical writings were of a very technical nature and divorced from practical issues, so much so that Frege scholar Dummett expresses his \"shock to discover, while reading Frege's diary, that his hero was an anti-Semite.\" After World War I his political opinion became more radical. In the last year of his life, at the age of 76, his diary contains extreme right-wing political opinions, opposing the parliamentary system, democrats, liberals, Catholics, the French and Jews, who he thought ought to be deprived of political rights and, preferably, expelled from Germany\". Frege confided \"that he had once thought of himself as a liberal and was an admirer of Bismarck\", but then sympathized with General Ludendorff and Adolf Hitler. Some interpretations have been written about that time. The diary contains a critique of universal suffrage and socialism. Frege had friendly relations with Jews in real life: among his students was Gershom Scholem who much valued his teacher; and he encouraged Ludwig Wittgenstein to leave for England. The 1924 diary was published posthumously in 1944. Frege apparently never spoke in public about his political viewpoints.\n\n\n== Personality ==\nFrege was described by his students as a highly introverted person, seldom entering into dialogue, mostly facing the blackboard while lecturing though being witty and sometimes bitterly sarcastic.\n\n\n== Important dates ==\nBorn 8 November 1848 in Wismar, Mecklenburg-Schwerin.\n1869 — attends the University of Jena.\n1871 — attends the University of Göttingen.\n1873 — PhD, doctor in mathematics (geometry), attained at Göttingen.\n1874 — Habilitation at Jena; private teacher.\n1879 — Ausserordentlicher Professor at Jena.\n1896 — Ordentlicher Honorarprofessor at Jena.\n1917 or 1918 — retires.\nDied 26 July 1925 in Bad Kleinen (now part of Mecklenburg-Vorpommern).\n\n\n== Important works ==\n\n\n=== Logic, foundation of arithmetic ===\nBegriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens (1879). Halle a. S.\nEnglish: Concept Notation, the Formal Language of the Pure Thought like that of Arithmetics.\nDie Grundlagen der Arithmetik: Eine logisch-mathematische Untersuchung über den Begriff der Zahl (1884). Breslau.\nEnglish: The Foundations of Arithmetic: A Logical-Mathematical Investigation of the Concept of Number.\nGrundgesetze der Arithmetik, Band I (1893); Band II (1903). Jena: Verlag Hermann Pohle.\nEnglish: Basic Laws of Arithmetic, translated and edited with an introduction by Philip A. Ebert and Marcus Rossberg. Oxford: Oxford University Press, 2013. ISBN 978-0-199-28174-9.\n\n\n=== Philosophical studies ===\n\"Function and Concept\" (1891)\nOriginal: \"Funktion und Begriff\"; vom 9. Januar 1891 der Jenaischen Gesellschaft für Medizin und Naturwissenschaft, Jena, 1891;\nIn English: \"Function and Concept.\n\"On Sense and Reference\" (1892)\nOriginal: \"Über Sinn und Bedeutung\", in Zeitschrift für Philosophie und philosophische Kritik C (1892): 25–50;\nIn English: \"On Sense and Reference\", alternatively translated (in later edition) as \"On Sense and Meaning\".\n\"Concept and Object\" (1892)\nOriginal: \"Ueber Begriff und Gegenstand\", in Vierteljahresschrift für wissenschaftliche Philosophie XVI (1892): 192–205;\nIn English: \"Concept and Object\".\n\"What is a Function?\" (1904)\nOriginal: \"Was ist eine Funktion?\", in Festschrift Ludwig Boltzmann gewidmet zum sechzigsten Geburtstage, 20. February 1904, S. Meyer (ed.), Leipzig, 1904, pp. 656–666 (Internet Archive: [2], [3], [4]);\nIn English: \"What is a Function?\".\nLogical Investigations (1918–1923). Frege intended that the following three papers be published together in a book titled Logische Untersuchungen (Logical Investigations). Though the German book never appeared, the papers were published together in Logische Untersuchungen, ed. G. Patzig, Vandenhoeck & Ruprecht, 1966, and English translations appeared together in Logical Investigations, ed. Peter Geach, Blackwell, 1975.\n1918–19. \"Der Gedanke: Eine logische Untersuchung\" (\"The Thought: A Logical Inquiry\"), in Beiträge zur Philosophie des Deutschen Idealismus I: 58–77.\n1918–19. \"Die Verneinung\" (\"Negation\") in Beiträge zur Philosophie des deutschen Idealismus I: 143–157.\n1923. \"Gedankengefüge\" (\"Compound Thought\"), in Beiträge zur Philosophie des Deutschen Idealismus III: 36–51.\n\n\n=== Articles on geometry ===\n1903: \"Über die Grundlagen der Geometrie\". II. Jahresbericht der deutschen Mathematiker-Vereinigung XII (1903), 368–375;\nIn English: \"On the Foundations of Geometry\".\n\n1967: Kleine Schriften. (I. Angelelli, ed.). Darmstadt: Wissenschaftliche Buchgesellschaft, 1967 and Hildesheim, G. Olms, 1967. \"Small Writings,\" a collection of most of his writings (e.g., the previous), posthumously published.\n\n\n== See also ==\nFrege programming language\n\n\n== References ==\n\n\n=== Primary ===\nOnline bibliography of Frege's works and their English translations (compiled by E. N. Zalta, Stanford Encyclopedia of Philosophy).\n1879. Begriffsschrift, eine der arithmetischen nachgebildete Formelsprache des reinen Denkens. Halle a. S.: Louis Nebert. Translation: Concept Script, a formal language of pure thought modelled upon that of arithmetic, by S. Bauer-Mengelberg in Jean Van Heijenoort, ed., 1967. From Frege to Gödel: A Source Book in Mathematical Logic, 1879–1931. Harvard University Press.\n1884. Die Grundlagen der Arithmetik: Eine logisch-mathematische Untersuchung über den Begriff der Zahl. Breslau: W. Koebner. Translation: J. L. Austin, 1974. The Foundations of Arithmetic: A Logico-Mathematical Enquiry into the Concept of Number, 2nd ed. Blackwell.\n1891. \"Funktion und Begriff.\" Translation: \"Function and Concept\" in Geach and Black (1980).\n1892a. \"Über Sinn und Bedeutung\" in Zeitschrift für Philosophie und philosophische Kritik 100:25–50. Translation: \"On Sense and Reference\" in Geach and Black (1980).\n1892b. \"Ueber Begriff und Gegenstand\" in Vierteljahresschrift für wissenschaftliche Philosophie 16:192–205. Translation: \"Concept and Object\" in Geach and Black (1980).\n1893. Grundgesetze der Arithmetik, Band I. Jena: Verlag Hermann Pohle. Band II, 1903. Band I+II online. Partial translation of volume 1: Montgomery Furth, 1964. The Basic Laws of Arithmetic. Univ. of California Press. Translation of selected sections from volume 2 in Geach and Black (1980). Complete translation of both volumes: Philip A. Ebert and Marcus Rossberg, 2013, Basic Laws of Arithmetic. Oxford University Press.\n1904. \"Was ist eine Funktion?\" in Meyer, S., ed., 1904. Festschrift Ludwig Boltzmann gewidmet zum sechzigsten Geburtstage, 20. Februar 1904. Leipzig: Barth: 656–666. Translation: \"What is a Function?\" in Geach and Black (1980).\n1918–1923. Peter Geach (editor): Logical Investigations, Blackwell, 1975.\n1924. Gottfried Gabriel, Wolfgang Kienzler (editors): Gottlob Freges politisches Tagebuch. In: Deutsche Zeitschrift für Philosophie, vol. 42, 1994, pp. 1057–98. Introduction by the editors on pp. 1057–66. This article has been translated into English, in: Inquiry, vol. 39, 1996, pp. 303–342.\nPeter Geach and Max Black, eds., and trans., 1980. Translations from the Philosophical Writings of Gottlob Frege, 3rd ed. Blackwell (1st ed. 1952).\n\n\n=== Secondary ===\nPhilosophy\nBadiou, Alain. \"On a Contemporary Usage of Frege\", trans. Justin Clemens and Sam Gillespie. UMBR(a), no. 1, 2000, pp. 99–115.\nBaker, Gordon, and P.M.S. Hacker, 1984. Frege: Logical Excavations. Oxford University Press. — Vigorous, if controversial, criticism of both Frege's philosophy and influential contemporary interpretations such as Dummett's.\nCurrie, Gregory, 1982. Frege: An Introduction to His Philosophy. Harvester Press.\nDummett, Michael, 1973. Frege: Philosophy of Language. Harvard University Press.\n------, 1981. The Interpretation of Frege's Philosophy. Harvard University Press.\nHill, Claire Ortiz, 1991. Word and Object in Husserl, Frege and Russell: The Roots of Twentieth-Century Philosophy. Athens OH: Ohio University Press.\n------, and Rosado Haddock, G. E., 2000. Husserl or Frege: Meaning, Objectivity, and Mathematics. Open Court. — On the Frege-Husserl-Cantor triangle.\nKenny, Anthony, 1995. Frege — An introduction to the founder of modern analytic philosophy. Penguin Books. — Excellent non-technical introduction and overview of Frege's philosophy.\nKlemke, E.D., ed., 1968. Essays on Frege. University of Illinois Press. — 31 essays by philosophers, grouped under three headings: 1. Ontology; 2. Semantics; and 3. Logic and Philosophy of Mathematics.\nRosado Haddock, Guillermo E., 2006. A Critical Introduction to the Philosophy of Gottlob Frege. Ashgate Publishing.\nSisti, Nicola, 2005. Il Programma Logicista di Frege e il Tema delle Definizioni. Franco Angeli. — On Frege's theory of definitions.\nSluga, Hans, 1980. Gottlob Frege. Routledge.\nNicla Vassallo, 2014, Frege on Thinking and Its Epistemic Significance with Pieranna Garavaso, Lexington Books–Rowman & Littlefield, Lanham, MD, Usa.\nWeiner, Joan, 1990. Frege in Perspective, Cornell University Press.\nLogic and mathematics\nAnderson, D. J., and Edward Zalta, 2004, \"Frege, Boolos, and Logical Objects,\" Journal of Philosophical Logic 33: 1–26.\nBlanchette, Patricia, 2012, Frege's Conception of Logic. Oxford: Oxford University Press, 2012\nBurgess, John, 2005. Fixing Frege. Princeton Univ. Press. — A critical survey of the ongoing rehabilitation of Frege's logicism.\nBoolos, George, 1998. Logic, Logic, and Logic. MIT Press. — 12 papers on Frege's theorem and the logicist approach to the foundation of arithmetic.\nDummett, Michael, 1991. Frege: Philosophy of Mathematics. Harvard University Press.\nDemopoulos, William, ed., 1995. Frege's Philosophy of Mathematics. Harvard Univ. Press. — Papers exploring Frege's theorem and Frege's mathematical and intellectual background.\nFerreira, F. and Wehmeier, K., 2002, \"On the consistency of the Delta-1-1-CA fragment of Frege's Grundgesetze,\" Journal of Philosophic Logic 31: 301–11.\nGrattan-Guinness, Ivor, 2000. The Search for Mathematical Roots 1870–1940. Princeton University Press. — Fair to the mathematician, less so to the philosopher.\nGillies, Donald A., 1982. Frege, Dedekind, and Peano on the foundations of arithmetic. Methodology and Science Foundation, 2. Van Gorcum & Co., Assen, 1982.\nGillies, Donald: The Fregean revolution in logic. Revolutions in mathematics, 265–305, Oxford Sci. Publ., Oxford Univ. Press, New York, 1992.\nCharles Parsons, 1965, \"Frege's Theory of Number.\" Reprinted with Postscript in Demopoulos (1965): 182–210. The starting point of the ongoing sympathetic reexamination of Frege's logicism.\nGillies, Donald: The Fregean revolution in logic. Revolutions in mathematics, 265–305, Oxford Sci. Publ., Oxford Univ. Press, New York, 1992.\nHeck, Richard G., Jr: Frege's Theorem. Oxford: Oxford University Press, 2011\nHeck, Richard G., Jr: Reading Frege's Grundgesetze. Oxford: Oxford University Press, 2013\nWright, Crispin, 1983. Frege's Conception of Numbers as Objects. Aberdeen University Press. — A systematic exposition and a scope-restricted defense of Frege's Grundlagen conception of numbers.\nHistorical context\nEverdell, William R. (1997), The First Moderns: Profiles in the Origins of Twentieth Century Thought, Chicago: University of Chicago Press \n\n\n== External links ==\n\nWorks by or about Gottlob Frege at Internet Archive\nFrege at Genealogy Project\nA comprehensive guide to Fregean material available on the web by Brian Carver.\nStanford Encyclopedia of Philosophy:\n\"Gottlob Frege\" — by Edward Zalta.\n\"Frege's Logic, Theorem, and Foundations for Arithmetic\" — by Edward Zalta.\n\nInternet Encyclopedia of Philosophy:\nGottlob Frege — by Kevin C. Klement.\nFrege and Language — by Dorothea Lotter.\n\nMetaphysics Research Lab: Gottlob Frege.\nFrege on Being, Existence and Truth.\nO'Connor, John J.; Robertson, Edmund F., \"Gottlob Frege\", MacTutor History of Mathematics archive, University of St Andrews .\nBegriff, a LaTeX package for typesetting Frege's logic notation, earlier version\ngrundgesetze, a LaTeX package for typesetting Frege's logic notation, mature version\nFrege's Basic Laws of Arithmetic, info website, incl. corrigenda and LaTeX typesetting tool — by P.A. Ebert and M. Rossberg", "ns": 0, "pageid": 48416, "title": "Gottlob Frege"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}