{"batchcomplete": "", "query": {"normalized": [{"to": "Gregory Chaitin", "from": "Gregory_Chaitin"}], "pages": {"12308": {"extract": "Gregory John Chaitin (/ˈtʃaɪtᵻn/ CHY-tən; born 15 November 1947) is an Argentine-American mathematician and computer scientist. Beginning in the late 1960s, Chaitin made contributions to algorithmic information theory and metamathematics, in particular a computer-theoretic result equivalent to Gödel's incompleteness theorem. He is considered to be one of the founders of what is today known as Kolmogorov (or Kolmogorov-Chaitin) complexity together with Andrei Kolmogorov and Ray Solomonoff. Today, algorithmic information theory is a common subject in any computer science curriculum.\n\n\n== Mathematics and computer science ==\nHe attended the Bronx High School of Science and City College of New York, where he (still in his teens) developed the theory that led to his independent discovery of Kolmogorov complexity.\nChaitin has defined Chaitin's constant Ω, a real number whose digits are equidistributed and which is sometimes informally described as an expression of the probability that a random program will halt. Ω has the mathematical property that it is definable but not computable.\nChaitin's early work on algorithmic information theory followed after the work of Solomonoff, Kolmogorov, and Martin-Löf.\nChaitin is also the originator of using graph coloring to do register allocation in compiling, a process known as Chaitin's algorithm.\nHe was formerly a researcher at IBM's Thomas J. Watson Research Center in New York and remains an emeritus researcher. He has written more than 10 book titles that have been translated to about 15 languages. He is today interested in questions of metabiology and information-theoretic formalizations of the theory of evolution.\n\n\n== Other scholarly contributions ==\nChaitin also writes about philosophy, especially metaphysics and philosophy of mathematics (particularly about epistemological matters in mathematics). In metaphysics, Chaitin claims that algorithmic information theory is the key to solving problems in the field of biology (obtaining a formal definition of 'life', its origin and evolution) and neuroscience (the problem of consciousness and the study of the mind).\nIn recent writings, he defends a position known as digital philosophy. In the epistemology of mathematics, he claims that his findings in mathematical logic and algorithmic information theory show there are \"mathematical facts that are true for no reason, they're true by accident. They are random mathematical facts\". Chaitin proposes that mathematicians must abandon any hope of proving those mathematical facts and adopt a quasi-empirical methodology.\n\n\n== Honors ==\nIn 1995 he was given the degree of doctor of science honoris causa by the University of Maine. In 2002 he was given the title of honorary professor by the University of Buenos Aires in Argentina, where his parents were born and where Chaitin spent part of his youth. In 2007 he was given a Leibniz Medal by Wolfram Research. In 2009 he was given the degree of doctor of philosophy honoris causa by the National University of Córdoba. He was formerly a researcher at IBM's Thomas J. Watson Research Center and is now a professor at the Federal University of Rio de Janeiro.\n\n\n== Criticism ==\nSome philosophers and logicians strongly disagree with the philosophical conclusions that Chaitin has drawn from his theorems. The logician Torkel Franzén criticized Chaitin’s interpretation of Gödel's incompleteness theorem and the alleged explanation for it that Chaitin’s work represents.\n\n\n== See also ==\nDigital philosophy\nHalting problem\nAlgorithmic information theory\n\n\n== Bibliography ==\nInformation, Randomness & Incompleteness (World Scientific 1987) (online)\nAlgorithmic Information Theory (Cambridge University Press 1987) online\nInformation-theoretic Incompleteness (World Scientific 1992) (online)\nThe Limits of Mathematics (Springer-Verlag 1998)\nThe Unknowable (Springer-Verlag 1999)\nExploring Randomness (Springer-Verlag 2001)\nConversations with a Mathematician (Springer-Verlag 2002)\nFrom Philosophy to Program Size (Tallinn Cybernetics Institute 2003)\nMeta Math!: The Quest for Omega (Pantheon Books 2005) (reprinted in UK as Meta Maths: The Quest for Omega, Atlantic Books 2006) (arXiv preprint)\nTeoria algoritmica della complessità (G. Giappichelli Editore 2006)\nThinking about Gödel & Turing (World Scientific 2007)\nMathematics, Complexity and Philosophy (Editorial Midas 2011)\nGödel's Way (CRC Press 2012)\nProving Darwin: Making Biology Mathematical (Pantheon Books 2012)\n\n\n== Notes ==\n\n\n== References ==\nPagallo, Ugo (2005), Introduzione alla filosofia digitale. Da Leibniz a Chaitin [Introduction to Digital Philosophy: From Leibniz to Chaitin] (in Italian), G. Giappichelli Editore, ISBN 88-348-5635-X \nCalude, Cristian S., ed. (2007), Randomness and Complexity. From Leibniz to Chaitin, World Scientific, ISBN 978-981-277-082-0 \n\n\n== External links ==\nG J Chaitin Home Page\nList of publications of G J Chaitin\nVideo of lecture on metabiology: \"Life as evolving software\" on YouTube\nVideo of lecture on \"Leibniz, complexity and incompleteness\"\nWorks by or about Gregory Chaitin in libraries (WorldCat catalog)\nNew Scientist article (March, 2001) on Chaitin, Omegas and Super-Omegas\nA short version of Chaitin's proof", "ns": 0, "pageid": 12308, "title": "Gregory Chaitin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}