{"batchcomplete": "", "query": {"normalized": [{"to": "Grigori Mints", "from": "Grigori_Mints"}], "pages": {"43508402": {"extract": "Grigori Mints (June 7, 1939 – May 29, 2014) was a Russian philosopher and mathematician who worked in mathematical logic. He was born in Leningrad, in the Soviet Union (now St. Petersburg, Russia), and received his Ph.D. in 1965 from the Leningrad State University under Nikolai Aleksandrovich Shanin with a thesis entitled \"On Predicate and Operator Variants for Building Theories of Constructive Mathematics\". In 1990 he received his D.Sc. from Leningrad State University with a thesis entitled \"Proof Transformations and Synthesis of Programs\". He was a Stanford University professor. Since 1991, Grigori \"Grisha\" Mints was a professor of philosophy and, by courtesy, of mathematics and of computer science at Stanford University. Before joining Stanford, Mints held research positions at the Steklov Mathematical Institute, the Leningrad University and the Estonian Academy of Sciences.\nConsidered one of the most distinguished logicians in the world, Mints was passionate about the applications of logic to philosophy. His expertise was in proof theory – the analysis of the structure of mathematical reasoning. Mints was elected to the Estonian Academy of Sciences in 2008 and to the American Academy of Arts and Sciences in 2010.\nMints was a very active member of the steering committee of the WoLLIC series of workshops on logic and language, after having been a member of the community in several capacities such as invited speaker, PC member, PC chair, Organising Committee chair, guest editor of proceedings and special issue, and steering committee member.\n\n\n== Selected Publications ==\nMints, G. (2013) Epsilon substitution for first- and second-order predicate logic. \"Ann. Pure Appl. Logic\" 164(6): 733-739.\nMints, G., Olkhovikov, G.V., Urquhart, A. (2013) Failure of interpolation in constant domain intuitionistic logic. \"J. Symb. Log.\" 78(3): 937-950.\nMints, G. (2013) ADC Method of Proof Search for Intuitionistic Propositional Natural Deduction. To appear in a \"Festsschrift for A. Avron\".\nMints, G. (2012) Effective Cut-elimination for a Fragment of Modal mu-calculus. \"Studia Logica\" 100(1-2): 279-287.\nMints, G. (2010) Cut-free formulations for a quantified logic of here and there. \"Ann. Pure Appl. Logic\" 162(3): 237-242.\nMints, G. (2008) Cut elimination for a simple formulation of epsilon calculus. \"Ann. Pure Appl. Logic\" 152(1-3): 148-160.\nMints, G. (2006) Notes on constructive negation. in R. Kahle and P. Schroeder-Heister (eds.), \"Proof-Theoretic Semantics\", special issue of \"Synthese\", 2006, 148, issue 3, pp. 701–717.\nMints, G. (2006) Cut Elimination for a Simple Formulation of PAepsilon. \"Electr. Notes Theor. Comput. Sci.\" 143: 159-169.\nMints, G. (2006) S4 is Topologically Complete for (0, 1): a Short Proof. \"Logic Journal of the IGPL\" 14(1): 63-71.\nMints, G. (2006) Cut Elimination for S4C: A Case Study. \"Studia Logica\" 82(1): 121-132.\nMints, G. & Zhang, T. (2005) Propositional logic of continuous transformations in Cantor space. \"Arch. Math. Log.\" 44(6): 783-799.\nKremer, Ph. & Mints, G. (2005) Dynamic topological logic. \"Ann. Pure Appl. Logic\" 131(1-3): 133-158.\nMints, G. & Zhang, T. (2005) A proof of topological completeness for S4 in (0, 1). \"Ann. Pure Appl. Logic\" 133(1-3): 231-245.\nTatsuta, M. & Mints, G. (2005) A simple proof of second-order strong normalization with permutative conversions. \"Ann. Pure Appl. Logic\" 136(1-2): 134-155\nMints, G. & Muskens, R. (eds.) (2003) \"Games, Logic, and Constructive Sets\". Published by Center for the Study of Language and Information - Lecture Notes (Book 161), 2003. ISBN 978-1575864501\nMints, G. (2001) \"A Short Introduction to Intuitionistic Logic\" (University Series in Mathematics). Published by Kluwer Academic Publisher, 2001.\nMints, G. (1992) \"A Short Introduction to Modal Logic\". Published by Center for the Study of Language and Information - Lecture Notes (Book 30), 1992. ISBN 978-0937073759\nSelected Papers in Proof Theory (North-Holland), August 1992, ISBN 978-0444896193, Studies in Proof Theory series)\nMints, G. & Martin-Löf, P. (eds.) (1990) \"COLOG-88: International Conference on Computer Logic\", Tallinn, USSR, December 12–16, 1988, Proceedings - Lecture Notes in Computer Science (Vol. 417), 1990. ISBN 978-3540523352\n\n\n== References ==\n\n\n== External links ==\nGrigori Mints official website at Stanford University\nTributes to Grigori Mints", "ns": 0, "pageid": 43508402, "title": "Grigori Mints"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}