{"batchcomplete": "", "query": {"normalized": [{"to": "Gualtiero Piccinini", "from": "Gualtiero_Piccinini"}], "pages": {"28349473": {"extract": "Gualtiero Piccinini (born 1970) is an Italian and American philosopher notable for his work on the nature of mind and computation as well as on how to integrate psychology and neuroscience. He is Professor in the Philosophy Department and the Center for Neurodynamics at the University of Missouri, St. Louis, United States.\n\n\n== Background ==\nPiccinini was born and raised in Italy, and studied philosophy and cognitive science at the University of Turin. He then went to graduate school at University of Pittsburgh, specializing in philosophy of science. Upon completion of his Ph.D. he held a postdoctoral position at the PNP program at Washington University, St. Louis, devoted to Philosophy, Neuroscience and Psychology. He started his position at University of Missouri, St. Louis in 2005 and received early tenure and promotion to associate professor in 2010 and early promotion to full professor in 2014. From 2011 to 2014 he was the Chair of the Philosophy Department at University of Missouri, St. Louis.\n\n\n== Work ==\n\n\n=== Cognitive science ===\nIn the area of cognitive science Piccinini is best known for his mechanistic account of what it takes for a physical system to perform computations. He has argued that computation is a kind of mechanistic process that does not require representation. Building on his account of computation, he and co-author Sonya Bahar, an award-winning physicist and Director of the Center for Neurodynamics at University of Missouri, St. Louis, argue that neural computations are neither digital nor analog, but sui generis.\n\n\n=== Philosophy of mind ===\nPiccinini is also widely known for his critique of pancomputationalism and for his view about first-person data such as data from first-person reports. He has argued that first-person data are scientifically legitimate because they are public like other scientific data. Piccinini has also published influential articles on computational theories of cognition, concepts, and consciousness, with award-winning physicist Sonya Bahar and his post doc and research associate Corey Maley from Princeton University, among others.\n\n\n== Miscellaneous ==\nPiccinini has received several grants, awards, fellowships and teaching releases, including a Fellowship at the Institute for Advanced Studies at the Hebrew University of Jerusalem and a Scholars' Award by the National Science Foundation. He is the recipient of the 2014 Herbert Simon award by the International Association of Computing and Philosophy.\nHe has been Philosophy Program Chair for the Southern Society for Philosophy and Psychology.\nHe is the founder of Brains, an academic group blog in the philosophy of mind, psychology, and neuroscience and one of the founders of SLAPSA, a St. Louis-based organization for the philosophy of science, run by Piccinini, Professor Carl Craver (Washington University Saint Louis) and Professor Kent Staley (Saint Louis University).\n\n\n== Bibliography ==\nA partial list of publications by Gualtiero Piccinini:\n\"Neural Computation and the Computational Theory of Cognition,\" (with Sonya Bahar). Cognitive Science (2012).\n\"Integrating psychology and neuroscience: functional analyses as mechanism sketches.\" (with Carl Craver) Synthese 183(3): 283-311 (2011)\n“Information Processing, Computation, and Cognition” (with Andrea Scarantino). Journal of Biological Physics, 37.1 (2011), pp. 1–38.\n“The Mind as Neural Software? Understanding Functionalism, Computationalism, and Computational Functionalism.” Philosophy and Phenomenological Research, 81.2 (2010), pp. 269–311.\n“Computation in Physical Systems,” The Stanford Encyclopedia of Philosophy.(Fall 2010 Edition), Edward N. Zalta (ed.).\n“First-Person Data, Publicity, and Self-Measurement.” Philosophers’ Imprint, 9.9 (2009), pp. 1–16.\n“Computation without Representation,” Philosophical Studies, 137.2 (2008), pp. 205–241.\n“Computational Modeling vs. Computational Explanation: Is Everything a Turing Machine, and Does It Matter to the Philosophy of Mind?” Australasian Journal of Philosophy, 85.1 (2007), pp. 93–115.\n\n\n== References ==\n\n\n== Sources ==\n\"Gualtiero Piccinini's Homepage\". St. Louis: University of Missouri. 10 March 2010. Retrieved 31 December 2012.\nNir Fresco (2008). \"An Analysis of the Criteria for Evaluating Adequate Theories of Computation.\" Minds and Machines 18(3), September 2008, pp. 379–401.\nArkoudas, K., “Computation, Hypercomputation, and Physical Science”, Journal of Applied Logic, 6.4 (2008): 461–475.\nChalmers, D., The Character of Consciousness, Oxford University Press (2010), p. 53\n\n\n== External links ==\nList of Piccinini’s Works at University of Missouri – St. Louis\nBrains, a group blog in the philosophy of mind and cognitive science", "ns": 0, "pageid": 28349473, "title": "Gualtiero Piccinini"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}