{"batchcomplete": "", "query": {"normalized": [{"to": "Guy Debord", "from": "Guy_Debord"}], "pages": {"157393": {"extract": "Guy Louis Debord (French: [gi dəbɔʁ]; December 28, 1931 – November 30, 1994) was a French Marxist theorist, writer, filmmaker, member of the Letterist International, founder of a Letterist faction, and founding member of the Situationist International (SI). He was also briefly a member of Socialisme ou Barbarie.\n\n\n== Early life ==\nGuy Debord was born in Paris in 1931. Guy's father, Martial, was a pharmacist who died due to illness when Guy was young. Guy's mother, Paulette Rossi, sent Guy to live with his grandmother in her family villa in Italy. During World War II, the Rossis left the villa and began to travel from town to town. As a result, Guy attended high school in Cannes, where he began his interest in film and vandalism. As a young man, Debord actively opposed the French war in Algeria and joined in demonstrations in Paris against it.\n\n\n== Involvement with the Letterists ==\nDebord joined the Letterist International when he was 19. The Letterists were led dictatorially by Isidore Isou until a widely agreed upon schism ended Isou's authority. This schism gave rise to several factions of Letterists, one of which was decidedly led by Debord upon Gil Wolman's unequivocal recommendation. In the 1960s, Debord led the Situationist International group, which influenced the Paris Uprising of 1968. Some consider his book The Society of the Spectacle (1967) to be a catalyst for the uprising.\n\n\n== Founding of the Situationist International ==\nIn 1957, the Lettrist International, the International Movement for an Imaginist Bauhaus, and the London Psychogeographical Association gathered in Cosio d'Arroscia (Cuneo), Italy, to found the Situationist International, with Debord having been the leading representative of the Lettrist delegation. Initially made up of a number of well known artists such as Asger Jorn and Pinot Gallizio, the early days of the SI were heavily focused on the formulation of a critique of art, which would serve as a foundation for the group's future entrance into further political critiques. The SI was known for a number of its interventions in the art world, which included one raid against an international art conference in Belgium during 1958  that included a large pamphlet drop and significant media coverage, all of which culminated in the arrest of various situationists and sympathizers associated with the scandal. In addition to this action, the SI endeavored to formulate industrial painting, or, painting prepared en masse with the intent of defaming the original value largely associated with the art of the period. In the course of these actions, Debord was heavily involved in the planning and logistical work associated with preparing these interventions, as well as the work for Internationale Situationniste associated with theoretical defense of the Situationist International's actions.\n\n\n== Political phase of the Situationist International ==\nIn the early 1960s Debord began to direct the SI toward an end of its artistic phase, eventually excluding members such as Jorn, Gallizio, Troche, and Constant - the bulk of the \"artistic\" wing of the SI - by 1965. Having established the situationist critique of art as a social and political critique, one not to be carried out in traditional artistic activities, the SI began, due in part to Debord's contributions, to pursue a more concise theoretical critique of capitalist society.\nWith Debord's 1967 work, The Society of the Spectacle, and excerpts from the group's journal, Internationale Situationniste, the Situationists began to formulate their theory of the spectacle, which explained the nature of late capitalism's historical decay. In Debord's terms, situationists defined the spectacle as an assemblage of social relations transmitted via the imagery of class power, and as a period of capitalist development wherein \"all that was once lived has moved into representation\". With this theory, Debord and the SI would go on to play an influential role in the revolts of May 1968 in France, with many of the protesters drawing their slogans from Situationist tracts penned or influenced by Debord.\n\n\n== After the Situationist International ==\n\nIn 1972, Debord disbanded the Situationist International due to the fact that he had either expelled or lost all of the original members, including Asger Jorn and, in 1972, Raoul Vaneigem, who wrote a biting criticism of Debord and the International. Debord then focused on filmmaking with financial backing from the movie mogul and publisher, Gérard Lebovici (éditions Champ Libre), until Lebovici's mysterious death. Debord was suspected of Lebovici's murder. Distraught by these accusations and his friend's death, Debord took his films and writings out of production until after his death, when he agreed to have his films released at the request of the American researcher, Thomas Y. Levin. Debord's two most recognized films date from this period: a film version of Society of the Spectacle (1973) and \"In girum imus nocte et consumimur igni\" (1978).\nAfter the dissolution of the Situationist International, Debord spent his time reading, and occasionally writing, in relative isolation in a cottage at Champot with Alice Becker-Ho, his second wife. He continued to correspond on political and other issues, notably with Lebovici and the Italian situationist Gianfranco Sanguinetti. He focused on reading material relating to war strategies, e.g. Clausewitz and Sun Tzu, and he designed a war game with Alice Becker-Ho.\nDebord was married twice, to Michèle Bernstein and Alice Becker-Ho, however, these were open relationships. Debord had noted relationships with other women, including Michèle Mochot, the daughter of a surrealist. Bernstein produced a vaguely fictional account of intimate details of the open relationships Mochot and she had with Debord in her novel, All The King's Horses.\nDebord's alcohol consumption became problematic for his health, giving him a form of polyneuritis brought on by his excessive drinking. Apparently, in order to end the suffering induced by this condition, he committed suicide, by shooting himself in the heart at his property in Champot, near Bellevue-la-Montagne, Haute-Loire, on November 30, 1994. Just before his death, he filmed (although did not publish) a documentary entitled, \"Son art et son temps\" (His Art and his Time), an \"autobiography\" that focused primarily on social issues in Paris in the 1990s. It has been suggested that this dark depiction of Debord's \"time\" was a suicide note of sorts.\nOn January 29, 2009, fifteen years after his death, Christine Albanel, Minister of Culture, classified the archive of his works as a \"national treasure\" in response to a sale request by Yale University. The Ministry declared that \"he has been one of the most important contemporary thinkers, with a capital place in history of ideas from the second half of the twentieth century.\" Similarly, Debord once called his book, The Society of the Spectacle, \"the most important book of the twentieth century\". He continues to be a canonical and controversial figure particularly among European scholars of radical politics and modern art.\n\n\n== Written works ==\nGuy Debord's best known works are his theoretical books, The Society of the Spectacle and Comments on the Society of the Spectacle. In addition to these he wrote a number of autobiographical books including Mémoires, Panégyrique, Cette Mauvaise Réputation..., and Considérations sur l'assassinat de Gérard Lebovici. He was also the author of numerous short pieces, sometimes anonymous, for the journals Potlatch, Les Lèvres Nues, Les Chats Sont Verts, and Internationale Situationniste.\nDebord was deeply distressed by the hegemony of governments and media over everyday life through mass production and consumption. He criticized both the capitalism of the West and the dictatorial communism of the Eastern bloc for the lack of autonomy allowed to individuals by both types of governmental structure. Debord postulated that Alienation had gained a new relevance through the invasive forces of the 'spectacle' - \"a social relation between people that is mediated by images\" consisting of mass media, advertisement, and popular culture. The spectacle is a self-fulfilling control mechanism for society. Debord's analysis developed the notions of \"reification\" and \"fetishism of the commodity\" pioneered by Karl Marx and Georg Lukács. Semiotics was also a major influence, particularly the work of his contemporary, Roland Barthes, who was the first to envisage bourgeois society as a spectacle, and to study in detail the political function of fashion within that spectacle. Debord's analysis of \"the spectaclist society\" probed the historical, economic, and psychological roots of the media and popular culture. Central to this school of thought was the claim that alienation is more than an emotive description or an aspect of individual psychology: rather, it is a consequence of the mercantile form of social organization that has reached its climax in capitalism, as theorized by Herbert Marcuse of the Frankfurt School.\nThe Situationist International (SI), a political/artistic movement organized by Debord and his colleagues and represented by a journal of the same name, attempted to create a series of strategies for engaging in class struggle by reclaiming individual autonomy from the spectacle. These strategies, including \"dérive\" and \"détournement,\" drew on the traditions of Lettrism. As founder of the SI, it has been suggested that Debord felt driven to generalize and define the values, ideas, and characteristics of the entire group, which may have contributed to his hand-picking and expulsion of members. The hierarchical and dictatorial nature of the SI existed, however, in the groups that birthed it, including the Letterists and the Surrealists.\nDebord's first book, Mémoires, was bound with a sandpaper cover so that it would damage other books placed next to it.\nDebord has been the subject of numerous biographies, works of fiction, artworks, and songs, many of which are catalogued in the bibliography by Shigenobu Gonzalves, \"Guy Debord ou la Beauté du Negatif.\"\nOften, it is suggested that Debord was opposed to the creation of art, however, Debord writes in the Situationist International magazine (\"Contre le Cinema\") that he believes that \"ordinary\" (quotidian) people should make \"everyday\" (quotidian) art; art and creation should liberate from the spectacle, from capitalism, and from the banality of everyday life in contemporary society. In \"The Society of the Spectacle,\" Debord argues that it is the price put on art that destroys the integrity of the art object, not the material or the creation itself. It is important to note that Debord does not equate art to \"the spectacle.\"\n\n\n== Films ==\nDebord began an interest in film early in his life when he lived in Cannes in the late 1940s. Debord recounted that, during his youth, he was allowed to do very little other than attend films. He said that he frequently would leave in the middle of a film screening to go home because films often bored him. Debord joined the Lettrists just as Isidore Isou was producing films and the Lettrists attempted to sabotage Charlie Chaplin's trip to Paris through negative criticism. Debord directed his first film, Hurlements en faveur de Sade in 1952 with the voices of Michèle Bernstein and Gil Wolman. The film has no images represented; instead, it shows bright white when there is speaking and black when there is not. Long silences separate speaking parts. The film ends with 24 minutes of black silence. People were reported to have become angry and left screenings of this film. The script is composed of quotes appropriated from various sources and made into a montage with a sort of non-linear narrative. Later, through the financial support of Michèle Bernstein and Asger Jorn, Debord produced a second film, Sur le passage de quelques personnes à travers une assez courte unité de temps, which combined scenes with his friends and scenes from mass media culture. This integration of Debord's world with mass media culture became a running motif climaxing with \"The Society of the Spectacle\". Debord wrote the book The Society of the Spectacle before writing the movie. When asked why he made the book into a movie, Debord said, \"I don't understand why this surprised people. The book was already written like a script\". Debord's last film, \"Son Art et Son Temps\", was not produced during his lifetime. It worked as a final statement where Debord recounted his works and a cultural documentary of \"his time\".\nHurlements en faveur de Sade (Howls for Sade) 1952\nSur le passage de quelques personnes à travers une assez courte unité de temps (On the Passage of a Few Persons Through a Rather Brief Unity of Time) 1959 (short film, Dansk-Fransk Experimentalfilmskompagni)\nCritique de la séparation (Critique of Separation) 1961 (short film, Dansk-Fransk Experimentalfilmskompagni)\nLa Société du spectacle (Society of the Spectacle) 1973 (Simar Films)\nRéfutation de tous les judgements, tant élogieux qu’hostiles, qui ont été jusqu’ici portés sur le film « La Société du spectacle » (Refutation of All the Judgements, Pro or Con, Thus Far Rendered on the Film \"The Society of the Spectacle\") 1975 (short film, Simar Films)\nIn girum imus nocte et consumimur igni (a Latin palindrome meaning \"We Go Round and Round in the Night, Consumed by Fire\") (Simar Films) 1978 - This film was meant to be Debord's last and is largely autobiographical. The script was reprinted in 2007 in No: A Journal of the Arts.\nGuy Debord, son art, son temps (Guy Debord - His Art and His Time) 1994 (a \"sabotage television film\" by Guy Debord and Brigitte Cornand, Canal Plus)\nComplete Cinematic Works (AK Press, 2003, translated and edited by Ken Knabb) includes the scripts for all six of Debord's films, along with related documents and extensive annotations.\n\n\n== Bibliography ==\nDebord, Guy (1957). Report on the Construction of Situations. \nMémoires, 1959 (co-authored by Asger Jorn), reprinted by Allia (2004), ISBN 2-84485-143-6.\nLa société du spectacle, 1967, numerous editions; in English: The Society of the Spectacle, Zone Books 1995, ISBN 0-942299-79-5. Society of the Spectacle, Rebel Press 2004, ISBN 0-946061-12-2. The Society of the Spectacle: Annotated Edition, Bureau of Public Secrets, 2014, ISBN 978-0-939682-06-5.\nLa Véritable Scission dans L'Internationale, Champ Libre, 1972 (co-authored by Gianfranco Sanguinetti); in English: The Real Split in the International, Pluto Press 2003, ISBN 0-7453-2128-3.\nŒuvres cinématographiques complètes, Champ Libre, 1978, new edition in 1994; in English: Complete Cinematic Works: Scripts, Stills, and Documents, AK Press 2003, ISBN 1-902593-73-1.\nConsidérations sur l'assassinat de Gérard Lebovici, éditions Gérard Lebovici, 1985; in English: Considerations on the Assassination of Gérard Lebovici, TamTam 2001, ISBN 2-85184-156-4.\nLe Jeu de la Guerre, 1987; in English A Game of War, Atlas Press 2008, ISBN 978-1-900565-38-7\nCommentaires sur la société du spectacle, éditions Gérard Lebovici, 1988; in English: Comments on the Society of the Spectacle, Verso 1990, ISBN 0-86091-302-3.\nPanégyrique volume 1, 1989; in English: Panegyric, Verso 2004, reprinted 2009, ISBN 1-85984-665-3; in Portuguese: \"Panegírico\" [2002], ISBN 85-87193-77-5.\nAll the Guy Debord’s books and films as well as unpublished texts were gathered in a volume of Œuvres, éditions Gallimard, collection Quarto, Paris, 2006.\n\"The Proletariat as Subject and as Representation\"\n\n\n== References ==\n\n\n== Further reading ==\nInternationale situationniste, Paris, 1958-1969. Réédition intégrale chez Van Gennep, Amsterdam 1972, chez Champ Libre 1975, et chez Fayard 1997, ISBN 2-213-59912-2; complete translations are available in German: Situationistische Internationale, Gesammelte Ausgabe des Organs der Situationistischen Internationale, Hamburg: MaD Verlag 1976-1977, ISBN 3-921523-10-9; and in Spanish: Internacional situacionista: textos completos en castellano de la revista Internationale situationniste (1958-1969), Madrid: Literatura Gris [1999-2001], ISBN 84-605-9961-2.\nThe Situationist International by Simon Ford, Black Dog Publishing, 2004, illustrated.\nDebord: Le naufrageur, Jean-Marie Apostolidès, Flammarion, 2016.\nLipstick Traces: A Secret History of the Twentieth Century, Greil Marcus, Harvard University Press, 1990, ISBN 0-674-53581-2.\nSituationist International Anthology, translated and edited by Ken Knabb, Bureau of Public Secrets 1981; Revised and Expanded Edition 2006, ISBN 978-0-939682-04-1.\nGuy Debord, Anselm Jappe, University of California Press 1999, ISBN 0-520-21204-5.\nGuy Debord - Revolutionary, Len Bracken, Feral House 1997, ISBN 0-922915-44-X.\nI situazionisti, Mario Perniola, Roma, Castelvecchi 2005, ISBN 88-7615-068-4.\nDella critica radicale - bibliografia ragionata sull' Internazionale situazionista - con documenti inediti in italiano, Gianluigi Balsebre, Bologna, Grafton 9, 1995.\nThe Game of War: The Life and Death of Guy Debord., Andrew Hussey, Cape 2001, ISBN 0-224-04348-X.\nGuy Debord and the Situationist International, edited by Tom McDonough, MIT Press 2002, ISBN 0-262-13404-7.\n\"The Beautiful Language of my Century\": Reinventing the Language of Contestation in Postwar France, 1945-1968, Tom McDonough, MIT Press 2007, ISBN 0-262-13477-2.\nGuy Debord, Andy Merrifield, Reaktion 2005, ISBN 1-86189-261-6.\n50 Years of Recuperation of the Situationist International, McKenzie Wark, Princeton Architectural Press, New York, 2008 ISBN 1-56898-789-7.\nLos Situacionistas y la Anarquía, Miguel Amorós, Bilbao, Muturreko burutazioak, 2008, ISBN 978-84-88455-98-7.\nDebord ou la Diffraction du temps, Stéphane Zagdanski, Gallimard, 2008.\n\n\n== External links ==\nSituationist international online\nLetters 1957-1994\nThe Marxist Critique of Religion in the Films of Guy Debord\nGuy Debord's Howls for Sade\nLibcom.org/library: Guy Debord archive\nA brief biography and several texts, including Society of the Spectacle\n\"Comments on the society of the spectacle\" (1988)\nGuy Debord and the Situationists\nAudio recordings and Films by Guy Debord at Ubu.web\nMichael Löwy on Guy Debord, in Radical Philosophy\nThe Strange Life of Guy Debord(French)\nFilms / Writings and Literature on Guy Debord\n\"On Guy Debord’s Films\"\nGuy Debord and the Aesthetics of Cine-sabotage\nConstructing Situations: Guy Debord's detournement of fiction\nWall Street vs the Indigenous Peoples Movement—On Guy Debord's work and the NGO-isation of indigenous peoples movements\nClass Wargames Presents Guy Debord's The Game of War\nEmily Nussbaum (January 2015). \"Button-Pusher: The seductive dystopia of \"Black Mirror\"\". The New Yorker.  Quote: \"Anyone who has skimmed Guy Debord’s Wikipedia page or watched the American Music Awards could condemn our culture as a masquerade, a spectacle of virtuality.\"", "ns": 0, "pageid": 157393, "title": "Guy Debord"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}