{"batchcomplete": "", "query": {"normalized": [{"to": "Guy Aldred", "from": "Guy_Aldred"}], "pages": {"2684183": {"extract": "Guy Alfred Aldred (often Guy A. Aldred; 5 November 1886 – 16 October 1963) was a British anarchist communist and a prominent member of the Anti-Parliamentary Communist Federation (APCF). He founded the Bakunin Press publishing house and edited five Glasgow-based anarchist periodicals: The Herald of Revolt, The Spur, The Commune, The Council, and The Word, where he worked closely with Ethel MacDonald and his later partner Jenny Patrick.\n\n\n== Early life ==\nAldred was born in Clerkenwell, London. His father was a 22-year-old lieutenant in the Royal Navy, and his mother was Ada Caroline Holdsworth, a 19-year-old parasol maker. Although Ada was socially unacceptable to the young naval officer, he married her shortly before Guy's birth. After the wedding, he left her at the church to return to his mother. Guy Fawkes night, 5 November, gave Guy his forename. Guy was brought up in the home of Ada’s father, Charles Holdsworth, a Victorian radical. He attended the Iron Infant's School in Farringdon Road, later moving to the Hugh Middleton Higher Grade School, where he was presented to the Prince of Wales because he was the youngest pupil. One of his fellow pupils was the son of Hermann Jung, the Swiss watchmaker and one-time activist in the First International. His first adventures in propaganda were with the Anti-Nicotine League, the Band of Hope, and the total abstinence movement, and he remained an abstainer in these respects all his life.\nHis grandfather, an Anglican, encouraged him to attend the church of St Anne and St Agnes, where he took communion in 1894. However, he soon developed a critical attitude to the church, even though he was close to his cousin, a curate at Holloway.\nAt the age of 15 (1902), he was made aware of his London provincialism when Sir Madlio Singh, the Maharaja of Jeypore, visited the city. He became fascinated by the newspaper accounts of the Maharaja moving around with his \"travelling god\":\nLater that year he gained a reputation as a \"Boy Preacher\", printing and handing out his own leaflets, which were often received with ridicule and disdain. He found employment as an office boy with the National Press Agency in Whitefriars House, where he was promoted to sub-editor. Working with an evangelist named McMasters, he co-founded the \"Christian Social Mission\", opening shortly after his 16th birthday as the Holloway Boy Preacher. His non-conformist approach aroused concern following his first sermon.\nAfter contacting Charles Voysey, Guy was eventually granted an audience on 20 December 1902. The 74-year-old well-to-do Voysey was surprised to be confronted with a coarse-dressed 16-year-old working class boy. After careful preliminaries on the part of Voysey, the meeting lasted three hours. Their friendship was to continue until Voysey’s death in 1912.\nIn January 1903 the Reverend George Martin, an Anglican priest, visited Guy with one of his leaflets, asking to meet the Holloway Boy Preacher. Martin worked in London’s worst slums, and Guy joined him in his work with London’s poorest. His friendship with Martin lasted six years and influenced Guy strongly. He soon gave his last sermon from the pulpit and left the \"Christian Social Mission\".\n\n\n== Agnosticism ==\nGuy became a speaker at the Institute of Theism, but soon felt it was time to set up his own organisation. In 1904 he founded the Theistic Mission, which met every Sunday. With a considerable, though sometimes boisterous, crowd, Guy was gaining a reputation as a forceful young orator. He was also shifting towards atheism. By August, the meeting banner was changed to read The Clerkenwell Freethought Mission. Meetings often generated extreme hostility. On one occasion the crowd charged the platform, knocking Guy to the ground and beating him. Police intervention put an end to the meeting. Around this time he became interested in The Agnostic Journal and became friendly with its editor, \"Saladin\", a Scotsman. It was at the Journal’s office that he met another Scotsman, John Morrison Davidson, and Guy became more interested in Scottish affairs.\n\n\n== Indian Sedition Trial, 1907 ==\n\nThe Indian Sociologist was an Indian nationalist newspaper edited by Shyamji Krishnavarma. When Krishnavarma left London for Paris, fearing repression by the authorities, the printing of the newspaper was first taken over by Arthur Fletcher Horsley. However, he was arrested and tried for printing the May, June and July issues. (He was tried and sentenced on the same day as Madan Lal Dhingra, who was convicted of the assassination of Sir William Hutt Curzon Wyllie). At Horseley's prominent trial the Lord Chief Justice, Lord Alverstone, indicated that anyone printing that sort of material would be liable for prosecution. Nevertheless, Aldred, as an advocate of the free press, published it, bearing his own name. The police obtained a warrant and seized 396 copies of the issue. At the trial the prosecution was led by the Attorney General, Sir William Robson, at the Central Criminal Court. Robson highlighted parts of TIS which Aldred had himself written, particularly focussing on a passage which touched on the execution of Dhingra:\nAldred also remarked that the Sepoy Mutiny, or Indian Mutiny, would be described as The Indian War of Independence. Aldred received a sentence of twelve months hard labour. His involvement with The Indian Sociologist brought him into contact with Har Dayal, who combined anarchism with his Indian Nationalism, based on his view of ancient Aryan culture and Buddhism.\n\n\n== Socialism and anarchism ==\nAldred joined the Social Democratic Federation, but left in 1906. He was a political conscientious objector during the First World War and also a founder of the Glasgow Anarchist Group. He initiated the Communist Propaganda Groups, in support of the October Revolution, which subsequently became a component of the Communist League in 1919. Following its collapse, he founded the Anti-Parliamentary Communist Federation (APCF) in 1921, and gradually moved towards opposing the Soviet Union. His links with left communists across Europe brought him close to council communism.\nIn 1932 he split with the APCF and later founded the Workers Open Forum, which eventually became the United Socialist Movement. During World War II the USM worked with people from across the political spectrum to oppose military action, in a form of Popular Front, and came to advocate World Government. After Joseph Stalin's death, Aldred became increasingly supportive of the Soviet Union.\n\n\n== Free love ==\nAldred worked closely with his partner Rose Witcop (9 April 1890 - 4 July 1932), a pioneer of birth control and sister of Milly Witkop (who was, in turn, partner of anarchist Rudolf Rocker).\nTogether they published an edition of Margaret Sanger's Family Limitation, an action which saw them denounced by a London magistrate for \"indiscriminate\" publication and, despite expert testimony from a consultant to Guy's Hospital and evidence at the appeal that the book had only been sold to those aged over twenty-one, the stock was ordered to be destroyed. Their case had been strongly supported by Dora Russell who, with her husband Bertrand Russell and John Maynard Keynes, paid the legal costs of the appeal.\nAldred and Witcop had a son, Annesley, in 1909. Although they were drifting apart by the time Aldred settled permanently in Glasgow in 1922, finally parting in 1924, they had a legal marriage on 2 February 1926, when it seemed possible Witcop might be deported for her continuing work on family planning.\n\n\n== Death and legacy ==\nAfter initially refusing hospital treatment for a heart condition, Guy Aldred died, almost penniless, in the Western Infirmary, Glasgow, on 16 October 1963 aged 76, leaving his body to Glasgow University's Department of Anatomy. His remains were cremated at the Maryhill Crematorium, Glasgow on 4 May 1964.\nAldred's long-time associate and literary executor, John Taylor Caldwell, produced a biography Come Dungeon's Dark: The Life and Times of Guy Aldred, Glasgow Anarchist and ensured that Aldred's work was collated and preserved on microfilm. He was survived by his son, Annesley.\n\n\n== References ==\n\n\n== Bibliography ==\nSome of Aldred's pamphlets can be found online as part of the Jo Labadie Collection.\nThe Last Days - War of Peace?, 1902\nThe Safety of Unbelief, 1904\nThe Possibility and Philosophy of Anarchist Communism, 1906\nLogics and Economics of the Class Struggle, 1907\nOpen Letter to a Constitutional Imbecile, 1907\nThe Basis and Exodus of Bourgeois Sectarianism, 1907\nSex Oppression, 1907\nAnarchism, Socialism and Social Revolution, 1908\nFrom Anglican Boy-Preacher to Anarchist Socialist Impossibilist, 1908\nRepresentation and the State, 1910 at the Wayback Machine (archived October 26, 2009)\nTrade Unionism and the Class War, 1911\nBakunin's Writings (ed), 1913\nCommunism and Religion, 1920\nSocialism and Parliament, 1924\nSocialism and Parliament Part I: The Burning Question of Today (revised edition, 1928)\nSocialism and Parliament Part II: Government by Labour, 1928\nAt Grips with War, 1929\nJohn Maclean, 1932\nLife of Bakunin (Revised Edition), 1933\nTowards Social Revolution?: Whither the ILP?, 1934\nSocialism and the Pope, 1934\nFor Communism, 1935\nAgainst Terrorism in the Workers' Struggle, 1938\nThe Rebel and his Disciple, 1940\nHistorical and Traditional Christianity 1940\nStudies in Communism, 1940\nDogmas Discarded, 1940\nPioneers of Anti-Parliamentarianism, 1940\nWhy Jesus Wept, 1940\nThe Conscientious Objector, The Tribunal and After, 1940\nCommunism: The Story of the Communist Party, 1943\nConvict 9653 - Eugene Debs, 1942\nA Call to Manhood: 26 Essays, 1944\nSown in Dishonour, 1945\nPeace Now and Forever, 1945\nRex v. Aldred - Report of Trials for Sedition, 1909 and 1912, 1948\nNo Traitors' Gait! - The Life and Times of Guy A. Aldred, (Issued in 19 parts between December 1955 and June 1963), unfinished.\n\n\n== External links ==\n\"The Guy they All Dread,\" Albert Meltzer's reminiscence of Guy Aldred from his autobiography I Couldn't Paint Golden Angels,\nClass war on the Home Front at the Wayback Machine (archived October 27, 2009), articles from the pages of Solidarity, the paper of the Anti-Parliamentary Communist Federation\nAnarchist Encyclopedia entry\nA Brief History of the APCF\nAnti-Parliamentary Communism the movement for workers' councils in Britain, 1917–45\nAgainst the War: Guy Aldred, BBC World Service radio programme broadcast 1989\n\"Guy Aldred: Rebel With a Cause\", Ruth Kinna, Berfrois, 30 September 2011", "ns": 0, "pageid": 2684183, "title": "Guy Aldred"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}