{"batchcomplete": "", "query": {"normalized": [{"to": "Han Ryner", "from": "Han_Ryner"}], "pages": {"22367417": {"extract": "Jacques Élie Henri Ambroise Ner (7 December 1861 – February 6, 1938), also known by the pseudonym Han Ryner, was a French individualist anarchist philosopher and activist and a novelist. He wrote for publications such as L'Art social, L'Humanité nouvelle, L'Ennemi du Peuple, L'Idée Libre de Lorulot; and L'En dehors and L'Unique of fellow anarchist individualist Émile Armand. His thought is mainly influenced by stoicism and epicureanism.\n\n\n== Life ==\nHe was born in Nemours (now Ghazaouet, Tlemcen Province), Department of Orán, French Algeria in a modest religious family. After the death of his mother, he abandoned Catholicism, associated himself with Freemasons and started having an interest in social ideas.\nHe published 2 novels in 1894–1895 and later started working as a journalist. After that he took a teaching position but struggled at having to fit into such a disciplined environment. He becomes a prolific literary writer.\nIn 1896, he adopted the pseudonym \"Han Ryner\" and started writing for such magazines as L'Art social, L'Humanité nouvelle of Augustin Hamon, L'Ennemi du Peuple of Emile Janvion and L'Idée Libre. From here he started collaborating in the important individualist anarchist magazine L'EnDehors and L'Unique of Émile Armand.\nIn 1900 he wrote the essay Le crime d'obéir (the crime of obeying) and in 1903 he wrote the essay Petit manuel individualiste, in which he presented his anarchist individualist doctrine influenced by classic Greek stoicism in the works of Epictetus. By the 1920s his thought starts having an important influence in Spain within individualist anarchist circles especially through the translations of his work by Juan Elizalde. Han Ryner started writing in Spanish individualist journals such as Ética, which already had an important influence of the thought of Ryner. The Brazilian individualist anarchist Maria Lacerda de Moura took the task of making his philosophy and writing become known in the Portuguese-speaking world.\nWith the First World War approaching. Han Ryner embraces pacifist and anti-war positions and promotes conscience objection. In his anti-war activism he collaborates with Émile Armand.\nHe campaigned for the liberation of Eugène Dieudonné in 1913; for that of Émile Armand during the war; for the mutiny in the Black Sea, and for the Italian-American anarchists Nicola Sacco and Bartolomeo Vanzetti and for the Ukrainian anarchist Nestor Makhno. A radical anticlerical, he adhered to the World Committee against War and Fascism. He also opposed World War I on pacifist anti militaristic grounds. He was a rare case of an anarchist participating in the Félibrige. He died in Paris on February 6, 1938.\n\n\n== The individualist anarchism of Han Ryner ==\nThe mature thought of Han Ryner is influenced by stoicism and epicureanism. From this first position he shows a tendency to fatalism towards the pains of life and those produced by society. He wrote in \"Mini-manual of individualism\", \"The Stoic Epictetus courageously bore poverty and slavery. He was perfectly happy in the situations most painful to ordinary men.\" He then emphasized subjective will as a power which individuals can resort to.\nHe defined individualism as \"the moral doctrine which, relying on no dogma, no tradition, no external determination, appeals only to the individual conscience\". As models of individualists he names Socrates, Epicurus, Jesus and Epictetus and so these persons exemplify what he defines as \"harmonic individualism\". For example, he admires from Epicurus his temperance and that \"he showed that very little was needed to satisfy hunger and thirst, to defend oneself against heat and the cold. And he liberated himself from all other needs, that is, almost all the desires and all the fears that enslave men.\". From Jesus how \"He lived free and a wanderer, foreign to any social ties. He was the enemy of priests, external cults and, in general, all organizations.\" From these individualists as he defines them he distinguishes \"conquering and aggressive egoists who proclaim themselves to be individualists\" such as Stendhal and Nietzsche.\nHan Ryner, as well as fellow French individualist anarchist Émile Armand, regarded individualist anarchism above all as a way of life. He regarded that the individualist act must be in accord with his ideas and he calls that \"virtue\". For him, disinterested virtue creates happiness which for him meant feeling oneself free of all outside servitudes and in perfect accord with oneself.\nIn relationships with others and things outside the individual he saw \"Every person is a goal, an end\" and from this he saw that he can \"ask people for services that they will freely accord me, either through benevolence or in exchange for other services\". He defined society as \"a gathering of individuals for a common labor.\" From society's evils he advocated developing individual resistance towards building up indifference. He understood happiness as something that can only be reached through oneself and sees that \"Society has stolen from all, in order to turn over to a few, that great instrument of natural labor, the earth.\" He rejected crowds as he sees them as \"the most brutal of natural forces.\"\nHe saw work as an evil worsened by society and that \"1—It arbitrarily dispenses a certain number of men from all work and places their part of the burden on other men. 2—It employs many men at useless labors and social functions. 3—It multiplies among all, and particularly among the rich, imaginary needs and it imposes on the poor the odious labor necessary for the satisfaction of these needs.\"\nIn line with Stirner, he rejected sacrifices in the name of exterior \"Idols\" such as \"In certain countries, the King or the Emperor, in others some fraud called the Will of the People. Everywhere Order, the Political party, Religion, the Fatherland, the Race, the Color.\" By color he meant race and he found deplorable that \"The White color especially ... has managed to unite in one cult the French, Germans, Russians, and Italians and to obtain from these noble priests the bloody sacrifice of a great number of Chinese.... It is they who have made all of Africa a hell. It is they who destroyed the Indians of America and lynches Negroes.\"\n\n\n== Written works ==\nChair vaincue, roman psychologique (1889)\nLes Chants du divorce, poésies (1892)\nL'Humeur inquiète (1894)\nLa Folie de misère (1895)\nLe Crime d'obéir (1900)\nLe Soupçon (1900)\nL'Homme fourmi, roman illustré par Alexis Mérodack-Jeanneau (1901)\nLes Voyages de Psychodore, philosophe cynique (1903) (translated by Brian Stableford and included in The Superhumans, q.v.)\nPetit Manuel individualiste (1903)\nLa Fille manquée (1903) Rééd. QuestionDeGenre/GKC (2013)\nPetit Manuel individualiste (1903)\nProstitués, études critiques sur les gens de lettres d'aujourd'hui (1904)\nLes Chrétiens et les philosophes (1906)\nLe Subjectivisme. Des bons et mauvais usages de la logique. La Métaphysique et les Sagesses positives. Le Déterminisme et la Liberté. Les Morales: Servilisme et Dominisme. Les Sagesses: Fraternisme et Subjectivisme. Les Étapes de la sagesse (1909)\nVive le roi, hypothèse en 3 actes. Les Esclaves, vision en un acte (1910)\nLe Cinquième Évangile (1911)\nLe Fils du silence (1911)\nLes Paraboles cyniques (1913)\nLes Apparitions d'Ahasvérus v. 1913)\nLes Pacifiques (1914)\nLe Père Diogène (v. 1915–1935)\nLe Sphinx rouge (1918)\nLe Poison, drame en 1 acte (1919)\nLa Tour des peuples (1919)\nLe Père Diogène (1920). Réédition: Premières Pierres, 2007.\nDialogue du mariage philosophique ; suivi des Dicéphales (1922)\nLes Véritables entretiens de Socrate (1922)\nL'Individualisme dans l'antiquité (histoire et critique) (1924)\nLe Communisme et la Liberté (1924)\nLe Crime d'obéir, roman d'histoire contemporaine (1925)\nJusqu'à l'âme: drame moderne en 2 actes (1925)\nL'Ingénieux Hidalgo Miguel Cervantès (1926)\nLa Vie éternelle, roman du mystère (1926)\nJésus est-il un personnage historique ou un personnage légendaire ? La Vérité sur Jésus (1926)\nL'Aventurier d'amour (1927)\nL'Amour plural, roman d'aujourd'hui et de demain (1927)\nJeanne d'Arc fut-elle victime de l'Église ? (1927)\nLa Sagesse qui rit (1928)\nLes Surhommes, roman prophétique (1929) (translated by Brian Stableford as The Superhumans, ISBN 978-1-935558-77-4)\nSonges perdus (1929)\nChère Pucelle de France (1930)\nPrenez-moi tous ! (1930)\nCrépuscules. Bouddha. Platon. Épicure. Thraséas. Raymond Lulle. Rabelais. Leibniz. Hegel. Vigny. Élisée Reclus, etc. (1930)\nLe Manœuvre: pièce en 3 actes (1931)\nDans le mortier. Zénon. Phocion, Saint Ignace ; Les Albigeois ; Michel Servet ; Pierre Ramus ; Vanini ; Brousson ; Francisco Ferrer (1932)\nLa Soutane et le veston, roman (1932)\nBouche d'or, patron des pacifistes (1934)\nLa Cruauté de l'Église (1937)\nL'Église devant ses juges (1937)\nLe Massacre des amazones: études critiques sur deux cents bas-bleus contemporains: Mmes Adam, Sarah Bernhardt, Marie-Anne de Bovet, Bradamante, Jeanne Chauvin, Alphonse Daudet (s. d.)\nLa Beauté: légende dramatique en quatre tableaux (1938)\nFlorilège de paraboles et de songes (1942)\nFace au public. Première série, 1901–1919 (1948)\nJ'ai mon Éliacin, souvenirs d'enfance (1956)\nAux orties, souvenirs d'adolescence (1957)\nLe Sillage parfumé (1958)-\nLes Grandes Fleurs du désert (1963)\n\n\n== References ==\n\n\n== View also ==\nIndividualist anarchism in Europe\n\n\n== External links ==\nWorks by or about Han Ryner at Internet Archive\nHan Ryner Archive including a translation of Mini-Manual of Individualism\nHan Ryner blog\nBibliographical list of Han Ryner´s works\n\"Han Ryner or the Social Thinking of an Individualist in the Early Part of the 20th Century\" by Gérard Lecha in French", "ns": 0, "pageid": 22367417, "title": "Han Ryner"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}