{"batchcomplete": "", "query": {"normalized": [{"to": "Hans Küng", "from": "Hans_Küng"}], "pages": {"587936": {"extract": "Hans Küng (pronounced [ˈhans ˈkʏŋ]; born 19 March 1928) is a Swiss Catholic priest, theologian, and author. Since 1995 he has been President of the Foundation for a Global Ethic (Stiftung Weltethos). He is notable for his rejection of the doctrine of papal infallibility. Although Küng is not officially allowed to teach Catholic theology, his priestly faculties have not been revoked. In 1979, he had to leave the Catholic faculty, but remained at the University of Tübingen as a professor of ecumenical theology, serving as an emeritus professor since 1996.\n\n\n== Life and work ==\nKüng was born in Sursee, Canton of Lucerne. He studied philosophy and theology at the Pontifical Gregorian University in Rome and was ordained in 1954. He continued his education in various European cities, including the Sorbonne.\nIn 1960, he was appointed professor of theology at Eberhard Karls university, Tübingen, Germany. Like his colleague Joseph Ratzinger (later Pope Benedict XVI), in 1962 he was appointed peritus by Pope John XXIII, serving as an expert theological advisor to members of the Second Vatican Council until its conclusion in 1965. At Küng's instigation, the Catholic faculty at Tübingen appointed Ratzinger as professor of dogmatic theology.\nIn a 1963 tour of the United States, Küng gave the lecture \"The Church and Freedom\", receiving an interdict from The Catholic University of America but an honorary doctorate from St. Louis University. He accepted an invitation to visit John F. Kennedy at the White House.\nKüng's doctoral thesis, \"Justification. La doctrine de Karl Barth et une réflexion catholique\", was finally published in English in 1964 as Justification: The Doctrine of Karl Barth. It located a number of areas of agreement between Barthian and Catholic theologies of justification, concluding that the differences were not fundamental and did not warrant a division in the Church. (The book included a letter from Karl Barth attesting that he agreed with Küng's representation of his theology.) In this book Küng argued that Barth, like Martin Luther, overreacted against the Catholic Church which, despite its imperfections, has been and remains the body of Christ.\nIn the late 1960s, he became the first major Roman Catholic theologian since the late 19th century Old Catholic Church schism to publicly reject the doctrine of papal infallibility, in particular in his book Infallible? An Inquiry (1971). Consequently, on 18 December 1979, he was stripped of his missio canonica, his licence to teach as a Roman Catholic theologian, but carried on teaching as a tenured professor of ecumenical theology at the University of Tübingen until his retirement (Emeritierung) in 1996.\nFor three months in 1981, he was guest professor at the University of Chicago. During this visit to America he was invited to only one Catholic institution, the University of Notre Dame. He appeared on the Phil Donahue Show. In October 1986, he participated in the Third Buddhist-Christian Theological Encounter held at Purdue University, West Lafayette, Indiana.\nIn the early 1990s, Küng initiated a project called Weltethos (\"Global Ethic\"), which is an attempt at describing what the world's religions have in common (rather than what separates them) and at drawing up a minimal code of rules of behaviour everyone can accept. His vision of a global ethic was embodied in the document for which he wrote the initial draft, Towards a Global Ethic: An Initial Declaration. This Declaration was signed at the 1993 Parliament of the World's Religions by religious and spiritual leaders from around the world. Later Küng's project would culminate in the UN's Dialogue Among Civilizations to which Küng was assigned as one of 19 \"eminent persons.\" Even though it was completed shortly after the terrorist attacks of 9/11 (in September 2001), it was not covered in the U.S. media, about which Küng complained.\nIn March 1991, he gave a talk titled \"No Peace Among Nations until Peace Among the Religions\" at UCSD's Price Center. He visited the nearby Beth El synagogue and spoke there on modern German-Jewish relations.\nIn 1998, he published Dying with Dignity, co-written with Walter Jens, in which he affirms acceptance of euthanasia from a Christian viewpoint.\nIn 2003, Küng saw the beatification of Pope Pius IX as evidence of the degeneration of canonizations to \"gestures of church politics\".\nIn 2005, Küng published a critical article in Italy and Germany on \"The failures of Pope Wojtyla\" in which he argued that the world had expected a period of conversion, reform, and dialogue but, instead, John Paul II offered a restoration of the pre-Vatican II status quo—thus blocking reform and inter-church dialogue and reasserting the absolute dominion of Rome.\nOn 26 September 2005, he had a friendly discussion about Catholic theology over dinner with Pope Benedict XVI, surprising some observers.\nNevertheless, in a 2009 interview with Le Monde, Küng deeply criticised the lifting of the excommunications on the bishops of the Society of Saint Pius X. The interview drew a rebuke from Cardinal Angelo Sodano.\nBased on Studium Generale lectures at Tübingen University, his latest publication, Der Anfang aller Dinge (The beginning of all things), discusses the relationship between science and religion. In an analysis spanning from quantum physics to neuroscience, he comments on the current debate about evolution in the United States, dismissing those opposed to the teaching of evolution as \"naive [and] un-enlightened.\"\nIn his 2010 book Was ich glaube, he describes his own personal relationship with nature, how he learned to observe correctly, drawing strength from God's creation without falling victim to a false and fanatic love of nature.\nIn April 2010, he published in several newspapers an open letter to all Catholic bishops. In the letter he criticized Pope Benedict's handling of liturgical, collegial and inter-religious issues and also the sexual abuse scandals in the Catholic Church. In the letter, he called on bishops to consider six proposals, ranging from speaking up and working on regional solutions to calling for another Vatican council.\nHe is a signatary of Church 2011, a German-language memorandum promulgated by Catholic theology professors.\nIn 2013, Küng wrote in Erlebte Menschlichkeit (\"Experienced Humanity\") that he believed people had the right to end their own lives if physical illness, pain, or dementia made living unbearable. He further wrote that he was considering the option of assisted suicide for himself as he was suffering from Parkinson's Disease and was losing the ability to see and write with his hands. Küng wrote that he did not wish to follow the example of John Paul II in this case.\n\n\n== Awards ==\n1991 Swiss culture prize;\n1992 Karl Barth prize;\n1998 Theodor Heuss Foundation prize;\n1998 Interfaith gold medallion from the International Council of Christianity and Judaism, London;\n1999 Federation of Lutheran cities prize;\n2000 GLOBArt Award;\n2001 Planetary Consciousness Prize from the Club of Budapest;\n2003 Grand Order of Merit with star\n2004 German Druiden medal from the Weltethos Foundation\n2005 Niwano Peace Prize\n2005 Baden-Wuerttemberg medal\n2006 Lew Kopelew prize\n2007 German freemasonry cultural prize\n2007 Honorary Citizen of City of Tübingen\n2008 Honour for civil courage by the circle of friends Heinrich Heine (Düsseldorf)\n2008 Otto Hahn Peace Medal in Gold from the United Nations Association of Germany (DGVN) in Berlin, for \"outstanding services to peace and international understanding, especially for his exemplary employment for humanity, tolerance and the dialogue between the great world religions\".\n2009 Abraham Geiger prize from the Abraham-Geiger-Kolleg at the University of Potsdam.\n2011 Doctor Honoris Causa by the U.N.E.D.(Universidad de Educación a Distancia) Madrid\n\n\n== See also ==\nParliament of the World's Religions\nTowards a Global Ethic: An Initial Declaration\n\n\n== Writings ==\nEnglish translations:\nJustification: The Doctrine of Karl Barth and a Catholic Reflection, (org. 1964), (40th Ann. Ed. 2004), Westminster John Knox Press, ISBN 0-664-22446-6\nThe Council and Reunion (1960), London: Sheed and Ward\nStructures of the Church (1962), New York: Thomas Nelson and Sons\nThat the World May Believe (1963), New York: Sheed and Ward\nThe Living Church: Reflections on the Second Vatican Council (1963), London: Sheed and Ward\nThe Church (1967), London: Burns and Oates\nInfallible? An Inquiry (1971), ISBN 0-385-18483-2\nWhy Priests? (1971)\nWhat must remain in the Church (1973), London: Collins\nOn Being a Christian (1974)\nSignposts for the Future: Contemporary Issues facing the Church (1978), (ISBN 0-3851-3151-8), 204 pages\nFreud and the Problem of God: Enlarged Edition, Edward Quinn (translator), (ISBN 0-3000-4723-1), 126 pages, Yale University Press\nDoes God Exist? An Answer For Today (1980) (ISBN 0-8245-1119-0)\nChristianity and the world religions: paths of dialogue with Islam, Hinduism, and Buddhism (1986) ISBN 0-385-19471-4\nChristianity and Chinese Religions (with Julia Ching, 1988) (ISBN 0-334-02545-1)\nArt and the question of Meaning (1980, translated 1981) E. Quinn, Crossroads New York (ISBN 0-8245-0016-4)\nThe Incarnation of God: An Introduction to Hegel's Theological Thought as Prolegomena to a Future Christology, J. R. Stephenson (translator), (ISBN 0567093522), 601 pages, Crossroad Publishing Company\nTheology for the Third Millennium: An Ecumenical View (1990) (Translated by Peter Heinegg) (ISBN 0-3854-1125-1)\nGlobal Responsibility: In Search of a New World Ethic (1991), New York: Crossroad.\nJudaism: Between Yesterday and Tomorrow (1992), New York: Crossroad (ISBN 0-8264-0788-9)\nGreat Christian Thinkers (1994) ISBN 0-8264-0848-6\nChristianity : Its Essence and History (1995) (ISBN 0334025710)\nA Global Ethic for Global Politics and Economics (1997) (ISBN 0-334-02686-5)\nDying with Dignity (1998), co-written with Walter Jens\nThe Catholic Church: A Short History. New York: Modern Library. 2001. ISBN 0-679-64092-4. \nMy Struggle for Freedom: Memoirs (2003), New York, London: Continuum (ISBN 0-8264-7021-1)\nWhy I Am Still a Christian (2006) (ISBN 978-0826476982)\nThe Beginning of All Things – Science and Religion (2007) (ISBN 978-0802807632)\nIslam: Past, Present and Future (2007) (ISBN 978-1-85168-377-2)\nDisputed Truth: Memoirs II (2008) New York: Continuum (ISBN 9780826499103)\n\n\n=== About ===\nHans Küng his work and his way, Hans Küng, Hermann Häring, Karl-Josef Kuschel, Robert Nowell, Margret Gentner (1979) (ISBN 0-3851-5852-1)\nThe New Inquisition?: The Case of Edward Schillebeeckx and Hans Küng, Peter Hebblethwaite, (ISBN 0-0606-3795-1)\nHans Küng (Makers of the Modern Theological Mind Series), John J. Kiwiet, Bob E. Patterson (Series Ed.) (1985) (ISBN 0-8499-2954-7)\n\n\n=== References in popular culture ===\nIn \"The Nonborn King\" by Julian May, the third book in the Saga of Pliocene Exile, a minor character, Sullivan-Tonn, is referred to as having once been \"Küng Professor of Moral Theology at Fordham University\"\n\n\n== References ==\n\n\n== External links ==\nPublications by and about Hans Küng in the catalogue Helveticat of the Swiss National Library\nWorks by or about Hans Küng in libraries (WorldCat catalog)\nVideos: Lectures from Hans Küng, University Tuebingen, (German)", "ns": 0, "pageid": 587936, "title": "Hans Küng"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}