{"batchcomplete": "", "query": {"normalized": [{"to": "Hans-Hermann Hoppe", "from": "Hans-Hermann_Hoppe"}], "pages": {"229870": {"extract": "Hans-Hermann Hoppe (German: [ˈhɔpə]; born September 2, 1949) is a German-born American Austrian School economist, and libertarian/anarcho-capitalist philosopher. He is Professor Emeritus of Economics at the University of Nevada, Las Vegas, Senior Fellow of the Ludwig von Mises Institute, and the founder and president of the Property and Freedom Society.\nHoppe identifies as a culturally conservative libertarian. His comments on homosexuality have provoked controversy both among the libertarian community and Hoppe's colleagues at UNLV Business School. Hoppe also garners controversy due to his support for federal enforcement of immigration laws, which critics argue is at odds with libertarianism and anarchism.\n\n\n== Life and work ==\n\nHoppe was born in Peine, West Germany, did undergraduate studies at Universität des Saarlandes and received his MA and PhD degrees from Goethe University Frankfurt. He was a post-doctoral fellow at the University of Michigan, in Ann Arbor, from 1976 to 1978 and earned his habilitation in Foundations of Sociology and Economics from the University of Frankfurt in 1981. From 1986 until his retirement in 2008, Hoppe was a Professor in the School of Business at University of Nevada, Las Vegas. He is a Distinguished Fellow of the Ludwig von Mises Institute, the publisher of much of his work, and was editor of various Mises Institute periodicals.\nHoppe has stated that Murray Rothbard was his \"principal teacher, mentor and master\". After reading Rothbard's books and being converted to a Rothbardian political position, Hoppe moved from Germany to New York City to be with Rothbard, and then followed Rothbard to the University of Nevada, Las Vegas, \"working and living side-by-side with him, in constant and immediate personal contact.\" According to Hoppe, from 1985 until Rothbard's 1995 death, Hoppe considered Rothbard his \"dearest fatherly friend\".\n\n\n=== Property and Freedom Society ===\n\nIn 2006, Hoppe founded The Property & Freedom Society (\"PFS\") as a reaction against the Milton Friedman-influenced Mont Pelerin Society, which he has derided as \"socialist\". On the fifth anniversary of PFS, Hoppe reflected on its goals:\n\nOn the one hand, positively, it was to explain and elucidate the legal, economic, cognitive and cultural requirements and features of a free, state-less natural order.\nOn the other hand, negatively, it was to unmask the State and showcase it for what it really is: an institution run by gangs of murderers, plunderers and thieves, surrounded by willing executioners, propagandists, sycophants, crooks, liars, clowns, charlatans, dupes and useful idiots – an institution that dirties and taints everything it touches.\n\n\n== Argumentation ethics ==\n\nIn the September 1988 issue of Liberty, Hoppe attempted to establish an a priori and value-neutral justification for libertarian ethics by devising a new theory which he named argumentation ethics. Hoppe asserts that any argument which in any respect purports to contradict libertarian principles is logically incoherent. In the following issue, Liberty published comments by ten of Hoppe's fellow libertarians, followed by a rejoinder from Hoppe. In his comment, Hoppe's friend and Mises Institute supervisor Murray Rothbard wrote that Hoppe's theory was \"a dazzling breakthrough for political philosophy in general and for libertarianism in particular\" and that Hoppe, \"has managed to transcend the famous is/ought, fact/value dichotomy that has plagued philosophy since the days of the Scholastics, and that had brought modern libertarianism into a tiresome deadlock\". However, the majority of Hoppe's colleagues surveyed by Liberty rejected his theory. In his response, Hoppe derided his critics as \"utilitarians\".\nFellow Mises Institute Senior Fellow Roderick T. Long states that Hoppe's a priori formulation of libertarianism denies the fundamental principle of Misesean praxeology. On the issue of utilitarianism, Long writes, \"Hoppe’s argument, if it worked, would commit us to recognizing and respecting libertarian rights regardless of what our goals are – but as a praxeologist, I have trouble seeing how any practical requirement can be justified apart from a means-end structure.\"\n\n\n== Views on democracy ==\n\nIn 2001, Hoppe published Democracy: The God That Failed which examines various social and economic phenomena which, Hoppe argues, are problems caused by democratic forms of government. He attributes democracy's alleged failures to pressure groups which seek to increase government expenditures and regulations. Hoppe proposes alternatives and remedies, including secession, decentralization of government, and \"complete freedom of contract, occupation, trade and migration\". Hoppe argues that monarchy would preserve individual liberty more effectively than democracy.\nIn 2013, Hoppe reflected on the relationship between democracy and the arts and concluded that \"democracy leads to the subversion and ultimately disappearance of the notion of beauty and universal standards of beauty. Beauty is swamped and submerged by so-called 'modern art'.\"\nWalter Block, a colleague of Hoppe's at the Ludwig von Mises Institute, asserts that Hoppe's arguments shed light \"on historical occurrences, from wars to poverty to inflation to interest rates to crime\". Block notes that while Hoppe concedes that 21st-century democracies are more prosperous than the monarchies of old, Hoppe argues that if nobles and kings replaced today's political leaders, their ability to take a long term view of a country's well-being would “improve matters”. Block also shared what he called minor criticisms of Hoppe’s theses regarding time preferences, immigration and the gap between libertarianism and conservatism.\nAccording to Hoppe, four years before the publication of Democracy, Alberto Benegas Lynch, Jr. criticized Hoppe's thesis that monarchy is preferable to democracy. A Professor of Economics at the University of Buenos Aires, Benegas Lynch provided empirical evidence demonstrating that modern monarchies tend to be far poorer than modern democracies. In reply, Hoppe stated that as a Misesian economist, he believes that economic theories cannot be \"established or refuted by historical data.\" Hoppe also cited the work of racialist scientist J. Phillipe Rushton to argue that the data are misleading because many modern monarchies are composed of \"Negroid\" people. According to Hoppe, \"since Caucasians have, on the average, a significantly lower degree of time preference than Negroids, any comparison [between African monarchies and Western democracies] would amount to a systematic distortion of the evidence.\" Regardless, Hoppe argues that these data would otherwise systemically favor his case, \"and if anything I have erred - though unavoidably so - on the side of democracy.\"\n\n\n=== Expulsion of homosexuals and political dissidents from Hoppe's libertarian order ===\nIn Democracy Hoppe describes a fully libertarian society of \"covenant communities\" made up of residents who have signed an agreement defining the nature of that community. Hoppe writes \"There would be little or no ‘tolerance’ and ‘openmindedness’ so dear to left-libertarians. Instead, one would be on the right path toward restoring the freedom of association and exclusion implied in the institution of private property\". Hoppe writes that towns and villages could have warning signs saying \"no beggars, bums, or homeless, but also no homosexuals, drug users, Jews, Moslems, Germans, or Zulus\".\nHoppe writes:\n\nIn a covenant concluded among proprietor and community tenants for the purpose of protecting their private property, no such thing as a right to free (unlimited) speech exists, not even to unlimited speech on one's own tenant-property. One may say innumerable things and promote almost any idea under the sun, but naturally no one is permitted to advocate ideas contrary to the very purpose of the covenant of preserving and protecting private property, such as democracy and communism. There can be no tolerance toward democrats and communists in a libertarian social order. They will have to be physically separated and expelled from society. Likewise, in a covenant founded for the purpose of protecting family and kin, there can be no tolerance toward those habitually promoting lifestyles incompatible with this goal. They – the advocates of alternative, non-family and kin-centered lifestyles such as, for instance, individual hedonism, parasitism, nature-environment worship, homosexuality, or communism – will have to be physically removed from society, too, if one is to maintain a libertarian order.\n\nCommenting on this passage, Martin Snyder of the American Association of University Professors said Hoppe's words will disturb \"[t]hose with a better memory than Hoppe for segregation, apartheid, internment facilities and concentration camps, for yellow stars and pink triangles\". Hoppe also provoked controversy by calling homosexuality a \"perversity or abnormality\" and comparable to pedophilia.\nWalter Block wrote that Hoppe's comment calling for \"homosexuals and others to be banned from polite society\" was \"exceedingly difficult to reconcile... with libertarianism\" because \"the libertarian philosophy would support the rights of both groups to act in such manners\". He continues: \"As for homosexuality, it is entirely possible that some areas of the country, parts of Gotham and San Francisco for example, will require this practice, and ban, entirely, heterosexuality. If this is done through contract, private property rights, restrictive covenants, it will be entirely compatible with the libertarian legal code.\"\n\n\n== Support for immigration restrictions and critiques ==\nAs a self-proclaimed anarchist who favors abolishing the nation-state, Hoppe believes that as long as states exist, they should impose some restrictions on immigration. Hoppe has equated free immigration to \"forced integration\" which violates the rights of native peoples, since if land were privately owned, immigration would not be unhindered but would only occur with the consent of private property owners. Hoppe's Mises Institute colleague Walter Block has characterized Hoppe as an \"anti-open immigration activist\" who argues that, though all public property is \"stolen\" by the state from taxpayers, \"the state compounds the injustice when it allows immigrants to use [public] property, thus further “invading” the private property rights of the original owners\". However, Block rejects Hoppe's views as incompatible with libertarianism. Employing a reductio ad absurdum argument, he argues that Hoppe's logic implies that flagrantly unlibertarian laws such as regulations on prostitution and drug use \"could be defended on the basis that many tax-paying property owners would not want such behavior on their own private property\". Another libertarian author, Simon Guenzl, writing for Libertarian Papers argues that: \"supporting a legitimate role for the state as an immigration gatekeeper is inconsistent with Rothbardian and Hoppean libertarian anarchism, as well as with the associated strategy of advocating always and in every instance reductions in the state’s role in society.\"\nIn terms of specific immigration restrictions, Hoppe argued that an appropriate policy will require immigrants to the United States to display proficiency in English in addition to \"superior (above-average) intellectual performance and character structure as well as a compatible system of values\". These requirements will, he argued, result in a \"systematic pro-European immigration bias\". Jacob Hornberger of the Future of Freedom Foundation opined that the immigration test Hoppe advocated would probably be prejudiced against Latin American immigrants to the United States.\n\n\n== Remarks about homosexuals and academic freedom ==\nFollowing a March 4, 2004 lecture on time preference at the University of Nevada, Las Vegas (UNLV), a student complained that Hoppe created a hostile classroom environment by stating that homosexuals tend to be more shortsighted than heterosexuals in their ability to save money and plan (economically) for the future, in part because they tend not to have children. Hoppe also suggested that John Maynard Keynes's homosexuality might explain his economic views. Hoppe also stated that very young and very old people, and couples without children, were less likely to plan for the future. Hoppe told a reporter that the comments lasted only 90 seconds of a 75-minute class, no students questioned the comments in that class, and that in 18 years of giving the same lecture all over the world, he had never previously received a complaint about it. At the request of university officials, Hoppe apologized to the class. He said, \"Italians tend to eat more spaghetti than Germans, and Germans tend to eat more sauerkraut than Italians\" and explained that he was speaking in generalities. Thereafter, Hoppe told the reporter, the student alleged that Hoppe did not take the complaint seriously and filed a formal complaint. Hoppe told the reporter that he felt as if it were he who was the victim in the incident and that the student should have been told to \"grow up\".\nAn investigation was conducted and the university's provost, Raymond W. Alden III, issued Hoppe a non-disciplinary letter of instruction on February 9, 2005, with a finding that he had \"created a hostile or intimidating educational environment in violation of the University's policies regarding discrimination as to sexual orientation\". Alden also instructed Hoppe to \"...cease mischaracterizing opinion as objective fact\", asserted that Hoppe's opinion was not supported by peer-reviewed academic literature, and remarked that Hoppe had \"refus[ed] to substantiate [his] in-class statements of fact....\"\nHoppe appealed the decision, saying the university had \"blatantly violated its contractual obligations\" toward him and described the action as \"frivolous interference with my right to academic freedom\". He was represented by the American Civil Liberties Union. The ACLU threatened legal action. ACLU attorney Allen Lichtenstein said \"The charge against professor Hoppe is totally specious and without merit\". The Nevada ACLU executive director said \"We don't subscribe to Hans' theories and certainly understand why some students find them offensive....But academic freedom means nothing if it doesn't protect the right of professors to present scholarly ideas that are relevant to their curricula, even if they are controversial and rub people the wrong way\". Alden's decision was picked up by Fox News and several blogs and libertarians organized a campaign to contact the university. The university received two weeks of bad publicity and the Interim Chancellor (Nevada System of Higher Education) Jim Rogers expressed concerns about \"any attempts to thwart free speech\".\nJim Rogers intervened in the matter. He rejected Hoppe's request for a one-year paid sabbatical, and UNLV President UNLV Carol Harter acted upon Hoppe's appeal on February 18, 2005. She decided that Hoppe's views, even if non-mainstream or controversial, should not be cause for reprimanding him. She dismissed the discrimination complaint against Hoppe and the non-disciplinary letter was withdrawn from Hoppe's personnel file. She wrote:\n\nUNLV, in accordance with policy adopted by the Board of Regents, understands that the freedom afforded to Professor Hoppe and to all members of the academic community carries a significant corresponding academic responsibility. In the balance between freedoms and responsibilities, and where there may be ambiguity between the two, academic freedom must, in the end, be foremost.\n\nHoppe later wrote about the incident and the UNLV investigation in an article entitled \"My Battle With the Thought Police\". Martin Snyder of the American Association of University Professors wrote that he should not be \"punished for freely expressing his opinions\".\nVarious controversies about academic freedom, including the Hoppe matter and remarks made by Harvard University President Lawrence Summers, prompted the University of Nevada, Las Vegas, to hold a conference on academic freedom in October 2005. In 2009 UNLV proposed a new policy that included the encouragement of reporting by people who felt that they had encountered bias. The proposed policy was criticized by the Nevada ACLU and some faculty members who remembered the Hoppe incident as adverse to academic freedom.\n\n\n== Selected works ==\n\n\n=== Books ===\nHandeln und Erkennen (Bern, 1976) ISBN 978-3261019004 OCLC 2544452\nKritik der kausalwissenschaftlichen Sozialforschung (Westdeutscher Verlag, 1983) ISBN 978-3531116242 OCLC 10432202\nEigentum, Anarchie und Staat (Westdeutscher Verlag, 1987) ISBN 978-3531118116 OCLC 18226538\nA Theory of Socialism and Capitalism (Kluwer Academic Publishers, 1989) ISBN 0-89838-279-3. (Full Text in PDF format)\nEconomic Science and the Austrian Method (Ludwig von Mises Institute, 1995) ISBN 094546620X. (Full Text in PDF format)\nDemocracy: The God That Failed: the economics and politics of monarchy, democracy and natural order. (Transaction Publishers, 2001) ISBN 0765808684 OCLC 46384089\nThe Economics and Ethics of Private Property (2nd edition, Ludwig von Mises Institute, 2006) ISBN 0945466404\nEditor and contributor: The Myth of National Defense. Essays on the Theory and History of Security Production (Ludwig von Mises Institute, 2003) ISBN 978-0945466376 OCLC 53401048. (Full Text in PDF format) Includes writings by L.M. Bassani, C. Lottieri, M.N. Rothbard, E. von Kuehnelt-Leddihn, B. Lemennicier, G. Radnitsky, J.R. Stromberg, L.J. Sechrest, J.R. Hummel, W. Block and J.G. Hulsmann.\n\n\n=== Articles ===\nFull text of Hoppe's 1998 introduction to The Ethics of Liberty by Murray Rothbard (also in PDF format)\nHoppe, Hans-Hermann (September 1988). \"On the Ultimate Justification of the Ethics of Private Property\" (PDF). Liberty. 2 (1): 20–22. \nHoppe, Hans-Hermann. \"In Defense of Extreme Rationalism: Thoughts on D. McCloskey's The Rhetoric of Economics\" (PDF). \nHoppe, Hans-Hermann; M. Rothbard; D. Friedman; L. Yeager; D. Gordon; D. Rasmussen; et al. (November 1988). \"Symposium: Breakthrough or Buncombe?\" (PDF). Liberty. 2 (2): 44–54. \nHoppe, Hans-Hermann (Spring 1996). \"Small is Beautiful and Efficient: The Case for Secession\". Telos. 107. \nHoppe, Hans-Hermann (April 12, 2005). \"My Battle with the Thought Police\". Ludwig von Mises Institute.\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nHans-Hermann Hoppe, The Mises Institute\nProperty, Freedom, and Society – Festschrift (essays honoring Hoppe from the Mises Institute)\n\nThe Property & Freedom Society\nHoppe's archives at LewRockwell.com", "ns": 0, "pageid": 229870, "title": "Hans-Hermann Hoppe"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}