{"batchcomplete": "", "query": {"normalized": [{"to": "Hans Köchler", "from": "Hans_Köchler"}], "pages": {"3810935": {"extract": "Hans Köchler (born 18 October 1948) is a retired professor of philosophy at the University of Innsbruck, Austria, and president of the International Progress Organization, a non-governmental organization in consultative status with the United Nations. In his general philosophical outlook he is influenced by Husserl and Heidegger, his legal thinking has been shaped by the approach of Kelsen. Köchler has made contributions to phenomenology  and philosophical anthropology and has developed a hermeneutics of trans-cultural understanding  that has influenced the discourse on the dialogue of civilizations, particularly as regards the relations between Islam and the West. His research in political and legal philosophy—combined with his involvement with the UN—has resulted in a fundamental critique of the state-centered international system and in specific proposals for the democratization of the United Nations Organization and for a viable system of international criminal justice. Köchler has long worked on the philosophical basis of international relations. He came to prominence in the world of international politics when he was nominated by then UN Secretary-General Kofi Annan as an observer at the Pan Am Flight 103 (Lockerbie) bombing trial.\n\n\n== Early life and academic career ==\nIn his student years, Hans Köchler was actively involved as a Board Member of the European Forum Alpbach and established contacts with leading European intellectuals and philosophers such as Manès Sperber, Hans-Georg Gadamer and Rudi Supek of the Praxis school who he invited to his lecture series that he organized from 1969 onwards. At the beginning of the 1970s, he had joined the team around Otto Molden, the founder of the European Forum Alpbach. These were his formative philosophical years; he initially developed an interest in existential philosophy, transcendental philosophy and phenomenology. In particular, he undertook an epistemological critique of Husserl's transcendental idealism] and interpreted Heidegger's philosophy of Being in the sense of social critique, opening up—in the Cold War era—a dialogue with humanist philosophers of the Praxis school in Yugoslavia and in Czechoslovakia. As a doctoral student, he also had met in Alpbach with Ernst Bloch, Arthur Koestler and Karl Popper.\nIn 1972, Köchler graduated at the University of Innsbruck with a doctor degree in philosophy (Dr. phil.) with highest honours (\"sub auspiciis praesidentis rei publicae\"). In the years following his graduation he expanded his scholarly interest to philosophy of law and later political philosophy. Since the early 1970s he has been promoting the idea of inter-cultural dialogue which—since the last decade—has become known under the slogan of dialogue of civilizations. Köchler first outlined his hermeneutical philosophy of dialogue and his concept of cultural self-comprehension in lectures at the University of Innsbruck (1972) and at the Royal Scientific Society in Amman, Jordan, in March 1974  and discussed that notion in a tour around the world (March–April 1974) for which he got support and encouragement from Austrian Foreign Minister Rudolf Kirchschläger (later to become President of Austria) and in the course of which he met with intellectuals and political leaders on all continents. Among his interlocutors were Yussef el-Sebai, Minister of Culture of Egypt, Prof. S. Nurul Hasan, Minister of Education, Social Welfare and Culture of India, Prince Subhadradis Diskul of Thailand, Charoonphan Israngkul Na Ayudhya, Foreign Minister of Thailand, Prof. Ida Bagus Mantra, Director-General for Culture of Indonesia, and the President of Senegal, Léopold Sédar Senghor. In recognition of his contribution to the dialogue among civilizations he received an honorary doctor degree (Doctor of Humanities honoris causa) from the Mindanao State University (Philippines) (2004). In 2012 he received an honorary doctor degree from the Armenian State Pedagogical University.\n\nIn 1982 he was appointed as University Professor of Philosophy (with special emphasis on Political Philosophy and Philosophical Anthropology) at the University of Innsbruck. From 1990 until 2008 he has served as Chairman of the Department of Philosophy at the University of Innsbruck (Austria). At his University, Professor Köchler also has acted as Chairperson of the Arbeitsgemeinschaft für Wissenschaft und Politik (Working Group for Sciences and Politics) since 1971; he was a member of the Doctoral Grants Committee of the Austrian Academy of Sciences (2000–2006) and is Life Fellow—since 2010 Co-President—of the International Academy for Philosophy. Since 2010 he is also a member of the Advisory Board of the Indian Yearbook of International Law and Policy.\nAdditional professorships:\nVisiting Professor at the University of Malaya, Kuala Lumpur, Malaysia (1998).\nVisiting Professorial Lecturer at the Polytechnic University of the Philippines, Manila (since 2004).\nHonorary Professor of Philosophy at Pamukkale University, Turkey (since 2008).\nKöchler is the recipient of numerous honours and awards such as the History Medal of the Austrian College Society; the award \"Apostle of International Understanding\" (Unity International Foundation, India); the Honorary Medal of the International Peace Bureau (Geneva); the Honorary Medal of the Polytechnic University of the Philippines; the Royal Datoship of the Sultanate of Marawi (Muslim Mindanao); the Medal of David the Invincible by the Armenian Philosophical Academy; the Gusi Peace Prize (2014). On 18 October 2003 the Hans Koechler Political and Philosophical Society was established in the Philippines.\n\n\n== Research ==\n\nDuring the 1970s, he co-operated with Cardinal Karol Wojtyła of Kraków, later to become Pope John Paul II, within the framework of the International Society for Phenomenology. He published the first comment articles on the future Pope's anthropological conception. During the 1980s he engaged in a critique of legal positivism (Philosophie—Recht—Politik, 1985) and developed a theory according to which human rights are the basis of the validity of international law (Die Prinzipien des Völkerrechts und die Menschenrechte, 1981). He also dealt with the applicability of democracy in inter-state relations (Democracy in International Relations, 1986). Legal theory led him to questions of political philosophy, and in particular a critique of the representative paradigm of democracy. During the 1990s Köchler got increasingly involved in questions of world order—including the role and philosophical foundations of civilizational dialogue—and in what he has called the dialectic relationship between power and law. On the basis of these reflections, he made major proposals for the reform of the United Nations Organization, in particular the Security Council, and for a comprehensive system of international criminal justice.\nKöchler's bibliography contains more than 380 books, reports and scholarly articles in several languages (Albanian, Arabic, Chinese, English, French, German, Italian, Japanese, Korean, Persian, Spanish, Serbo-Croat, Turkish). His publications deal with issues of phenomenology, existential philosophy, anthropology, human rights, philosophy of law, theory of international law, international criminal law, United Nations reform, theory of democracy, etc. He acts as editor of the series Studies in International Relations (Vienna), Veröffentlichungen der Arbeitsgemeinschaft für Wissenschaft und Politik (Innsbruck), and as member of the Editorial Board of the international academic journal Hekmat va Falsafeh (Wisdom and Philosophy), published by the Philosophy Department of Allameh Tabatabaii University, Iran.\nKöchler has served in several committees and expert groups dealing with issues of international democracy, human rights and development such as the Research Network on Transnational Democracy sponsored by the European Commission; the Council of Europe's Expert Group on Democratic Citizenship (1998–2000); and the Asia-Europe Foundation’s expert meeting on Cultural, Religious and Social Conceptions of Justice in Asia & Europe (Singapore, 2004).\nKöchler calls in his research paper \"The “Global War on Terror” and its Implications for Muslim-Western Relations \" presented during the International Roundtable Conference at the University of Sains Malaysia, Centre for Policy Research and International Studies (CenPRIS) Penang, Malaysia, during 13–14 December 2007, the \"official narrative\" of 9/11, told by the American authorities, an \"official conspiracy theory\". Moreover, he claims that the Western establishment refuses to investigate what really happened on 9/11 and this is part of a collective denial process.\n\n\n== Non-governmental organizations (NGOs) ==\nKöchler is the Founder and President (since 1972) of the International Progress Organization (I.P.O.), an international non-governmental organization (NGO) in consultative status with the United Nations and with a membership in over 70 countries, representing all continents. He was the founder and Secretary-General (1973-1977) of Euregio Alpina (Study Group for the Alpine Region), a transnational planning structure for the Alpine region and predecessor of the new concept of the \"Euro Regions\" in the framework of the European Union. During the 1970s and 1980s Köchler participated in the international phenomenological movement and organized several conferences and colloquia on the phenomenology of the life-world; he was the organizer of the Eighth International Phenomenological Conference in Salzburg (1980) and is the co-founder of the Austrian Society of Phenomenology. Other activities or functions:\nCoordinator of the International Committee for Palestinian Human Rights (ICPHR) (1988–);\nCo-founder of the European Ombudsman Institute (1988);\nVice-Chairman of the Jamahir Society for Culture and Philosophy and Chairman of the Society's Editorial Board, Vienna (1991–2004);\nMember of the Board, NGO Committee on Development at the United Nations Center in Vienna (1994–);\nMember of the Advisory Council of the International Movement for a Just World (Malaysia) (1997–);\nConvenor (Austria) of the International Movement for a Just World (JUST) (1997–2004);\nMember of the International Advisory Panel of the Center for Civilizational Dialogue at the University of Malaya (Kuala Lumpur) (1997–);\nMember of the International Advisory Council of the Committee for a Democratic United Nations, Germany (2003–);\nMember of the International Advisory Board of the \"Youth for the Alliance of Civilizations,\" an initiative of the Islamic Conference Youth Forum for Dialogue and Cooperation (2007–).\n\n\n== International impact ==\nKöchler has been the organizer of major international conferences in the fields of transnational co-operation, democracy, human rights, terrorism, and conflict resolution, among them the \"International Conference on the European Vocation of the Alpine Region\" in Innsbruck (1971), which initiated transborder co-operation in Europe and the development towards the \"Euro Regions\" within the EU; the \"International Conference on the Question of Terrorism\" in Geneva (1987); and the \"Second International Conference On A More Democratic United Nations\" (CAMDUN-2) at the Vienna headquarters of the United Nations (1991). In 1996 he acted as Chairman of the final session and co-ordinator of the Drafting Committee of the \"International Conference on Democracy and Terrorism\" in New Delhi. In March 2002 he delivered the 14th Centenary Lecture at the Supreme Court of the Philippines on \"The United Nations, the International Rule of Law and Terrorism.\" On 1 September 2004 he delivered the Foundation Day Speech at Mindanao State University, Islamic City of Marawi, on \"The Dialogue of Civilizations and the Future of World Order.\"\n\nThrough his research and civil society initiatives, Professor Köchler made major contributions to the debate on international democracy and United Nations reform, in particular reform of the Security Council. This was acknowledged by international figures such as the German Foreign Minister Klaus Kinkel in 1993. In 1985, he organized the first colloquium on \"Democracy in International Relations\" on the occasion of the 40th anniversary of the United Nations in New York. With Irish Nobel Laureate Seán MacBride he initiated the Appeal by Lawyers against Nuclear War, which set in motion an international campaign that eventually led to a General Assembly resolution and the issuing of an advisory opinion by the International Court of Justice. As President of the I.P.O. he dealt with the humanitarian issues of the exchange of prisoners of war between Iran and Iraq and with the issue of Kuwaiti POWs and missing people in Iraq. Since 1972, UN Secretaries-General in their statements subsequently acknowledged Professor Köchler's contribution to international peace.\n\nIn the framework of his activities as President of the International Progress Organization, he co-operated with numerous international figures such as the Founder President of Senegal, Léopold Sédar Senghor, on the issue of civilizational dialogue; Crown Prince Hassan of Jordan and Cardinal Franz König of Austria on Islamic-Christian understanding; Leo Mates, Secretary-General of the first Non-Aligned summit in Belgrade in 1961, on the principles and future of the non-aligned movement (NAM); Field Marshal Abdul Rahman Sowar el-Dahab, former Head of State of Sudan, on matters of POW exchange and international humanitarian law; Indian President Gyani Zail Singh on issues of international peace; and Sir Thomas Dalyell, former British MP and \"Father of the House of Commons,\" in the case of the criminal investigation into the bombing of Pan Am Flight 103.\nDuring the Pope Benedict XVI Islam controversy, he wrote in a commentary: \"In his lecture preaching the compatibility of reason and faith, Benedict XVI, the scholar, deliberately overlooks the fact that the insights of Greek philosophy – its commitment to the λόγος – have been brought to medieval Christian Europe by the great Muslim thinkers of the Middle Ages. What he calls the 'encounter between the Biblical message and Greek thought' ... was, to a large extent, the result of the influence of Muslim philosophers – at a time when European Christians were totally ignorant of classical Greek philosophy.\".\"\nKöchler is also an outspoken critic of the International Criminal Tribunal for the former Yugoslavia and has condemned its inception and practice by citing provisions of international law.\n\n\n== Major works ==\nDie Subjekt-Objekt-Dialektik in der transzendentalen Phänomenologie. Das Seinsproblem zwischen Idealismus und Realismus. (Monographien zur philosophischen Forschung, vol. 112.) Meisenheim a. G.: Anton Hain, 1974.\nSkepsis und Gesellschaftskritik im Denken Martin Heideggers. Monographien zur philosophischen Forschung, vol. 158. Meisenheim a. G.: Anton Hain, 1978.\nPhilosophie – Recht – Politik. Abhandlungen zur politischen Philosophie und zur Rechtsphilosophie. Veröffentlichungen der Arbeitsgemeinschaft für Wissenschaft und Politik an der Universität Innsbruck, vol. 4. Vienna/New York: Springer-Verlag, 1985.\n(ed.) The Principles of Non-Alignment. London: Third World Centre, 1982.\nPhenomenological Realism. Selected Essays. Frankfurt a. M./Bern: Peter Lang, 1986.\nPolitik und Theologie bei Heidegger. Politischer Aktionismus und theologische Mystik nach \"Sein und Zeit.\" Veröffentlichungen der Arbeitsgemeinschaft für Wissenschaft und Politik an der Universität Innsbruck, vol. 7. Innsbruck: Arbeitsgemeinschaft für Wissenschaft und Politik, 1991.\nDemocracy and the International Rule of Law. Propositions for an Alternative World Order. Selected Papers Published on the Occasion of the Fiftieth Anniversary of the United Nations. Vienna/New York: Springer-Verlag, 1995.\nNeue Wege der Demokratie. Demokratie im globalen Spannungsfeld von Machtpolitik und Rechtsstaatlichkeit. Vienna/New York: Springer-Verlag, 1998.\nManila Lectures 2002. Terrorism and the Quest for a Just World Order. Quezon City (Manila): FSJ Book World, 2002.\nGlobal Justice or Global Revenge? International Criminal Justice at the Crossroads. Philosophical Reflections on the Principles of the International Legal Order Published on the Occasion of the Thirtieth Anniversary of the Foundation of the International Progress Organization. SpringerScience. Vienna/New York: Springer-Verlag, 2003.—Indian edition published by the Indian Society of International Law. New Delhi: Manak Publications, 2005; Turkish edition: Istanbul: Manak, 2005; Arabic edition: Casablanca: Top Édition, 2011.\n(Arabic) ١ﻠﻣﺳﻠﻤٯ ن ﻭ ١ﻠﻐﺮﺐ : من ﺍﻟﺼﺮﺍع إﻟﻰ ﺍﻠﺤوﺍﺮ (The Muslims and the West: From Confrontation to Dialogue). Casablanca, Morocco: TOP Edition, 2009.\nWorld Order: Vision and Reality. Collected Papers Edited by David Armstrong. Studies in International Relations, Vol. XXXI. New Delhi: Manak, 2009.\nGlobal Justice or Global Revenge? The ICC and the Politicization of International Criminal Justice in International Criminal Law and Human Rights, Manoj Kumar Sinha (ed.) (Manak Publications, New Delhi, 2010)\nThe Security Council as Administrator of Justice? Reflections on the Antagonistic Relationship between Power and Law. Vienna: International Progress Organization, 2011.\nForce or Dialogue: Conflicting Paradigms of World Order. Collected Papers Edited by David Armstrong. Studies in International Relations, Vol. XXXIII. New Delhi: Manak, 2015.\n\n\n== Bibliography ==\nComplete bibliography\nTitles in the Library of Congress Catalogue\n\n\n== Köchler on ==\n\n\n=== Heidegger ===\nDer innere Bezug von Anthropologie und Ontologie. Das Problem der Anthropologie im Denken Martin Heideggers. Meisenheim a. G.: Anton Hain, 1974. ISBN 3-445-01072-2 (German)\nSkepsis und Gesellschaftskritik im Denken Martin Heideggers. Meisenheim a. G.: Anton Hain, 1978. ISBN 3-445-01381-0 (German)\nPolitik und Theologie bei Heidegger. Politischer Aktionismus und theologische Mystik nach \"Sein und Zeit.\" Innsbruck: Arbeitsgemeinschaft für Wissenschaft und Politik, 1991. 3-900719-02-0 (German)\n\"God in the Thought of Martin Heidegger,\" in: S. A. Matczak (ed.), God in Contemporary Thought. A Philosophical Perspective. A Collective Study. New York: Learned Publications; Louvain: Editions Nauwelaerts; Paris: Beatrice-Nauwelaerts, 1977, pp. 751-773.\n\"Da li je Heideggerova fundamentalna ontologija odgovara drustvenim normama? U vezi s pitanjem sustavne valorizacije njegova nacionalsocijalistickog angazmana,\" in: Godišnjak za povijest filozofije, Zagreb, vol. 7 (1989), pp. 147-162 (special issue Heidegger I suvremeno mišljenje). (Croatian)\n\"Il concetto di essere in Heidegger e l’interrogativo sul dio personale,” in: Hugo Ott and Giorgio Penzo (eds.), Heidegger e la teologia. Atti del Convegno tenuto a Trento l'8-9 febbraio 1990. Brescia: Morcelliana, 1995, pp. 25-41. (Italian)\n\"Heideggers Konzeption des Subjekts auf dem Hintergrund seiner Ontologie,\" in: R. L. Fetz, R. Hagenbüchle, P. Schulz (eds.), Geschichte und Vorgeschichte der modernen Subjektivität, Vol. II. Berlin/New York: de Gruyter, 1998, pp. 1058-1072. (German)\n\"Heidegger’in ontolojisinde süje kavrami,\" in: Felsefe Dünyasi, Ankara, vol. 29, no. 1 (1999), pp. 3-11. (Turkish)\n\"الشك و نقد المجتمع عند مارتين هيدجر \" (Trans. Hamid Lechhab.) Casablanca (Morocco) 2012. ISBN 978-9954-30-685-7 (Arabic)\n\n\n=== Dialogue of civilizations ===\nCultural-philosophical Aspects of International Cooperation. Lecture delivered at the Royal Scientific Society, Amman, Jordan, 9 March 1974. Published in: Studies in International Cultural Relations, II. Vienna: I.P.O., 1978.\nMuslim-Christian Ties in Europe: Past, Present and Future. Lecture delivered at the Second International Seminar on Civilizational Dialogue, Kuala Lumpur, Malaysia, 2 September 1996.\nPhilosophical Foundations of Civilizational Dialogue. Lecture delivered at the University of Malaya, Kuala Lumpur, Malaysia, 15 September 1997. I.P.O., Occasional Papers Series No. 3, 1997.\nThe Clash of Civilizations Revisited. Lecture at the University of Innsbruck, Austria, 8 June 1998. Google Print: Civilizations - Conflict or Dialogue?, 1999\nAfter September 11: Clash of Civilizations or Dialogue? Lecture delivered at the University of the Philippines (UP), Manila, Philippines, 11 March 2002. UP Forum Online\nThe Dialogue of Civilizations: Philosophical Basis, Political Dimensions and the Relevance of International Sporting Events. Lecture delivered at the FIFA World Cup Roundtable, Seoul, Republic of Korea, 1 June 2002.\nThe Dialogue of Civilizations: Philosophical Basis, Current State and Prospects. Lecture delivered at the invitation of the Asia-Europe Foundation and the Danish Youth Council in Hillerød, Denmark, on 22 September 2002. Asia Europe Journal, Vol. 1, No. 3 (August 2003)\nThe \"Clash of Civilizations\": Perception and Reality in the Context of Globalization and International Power Politics. Lecture delivered at the invitation of the International Black Sea University in Tbilisi, Georgia, 30 September 2004.\nThe Dialogue of Civilizations and the Future of World Order. The 43rd MSU Foundation Day Address delivered at Mindanao State University, Philippines, 1 September 2004. Mindanao Journal, Vol. XXVIII (2005)\nCivilization as Instrument of World Order? The Role of the Civilizational Paradigm in the Absence of a Balance of Power. Lecture delivered at the International Symposion on \"Civilizations and World Orders,\" Istanbul, Turkey, 13 May 2006, in: Future Islam, New Delhi, July/August 2006.\nReligion, Reason and Violence: Pope Benedict XVI and Islam. International Progress Organization, Information Service, 16 September 2006.\nاﻠﻣﺳﻠﻤٯ ن ﻭ اﻠﻐﺮﺐ - من ﺍﻟﺼﺮﺍع إﻟﻰ ﺍﻠﺤوﺍﺮ [The Muslims and the West: From Confrontation to Dialogue/Arabic]. Casablanca: TOP Édition, 2009.\nThe Philosophy and Politics of Dialogue. Centre for Dialogue Working Paper Series, No. 2010/1. La Trobe University, Melbourne, 2010.\nUnity in Diversity: The Integrative Approach to Intercultural Relations. UN Chronicle, Vol. XLIX, No. 3, 2012.\n\n\n=== International terrorism ===\nOpening speech by the President of the I.P.O., in: Hans Köchler (ed.), Terrorism and National Liberation. Frankfurt a.M./Bern/New York: Peter Lang, 1988, pp. 11–14.\n(Initiator) The Baku Declaration on Global Dialogue and Peaceful Co-existence Among Nations and the Threats posed by International Terrorism. International Progress Organization. Baku, Azerbaijan, 9 November 2001.\nThe United Nations, International Rule of Law and Terrorism, in: The Supreme Court Centenary Lecture Series. I: July 2000 – June 2001; II. September 2001 – June 2002. Manila: Supreme Court of the Philippines / Philippine Judicial Academy, 2002, pp. 550–571.\nThe \"Clash of Civilizations,\" the Problem of Terrorism and Strategies Towards Peaceful Co-existence Among Nations, in: ASEM Youth Dialogue on Globalisation, 19–22 September 2002, Hillerød, Denmark. Conference Presentations.\nThe War on Terror, its Impact on the Sovereignty of Nations, and its Implications for Human Rights and Civil Liberties. International Ecumenical Conference on Terrorism in a Globalized World, organized by the National Council of Churches in the Philippines (NCCP), the World Council of Churches, and the Christian Conference in Asia (Manila, 25 September 2002).\nLas Naciones Unidas, el imperio internacional del derecho y el terrorismo. Conferencia centenaria. Suprema Corte de Filipinas y Academia Judicial de Filipinas. Manila, 12 de Marzo del 2002. Occasional Papers Series, No. 7. Vienna: International Progress Organization, 2003. (Spanish)\nManila Lectures 2002. Terrorism and the Quest for a Just World Order. Quezon City, Manila: FSJ Book World, 2002.\nTerrorism and Counter-Terrorism. Towards a Comprehensive Approach. I.P.O. Online Papers, at www.i-p-o.org, 2003.\nThe United Nations and International Terrorism: Challenges to Collective Security. Lecture delivered at the Shanghai Center for International Studies, 15 November 2002. I.P.O. Research Papers. Vienna: International Progress Organization, 2004.\nThe Global War on Terror and the Metaphysical Enemy. Lecture delivered at Universiti Sains Malaysia, Penang, Malaysia, 13 December 2007.\n\n\n=== United Nations reform ===\nThe Voting Procedure in the United Nations Security Council. Examining a Normative Contradiction and its Consequences on International Relations. Studies in International Relations, XVII. Vienna: International Progress Organization, Wien 1991.\nThe United Nations Security Council and the New World Order, in: Frank Barnaby (ed.), Building A More Democratic United Nations. Proceedings of the First International Conference on a More Democratic UN. London: Cass, 1991, pp. 238–245.\nThe United Nations and the New World Order. Philosophical Reflections, in: Hans Köchler (ed.), The United Nations and the New World Order. (Studies in International Relations, XVIII.) Vienna: International Progress Organization, 1992, pp. 7–21.\nDemocracy and the International Rule of Law. Propositions for an Alternative World Order. Selected Papers Published on the Occasion of the Fiftieth Anniversary of the United Nations. Vienna/New York: Springer-Verlag, 1995.\nThe United Nations Sanctions Policy and International Law. Penang, Malaysia: Just World Trust (JUST), 1995; Arabic version: . Vienna: Jamahir Society for Culture and Philosophy, 1997.\nThe United Nations and International Democracy: The Quest for UN Reform. Studies in International Relations, XXII. Vienna: International Progress Organization, 1997.\nSelf-Determination as a Means of Democratization of the United Nations & the International System, in: Y. N. Kly and D. Kly (eds.), In Pursuit of the Right to Self-determination. Collected Papers & Proceedings of the First International Conference on the Right to Self-determination & the United Nations, Geneva 2000. Atlanta: Clarity Press, 2001, pp. 133–142.\nQuo Vadis, United Nations?, in: Law Review, Polytechnic University of the Philippines, College of Law, May 2005, pp. 49-65.\nThe United Nations Organization and Global Power Politics. The Antagonism Between Power and Law and the Future of World Order, in: Chinese Journal of International Law], Vol. 5, No. 2 (2006), pp. 323-340.\nSecurity Council Reform: A Requirement of International Democracy. Lecture delivered at the Center for the Study of Federalism (CSF), Turin, Italy, 8 June 2007.\n\n\n== Commentaries on Köchler's works ==\nPeut-on parler d'un \"scepticisme\" heideggérien? Emilio Brito, Heidegger et l'hymne du sacré. Leuven: Leuven University Press / Uitgeverij Peeters, 1999, pp. 615-621. (French)\nHans Köchler. Global Justice or Global Revenge. International Criminal Justice at the Crossroads. REVIEW. Quezon City, Metro Manila: H. Koechler Political and Philosophical Society, 2004.\nThe Great Power Balance, the United Nations and What the Framers Intended: In Partial Response to Hans Köchler. C.L. Lim in: Chinese Journal of International Law (2007), pp. 1-22.\n\n\n== Publications about Hans Köchler ==\n[Biographical sketches of the members of the International Academy for Philosophy]: \"Hans Köchler,\" in: News and Views, No. 13 (November 2006). Yerevan (Armenia)/Athens (Greece)/Berkeley (USA): International Academy for Philosophy, 2006, pp. 46-53.\nFatemah Remedios C. Balbin (ed.), Hans Köchler Bibliography and Reader. Quezon City, Metro Manila: Hans Koechler Political and Philosophical Society & Foundation for Social Justice, 2007. ISBN 978-3-900719-04-3\nMarie-Luisa Frick and Andreas Oberprantacher (eds.), Power and Justice in International Relations: Interdisciplinary Approaches to Global Challenges. (Essays in Honour of Hans Köchler.) Farnham (Surrey), UK: Ashgate, 2009. ISBN 978-0-7546-7771-0\n\n\n== Köchler's major international conferences ==\nDie europäische Aufgabe der Alpenregion [The European Vocation of the Alpine Region] -- Innsbruck, Austria, 2–3 June 1971\nÖsterreich und die EWG [Austria and the European Economic Community] -- Innsbruck, Austria, 2–3 June 1972\nThe Cultural Self-comprehension of Nations—in co-operation with the United Nations Educational, Scientific and Cultural Organization (UNESCO), Innsbruck, Austria, 27–29 July 1974\nThe Legal Aspects of the Palestine Problem with Special Regard to the Question of Jerusalem—Vienna, Austria, 5–7 November 1980\nThe Concept of Monotheism in Islam and Christianity—Rome, Italy, 17–19 November 1981\nThe Principles of Non-alignment – The Non-aligned Countries in the Eighties: Results and Perspectives -- Baghdad, Iraq, 4–6 May 1982\nThe New International Information and Communication Order – Basis for Cultural Dialogue and Peaceful Co-existence among Nations—in co-operation with the United Nations Educational, Scientific and Cultural Organization (UNESCO), Nicosia, Cyprus, 26–27 October 1984\nDemocracy in International Relations—organized on the occasion of the 40th anniversary of the foundation of the United Nations Organization, New York City, United States, 31 October 1985\nThe Crisis of Representative Democracy -- Geneva, Switzerland, 15–17 November 1985\nThe Question of Terrorism—Geneva, Switzerland, 19–21 March 1987\nSecond International Conference On A More Democratic United Nations (CAMDUN-2) -- United Nations Office at Vienna, Austria, 17–19 September 1991\nIslam and the West - The Conflict in Bosnia-Herzegovina and its Implications for a New World Order—Vienna, Austria, 25 November 1993\nCivilizations: Conflict or Dialogue? -- in co-operation with the Departments of Philosophy and American Studies at the University of Innsbruck, Austria, 8 June 1998\nThe Challenges of Globalization—University of Munich, Germany, 18–19 March 1999\nTransplantationsmedizin und personale Identität [Transplantation Medicine and Personal Identity] -- University of Innsbruck, Austria, 15 March 2000\n¿Cómo democratizar la democracia? [How to Democratize Democracy?] -- in co-operation with Simón Bolívar University, Caracas, Venezuela, 7–8 November 2000\nHuman and Peoples’ Rights in International Relations—in co-operation with Myongji University, Seoul, Republic of Korea, 25 October 2001\nThe United Nations and International Power Politics: The Future of World Order—in co-operation with International Human Rights Association of American Minorities and East-West University, Chicago, Ill., United States, 5 June 2004\nThe Use of Force in International Relations: Challenges to Collective Security—University of Innsbruck, Austria, 22 June 2005\nThe \"Global War on Terror\" and its Implications for Muslim-Western Relations—Centre for Policy Research and International Studies (CenPRIS) at Universiti Sains Malaysia / Malaysia Science University, Penang, Malaysia, 13–14 December 2007\n\"9/11 Revisited – Seeking The Truth\", International Conference, Kuala Lumpur, November 19, 2012\n\n\n== Interviews ==\nLe Soleil, Dakar, Senegal, 27 April 1974 (French)\nPolitika Express, Belgrade, Yugoslavia, 31 August 1981 (Serbo-Croat)\nSächsische Zeitung, Dresden, Germany, 3 January 1992 (German)\nExcelsior, Mexico D.F., 16 November 1992 (Spanish)\nNew Straits Times, Kuala Lumpur, Malaysia, 19 November 1994\nAl-Zaman, Biweekly, Rabat, Morocco, 20 June - 3 July 1997 (Arabic)\nThe Statesman, New Delhi, India, 6 March 1998\nKorea Plus, Seoul, Republic of Korea, 1 June 2005 (Korean)\n\"Reforming the United Nations Organisation: philosophical and practical underpinnings,\" in: Global Change, Peace & Security, Vol. 21, Issue 2 (June 2009), pp. 257–267.\nAksiyon, Istanbul, Turkey, 2 April 2012\nRaiffeisenzeitung, Vienna, Austria, No. 42, 18 October 2012 (German)\nدبي الثقافية / Dubai al-Thaqafiyah, Dubai, UAE, Issue No. 96, May 2013, pp. 34-37 (Arabic)\nA2 Magazine, Prague, Czech Republic, 5 August 2015 (Czech)\n\n\n== Media ==\nAbendzeitung, Munich, Germany, 24 July 1974 (German)\nZeitschrift für Direkte Demokratie, No. 4/1998 (German)\nThe Times, London, UK, 9 April 2001\nAl-Ahram Weekly, Cairo, Egypt, 21-27 March 2002\nReformatorisch Dagblad, Apeldoorn, Netherlands, 14 June 2003 (Dutch)\nMorgunblađiđ, Reykjavík, Iceland, 18 August 2003 (Icelandic)\nAfriqia al-jadidah, Tripoli, Libya, September 2003 (Arabic)\nFrontline. India's National Magazine, Vol. 21, Issue 05, Feb. 28 - March 12, 2004\nCumhuriyet, Istanbul, Turkey, 29 April 2004 (Turkish)\nManila Bulletin, Manila, Philippines, 28 September 2004\nGlobal Policy Forum, New York, USA, 2 April 2005\nUniversity of Hong Kong, Centre for Comparative and Public Law, Hong Kong, P. R. China, 23 May 2005\nThe Hindu. India's National Newspaper, 10 January 2006\nScotland on Sunday, Edinburgh, 5 March 2006\nBaztab, Tehran, Iran, 19 September 2006 (in Persian)\nChinese Journal of International Law, Vol. 6/2, 10 June 2007\nThe Scotsman, Edinburgh, 7 July 2007\nUniversity of Innsbruck, Austria, 29 October 2007 (German)\nMaghreb Canada Express, Montreal, Vol. 6, No. 6, June 2008 (French)\nLe Matin, Casablanca, Morocco, 11 February 2009 (French)\nDeutsche Welle - World, Berlin, Germany, 13 July 2009\nMainstream Weekly, New Delhi, India, 12 June 2010\nBBC News, 22 July 2010\nEURASIA, Rome, Italy, 4 September 2011\nMail & Guardian, Johannesburg, South Africa, 4 July 2012\nManila Standard Today, Manila, Philippines, 15 August 2012\n\n\n== See also ==\nHans Köchler's Lockerbie trial observer mission\nGlobal Justice or Global Revenge?\n\n\n== References ==\n\n\n== External links ==\nHans Köchler web site\nHans Köchler's faculty page at the University of Innsbruck\nHans Köchler at the World Public Forum \"Dialogue of Civilizations\"\nHans Köchler's observer mission at the Lockerbie trial in the Netherlands", "ns": 0, "pageid": 3810935, "title": "Hans Köchler"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}