{"batchcomplete": "", "query": {"normalized": [{"to": "Har Dayal", "from": "Har_Dayal"}], "pages": {"30861365": {"extract": "Lala Har Dayal (in Punjabi ਲਾਲਾ ਹਰਦਿਆਲ; born 14 October 1884, Delhi, India – died 4 March 1939, Philadelphia, Pennsylvania) was an Indian nationalist revolutionary who founded the Ghadar Party in America. He was a polymath who turned down a career in the Indian Civil Service. His simple living and intellectual acumen inspired many expatriate Indians living in Canada and the USA to fight against British Imperialism during the First World War.\n\n\n== Biography ==\n\n\n=== Early years ===\nHe was born as a Dalit. At an early age he was influenced by Arya Samaj. He was associated with Shyam Krishnavarma, Vinayak Damodar Savarkar and Bhikaji Cama. He also drew inspiration from Giuseppe Mazzini, Karl Marx and Mikhail Bakunin. He was, according to Emily Brown as quoted by Juergensmeyer, \"in sequence an atheist, a revolutionary, a Buddhist, and a pacifist\".\n\nHe studied at the Cambridge Mission School and received his bachelor's degree in Sanskrit from St. Stephen's College, Delhi, India and his master's degree also in Sanskrit from Punjab University. In 1905, he received two scholarships of Oxford University for his higher studies in Sanskrit: (Boden Scholarship, 1907 and Casberd Exhibitioner, and award from St John's College, where he was studying. In a letter to The Indian Sociologist, published in 1907, he started to explore anarchist ideas, arguing that \"our object is not to reform government, but to reform it's [sic?] away, leaving, if necessary only nominal traces of it's [sic?] existence.\" The letter led to him being put under surveillance by the police. Later that year, saying \"To Hell with the ICS\", he gave up the prestigious Oxford scholarships and returned to India in 1908 to live a life of austerity. But in India too, he started writing harsh articles in the leading news papers, When the British Government decided to impose a ban upon his writing Lala Lajpat Rai advised him to leave and go abroad. It was during this period that he came into the friendship of the anarchist Guy Aldred, who was put on trial for printing The Indian Sociologist.\n\nHe moved to Paris in 1909 and became editor of the Vande Mataram. But he was not very happy in Paris, so he left the Paris and moved to Algeria. There too, he was unhappy and wondering whether to go- either to Cuba or Japan. After all he went to Martinique, where he started living a life of austerity. An Arya Samaj Missionary, Bhai Parmanand went there to look for him, and found him lonely and isolated. The two discussed founding a new religion modelled on Buddhism. Har Dayal was living an ascetic life eating only boiled grain and potatoes, sleeping on the floor and meditating in a secluded place. Guy Aldred later related that this religion's motto was to be Atheism, Cosmopolitanism and moral law. Emily Brown and Erik Erikson have described this as a crisis of \"ego-identity\" for him. Parmanand says that Har Dayal agreed to go to the United States to propagate the ancient culture of the Aryan Race.\n\nHardayal went straight from Boston to California, where he wrote an idyllic account of life in the United States. He then moved on to Honolulu in Hawaii where he spent some time meditating on Waikiki Beach. During his stay he made friends with Japanese Buddhists. He also started studying the works of Karl Marx. Whilst here he wrote Some Phases of Contemporary Thought in India subsequently published in Modern Review. Parmanand persuaded him by letter to return to California.\n\n\n=== Anarchist activism in America ===\n\nHe moved to the United States in 1911, where he became involved in industrial unionism. He had also served as secretary of the San Francisco branch of the Industrial Workers of the World alongside Fritz Wolffheim, (later a National Bolshevik after he had left IWW and joined the Communist Workers Party of Germany). In a statement outlining the principles of the Fraternity of the Red Flag he said they proposed \"the establishment of Communism, and the abolition of private property in land and capital through industrial organisation and the general strike, ultimate abolition of the coercive organisation of government\". A little over a year later, this group was given 6 acres (24,000 m2) of land and a house in Oakland, where he founded the Bakunin Institute of California, which he described as \"the first monastery of anarchism\". The organisation aligned itself with the Regeneración movement founded by the exiled Mexicans Ricardo and Enrique Flores Magón. He had a designated post of a lecturer in Indian philosophy and Sanskrit at Leland Stanford University. However, he was forced to resign because of embarrassment about his activities in the anarchist movement.\nHe had developed contacts with Indian American farmers in Stockton, California. Having developed an Indian Nationalist perspective, he encouraged young Indians to gain a scientific and sociological education. With the personal help of Teja Singh, Tarak Nath Das and Arthur Pope and funding from Jwala Singh, a rich farmer from Stockton, he set up Guru Govind Singh Sahib Educational Scholarship for Indian students. With Shyamji Krishna Verma's India House in London, he established his house as a home for these students. Amongst the six students who responded to the offer were Nand Singh Sehra, Darisi Chenchiah and Gobind Behari Lal, his wife's cousin. They lived together in a rented apartment close to the University of California, Berkeley.\n\n\n=== Assassination attempt on Viceroy of India ===\n\nAt the time, he was still a vigorous anarchist propagandist and had very little to do with the nationalist Nalanda Club, composed of Indian students. However Basanta Kumar Biswas's attempt on the life of the Indian Viceroy, Lord Hardinge, on 23 December 1912 had a major impact upon him. He visited the Nalanda Club Hostel to tell them this news at dinner. He delivered a rousing lecture, which ended with the following couplet of the Urdu poet Mir Taqi 'Mir' of Delhi (India):\n\n\"Pagari apani sambhaliyega 'Mir' !\nAur basti nahin, ye Dilli hai !!\"\n\n\"Take care of your turban Mr Mir ! (Note: Here Mir is Quoted for Britishers.)\nThis is not just any town, this is Delhi, India Okay !!'\n\nThe hostel then became a party with dancing and the singing of Vande Mataram. Hardayal excitedly told his anarchist friends of what one of his men had done in India.\nHe quickly brought out a pamphlet called the Yugantar Circular in which he eulogised about the bombing:\n\nHAIL ! HAIL ! HAIL !\nBOMB OF 23 DECEMBER 1912\nHARBINGER OF HOPE AND COURAGE\nDEAR REAWAKENER OF SLUMBERING SOULS\nCONCENTRATED MORAL DYNAMITE\nTHE ESPERANTO OF REVOLUTION\n“Who can describe the moral power of the bomb? It is concentrated moral dynamite. When the strong and cunning in the pride of their power parade their glory before their helpless victims, when the rich and naughty set themselves on a pedestal and ask their slaves to fall down before them and worship them, when the wicked ones on the Earth seem exalted to the sky and nothing appears to withstand their might, then in that dark hour, for the glory of humanity comes the bomb, which lays the tyrant in the dust. It tells all the cowering slaves that he who sits enthroned as God, is a mere man like them. Then, in that hour of shame, a bomb preaches the eternal truth of human equality and sends proud superiors and Viceroys from the palace and the howdah to the grave and the hospital. Then, in that tense moment, when human nature is ashamed of itself, the bomb declares the vanity of power and pomp and redeems us from our own baseness. HOW GREAT WE FEEL WHEN SOMEONE DOES THE HEROIC DEED? WE SHARE IN HIS MORAL POWER. WE REJOICE IN HIS ASSERTION OF HUMAN EQUALITY AND DIGNITY.\"\n\nIn April 1914, he was arrested by the United States government for spreading anarchist literature and fled to Berlin, Germany. He subsequently lived for a decade in Sweden. He received his Ph.D. degree in 1930 from the School of Oriental and African Studies at the University of London. In 1932, he got his book Hints For Self Culture published and embarked on a lecture circuit covering Europe, India, and the United States.\nHe died in Philadelphia on March 4, 1939. In the evening of his death he delivered a lecture as usual where he had said \"I am in peace with all\". But a very close friend of Lala Hardayal and the founder member of Bharat Mata Society (established in 1907), Lala Hanumant Sahai did not accept the death as natural, he suspected it as poisoning.\nIn 1987, the India Department of Posts issued a commemorative stamp in his honour, within the series of \"India's Struggle for Freedom\".\n\n\n== Literature of Lala Har Dayal ==\nSome of his books with available references are listed hereunder:\nOur Educational Problem: Collection of Lalaji's articles published in 'Punjabi'(published from Lahore) published as a book in 1922 with introduction from Lala Lajpat Rai\nThoughts on Education: Lalaji had written so many articles in 'Punjabi'( published from Lahore) and 'Modern Review' (published from Calcutta). Most of these articles were written against the Education Policy of British Government in India. Mr Hem Chand Kaushik Alias Varadachari Pandit had given to this author this book which he had published in July 1969.\nSocial Conquest of Hindu Race: A booklet containing 21 pages was proscribed by British Raj is kept in National Archives of India under Acc.No.74. (Ref:Patriotic s Banned by the Raj)\nWritings of Lala Har Dayal: This book was published in 1920 by Swaraj Publishing House,Varanasi. as per details given in the book of Dr. Vishwa Nath Prasad Verma's book 'Adhunik Bhartiya Rajneetik Chintan' on page 389.\nForty Four Months in Germany and Turkey: This book was published in 1920 by P.S.King and Sons. London when Lalaji was living in Sweden. Ganesh Shankar Vidyarthy has quoted so many references of this book into his book Kranti Ka Udghosh.\nLala Har Dayal Ji Ke Swadhin Vichar: This book was translated in Hindi by Sri Narayan Prasad Arora and was published in Raghunandan Press, Kanpur by Pt. Ganga Narayan Shukla in 1922. It can be seen in Seth Surajmal Jalan Library, Calcutta.\nAmrit me Vish: This was the Hindi Translation of above book 'Thoughts on Education'. It was published by Lajpat Rai Prithviraj Sahni from Lohari Gate, Lahore in the year 1922. In the National Library, Calcutta under catalogue no 181.Rc.92.33.\nHints for Self Culture: This famous book of Lala Har Dayal was published by Hy.S.L.Polak and Co. London (U.K) in 1934. Jaico Publishing House published it in 1977 from Bombay by obtaining a copyright from its original publisher in 1961. Its Hindi Translalation has also been published from Kitab Ghar, Delhi (India) in 1997 under the title 'Vyaktitva Vikas-Sangharsh aur Safalata'.\nGlimpses of World Religions: It was the presentation of several religions by Lala Har Dayal from so many angles of history, ethics, theology and religious philosophy. It reflects the individuality of every religion in a rational way of thinking. This book was also published by Jaico Publishing House India from Bombay.\nBodhisatva Doctrines: Lala Lajpat Rai, who was a mentor of Har Dayal, had suggested him to write an authentic book based on the principles of Gautam Buddha. In 1927 when Har Dayal was not given permission by British Government to return to India, he decided to remain in London. He wrote this book and presented it to the University as a thesis. The book was approved for Ph.D. and a Doctorate was awarded to him in 1932. It was published from London in the year 1932. Motilal Banarsidass Publishers of India published this book in 1970 with a title 'The Bodhisatva Doctrines in Buddhist Sanskrit Literature.'\n\n\n=== The Bodhisattva Doctrines in Buddhist Sanskrit Literature ===\nThis 392 page work of Lala Hardayal consists of 7 chapters which deal with the Bodhisattva doctrine as expounded in the principal Buddhist Sanskrit Literature.\nIn Chapter I the nature of the Bodhisattva doctrine is described, with particular emphasis upon the distinct characteristics of arhat, Bodhisattva and sravaka.\nChapter II recounts the different factors which contributed to the rise and growth of the Boddhisattva doctrine including the influences of Persian religio-cult, Greek art and Christian ethics.\nIn Chapter III the production of the thought of Enlightenment for the welfare and liberation of all creatures is expounded.\nChapters IV describes thirty-seven practices and principles conducive to the attainment of Enlightenment.\nIn Chapter V ten perfections that lead to welfare, rebirth, serenity, spiritual cultivation, and supreme knowledge are explained.\nChapter VI defines different stages of spiritual progress in the aspirant`s long journey to the goal of final emancipation.\nThe last Chapter VII relates the events of the Gautama Buddha`s past lives as Bodhisattva.\nThis book contains comprehensive notes and references besides a general index appended at the end. This book has been written in a particularly lucid style which exhibits scholarly acumen and the mastery of Lala Hardayal in literary art.\n\n\n== Appreciations ==\nAccording to Swami Rama Tirtha Lala Har Dayal was the greatest Hindu who ever came to America, a great sage and saint, whose life mirrored the highest spirituality as his soul reflected the love of the 'Universal Spirit' whom he tried to realise.\nIn another appreciation Prof. Dharmavira has sketched the picture of Lala Har Dayal which is being quoted here in verbatim:\n\nHar Dayal dedicated his whole life to the sacred cause of the mother land. Surely from such a person alone could one ask: \"Good Master, what shall I do to inhirit eternal life?\" Let us drink deep at this spring and wax glad and strong and brave in every nerve and fibre of our being. He was one of the race of those who wrote the New Era in blood. His course was laborious, truthful, simple, independent, noble; and all these in an eminent degree. His experience of the inward and the outward battle was not inconsiderable and it was not confined to his early manhood, but was spread over his whole life. Lala Har Dayal had the Janak and Dadhichi touch and his life demonstrated that he had what it takes.\n\n\n== Footnotes ==\n\n\n== References ==\nGhadar Movement: Ideology, Organisation and Strategy by Harish K. Puri, Guru Nanak Dev University Press, 1983\nHar Dayal: Hindu Revolutionary and Rationalist by Emily C. Brown, The University of Arizona Press, 1975\nHar Dayal: Hindu Revolutionary and Rationalist, review by Mark Juergensmeyer. The Journal of Asian Studies, 1976\nThe Bodhisattva Doctrine in Buddhist Sanskrit Literature by Har Dayal, 1932; Motilal Banarsidass Publishers, 1970\nPandit Vardachari Thoughts On Education by L. Har Dayal 1969 New Dehi-110024 India Vivek Swadhyay Mandal.\n\n\n== External links ==\nOur Educational Problem - collection of Lala Har Dayal's articles published in Punjabi (published from Lahore)\nForty-four months in Germany and Turkey - digital archive at archive.org\nA tribute to the great revolutionary – an article by Khushwant Singh\nHar Dayal materials in the South Asian American Digital Archive (SAADA)\nYogendra Bali, Understanding revolutionary idol Lala Hardayal\nhttp://www.indianpost.com/viewstamp.php/Serial%20Number/1231/LALA%20HARDAYAL", "ns": 0, "pageid": 30861365, "title": "Har Dayal"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}