{"batchcomplete": "", "query": {"normalized": [{"to": "Harold Bloom", "from": "Harold_Bloom"}], "pages": {"26255613": {"extract": "Harold Bloom (born July 11, 1930) is an American literary critic and Sterling Professor of Humanities at Yale University. Since the publication of his first book in 1959, Bloom has written more than 20 books of literary criticism, several books discussing religion, and a novel. He has edited hundreds of anthologies concerning numerous literary and philosophical figures for the Chelsea House publishing firm. Bloom's books have been translated into more than 40 languages.\nBloom came to public attention in the United States as a commentator during the Canon wars of the early 1990s.\n\n\n== Early life ==\nBloom was born in New York City, the son of Paula (Lev) and William Bloom. He lived in the South Bronx at 1410 Grand Concourse. He was raised as an Orthodox Jew in a Yiddish-speaking household, where he learned literary Hebrew; he taught himself English at the age of six. Bloom's father, a garment worker, was born in Odessa and his mother, a homemaker, near Brest Litovsk. Harold had three older sisters and an older brother of whom he is the sole survivor.\nAs a boy, Bloom read Hart Crane's Collected Poems, a collection that inspired his lifelong fascination with poetry. Bloom received a B.A. from Cornell in 1951, where he was a student of English literary critic M.H. Abrams, and a PhD from Yale in 1955. Bloom was a standout student at Yale, where he clashed with the faculty of New Critics including William K. Wimsatt. Several years later, Bloom dedicated his first major book, The Anxiety of Influence, to Wimsatt.\n\n\n== Teaching career ==\nBloom has been a member of the Yale English Department since 1955. He received a MacArthur Fellowship in 1985. From 1988 to 2004, Bloom was Berg Professor of English at New York University while maintaining his position at Yale. In 2010, he became a founding patron of Ralston College, a new institution in Savannah, Georgia, that focuses on primary texts.\n\n\n== Personal life ==\nBloom married Jeanne Gould in 1958. In a 2005 interview his wife said that she regarded him and herself as both atheists while he denied being an atheist saying \"No, no I'm not an atheist. It's no fun being an atheist.\"\n\n\n== Writing career ==\n\n\n=== Defense of Romanticism ===\nBloom began his career by defending the reputations of the High Romantics through a sequence of highly regarded monographs beginning with his Doctoral Dissertation on Percy Bysshe Shelley, (Shelley's Myth-making, Yale University Press), W. B. Yeats, (Yeats, Oxford University Press), and Wallace Stevens, (Wallace Stevens: The Poems of Our Climate, Cornell University Press) against neo-Christian critics influenced by such writers as T. S. Eliot, who became a recurring intellectual foil. He had a contentious approach: his first book, Shelley's Myth-making, charged many contemporary critics with sheer carelessness in their reading of Shelley.\n\n\n=== Influence theory ===\nAfter a personal crisis in the late sixties, Bloom became deeply interested in Emerson, Sigmund Freud, and the ancient mystic traditions of Gnosticism, Kabbalah, and Hermeticism. In a 2003 interview with Bloom, Michael Pakenham, the book editor for The Baltimore Sun, writes that Bloom has long referred to himself as a \"Jewish Gnostic\". Bloom explains: \"I am using Gnostic in a very broad way. I am nothing if not Jewish... I really am a product of Yiddish culture. But I can't understand a Yahweh, or a God, who could be all-powerful and all knowing and would allow the Nazi death camps and schizophrenia.\" Influenced by his reading, he began a series of books that focused on the way in which poets struggled to create their own individual poetic visions without being overcome by the influence of the previous poets who inspired them to write.\nThe first of these books, Yeats, a magisterial examination of the poet, challenged the conventional critical view of his poetic career. In the introduction to this volume, Bloom set out the basic principles of his new approach to criticism: \"Poetic influence, as I conceive it, is a variety of melancholy or the anxiety-principle.\" A new poet becomes inspired to write because he has read and admired the poetry of previous poets; but this admiration turns into resentment when the new poet discovers that these poets whom he idolized have already said everything he wishes to say. The poet becomes disappointed because he \"cannot be Adam early in the morning. There have been too many Adams, and they have named everything.\"\nIn order to evade this psychological obstacle, the new poet must convince himself that previous poets have gone wrong somewhere and failed in their vision, thus leaving open the possibility that he may have something to add to the tradition after all. The new poet's love for his heroes turns into antagonism towards them: \"Initial love for the precursor's poetry is transformed rapidly enough into revisionary strife, without which individuation is not possible.\" The book that followed Yeats, The Anxiety of Influence, which Bloom had started writing in 1967, drew upon the example of Walter Jackson Bate's The Burden of the Past and The English Poet and recast in systematic psychoanalytic form Bate's historicized account of the despair felt by seventeenth- and eighteenth-century poets about their ability to match the achievements of their predecessors. Bloom attempted to trace the psychological process by which a poet broke free from his precursors to achieve his own poetic vision. He drew a sharp distinction between \"strong poets\" who perform \"strong misreadings\" of their precursors, and \"weak poets\" who simply repeat the ideas of their precursors as though following a kind of doctrine. He described this process in terms of a sequence of \"revisionary ratios,\" through which each strong poet passes in the course of his career. A Map of Misreading picked up where The Anxiety of Influence left off, making several adjustments to Bloom's system of revisionary ratios. Kabbalah and Criticism attempted to invoke the esoteric interpretive system of the Lurianic Kabbalah, as explicated by scholar Gershom Scholem, as an alternate system of mapping the path of poetic influence. Figures of Capable Imagination collected odd pieces Bloom had written in the process of composing his 'influence' books. He capped off this period of intense creativity with another monograph, a full-length study of Wallace Stevens, with whom he identified more than any other poet at this stage of his career, as he told an interviewer in the early 1980s.\nBloom continued to write about influence theory throughout the seventies and eighties, and he has written little since that does not invoke his ideas about influence.\n\n\n=== Novel experiment ===\nBloom's fascination with the fantasy novel A Voyage to Arcturus by David Lindsay led him to take a brief break from criticism in order to compose a sequel to Lindsay's novel. This novel, The Flight to Lucifer, remains Bloom's only work of fiction. Though reviews were very positive, he soon disowned this book. He believed his self-consciousness weighed it down too heavily. He has said that he would remove every copy of the book from every library if he could.\n\n\n=== Religious criticism ===\nBloom then entered a phase of what he called \"religious criticism\", beginning in 1989 with Ruin the Sacred Truths: Poetry and Belief from the Bible to the Present.\nIn The Book of J (1990), he and David Rosenberg (who translated the Biblical texts) portrayed one of the posited ancient documents that formed the basis of the first five books of the bible (see documentary hypothesis) as the work of a great literary artist who had no intention of composing a dogmatically religious work (see Jahwist). They further envisaged this anonymous writer as a woman attached to the court of the successors of the Israelite kings David and Solomon—a piece of speculation which drew much attention. Later, Bloom said that the speculations didn't go far enough, and perhaps he should have identified J with the Biblical Bathsheba. In Jesus and Yahweh: The Names Divine (2004), he revisits some of the territory he covered in The Book of J in discussing the significance of Yahweh and Jesus of Nazareth as literary characters, while casting a critical eye on historical approaches and asserting the fundamental incompatibility of Christianity and Judaism.\nIn The American Religion (1992), Bloom surveyed the major varieties of Protestant and post-Protestant religious faiths that originated in the United States and argued that, in terms of their psychological hold on their adherents, most shared more in common with gnosticism than with historical Christianity. The exception was the Jehovah's Witnesses, whom Bloom regards as non-Gnostic. He elsewhere predicted that the Mormon and Pentecostal strains of American Christianity would overtake mainstream Protestant divisions in popularity in the next few decades. In Omens of Millennium (1996), Bloom identifies these American religious elements as on the periphery of an old – and not inherently Christian – gnostic, religious tradition which invokes a complex of ideas and experiences concerning angelology, interpretation of dreams as prophecy, near-death experiences, and millennialism.\nIn his essay in The Gospel of Thomas, Bloom states that none of Thomas' Aramaic sayings have survived to this day in the original language. Marvin Meyer generally agreed and further confirmed that the earlier versions of that text were likely written in either Aramaic or Greek. Meyer ends his introduction with an endorsement of much of Bloom's essay. Bloom notes the other-worldliness of the Jesus in the Thomas sayings by making reference to \"the paradox also of the American Jesus.\"\n\n\n=== The Western Canon ===\nIn 1994, Bloom published The Western Canon, a survey of the major literary works of Europe and the Americas since the 14th century, focusing on 26 works he considered sublime and representative of their nations and of the Western canon. Besides analyses of the canon's various representative works, the major concern of the volume is reclaiming literature from those he refers to as the \"School of resentment\", the mostly academic critics who espouse a social purpose in reading. Bloom believes that the goals of reading must be solitary aesthetic pleasure and self-insight rather than the goal held by \"forces of resentment\" of improving one's society, which he casts as an absurd aim, writing: \"The idea that you benefit the insulted and injured by reading someone of their own origins rather than reading Shakespeare is one of the oddest illusions ever promoted by or in our schools.\" His position is that politics have no place in literary criticism: a feminist or Marxist reading of Hamlet would tell us something about feminism and Marxism, he says, but probably nothing about Hamlet itself.\nIn addition to considering how much influence a writer has had on later writers, Bloom proposed the concept of \"canonical strangeness\" (cf. uncanny) as a benchmark of a literary work's merit. The Western Canon also included a list—which aroused more widespread interest than anything else in the volume—of all the Western works from antiquity to the present that Bloom considered either permanent members of the canon of literary classics, or (among more recent works) candidates for that status. Bloom has said that he made the list off the top of his head at his editor's request, and that he does not stand by it.\n\n\n=== Work on Shakespeare ===\nBloom has a deep appreciation for Shakespeare and considers him to be the supreme center of the Western Canon. The first edition of The Anxiety of Influence almost completely avoided Shakespeare, whom Bloom considered, at the time, barely touched by the psychological drama of anxiety. The second edition, published in 1997, adds a long preface that mostly expounds on Shakespeare's debt to Ovid and Chaucer, and his agon with his contemporary Christopher Marlowe, who set the stage for him by breaking free of ecclesiastical and moralizing overtones.\nIn his 1998 survey, Shakespeare: The Invention of the Human, Bloom provides an analysis of each of Shakespeare's 38 plays, \"twenty-four of which are masterpieces.\" Written as a companion to the general reader and theatergoer, Bloom declares that bardolatry \"ought to be even more a secular religion than it already is.\" He also contends in the work (as in the title) that Shakespeare \"invented\" humanity, in that he prescribed the now-common practice of \"overhearing\" ourselves, which drives our changes. The two paragons of his theory are Sir John Falstaff of Henry IV and Hamlet, whom Bloom sees as representing self-satisfaction and self-loathing, respectively. Throughout Shakespeare, characters from disparate plays are imagined alongside and interacting with each other; this has been decried by numerous contemporary academics and critics as hearkening back to the out of fashion character criticism of A.C. Bradley and others, who happen to gather explicit praise in the book. As in The Western Canon, Bloom criticizes what he calls the \"School of Resentment\" for its failure to live up to the challenge of Shakespeare's universality and instead balkanizing the study of literature through various multicultural and historicist departments. Asserting Shakespeare's singular popularity throughout the world, Bloom proclaims him as the only multicultural author, and rather than the \"social energies\" historicists ascribe Shakespeare's authorship to, Bloom pronounces his modern academic foes – and indeed, all of society – to be \"a parody of Shakespearian energies.\"\n\n\n=== 2000s ===\nHarold Bloom consolidated his work on the western canon with the publication of How to Read and Why in 2000 and Genius: A Mosaic of One Hundred Exemplary Creative Minds in 2003. In the same year, Hamlet: Poem Unlimited was published, an amendment to Shakespeare: Invention of the Human written after he decided the chapter on Hamlet in that earlier book had been too focused on the textual question of the Ur-Hamlet to cover his most central thoughts on the play itself. Some elements of religious criticism were combined with his secular criticism in Where Shall Wisdom Be Found (2004), and a more complete return to religious criticism was marked by the publication of Jesus and Yahweh: The Names Divine in 2005. Throughout the decade he also compiled, edited and introduced several major anthologies of poetry.\nIn 2006, Bloom took part in the documentary, the Apparition of the Eternal Church, made by Paul Festa. This documentary centered on many individuals's reactions to hearing, for the first time, the renowned piece for organ, the Apparition de l'église éternelle, of Olivier Messiaen.\nBloom began a book under the working title of Living Labyrinth, centering on Shakespeare and Whitman, which was published in 2011 as The Anatomy of Influence: Literature as a Way of Life.\nIn July 2011, after the publication of The Anatomy of Influence and after finishing work on The Shadow of a Great Rock, Bloom was working on three further projects:\nAchievement in the Evening Land from Emerson to Faulkner, a history of American literature following the canonical model, which ultimately developed into his 2015 book The Daemon Knows: Literary Greatness and the American Sublime.\nThe Hum of Thoughts Evaded in the Mind: A Literary Memoir.\na play with the working title Walt Whitman: A Musical Pageant. By November 2011, Bloom had changed the title of the play to To You Whoever You Are: A Pageant Celebrating Walt Whitman.\n\n\n== Influence ==\nBloom credits Northrop Frye as his nearest precursor. He told Imre Salusinszky in 1986: \"In terms of my own theorizations ... the precursor proper has to be Northrop Frye. I purchased and read Fearful Symmetry a week or two after it had come out and reached the bookstore in Ithaca, New York. It ravished my heart away. I have tried to find an alternative father in Mr. Kenneth Burke, who is a charming fellow and a very powerful critic, but I don't come from Burke, I come out of Frye.\" However, he also admits an indebtedness, especially in his later period, to earlier critics such as William Hazlitt, Ralph Waldo Emerson, Walter Pater, A. C. Bradley, and Samuel Johnson, whom he acknowledges in The Western Canon as \"unmatched by any critic in any nation before or after him\". In his 2012 Foreword to the book The Fourth Dimension of a Poem (WW Norton, 2012), Bloom indicated the influence which M. H. Abrams had upon him in his years at Cornell University.\nBloom's theory of poetic influence regards the development of Western literature as a process of borrowing and misreading. Writers find their creative inspiration in previous writers and begin by imitating those writers in order to develop a poetic voice of their own; however, they must make their own work different from that of their precursors. As a result, Bloom argues, authors of real power must inevitably \"misread\" their precursors' works in order to make room for fresh imaginings.\nObservers often identified Bloom with deconstruction in the past, but he himself never admitted to sharing more than a few ideas with the deconstructionists. He told Robert Moynihan in 1983, \"What I think I have in common with the school of deconstruction is the mode of negative thinking or negative awareness, in the technical, philosophical sense of the negative, but which comes to me through negative theology ... There is no escape, there is simply the given, and there is nothing that we can do.\"\nBloom's association with the Western canon has provoked a substantial interest in his opinion concerning the relative importance of contemporary writers. In the late 1980s, Bloom told an interviewer: \"Probably the most powerful living Western writer is Samuel Beckett. He's certainly the most authentic.\"\nAfter Beckett's death in 1989, Bloom has pointed towards other authors as the new main figures of the Western literary canon.\nConcerning British writers: \"Geoffrey Hill is the strongest British poet now active\", and \"no other contemporary British novelist seems to me to be of Iris Murdoch's eminence\". Since Murdoch's death, Bloom has expressed admiration for novelists such as Peter Ackroyd, Will Self, John Banville, and A. S. Byatt.\nIn his 2003 book, Genius: A Mosaic of One Hundred Exemplary Creative Minds, he named the late Portuguese writer and Nobel Prize winner José Saramago as \"the most gifted novelist alive in the world today\", and as \"one of the last titans of an expiring literary genre\".\nOf American novelists, he declared in 2003 that \"there are four living American novelists I know of who are still at work and who deserve our praise\". He claimed that \"they write the Style of our Age, each has composed canonical works,\" and he identified them as Thomas Pynchon, Philip Roth, Cormac McCarthy, and Don DeLillo. He named their strongest works as, respectively, Gravity's Rainbow, The Crying of Lot 49 and Mason & Dixon; American Pastoral and Sabbath's Theater; Blood Meridian; and Underworld. He has added to this estimate the work of John Crowley, with special interest in his Aegypt Sequence and novel Little, Big saying that \"only a handful of living writers in English can equal him as a stylist, and most of them are poets ... only Philip Roth consistently writes on Crowley's level\".\nIn Kabbalah and Criticism (1975), Bloom identified Robert Penn Warren, James Merrill, John Ashbery, and Elizabeth Bishop as the most important living American poets. By the 1990s, he regularly named A.R. Ammons along with Ashbery and Merrill, and he has lately come to identify Henri Cole as the crucial American poet of the generation following those three. He has expressed great admiration for the Canadian poets Anne Carson, particularly her verse novel Autobiography of Red, and A. F. Moritz, whom Bloom calls \"a true poet.\" Bloom also lists Jay Wright as one of only a handful of major living poets.\nBloom's introduction to Modern Critical Interpretations: Thomas Pynchon (1987) features his canon of the \"twentieth-century American Sublime\", the greatest works of American art produced in the 20th century. Playwright Tony Kushner sees Bloom as an important influence on his work.\n\n\n== Reception, criticism and controversy ==\nFor many years, indeed decades, Bloom's writings have been able to effectively polarize opinion, among even established literary scholars. Bloom has been called \"probably the most celebrated literary critic in the United States\" and \"America's best-known man of letters\". A New York Times article in 1994 noted that many younger critics understand Bloom as an \"outdated oddity.\"\nJames Wood has described Bloom as \"Vatic, repetitious, imprecisely reverential, though never without a peculiar charm of his own—a kind of campiness, in fact—Bloom as a literary critic in the last few years has been largely unimportant.\" Bloom responded to questions about Wood in an interview by saying: \"There are period pieces in criticism as there are period pieces in the novel and in poetry. The wind blows and they will go away ... There's nothing to the man ... I don't want to talk about him\".\nIn the early 21st century, Bloom has often found himself at the center of literary controversy after criticizing popular writers such as Adrienne Rich, Maya Angelou, Stephen King, David Foster Wallace, and J. K. Rowling. In the pages of the Paris Review, he criticized the populist-leaning poetry slam, saying: \"It is the death of art.\" When Doris Lessing was awarded the Nobel Prize in Literature, he bemoaned the \"pure political correctness\" of the award to an author of \"fourth-rate science fiction.\"\nIn 2004 author Naomi Wolf wrote an article for New York Magazine accusing Harold Bloom of a sexual \"encroachment\" more than two decades earlier, by touching her thigh. She said that what she alleged Bloom did was not harassment, either legally or emotionally, and she did not think herself a \"victim\", but that she had harbored this secret for 21 years. Explaining why she had finally gone public with the charges, Wolf wrote, \"I began, nearly a year ago, to try—privately—to start a conversation with my alma mater that would reassure me that steps had been taken in the ensuing years to ensure that unwanted sexual advances of this sort weren't still occurring. I expected Yale to be responsive. After nine months and many calls and e-mails, I was shocked to conclude that the atmosphere of collusion that had helped to keep me quiet twenty years ago was still intact—as secretive as a Masonic lodge.\" When asked about the allegations in 2015, Bloom stated, \"I refuse to even use the name of this person. I call her Dracula's daughter, because her father was a Dracula scholar. I have never in my life been indoors with Dracula's daughter. When she came to the door of my house unbidden, my youngest son turned her away. Once, I was walking up to campus, and she fell in with me and said, 'May I walk with you, Professor Bloom?' I said nothing.\"\nMormonVoices, a group associated with Foundation for Apologetic Information & Research, included Bloom on its Top Ten Anti-Mormon Statements of 2011 list for stating \"The current head of the Mormon Church, Thomas S. Monson, known to his followers as 'prophet, seer and revelator,' is indistinguishable from the secular plutocratic oligarchs who exercise power in our supposed democracy\".\n\n\n== Selected bibliography ==\n\n\n=== Books ===\n\n\n=== Articles ===\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== Further reading ==\n\n\n== External links ==\nOfficial website at Yale University\nHarold Bloom on Charlie Rose\nAppearances on C-SPAN\nEpstein, Joseph I. (May 4, 2003). \"In Depth with Harold Bloom\". Interview. C-SPAN. \n\nWorks by or about Harold Bloom in libraries (WorldCat catalog)\n\"Harold Bloom collected news and commentary\". The New York Times. \nHarold Bloom at Stanford Presidential Lectures\nLamb, Brian (Sep 3, 2000). \"How to Read and Why\". Interview. Booknotes. \nOventile, Robert Savino (Aug 8, 2015). \"Anarchic Transports: A Review of Harold Bloom's The Daemon Knows: Literary Greatness and the American Sublime\". Review. Sobriquet Magazine.", "ns": 0, "pageid": 26255613, "title": "Harold Bloom"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}