{"batchcomplete": "", "query": {"normalized": [{"to": "Harriet Taylor Mill", "from": "Harriet_Taylor_Mill"}], "pages": {"965591": {"extract": "Harriet Taylor Mill (née Hardy; London, 8 October 1807 – Avignon, 3 November 1858) was a British philosopher and women's rights advocate. Her extant corpus of writing can be found in The Complete Works of Harriet Taylor Mill. She is largely remembered for her influence upon her second husband, John Stuart Mill, one of the pre-eminent thinkers of the 19th century.\n\n\n== Premarital relationship with Mill ==\nTaylor was attracted to Mill, who treated her as an intellectual equal and collaborated with her on many of the texts published under his name. Mill was impressed with Taylor, asking her to read and comment on the latest book he was working on. The two became close friends.\nIn 1833 she lived in a separate residence from her husband, keeping her daughter with her while John Taylor raised the two older boys. John Taylor agreed to Harriet's friendship with Mill in exchange for the \"external formality\" of her residing \"as his wife in his house\". Over the next few years Harriet Taylor and John Stuart Mill exchanged essays on issues such as marriage and women's rights. The surviving essays reveal that Taylor held more radical views than Mill on these matters. Taylor was attracted to the socialist philosophy promoted by Robert Owen in books such as The Formation of Character (1813) and A New View of Society (1814). In her essays Taylor especially criticised the degrading effect of women's economic dependence upon men.\n\n\n== Marriage to Mill ==\nAfter John Taylor died in 1849, Taylor and Mill waited two years before marrying in 1851. Taylor was hesitant to create greater scandal than the pair already had. Mill's marriage proposal is a model of equality. She wrote a number of essays, including several on domestic violence and The Enfranchisement of Women, published in 1851. Many of her arguments in this piece would be developed in J. S. Mill's The Subjection of Women, published eleven years after her death, although The Subjection is much more conservative than Taylor's Enfranchisement.\n\n\n== Own work ==\nExcept for a few articles in the Unitarian journal Monthly Repository, Taylor published little of her own work during her lifetime. She did, however, read and comment on all the material produced by John Stuart Mill. In his autobiography, Mill claimed Harriet as the joint author of most of the books and articles published under his name. He added, \"when two persons have their thoughts and speculations completely in common it is of little consequence, in respect of the question of originality, which of them holds the pen.\" Together, they wrote \"Early Essays on Marriage and Divorce\", published in 1832. The debate about the nature and extent of her collaboration is ongoing.\nA letter written by Mill in 1854 suggests Taylor was reluctant to be described as joint author of Mill's books and articles; \"I shall never be satisfied unless you allow our best book, the book which is to come, to have our two names on the title page. It ought to be so with everything I publish, for the better half of it all is yours\". The reasons for her reluctance may include the likely response to a philosophical text published by Mill only or as a coauthored work.\nJ. S. Mill called her a valuable contributor to much of his work, especially On Liberty, which he later dedicated to her when it was published in 1859, a year after her death.\n\n\n== Death ==\nHarriet Taylor Mill died in the Hotel d'Europe in Avignon, France, on 3 November 1858 after developing severe lung congestion, possibly due to syphilis. Her daughter Helen Taylor, who would become a well-known feminist, completed the writing of The Subjection of Women with Mill.\nUpon her death, Mill wrote:\n\n\n== See also ==\nHistory of feminism\nList of suffragists and suffragettes\nWomen's suffrage in the United Kingdom\n\n\n== References ==\n\n\n== Further reading ==\nRossi, Alice S. (1970). Sentiment and Intellect: The Story of John Stuart Mill and Harriet Taylor Mill, in Rossi, Alice S. (Ed), Essays on Sex Equality. The University of Chicago Press.\n\n\n== External links ==\nhttp://harriettaylormill.com\nStanford Encyclopedia of Philosophy entry\nCatalogue of Harriet Taylor Mill's correspondence and other papers at the Archives Division of the London School of Economics.\nWorks by or about Harriet Taylor Mill in libraries (WorldCat catalog)", "ns": 0, "pageid": 965591, "title": "Harriet Taylor Mill"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}