{"batchcomplete": "", "query": {"normalized": [{"to": "Hartry Field", "from": "Hartry_Field"}], "pages": {"1535742": {"extract": "Hartry H. Field (born 1946) is an American philosopher. He is Silver Professor of Philosophy at New York University and notable contributor to philosophy of language, mind, and mathematics. He previously taught at Princeton University, the University of Southern California and The Graduate Center of the City University of New York. He earned his Ph.D. in philosophy from Harvard University under the direction of Hilary Putnam.\n\n\n== Biography ==\nHis first work was a commentary on Alfred Tarski's theory of truth, which he has worked on since 1972. His current view on this matter is in favor of a deflationary theory of truth. His most influential work produced in this period is probably \"Theory Change and the Indeterminacy of Reference\" (Journal of Philosophy, 70, 14: 462-481), in which he introduced the concept of partial denotation.\nIn the 1980s, Field started a project in the philosophy of mathematics discussing mathematical fictionalism, the doctrine that all mathematical statements are merely useful fictions, and shouldn't be taken to be literally true. More precisely, Field holds that the existence of sets may be denied, in opposition to Quine and Putnam.\nField is also Distinguished Research Professor in the Department of Philosophy, University of Birmingham, UK.\nMuch of his current work is in the semantic paradoxes. In 2008, he gave the John Locke Lectures, entitled \"Logic, Normativity, and Rational Revisability.\"\n\n\n== Books ==\nScience Without Numbers, Blackwell, 1980\nRealism, Mathematics and Modality, Blackwell, 1989\nTruth and the Absence of Fact, Oxford University Press 2001\nSaving Truth from Paradox, Oxford University Press, 2008\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nField, Hartry, Philosophy - New York University", "ns": 0, "pageid": 1535742, "title": "Hartry Field"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}