{"batchcomplete": "", "query": {"normalized": [{"to": "Haskell Curry", "from": "Haskell_Curry"}], "pages": {"42182": {"extract": "Haskell Brooks Curry (/ˈhæskəl ˈkɜːri/; September 12, 1900 – September 1, 1982) was an American mathematician and logician. Curry is best known for his work in combinatory logic; while the initial concept of combinatory logic was based on a single paper by Moses Schönfinkel, much of the development was done by Curry. Curry is also known for Curry's paradox and the Curry–Howard correspondence. There are three programming languages named after him, Haskell, Brook and Curry, as well as the concept of currying, a technique used for transforming functions in mathematics and computer science.\n\n\n== Life ==\nCurry was born on September 12, 1900, in Millis, Massachusetts, to Samuel Silas Curry and Anna Baright Curry, who ran a school for elocution. He entered Harvard University in 1916 to study medicine but switched to mathematics before graduating in 1920. After two years of graduate work in electrical engineering at MIT, he returned to Harvard to study physics, earning a MA in 1924. Curry's interest in mathematical logic started during this period when he was introduced to the Principia Mathematica, the attempt by Alfred North Whitehead and Bertrand Russell to ground mathematics in symbolic logic. Remaining at Harvard, Curry pursued a Ph.D. in mathematics. While he was directed by George Birkhoff to work on differential equations, his interests continued to shift to logic. In 1927, while an instructor at Princeton University, he discovered the work of Moses Schönfinkel in combinatory logic. Schönfinkel's work had anticipated much of Curry's own research, and as a consequence, he moved to Göttingen where he could work with Heinrich Behmann and Paul Bernays, who were familiar with Schönfinkel's work. Curry was supervised by David Hilbert and worked closely with Bernays, receiving a Ph.D. in 1930 with a dissertation on combinatory logic.\nIn 1928, before leaving for Göttingen, Curry married Mary Virginia Wheatley. The couple lived in Germany while Curry completed his dissertation, then, in 1929, moved to State College, Pennsylvania where Curry accepted a position at Pennsylvania State College. They had two children, Anne Wright Curry (July 27, 1930) and Robert Wheatley Curry (July 6, 1934). Curry remained at Penn State for the next 37 years. He spent one year at University of Chicago in 1931–32 under a National Research Fellowship and one year in 1938–39 at the Institute for Advanced Study in Princeton. In 1942 he took a leave of absence to do applied mathematics for the US government during World War II. Immediately after the war he worked on the ENIAC project, in 1945 and 1946. Under a Fulbright fellowship, he collaborated with Robert Feys in Louvain, Belgium. After retiring from Penn State in 1966, Curry accepted a position at the University of Amsterdam. In 1970, after finishing the second volume of his treatise on the combinatory logic, Curry retired from the University of Amsterdam and returned to State College, Pennsylvania.\nHaskell Curry died on September 1, 1982 in State College, Pennsylvania.\n\n\n== Work ==\nThe focus of Curry's work were attempts to show that combinatory logic could provide a foundation for mathematics. Towards the end of 1933, he learned of the Kleene–Rosser paradox from correspondence with John Rosser. The paradox, developed by Rosser and Stephen Kleene had proved the inconsistency of a number of related formal systems including one proposed by Alonzo Church (a system which had the lambda calculus as a consistent subsystem) and Curry's own system. However, unlike Church, Kleene, and Rosser, Curry did not give up on the foundational approach, saying that he did not want to \"run away from paradoxes.\"\nBy working in the area of Combinatory Logic for his entire career, Curry essentially became the founder and biggest name in the field. Combinatory logic is the foundation for one style of functional programming language. The power and scope of combinatory logic is quite similar to that of the lambda calculus of Church, and the latter formalism has tended to predominate in recent decades.\nIn 1947 Curry also described one of the first high-level programming languages and provided the first description of a procedure to convert a general arithmetic expression into a code for one-address computer. \nHe taught at Harvard, Princeton, and from 1929 to 1966, at the Pennsylvania State University. In 1942, he published Curry's paradox. In 1966 he became professor of mathematics at the Universiteit van Amsterdam.\nCurry also wrote and taught mathematical logic more generally; his teaching in this area culminated in his 1963 Foundations of Mathematical Logic. His preferred philosophy of mathematics was formalism (cf. his 1951 book), following his mentor Hilbert, but his writings betray substantial philosophical curiosity and a very open mind about intuitionistic logic.\n\n\n== Major publications ==\n\"Grundlagen der Kombinatorischen Logik\" [Foundations of combinatorial logic]. American Journal of Mathematics (in German). The Johns Hopkins University Press. 52 (3): 509–536. 1930. doi:10.2307/2370619. Retrieved 23 July 2012. \nA theory of formal deducibility. University of Notre Dame Press. 1950. A theory of formal deducibility (2nd ed.). University of Notre Dame Press. 1957. \n\nOutlines of a formalist philosophy of mathematics. Amsterdam: Elsevier Science. 1951. ISBN 0444533680. Retrieved 23 July 2012. \nLeçons de logique algébrique (in French). Paris: Gauthier-Villars. 1952. \nCurry, Haskell; Feys, Robert (1958). Combinatory Logic. I. Amsterdam: North-Holland Publishing Company. \nFoundations of Mathematical Logic. Mcgraw Hill. 1963. \nFoundations of mathematical logic (Unabridged and corrected Dover ed.). New York: Dover Publications. 1977. ISBN 0-486-63462-0. Retrieved 23 July 2012. \n\nCombinatory Logic. II. Amsterdam: North-Holland Publishing Company. 1972. ISBN 0720422086. \n\n\n== See also ==\nCurrying\nCurry's paradox\nFunctional programming\nLambda calculus\nCurry–Howard correspondence\nHaskell (programming language)\nBrook (programming language)\nCurry (programming language)\n\n\n== References ==\n\n\n== Further reading ==\nSeldin, J.P., and Hindley, J.R., eds., 1980. To H.B. Curry: Essays on combinatory logic, lambda calculus, and formalism. Academic Press. Includes biographical essay.\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Haskell Curry\", MacTutor History of Mathematics archive, University of St Andrews .\nCurry archives provides images of several hundred manuscript pages from 1920 to 1931.\nCLg. bibliography 587 pp\nHaskell Brooks Curry at the Mathematics Genealogy Project", "ns": 0, "pageid": 42182, "title": "Haskell Curry"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}