{"batchcomplete": "", "query": {"normalized": [{"to": "Henry Babcock Veatch", "from": "Henry_Babcock_Veatch"}], "pages": {"3484290": {"extract": "Henry Babcock Veatch, Jr. (September 26, 1911 – July 9, 1999) was an American philosopher.\n\n\n== Life and career ==\nVeatch was born in Evansville, Indiana. He obtained his Ph.D. from Harvard University in 1937 and spent his career at Indiana University (1937–1965), Northwestern University (1965–1973), and Georgetown University (1973–1983) where he was Philosophy Department Chair from 1973 to 1976. He also had visiting professorships at Colby College, Haverford College and St. Thomas University.\nVeatch was active in the Episcopal Church and served as president of the American Catholic Philosophical Association. He served as president of the Metaphysical Society of America in 1961. In 1970–71 he served as president of the Western Division of the American Philosophical Association. He was a member of the Guild of Scholars of The Episcopal Church.\nHenry Veatch died in Bloomington, Indiana. Indiana University maintains the archive of his collected papers (1941–1997).\n\n\n== Philosophy ==\nVeatch was a major proponent of rationalism, an authority on Thomistic philosophy, and one of the leading neo-Aristotelian thinkers of his time. He opposed such modern and contemporary developments as the \"transcendental turn\" and the \"linguistic turn.\" A staunch advocate of plain speaking and \"Hoosier\" common sense, in philosophy and elsewhere, he argued on behalf of realist metaphysics and practical ethics.\nVeatch's most widely read book was Rational Man: A Modern Interpretation of Aristotelian Ethics (1962) which explicitly offered a rationalist counterpoint to William Barrett's well-known study in existential philosophy, Irrational Man (1958).\n\n\n== Major works ==\nConcerning the Ontological Status of Logical Forms (1948)\nAristotelian and Mathematical Logic (1950)\nIn Defense of the Syllogism (1950)\nMetaphysics and the Paradoxes (1952)\nIntentional Logic: A Logic Based on Philosophical Realism (1952)\nRealism and Nominalism Revisited (1954)\nLogic as a Human Instrument (1959, with Francis Parker)\nRational Man: A Modern Interpretation of Aristotelian Ethics (1962)\nThe Truths of Metaphysics (1964)\nNon-cognitivism in Ethics: A modest proposal for its diagnosis and cure (1966)\nTwo Logics: the Conflict between Classical and Neo-Analytic Philosophy (1969)\nFor an Ontology of Morals: A Critique of Contemporary Ethical Theory (1971)\nAristotle: A Contemporary Appreciation (1974)\nHuman Rights: Fact or Fancy (1985)\nSwimming Against the Current in Contemporary Philosophy (1990)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== Notes ==", "ns": 0, "pageid": 3484290, "title": "Henry Babcock Veatch"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}