{"batchcomplete": "", "query": {"normalized": [{"to": "Henry Home, Lord Kames", "from": "Henry_Home,_Lord_Kames"}], "pages": {"14064": {"extract": "Henry Home, Lord Kames (1696 – 27 December 1782) was a Scottish advocate, judge, philosopher, writer and agricultural improver. A central figure of the Scottish Enlightenment, a founder member of the Philosophical Society of Edinburgh, and active in the Select Society, his protégés included David Hume, Adam Smith, and James Boswell.\n\n\n== Biography ==\nBorn at Kames House, between Eccles and Birgham, Berwickshire, he was educated at home by a private tutor. He studied law at Edinburgh, was called to the bar in 1724, and became an advocate. He soon acquired reputation by a number of publications on the civil and Scottish law, and was one of the leaders of the Scottish Enlightenment. In 1752, he was \"raised to the bench\", thus acquiring the title of Lord Kames.\nHome was on the panel of judges in the Joseph Knight case which ruled that there could be no slavery in Scotland.\nHis address in 1775 is shown as New Street on the Canongate.\n\n\n== Writings ==\nHome wrote much about the importance of property to society. In his Essay Upon Several Subjects Concerning British Antiquities, written just after the Jacobite rising of 1745 he described how the politics of Scotland were not based on loyalty to Kings or Queens as Jacobites had said but on royal land grants given in return for loyalty.\nIn Historical Law Tracts and later in Sketches on the History of Man he described human history as having four distinct stages. The first was as a hunter-gatherer where people avoided each other out of competition. The second stage he described was a herder of domestic animals which required forming larger societies. No laws were needed at these stages except those given by the head of the family or society. Agriculture was the third stage requiring greater cooperation and new relationships to allow for trade or employment (or slavery). He argued that 'the intimate union among a multitude of individuals, occasioned by agriculture' required a new set of rights and obligations in society. This requires laws and law enforcers. A fourth stage moves from villages and farms to seaports and market towns requiring yet more laws and complexity but also much to benefit from. Kames could see these stages within Scotland itself, with the pastoral/agricultural highlands, the agricultural/industrial lowlands and the growing commercial (\"polite\") towns of Glasgow and Edinburgh.\nHome was a polygenist, he believed God had created different races on earth in separate regions. In his book Sketches of the History of Man, in 1774, Home claimed that the environment, climate, or state of society could not account for racial differences, so that the races must have come from distinct, separate stocks.\nThe above studies created the genre of the story of civilization and defined the fields of anthropology and sociology and therefore the modern study of history for two hundred years.\nIn the popular book Elements of Criticism (1762) Home interrogated the notion of fixed or arbitrary rules of literary composition, and endeavoured to establish a new theory based on the principles of human nature. The late eighteenth-century tradition of sentimental writing was associated with his notion that 'the genuine rules of criticism are all of them derived from the human heart. Prof Neil Rhodes has argued that Lord Kames played a significant role in the development of English as an academic discipline in the Scottish Universities.\n\n\n== Social milieu ==\nHe enjoyed intelligent conversation and cultivated a large number of intellectual associates, among them John Home, David Hume and James Boswell.[1]. Lord Monboddo was also a frequent debater of Kames, although these two usually had a fiercely competitive and adversarial relationship.\n\n\n== Major works ==\nRemarkable Decisions of the Court of Session (1728)\nEssays upon Several Subjects in Law (1732)\nEssay Upon Several Subjects Concerning British Antiquities (c. 1745)\nEssays on the Principles of Morality and Natural Religion (1751) He advocates the doctrine of philosophical necessity.\nPrinciples of Equity (1760)\nIntroduction to the Art of Thinking (1761)\nElements of Criticism (1762) Published by two Scottish booksellers, Andrew Millar and Alexander Kincaid.\nSketches of the History of Man (1774)\nGentleman Farmer (1776)\nLoose Thoughts on Education (1781)\n\n\n== See also ==\nGeorge Anderson (minister)\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Rines, George Edwin, ed. (1920). \"Home, Henry\". Encyclopedia Americana. \n\n\n== External links ==\nHenry Home, Lord Kames at James Boswell - a Guide", "ns": 0, "pageid": 14064, "title": "Henry Home, Lord Kames"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}