{"batchcomplete": "", "query": {"normalized": [{"to": "Henry Pogorzelski", "from": "Henry_Pogorzelski"}], "pages": {"789040": {"extract": "Henry Andrew Pogorzelski (September 26, 1922 - December 30, 2015) was an American mathematician of Polish descent, a professor of Mathematics at the University of Maine. Much of Pogorzelski's research concerns the Goldbach conjecture, the still-unsolved problem of whether every even number can be represented as a sum of two prime numbers.\nBorn in Harrison, New Jersey, Pogorzelski served in the U.S. Army in World War II. He served as editor of Mathematical Reviews from 1957 to 1964 and studied at the Institute for Advanced Study under André Weil. He received his Ph.D. from CUNY in 1969 under the advisor Raymond Smullyan; his dissertation was on \"Goldbach Sentences in Some Abstract Arithmetics Constructed from a Generalization of Ordinary Recursive Arithmetic\". In 1974, after he had joined the Maine faculty, he was the only American invited by the Polish Academy of Science to visit Poland for the celebration of the 500th anniversary of the birth of Copernicus. In 2002, the University of Maine attempted to suspend Pogorzelski from teaching duties, but backed down after he filed an age discrimination complaint.\nAs well as holding a faculty position at the University of Maine, Pogorzelski was the director of the Research Institute for Mathematics (formerly known as the Research Institute for Semiological Mathematics), an independent research institute located near the University of Maine in Orono, Maine and modeled after the Institute for Advanced Study. He proposed in 1993 to offer doctorates through the institute; the proposal was rejected at the time, but the Research Institute for Mathematics is now the only institution in Maine that grants doctoral degrees in mathematics. Henry Pogorzelski died December 30, 2015 in Orono, Maine.\n\n\n== References ==\n\n\n== External links ==\nPogorzelski's web site at the University of Maine.\nIn memoriam page at the University of Maine.", "ns": 0, "pageid": 789040, "title": "Henry Pogorzelski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}