{"batchcomplete": "", "query": {"normalized": [{"to": "Hermann Lotze", "from": "Hermann_Lotze"}], "pages": {"191379": {"extract": "Rudolf Hermann Lotze (German: [ˈlɔtsə]; 21 May 1817 – 1 July 1881) was a German philosopher and logician. He also had a medical degree and was unusually well versed in biology. He argued that if the physical world is governed by mechanical laws, relations and developments in the universe could be explained as the functioning of a world mind. His medical studies were pioneering works in scientific psychology.\n\n\n== Biography ==\nLotze was born in Bautzen (Budziszyn), Saxony, Germany, the son of a physician. He was educated at the grammar school of Zittau; he had an enduring love of the classical authors, publishing a translation of Sophocles' Antigone into Latin verse in his middle age.\nHe attended the University of Leipzig as a student of philosophy and natural sciences, but entered officially as a student of medicine when he was seventeen. Lotze's early studies were mostly governed by two distinct interests: the first was scientific, based upon mathematical and physical studies under the guidance of E. H. Weber, Alfred Wilhelm Volkmann and Gustav Fechner. The other was his aesthetic and artistic interest, which was developed under the care of Christian Hermann Weisse. He was attracted both by science and by the idealism of Johann Gottlieb Fichte, Friedrich Wilhelm Joseph Schelling and Georg Wilhelm Friedrich Hegel.\nLotze's first essay was his dissertation De futurae biologiae principibus philosophicis, with which he gained (1838) the degree of doctor of medicine, four months after obtaining the degree of doctor of philosophy. He laid the foundation of his philosophical system in his Metaphysik (Leipzig, 1841) and his Logik (1843), short books published while still a junior lecturer at Leipzig University, from whence he moved to Göttingen, succeeding Johann Friedrich Herbart in the chair of philosophy.\nHis two early books remained unnoticed by the reading public, and Lotze first became known to a larger circle through a series of works which aimed at establishing in the study of the physical and mental phenomena of the human organism in its normal and diseased states the same general principles which had been adopted in the investigation of inorganic phenomena. These works were his Allgemeine Pathologie und Therapie als mechanische Naturwissenschaften (1842, 2nd ed., 1848), the articles \"Lebenskraft\" (1843) and \"Seele und Seelenleben\" (1846) in Rudolf Wagner's Handwörterbuch der Physiologie, his Allgemeine Physiologie des Körperlichen Lebens (1851), and his Medizinische Psychologie oder Physiologie der Seele (1852).\nWhen Lotze published these works, medical science was still under the influence of Schelling's philosophy of nature. The mechanical laws, to which external things were subject, were conceived as being valid only in the inorganic world. Mechanism was the unalterable connexion of every phenomenon a with other phenomena b, c, d, either as following or preceding it; mechanism was the inexorable form into which the events of this world are cast, and by which they are connected. The object of those writings was to establish the all-pervading rule of mechanism. But the mechanical view of nature is not identical with the materialistic. In the last of the above-mentioned works the question is discussed at great length how we have to consider mind, and the relation between mind and body; the answer is we have to consider mind as an immaterial principle, its action, however, on the body and vice versa as purely mechanical, indicated by the fixed laws of a psycho-physical mechanism.\nThese doctrines of Lotze, though pronounced with the distinct and reiterated reservation that they did not contain a solution of the philosophical question regarding the nature of mechanism, were nevertheless by many considered to be the last word of the philosopher, a decisive rejection of the reveries of Schelling and the idealistic theories of Hegel. Published as they were during the years when the modern school of German materialism was at its height, these works of Lotze were enrolled in the opposing camp of Empirical philosophy.\nThe misinterpretations which he had suffered induced Lotze to publish a small polemical pamphlet (Streitschriften, 1857), in which he corrected two mistakes. His opposition to Hegel's formalism had induced some to associate him with the materialistic school, others to count him among the followers of Herbart. Lotze denied that he belonged to the school of Herbart. He admitted, though, that historically the same doctrine which might be considered the forerunner of Herbart's teachings might lead to his own views, viz. the monadology of Leibniz.\n\n\n== Philosophy ==\nLotze worked in a post-revolutionary time of transition between the idealistic and rationalist legacies of Leibniz, Kant and Hegel and the new Materialism and scientific interpretation of reality.\nHe believed that everywhere in the wide realm of observation we find three distinct regions: the region of facts, the region of laws and the region of standards of value. These three regions are separate only in our thoughts, not in reality. Full understanding comes through conviction that the world of facts is the field in which those higher standards of moral and aesthetic value are being realized through the medium of laws. Such a union is, for him, only intelligible through the idea of a personal Deity, who in the creation and preservation of a world has voluntarily chosen certain forms and laws, through the natural operation of which the ends of His work are gained.\nHis lectures ranged over a wide field: he delivered annually lectures on psychology and on logic (the latter including a survey of the entirety of philosophical research, Encyclopädie der Philosophie), then at longer intervals lectures on metaphysics, philosophy of nature, philosophy of art, philosophy of religion, rarely on history of philosophy and ethics. In these lectures he expounded his peculiar views in a stricter form, and during the last decade of his life he embodied the substance of those courses in his System der Philosophie, of which only two volumes have appeared (vol. I Logik, 1st ed., 1874, 2nd ed., 1880; vol. II Metaphysik, 1879). The third and concluding volume, which was to treat in a more condensed form the principal problems of practical philosophy, of philosophy of art and religion, was not completed before his death.\nA problem of a purely formal character for him was to try to bring unity and harmony into the scattered thoughts of our general culture. He wanted especially to investigate those conceptions which form the initial assumptions and conditions of the several sciences, and to fix the limits of their applicability.\nThe investigations will then naturally divide themselves into three parts, the first of which deals with\nthose to our mind inevitable forms, or laws, in which we are obliged to think about things, if we think at all (metaphysics), the second being devoted to\nthe great region of facts, trying to apply the results of metaphysics to these, specially the two great regions of external and mental phenomena (cosmology and psychology), the third dealing with\nthose standards of value from which we pronounce our aesthetic or ethical approval or disapproval.\nHis goal was to form some general idea how laws, facts and standards of value may be combined in one comprehensive view.\nThe world of many things surrounds us; our notions, by which we manage correctly or incorrectly to describe it, are also ready made. What remains to be done is, not to explain how such a world manages to be what it is, nor how we came to form these notions, but to eliminate those abstract notions which are inconsistent and jarring, or to remodel and define them so that they may constitute a consistent and harmonious view.\nThe course of things and their connexion is only thinkable by the assumption of a plurality of existences, the reality of which (as distinguished from our knowledge of them) can be conceived only as a multitude of relations. This quality of standing in relation to other things is that which gives to a thing its reality. And the nature of this reality again can neither be consistently represented as a fixed and hard substance nor as an unalterable something, but only as a fixed order of recurrence of continually changing events or impressions. The things themselves which exist and their changing phases must stand in some internal connexion; they themselves must be active or passive, capable of doing or suffering.\nWhy not interpret at once and render intelligible the common conception originating in natural science, viz. that of a system of laws which governs the many things? But, in attempting to make this conception quite clear and thinkable, we are forced to represent the connexion of things as a universal substance, the essence of which we conceive as a system of laws which underlies everything and in its own self connects everything, but is imperceptible, and known to us merely through the impressions it produces on us, which we call things. Practical life as well as those of science are equally served if we deprive the material things outside of us of an independence, and assign to them merely a connected existence through the universal substance by the action of which alone they can appear to us. He traced material things through our scientific discovery of them, back to the culture which gave them reality through this science, and ultimately back to the values which established this culture.\nLotze's historical position is of much interest. Though he disclaims being a follower of Herbart, his formal definition of philosophy and his conception of the object of metaphysics are similar to those of Herbart, who defines philosophy as an attempt to remodel the notions given by experience. In this endeavor he forms with Herbart an opposition to the philosophies of Johann Gottlieb Fichte, Friedrich Wilhelm Joseph Schelling, and Georg Wilhelm Friedrich Hegel which aimed at objective and absolute knowledge, and also to the criticism of Kant, which aimed at determining the validity of all human knowledge.\nWhat, however, with the idealists was an object of thought alone, the absolute, for Lotze cannot be defined in rigorous philosophical language; the aspirations of the human heart, the contents of our feelings and desires, the aims of art and the tenets of religious faith must be grasped in order to fill the empty idea of the absolute with meaning. These manifestations of the divine spirit again cannot be traced and understood by reducing (as Hegel did) the growth of the human mind in the individual, in society and in history to the monotonous rhythm of a speculative schematism. The essence and worth which is in them reveals itself only to the student of detail, for reality is larger and wider than philosophy. The problem, \"how the one can be many\", is only solved for us in the numberless examples in life and experience which surround us, for which we must retain a lifelong interest and which constitute the true field of all useful human work.\nThis conviction of the emptiness of terms and abstract notions, and of the fullness of individual life, led Lotze to combine in his writings the two courses into which German philosophical thought had been moving since the death of its great founder, Leibniz. We may define these courses by the terms esoteric and exoteric. The former was the academic quest to systematize everything and reduce all our knowledge to an intelligible principle. This attempt missed the deeper meaning of Leibniz's philosophy. The latter was the unsystematized philosophy of general culture which we find in the work of the great writers of the classical period, Lessing, Winckelmann, Goethe, Schiller and Herder. All of these expressed in some degree their indebtedness to Leibniz. Lotze can be said to have brought philosophy out of the lecture-room into the market-place of life. By understanding and combining the strengths of each approach, he became the true successor of Leibniz.\nThe age in which Lotze lived and wrote in Germany did not appreciate the position he took up. Frequently misunderstood, yet rarely criticized, he was nevertheless greatly admired, listened to by devoted hearers and read by an increasing circle. But this circle never attained to the unity of a philosophical school.\n\n\n== Works ==\n\n\n=== Works in Latin and German ===\nDe futurae biologiae principiis philosophicis (1838). Reprinted in Kleine Schriften, 1885. Vol. 1, pp. 1-25\nGedichte (1840).\nMetaphysik (1841). Google (Oxford)\nAllgemeine Pathologie und Therapie als mechanische Naturwissenschaften (1842). 2nd ed., 1848. Google (Harvard)\nLogik (1843). Google (NYPL) 2nd ed., 1880.\nUeber den Begriff der Schönheit (1845). Reprint, 1847. Google (Oxford)\nAllgemeine Physiologie des koerperlichen Lebens (1851). Google (Harvard)\nMedicinische Psychologie oder Physiologie der Seele (1852). Google (Oxford) Google (UMich)\nMikrokosmus: Ideen zur Naturgeschichte und Geschichte der Menschheit (1856–64). 2nd ed., 1868-72. 4th ed., 1884-88.\nVolume 1, 1856. Google (Oxford) Google (UMich)\nVolume 2, 1858. Google (Oxford) Google (UMich) Google (NYPL)\nVolume 3, 1864. Google (Oxford) Google (NYPL)\n\nStreitschriften (1857). Google (Harvard)\nGeschichte der Aesthetik in Deutschland (1868). Google (Oxford)\nSystem der Philosophie.\nPart 1. Logik: Drei Bücher (1874). Google (Oxford) Google (UMich) Google (UWisc). 2nd ed., 1880.\nPart 2. Metaphysik: Drei Bücher (1879). 2nd ed., 1884.\n\nGeschichte der deutschen Philosophie seit Kant (1882). 2nd ed., 1894. Google (UWisc)\nGrundzüge der Psychologie (1881). Google (Harvard) 2nd ed., 1882. Google (Oxford)\nGrundzüge der Naturphilosophie (1882). Google (Oxford)\nGrundzüge der praktischen Philosophie (1882). 2nd ed., 1884. Google (UCal)\nGrundzüge der Religionsphilosophie (1883). 2nd ed., 1884. Google (Oxford)\nGrundzüge der Logik und Encyclopädie der Philosophie (1883). 2nd ed., 1885. Google (UCal)\nGrundzüge der Metaphysik (1883). Google (Oxford)\nGrundzüge der Aesthetik (1884).\nKleine Schriften (1885–91).\nVolume 1, 1885. Google (Oxford) Google (Stanford) Google (UWisc)\nVolume 2, 1886. Google (Harvard)\nVolume 3, 1891. Google (UWisc)\n\n\n=== Translations in English ===\nLotze's Outlines of Philosophy\n\nPart 1. Outlines of Metaphysic (1884). IA (UCal) IA (UVictoria) 1886. Google (UMich)\nPart 2. Outlines of the Philosophy of Religion (1885). Google (UWisc)\nReprint, 1886. IA (OISE) 1895. IA (St. Michael's) 1901. Google (UWisc)\n\nPart 3. Outlines of Practical Philosophy (1885). Google (UCal)\nPart 4. Outlines of Psychology (1886). Google (UMich) IA (UToronto)\nPart 5. Outlines of Aesthetics (1886). Google (UMich) IA (UToronto)\nPart 6. Outlines of Logic (1887). Google (UMich) IA (UToronto) 1892. Google (Harvard)\n\nLotze's System of Philosophy\n\nPart 1. Logic: In Three Books (1884). Google (Oxford) IA (State Central) IA (UToronto).\n2nd ed., 1888. Volume 1. IA (St. Basil's) IA (UIllinois) IA (Osmania) Google (Stanford)\n2nd ed., 1888. Volume 2. IA (St. Basil's) IA (UIllinois).\n\nPart 2. Metaphysic: In Three Books (1884). Google (Oxford) IA (State Central) IA (UToronto)\n2nd ed., 1887. Volume 1. IA (Osmania) Google (Harvard)\n2nd ed., 1887. Volume 2. IA (Osmania)\n\nOther works\nMicrocosmus: An Essay Concerning Man and His Relation to the World (1885).\nVolume 1. IA (Union) 2nd ed., 1887. IA (UCal) IA (KCPL) 3rd ed., 1888. Google (Harvard) IA (St. Michael's)\nVolume 2. IA (Union) 2nd ed., 1887. IA (UCal) 3rd ed., 1888.Google (Harvard) IA (St. Michael's)\n\n\n== Notes ==\n\n\n== References ==\nWilliam R. Woodward, Hermann Lotze: An Intellectual Biography, Cambridge University Press, 2015.\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Lotze, Rudolf Hermann\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== External links ==\n Works written by or about Hermann Lotze at Wikisource\nSullivan, David. \"Hermann Lotze\". Stanford Encyclopedia of Philosophy. \nRudolf Hermann Lotze (1817–1881) entry by Nikolay Milkov in the Internet Encyclopedia of Philosophy\nFrederick Beiser Late German Idealism: Trendelenburg and Lotze, Oxford University Press, 2013: the most complete discussion of Lotze's philosophy in English\nCarl von Prantl (1884), \"Lotze, Rudolf Hermann\", Allgemeine Deutsche Biographie (ADB) (in German), 19, Leipzig: Duncker & Humblot, pp. 288–290 \nRichard Falckenberg (1906), \"Lotze, Rudolf Hermann\", Allgemeine Deutsche Biographie (ADB) (in German), 52, Leipzig: Duncker & Humblot, pp. 93–97", "ns": 0, "pageid": 191379, "title": "Hermann Lotze"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}