{"batchcomplete": "", "query": {"normalized": [{"to": "Hierocles of Alexandria", "from": "Hierocles_of_Alexandria"}], "pages": {"80292": {"extract": "Hierocles of Alexandria (Greek: Ἱεροκλῆς) was a Greek Neoplatonist writer who was active around AD 430.\n\n\n== Life ==\nHe studied under Plutarch (the Neoplatonist) at Athens in the early 5th century, and taught for some years in his native city. He seems to have been banished from Alexandria and to have taken up his abode in Constantinople, where he gave such offence that he was thrown into prison and flogged. The causes of this are not recorded.\n\n\n== Works ==\nThe only complete work of his which has been preserved is the commentary on the Chrysa Epe (Golden Verses) of Pythagoras. It enjoyed a great reputation in the Middle Ages and the Renaissance, and there are numerous translations in various European languages. Several other writings, especially one on providence and fate, a consolatory treatise dedicated to his patron Olympiodorus of Thebes, are quoted or referred to by Photius and Stobaeus. Hierocles argued against astrological fatalism on the basis that it is supported by an irrational necessity rather than a divine, rational Providence of God. For the same reason, he opposed theurgic and magic practices as they were attempts to supersede the divine providential order.\nAlthough he never mentions Christianity in his surviving works, his writings have been taken as an attempt at reconciliation between Greek religion traditions and the Christian beliefs he may have encountered in Constantinople.\nThe collection of some 260 witticisms attributed to Hierocles and Philagrius has no connection with Hierocles of Alexandria, but is probably a compilation of later date, founded on two older collections. It is now agreed that the fragments of the Elements of Ethics preserved in Stobaeus are from a work by a Stoic named Hierocles, contemporary of Epictetus, who has been identified with the \"Hierocles Stoicus vir sanctus et gravis\" in Aulus Gellius (ix. 5. 8). This theory is confirmed by the discovery of a papyrus (ed. H. von Arnim in Berliner Kiassikertexte, Iv. 1906.)\n\n\n== References ==\n\n\n== Further reading ==\nHermann S. Schibli, Hierocles of Alexandria. Oxford: Oxford University Press, 2002. ISBN 0-19-924921-0.", "ns": 0, "pageid": 80292, "title": "Hierocles of Alexandria"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}