{"batchcomplete": "", "query": {"normalized": [{"to": "Hirata Atsutane", "from": "Hirata_Atsutane"}], "pages": {"6284782": {"extract": "Hirata Atsutane (平田 篤胤, 6 October 1776 – 2 November 1843) was a Japanese scholar, conventionally ranked as one of the four great men of kokugaku (nativist) studies, and one of the most significant theologians of the Shintō religion. His literary name was Ibukinoya.\n\n\n== Life and thought ==\nHirata was born to a low-ranking samurai family of Akita domain (in present-day Akita Prefecture) in the Tōhoku region of northern Japan. His father was named Ōwada Yoshitane, and Hirata was adopted by Matsuyama retainer Hirata Tōbei, from whom he received the family name of Hirata in 1800. Little is known of his early life, but Hirata was a student of the Neo-Confucianism of Yamazaki Ansai (1619–1682) in Edo. He later turned towards Daoism as found in the works of the Chinese philosopher Zhuangzi, and towards Shintō as per the works of Motoori Norinaga, founder of the kokugaku movement.\nThough he is traditionally ranked fourth in the lineage of kokugaku scholars, Hirata actually represents a break with the purely scholarly urban culture characteristic of the revival of classical nativist learning, and represents a trend toward a populist message. Hirata laid particular emphasis on reaching the average man, and adapted his own style to them by employing at times the vernacular idiom.\nHirata claimed later to have received the mantle of kokugaku teacher in a dream directly from Motoori Norinaga, but the story is apocryphal. Hirata's interest in kokugaku postdates Motoori's own death.\nHirata was a prolific writer. Representative works in the study of ancient Japanese traditions include Tama no mihashira (The True Pillar of Spirit), Koshi seibun (Treatise on Ancient History), Kodō taii (True Meaning of the Ancient Way) and Zoku Shintō taii (True Meaning of Common Shintō), and the commentaries Koshi-chō and Koshi-den. He is also noted for his studies of ancient Indian and Chinese tradition (Indo zōshi and Morokoshi taikoden), and texts dealing with the spirit world, including Senkyō ibun (Strange Tales of the Land of Immortals) and Katsugorō saisei kibun (Chronicle of the Rebirth of Katsugorō). His early work Honkyō gaihen indicates an acquaintance with Christian literature that had been authored by Jesuits in China.\nHirata frequently expressed hostility to the Confucian and Buddhist scholars of the day, advocating instead a revival of the “ancient ways” in which the emperor was to be revered. Hirata's first published work, Kamosho (1803) was a scathing attack on the works of Confucian philosopher Dazai Shundai (1680–1747) on Buddhism, and resulted in an invitation to teach from the Yoshida family, the hereditary clan leading Yoshida Shinto.\nThe contents of his 1841 treatise Tenchō mukyūreki (Chronicle of the Perpetual Rule of the Emperor) angered the ruling Tokugawa bakufu government, and he was sentenced to confinement in Akita until his death in 1843.\nHirata's activities eventually attracted over 500 pupils, including Okuni Takamasa and Suzuki Shigetane. His nationalist writings had considerable impact on the samurai who supported the Sonnō jōi movement and who fought in the Boshin War to overthrow the Tokugawa Shogunate during the Meiji Restoration.\n\n\n== Influence ==\nAtsutane's influence on kokugaku has recently been thought to be overestimated. While he is called one of the \"four great men of kokugaku\", this is a phrase he invented himself. His work more often influenced religious groups than the government in the Empire of Japan.\nAmong Atsutane's more enduring contributions to Japanese thought was the idea that all Japanese were descended from the gods, not only the Imperial family and certain aristocratic families. As he put it, \"this, our glorious land, is the land in which the gods have their origin, and we are one and all descendants of the gods. For this reason, if we go back from the parents who gave us life and being, beyond the grandparents and great-grandparents, and consider the ancestors of ancient times, then the original ancestors of those must necessarily have been the gods.\"\n\n\n== Notes ==\n\n\n== References ==\nGordon, Andrew (2003). A Modern History of Japan: From Tokugawa Times to the Present. Oxford University Press.  ISBN 9780195110609; ISBN 9780195110616; OCLC 49704795\nJansen, Marius B. (2000). The Making of Modern Japan. Harvard University Press.  ISBN 9780674003347; OCLC 44090600\nMcNally, Mark (2005). Proving the Way: Conflict and Practice in the History of Japanese Nativism. Harvard University Asia Center. ISBN 0-674-01778-1. \n\n\n== External links ==\nEncyclopedia of Shinto", "ns": 0, "pageid": 6284782, "title": "Hirata Atsutane"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}