{"batchcomplete": "", "query": {"normalized": [{"to": "Horace Romano Harré", "from": "Horace_Romano_Harré"}], "pages": {"5110268": {"extract": "Horace Romano Harré (/ˈhæreɪ/; born 1927), known widely as Rom Harré, is a distinguished British philosopher and psychologist.\n\n\n== Background ==\nHarré was born in Apiti, in northern Manawatu, near Palmerston North, New Zealand, but holds British citizenship. He studied chemical engineering (for which he retains a great affection) and later graduated with a BSc in mathematics (1948) and a Masters in Philosophy (1952), both at the University of New Zealand, now the University of Auckland.\nHe taught mathematics at Kings College, Auckland (1948–53) and the University of Punjab in Lahore, Pakistan (1953–4). He then studied at University College, Oxford, where he completed a B. Phil. under the supervision of J.L. Austin in 1956. After a fellowship at the University of Birmingham he was lecturer at the University of Leicester from 1957 to 1959.\nHe returned to Oxford as the successor to Frederick Waismann as University Lecturer in Philosophy of Science in 1960 (age 34). At Oxford he was active in the founding of the Honours School of Physics and Philosophy and played an important part in the discursive turn in social psychology, a field he came to in the middle of his career. After mandatory retirement from Oxford in 1995 he joined the psychology department of Georgetown University, Washington, DC where he continues as Distinguished Research Professor teaching every year in the Spring Semester.\nHe has given occasional courses at both American University in Washington, D.C. and at George Mason University at Fairfax, Virginia. From 2009 until 2011 he served as Director Centre for Philosophy of Natural and Social Science at the London School of Economics in conjunction with his US post. He has been Visiting Professor at many places, teaching courses at Aoyama University, Tokyo; Universidad Santiago de Compostella, Spain; Universidad Caetano, Peru; Free University at Brussels; Aarhus University in Denmark and elsewhere.\n\n\n== Intellectual interests ==\nHarré is one of the world's most prolific social scientists. Has written on a wide variety of subjects including: philosophy of mathematics, philosophy of science, ontology, psychology, social psychology, sociology and philosophy. He was an important early influence on the British philosophical movement Critical Realism, publishing Causal Powers with Madden in 1975, the same year as A Realist Theory of Science. He supervised Roy Bhaskar's doctoral studies, and has continued to maintain close involvement with realism. He also supervised Patrick Baert, German Berrios, and Jonathan Smith's doctoral studies, respectively in social theory, history and epistemology of psychiatry, and social psychology. Another one of Harré's distinctive contributions was to the understanding of the social self in microsociology, which he called \"ethogenics:\" this method attempts to understand the systems of belief or means by which individuals can attach significance to their actions and form their identities, in addition to the structure of rules and cultural resources that underlie these actions.\n\n\n== Awards and festschrifts ==\nHonorary doctorate, Massey University, 2012\nHonorary doctorate, Helsinki (1986)\nHonorary doctorate, Brussels (1986)\nHonorary doctorate, Cayetano, Lima, Peru (1998)\nHonorary doctorate, Aarhus University, Denmark (1998)\nLifetime Achievement Award from the American Psychological Association, Theoretical and Philosophical Psychollgy (2010)\nTheodore Sarbin Award for 2014 (American Psychological Association, Div 24).\nHarré and his critics (1989) (ed) R. Bhaskar Oxford: Blackwell\nRom Harré's scientific realism (1993) (ed) A.A. Derksen, Tilborg: Tilborg University Press\nInternational Studies in Philosophy of Science Harré number: 1995 (ed) W. Newton-Smith\nDialectica: Harré number: 1997 (ed) B. Muller.\n\n\n== Publications ==\nBooks\nHarré, H. Rom with F.M. Moghaddam. Psychology for the Third Millennium. London and Los Angeles: Sage, 2012.\nHarré, H. Rom with P.Q. Pfordresser and S-L Tan. Introduction to the Psychology of Music. London: Psychology Press, 2010.\nHarré, H. Rom, Ed. L. van Langenhove. People and Societies. London: Routledge, 2010.\nHarré, H. Rom. Pavlov’s Dogs and Schrödinger’s Cat. Oxford: OUP (Chinese edition), 2009.\nHarré, H. Rom. Key Thinkers in 20th Century Psychology. London: Sage, 2006.\nHarré H. Rom with Michael Tissaw. Wittgenstein and Psychology. Basingstoke, UK: Ashgate, 2005.\nHarré, H. Rom. Modeling: Gateway to the Unknown. Amsterdam and Oxford: Elsevier, 2005.\nHarré, H. Rom. Cognitive Science: A Philosophical Introduction. Los Angeles: Sage (Chinese translation), 2002.\nHarré, H. Rom with J-M. Saguillo. Los problemas de la metafisica: Siglo XX. Madrid: Duque, 2001.\nHarré, H. Rom. One thousand years of philosophy. Oxford: Blackwell, 2000.\nHarré, H. Rom. The singular self. London and Los Angeles: Sage. Italian translation, 2000, 1998.\nHarré, H. Rom with Muhlhausler, P., Brockmeier, J. Greenspeak: A Study of Environmental Discourse. Los Angeles and London: Sage, 1998.\nRom Harre with M. Krausz. Varieties of relativism. Oxford: Blackwell, 1995.\nRom Harre with J. Arson and E Way . Realism rescued. London: Duckworth, 1994.\nHarré, H. Rom with Grant Gillet. The discursive mind. London: Sage (Spanish translation), 1994.\nHarré, H. Rom. Social being: revised edition. Oxford: Blackwell, 1993.\nHarré, H. Rom. Laws of nature. London: Duckworth, 1993.\nHarré, H. Rom. Physical being: a theory for corporeal psychology. Oxford: Blackwell, 1991.\nRom Harre with P Muhlhausler. Pronouns and people. Blackwell, Oxford, 1990.\nRom Harre. Designing the discipline: a programme for psychology. Blackwell, Oxford, 1986.\nHarré, H. Rom. Varieties of realism. Blackwell, Oxford, 1986.\nHarré, H. Rom. The philosophies of science, 2nd Edition. Oxford, GB: Oxford University Press, 1986.\nHarré, H. Rom, Clarke, D., & de Carlo, N.. Motives and mechanisms. London, UK: Metheun, 1985.\nHarré, H. Rom. Introduction to the logic of the sciences, 2nd Edition. London, UK: Macmillan, 1983.\nRom Harre. Personal being:a theory for individual psychology. Blackwell, Oxford;1985 Harvard UP, Cambridge, Mass., 1983.\nHarré, H. Rom. Twenty great scientific experiments. Phaidon Press, Oxford (OPUS paperback, 1983, American edition 1982) (Spanish, Italian, Japanese), 1981.\nHarré, H. Rom. Social being: a theory for social psychology. Oxford, GB: Blackwell, 1979.\nHarré, H. Rom. Social being: a theory for social psychology. : Blackwell, Oxford (Spanish translation), 1979.\nHarré, H. Rom, Marsh, P., & Rosser, E.. The rules of disorder. London, UK: Routledge and Kegan Paul, 1977.\nHarré, H. Rom, Morgan, J., & O’Neill, O.. Nicknames. London, UK: Routledge and Kegan Paul, 1977.\nHarré, H. Rom, & Madden, E.H.. Causal powers. Oxford, GB: Blackwell, 1975.\nHarré, H. Rom, & Secord, P.F.. The explanation of social behaviour. Oxford, GB: Blackwell, 1973.\nHarré, H. Rom. The philosophies of science. Oxford, GB: Oxford University Press, 1972.\nHarré, H. Rom. The method of science. London, UK: Wykelham Press, 1970.\nHarré, H. Rom. The principles of scientific thinking. London, UK: Macmillan, 1970.\nWaismann, F., Harré, H. Rom, ed.. The Principles of Linguistic Philosophy. London: Macmillan, 1968.\nHarré, H. Rom. The anticipation of nature. London, UK: Hutchinson, 1965.\nHarré, H. Rom. Matter and method. London, UK: Macmillan, 1964.\nHarré, H. Rom. Theories and things. London, UK: Sheed and Ward, 1961.\nHarré, H. Rom. Introduction to the logic of the sciences. London, UK: Macmillan, 1960.\nEdited books\nHarré, H. Rom, & Jensen, C., ed. Beyond Rationality. Newcastle, UK: Cambridge Scholars, 2012.\nHarré, H. Rom, & Moghaddam, F.M., ed. Words of Conflict, Words of War. Santa Barbara, CA: Praeger, 2010.\nHarré, H. Rom, Moghaddam, F.M., & Lee, N.P., ed. Global Conflict Resolution through Positioning Analysis. New York, NY: Springer, 2008.\nHarré, H. Rom, & Moghaddam, F., ed. The Self and Others. Westport, CT: Praeger, 2004.\nHarré, H. Rom, & van Langenhove, L. van, ed. Positioning Theory. Oxford, GB: Blackwell, 1998.\nHarré, H. Rom, & Parrott, W.G., ed. The emotions. London, UK & Los Angeles, CA: Sage, 1996.\nHarré, H. Rom, & Stearns, P., ed. Discursive psychology. London, UK & Los Angeles, CA: Sage, 1995.\nHarré, H. Rom, Smith, J., & van Langenhove, L., ed. Rethinking psychological methods. London, UK & Los Angeles, CA: Sage, 1995.\nHarré, H. Rom, & Harris, R., ed. Philosophy and linguistics. Oxford, UK: Pergamon, 1993.\nHarré, H. Rom, ed. Anglo-Ukrainian studies in philosophy of science. Lampeter, PA: Edward Mellen, 1993.\nHarré, H. Rom, & Brown, H.R., ed. Philosophical foundations of quantum field theory. Oxford, UK: Clarendon Press, 1988.\nHarré, H. Rom, van Langenhove, L., & de Waele, J-M., ed. Individual persons and their actions. Brussels, Belgium: Vrije Universiteit Press, 1986.\nHarré, H. Rom, & Lamb, R., ed. Blackwell Dictionary of Social and Personality Psychology. Blackwell, 1986.\nHarré, H. Rom, ed. The physical sciences since antiquity. London, UK: Croom Helm, 1986.\nHarré, H. Rom, ed. The social construction of emotions. Oxford, GB: Blackwell, 1986.\nHarré, H. Rom, & Lamb, R., ed. Blackwell Dictionary of Animal Behaviour and Ethology. Blackwell, 1986.\nHarré, H. Rom, & Lamb, R., ed. Blackwell Dictionary of Educational and Developmental Psychology. Blackwell, 1986.\nHarré, H. Rom, & Lamb, R., ed. Blackwell Dictionary of Clinical and Physiological Psychology. Blackwell, 1986.\nHarré, H. Rom, & Lamb, R., ed. Blackwell Encyclopaedic Dictionary of Psychology. Blackwell, 1985.\nHarré, H. Rom, & Reynolds, V., ed. The meaning of primate signals. Cambridge, GB: Cambridge University Press, 1983.\nHarré, H. Rom, & von Cranach, M., ed. The analysis of action. Cambridge, GB: Cambridge University Press, 1982.\nHarré, H. Rom, & Jensen, U.J., ed. The philosophy of evolution. Brighton, GB: Harvester Press, 1981.\nHarré, H. Rom, ed. Personality. Oxford, GB: Blackwell, 1976.\nHarré, H. Rom, ed. Life sentences. Chichester, UK: Wylie, 1976.\nHarré, H. Rom, ed. Problems of scientific revolution. Oxford, GB: Clarendon Press, 1975.\nHarré, H. Rom, ed. Some nineteenth century British scientists. Oxford, GB: Pergamon, 1969.\nHarré, H. Rom, ed. Scientific thought, 1900–1960. Oxford, GB: Oxford University Press, 1969.\nHarré, H. Rom, ed. How I see philosophy. London, UK: Macmillan, 1968.\nHarré, H. Rom, ed. The sciences: their origins and methods. Glasgow: Blackie, 1967.\nHarré, H. Rom, ed. Early Seventeenth Century Scientists. Oxford: Pergamon Press, 1965.\n\n\n== See also ==\nEthogenics\nPhilosophical realism\n\n\n== References ==\n\n\n== External links ==\nHarre's page at Georgetown University\nAn article by Caroline New\nProf R. Harré awarded with honorary doctorate from Massey University in 2012", "ns": 0, "pageid": 5110268, "title": "Horace Romano Harré"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}