{"batchcomplete": "", "query": {"normalized": [{"to": "Hugh MacColl", "from": "Hugh_MacColl"}], "pages": {"3380850": {"extract": "Hugh MacColl (1831–1909) was a Scottish mathematician, logician and novelist.\n\n\n== Life ==\nMacColl was the youngest son of a poor Highland family which was at least partly Gaelic-speaking. Hugh's father died when he was still an infant, and Hugh was educated largely thanks to the efforts of his elder brother Malcolm MacColl, an Episcopalian clergyman and friend and political ally of William Ewart Gladstone. Early in his acquaintanceship with Gladstone, Malcolm MacColl persuaded the Liberal politician to provide funds for Hugh's education at Oxford. It was proposed to send him to Oxford University's St. Edmund Hall, but Gladstone made this conditional on Hugh MacColl agreeing to take orders in the Church of England. Hugh MacColl refused this condition and, as a result, never obtained a university education, which may have limited his contribution to philosophy, and certainly prevented him from ever obtaining a formal academic position.\nAfter a few years working in different areas of Great Britain, MacColl relocated to Boulogne-sur-Mer, in France on the Channel, where he developed the greater part of his work and became a French citizen. MacColl was not obscure during his time. He was a lifelong regular contributor to the Educational Times. His correspondents included the logicians William Stanley Jevons and Charles Sanders Peirce. He also corresponded, and argued in print, with the young Bertrand Russell, and reviewed Alfred North Whitehead's 1898 Universal Algebra for Mind magazine.\n\n\n== Works ==\nHe is known for three main accomplishments:\nDuring 1877-79, while working out a problem involving integration, he published a four-part article establishing the first known variant of the propositional calculus, terming it the \"calculus of equivalent statements\", preceding Gottlob Frege's Begriffschrifft. He subsequently published 11 articles in Mind magazine, 1880..1908, and a text, in an effort to attract the attention of philosophers to his work.\nClarence Irving Lewis credited MacColl's late work on the nature of implication as the source of the basic ideas of Lewis's innovative work in modal logic.\nMacColl's work represents one of the first treatments of logical pluralism where he explores the possibilities of modal logic, logic of fiction, connexive logic, many-valued logic and probability logic.\nMacColl also published two novels, Mr. Stranger's Sealed Packet (1889), concerning a journey to Mars and a utopian Martian society, and Ednor Whitlock (1891), dealing with a crisis of faith occasioned by exposure to new scientific ideas. While described by a recent critic as \"best left unread\", the novels reveal social and moral values to which the author gave full expression in his 1909 publication Man's Origin, Destiny, and Duty, an apology for Christianity.\n\n\n== Legacy ==\nThere is presently a long-term MacColl Project, a joint venture of Greifswald University in Germany and the University of Oslo, which intends to publish a critical edition of his work. Furthermore, the group of logic and epistemology at the University of Lille (France) develop MacColl's suggestions for a dynamic free logic. The December 1999 issue of the magazine Nordic Journal of Philosophical Logic published the proceedings of a 1998 conference devoted to MacColl's work.\n\n\n== References ==\n\nRahman, S. & Redmond, J., 2008. \"Hugh MacColl and the Birth of Logical Pluralism\". In: Handbook of History of Logic. Elsevier, vol. 4. Discusses MacColl's contributions to philosophy of language and logic including modal logic, logic of fictions and modal logic.\nRahman, S. & Redmond, J., 2007. Hugh MacColl. An Overview of his Logical Work with Anthology. College Publications. Contains a long introduction to MacColl's logic and reprints of his main logical work.\nKneebone, G., 2001 (1963). Mathematical Logic and the Foundations of Mathematics. Dover. Contains a brief introduction to the \"calculus of equivalent statements.\"\nRahman, S.; Rückert, H. (2001). \"Dialogical Connexive Logic\". Synthese. 127 (1-2): 105–139. doi:10.1023/a:1010351931769. \nIvor Grattan-Guinness, 2000. The Search for Mathematical Roots 1870-1940. Princeton Uni. Press.\n\n\n== External links ==\nSpecial Hugh MacColl issue of the Nordic Journal of Philosophical Logic (Vol. 3 no. 1)\n\"Symbolic logic and its applications\" By Hugh MacColl, full .PDF on Google Books.", "ns": 0, "pageid": 3380850, "title": "Hugh MacColl"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}