{"batchcomplete": "", "query": {"normalized": [{"to": "Hui Shi", "from": "Hui_Shi"}], "pages": {"1094392": {"extract": "Hui Shi (Chinese: 惠施; pinyin: Huì Shī; Wade–Giles: Hui4 Shih1; 380–305 BCE), or Huizi (Chinese: 惠子; pinyin: Huìzǐ; Wade–Giles: Hui4 Tzu3; \"Master Hui\"), was a Chinese philosopher during the Warring States period. He was a representative of the School of Names (Sophists or Dialecticians), and is famous for ten paradoxes about the relativity of time and space, for instance, \"I set off for Yue (southeastern China) today and came there yesterday.\" His thought thus bears some similarity to the Greek philosopher Parmenides.\n\n\n== Works mentioning Hui Shi ==\nThe philosophical writings of Hui Shi are no longer extant, but several Chinese classic texts refer to him, including the Zhan Guo Ce, Lüshi Chunqiu, Han Feizi, Xunzi, and most frequently, the Zhuangzi.\nNine Zhuangzi chapters mention Hui Shi, calling him \"Huizi\" 26 times and \"Hui Shi\" 9 times. \"Under Heaven\" (chapter 33), which summarizes Warring States philosophies, contains all of the latter 9 references by name.\n\n\n== The Ten Theses ==\n\"Under Heaven\" lists Hui Shi's ten theses (sometimes referred to as the ten paradoxes):\n\nHui Shih was a man of many devices and his writings would fill five carriages. But his doctrines were jumbled and perverse and his words wide of the mark. His way of dealing with things may be seen from these sayings:\n\"The largest thing has nothing beyond it; it is called the One of largeness. The smallest thing has nothing within it; it is called the One of smallness.\"\n\"That which has no thickness cannot be piled up; yet it is a thousand li in dimension.\"\n\"Heaven is as low as earth; mountains and marshes are on the same level.\"\n\"The sun at noon is the sun setting. The thing born is the thing dying.\"\n\"Great similarities are different from little similarities; these are called the little similarities and differences. The ten thousand things are all similar and are all different; these are called the great similarities and differences.\"\n\"The southern region has no limit and yet has a limit.\"\n\"I set off for Yueh today and came there yesterday.\"\n\"Linked rings can be separated.\"\n\"I know the center of the world: it is north of Yen and south of Yueh.\"\n\"Let love embrace the ten thousand things; Heaven and earth are a single body.\"\n\nWith sayings such as these, Hui Shih tried to introduce a more magnanimous view of the world and to enlighten the rhetoricians.\n\n\n== Relation to Zhuangzi ==\nMost of the other Zhuangzi passages portray Hui Shi (Huizi) as a friendly rival of Zhuangzi. Hui Shi acts as an intellectual foil who argues the alternative viewpoint, or criticizes the Daoist perspective, often with moments of humor. The best known of the Zhuang-Hui dialogues concerns the subjectivity of happiness.\n\nChuang Tzu and Hui Tzu were strolling along the dam of the Hao River when Chuang Tzu said, \"See how the minnows come out and dart around where they please! That's what fish really enjoy!\"\nHui Tzu said, \"You're not a fish - how do you know what fish enjoy?\"\nChuang Tzu said, \"You're not I, so how do you know I don't know what fish enjoy?\"\nHui Tzu said, \"I'm not you, so I certainly don't know what you know. On the other hand, you're certainly not a fish ‑ so that still proves you don't know what fish enjoy!\"\nChuang Tzu said, \"Let's go back to your original question, please. You asked me how I know what fish enjoy ‑ so you already knew I knew it when you asked the question. I know it by standing here beside the Hao.\"\n\nAccording to these ancient Daoist stories, Zhuangzi and Hui Shi remained friendly rivals until death.\n\nChuang Tzu was accompanying a funeral when he passed by the grave of Hui Tzu. Turning to his attendants, he said, \"There was once a plasterer who, if he got a speck of mud on the tip of his nose no thicker than a fly's wing, would get his friend Carpenter Shih to slice it off for him. Carpenter Shih, whirling his hatchet with a noise like the wind, would accept the assignment and proceed to slice, removing every bit of mud without injury to the nose, while the plasterer just stood there completely unperturbed. Lord Yuan of Sung, hearing of this feat, summoned Carpenter Shih and said, 'Could you try performing it for me?' But Carpenter Shih replied, 'It's true that I was once able to slice like that but the material I worked on has been dead these many years.' Since you died, Master Hui, I have had no material to work on. There's no one I can talk to any more.\"\n\nChad Hansen (2003:146) interprets this lament as \"the loss of a philosophical partnership, of two like-minded but disagreeing intellectual companions engaged in the joys of productive philosophical argument.\"\n\n\n== Notes ==\n\n\n== References ==\nHansen, Chad. \"The Relatively Happy Fish.\" Asian Philosophy 13 (2003):145-164.\nKou Pao-koh. Deux sophistes chinois:Houei Che et Kong -souen Long. Paris, 1953.\nLucas Thierry. Hui Shih and Kung Sun Lung: an approach from contemporary logic, Journal of Chinese Philosophy 20: 211-255 (1993).\nMoritz R. Hui Shi und die Entwicklung des philosophischen Denkens im alten China. Berlin, 1973.\nSolomon B.S. The assumptions of Hui Shih, Monumenta Serica, 1969, vol.28. P.1-40.\nWatson, Burton, tr. 1968. The Complete Works of Chuang Tzu. New York: Columbia University Press.\n\n\n== External links ==\nFraser, Chris. \"School of Names: 5. Hui Shi\" and \"Life of Hui Shi\", Stanford Encyclopedia of Philosophy, 2005.", "ns": 0, "pageid": 1094392, "title": "Hui Shi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}