{"batchcomplete": "", "query": {"normalized": [{"to": "Ian Rumfitt", "from": "Ian_Rumfitt"}], "pages": {"26739342": {"extract": "Ian Rumfitt is a British philosopher currently serving as a Senior Research Fellow of All Souls College, Oxford.\n\n\n== Life ==\nHe was educated at Victoria College, Jersey, at Balliol College, Oxford, where he was also a Junior Research Fellow, and at Princeton University. His graduate studies at Oxford were supervised by Sir Michael Dummett. He has taught at Keele University, the University of Michigan at Ann Arbor, University College, Oxford, where he served as a tutorial fellow from 1998 until 2005, Birkbeck College, University of London, where he was Professor of Philosophy from 2005 until 2013, and the University of Birmingham, where he was Professor of Philosophy from 2013 until 2016.\nHe delivered the Nelson Lectures in Philosophy at the University of Michigan in 2004. He was founding co-director of the Centre for Logic and Language within the Institute of Philosophy, School of Advanced Study, University of London. He was awarded a Philip Leverhulme Prize in 2001. Since January 2016 he has been one of the editors of Philosophers' Imprint.\nHis primary areas of research include the philosophy of logic and the philosophy of language. He also works in metaphysics, model theory, and the philosophy of mathematics, with an interest in the works of Gottlob Frege.\n\n\n== Works ==\nRumfitt's work in the philosophy of logic culminated in the publication of \"The Boundary Stones of Thought\" (Oxford: Clarendon Press, 2015). This book presents a sustained defense of classical logic against such philosophers as Michael Dummett and Crispin Wright. What makes Rumfitt's defense unusual is that he joins Dummett and Wright in rejecting the Principle of Bivalence, the keystone of classical semantics. So Rumfitt presents and defends non-classical semantic theories for various problematical areas of discourse which nevertheless validate classical logic. The book also presents a solution to the Sorites Paradox and a defense of Kripke-Platek set theory against the better-known Zermelo-Fraenkel set theory.\nRumfitt's earlier work in logic includes a 'bilateral' formalization of classical logic which avoids problems that have been held to attend its familiar 'unilateral' formalization. In the philosophy of language, he is also known for his work on plural terms, on conditionals, on ascriptions of know how, on indirect speech reports, and for his views on the relationship between truth-conditional theories of meaning in the style of Donald Davidson and the intention-based theories championed by Paul Grice.\n\"The Boundary Stones Of Thought: An Essay in the Philosophy of Language\", (2015)*\n\"Truth and Meaning\", Proceedings of the Aristotelian Society Supplementary Volumes (2014)*\n\"Old Adams Buried\", Analytic Philosophy (2013)*\n\"Plural terms: another variety of reference?\" in J. L. Bermudez (ed.) Thought, Reference and Experience: Themes from the Philosophy of Gareth Evans, (OUP, 2005)\n\"Savoir Faire\", The Journal of Philosophy (2003)*\n\"'Yes' and 'No'\", Mind (2000)*\n\"Truth Conditions and Communication\", Mind (1995)*\n\"Content and Context: The Paratactic Theory Revisited and Revised\", Mind (1993)*\n\n\n== References ==\n\n\n== External links ==\n\"Ian Rumfitt\", Philosophy Papers", "ns": 0, "pageid": 26739342, "title": "Ian Rumfitt"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}