{"batchcomplete": "", "query": {"normalized": [{"to": "Inayatullah Khan Mashriqi", "from": "Inayatullah_Khan_Mashriqi"}], "pages": {"4146026": {"extract": "Inayatullah Khan Mashriqi, also known as Allama Mashriqi, (25 August 1888 – 27 August 1963) was a Pakistani mathematician, logician, political theorist, Islamic scholar and the founder of the Khaksar movement.\nIn 1930 founded the Khaksar Movement, aiming to advance the condition of the masses irrespective of any faith, sect, or religion.\n\n\n== Early years ==\n\n\n=== Background ===\nInayatullah Khan Mashriqi was born on 25 August 1888 to an illustrious Rajput family in Amritsar. Mashriqi's father Khan Ata Muhammad Khan was an educated man of wealth who owned a bi-weekly publication, Vakil, in Amritsar. His forefathers had held high government positions during the Mughal Empire and Sikh Empire. Through his father's position, as a young man he came into contact with a range of well-known luminaries including Jamāl al-Dīn al-Afghānī, Sir Syed Ahmad Khan, and Shibli Nomani.\n\n\n=== Education ===\nMashriqi was initially educated at home before attending schools in Amritsar. From an early age, he showed a passion for mathematics  After completing his Bachelor of Arts degree with First Class honours at Forman Christian College in Lahore, he completed his master's degree in Mathematics from the University of the Punjab, taking a First Class for the first time in the history of the University.\nIn 1907 he moved to England, where he matriculated at Christ's College, Cambridge, to read for the mathematics tripos. He was awarded a college foundation scholarship in May 1908. In June 1909 he was awarded first class honours in Mathematics Part I, being placed joint 27th out of 31 on the list of wranglers. For the next two years, he read for the oriental languages tripos in parallel to the natural sciences tripos, gaining first class honours in the former and third class in the latter.\nAfter three years' residence at Cambridge he had qualified for a Bachelor of Arts degree, which he took in 1910. In 1912 he completed a fourth tripos in mechanical sciences, and was placed in the second class. At the time he was believed to be the first man of any nationality to achieve honours in four different Triposes, and was lauded in national newspapers across the UK. The next year, Mashriqi was conferred with a DPhil in mathematics receiving a gold medal in his doctoral graduation ceremony.\nHe left Cambridge and returned to India in December 1912. During his stay in Cambridge his religious and scientific conviction was inspired by the works and concepts of the professor Sir James Jeans.\n\n\n== Early career ==\nOn his return to India, Mashriqi was offered the premiership of Alwar, a princely state, by the Maharaja. He declined owing to his interest in education. At the age of 25, and only a few months after arriving in India, he was appointed Vice Principal of Islamia College, Peshawar, by Chief Commissioner Sir George Roos-Keppel and was made Principal of the same college two years later. In October 1917 he was appointed Under Secretary to the Government of India in the Education Department in succession to Sir George Anderson. He became headmaster of the High School, Peshawar on 21 October 1919.\nIn 1920 the British government offered Mashriqi the Ambassadorship of Afghanistan and a year later he was offered a knighthood. He however refused both awards.\nIn 1930 he was passed over for a promotion in the government service, following which he went on medical leave. In 1932 he resigned, taking his pension, and settled down in Ichhra, Lahore.\n\n\n=== Nobel nomination ===\nIn 1924, at the age of 36, Mashriqi completed the first volume of his book, Tazkirah. It is a commentary on the Qur'an in the light of science. It was nominated for the Nobel Prize in 1925, subject to the condition it was translated into one of the European languages. Mashriqi, however, declined the suggestion of translation.\n\n\n== Political life ==\n\n\n=== Mashriqi's philosophy ===\nHe declared that the science of religions was essentially the science of collective evolution of mankind; all prophets came to unite mankind, not to disrupt it; the basic law of all faiths is the law of unification and consolidation of the entire humanity. According to Markus Daeschel, the philosophical ruminations of Mashriqi offer an opportunity to re-evaluate the meaning of colonial modernity and notion of post-colonial nation-building in modern times.\nMashriqi is often portrayed as a controversial figure, a religious activist, a revolutionary, and an anarchist; while at the same time he is described as a visionary, a reformer, a leader, and a scientist-philosopher who was born ahead of his time.\nAfter Mashriqi resigned from government service, he laid the foundation of the Khaksar Tehrik (also known as Khaksar Movement) in 1930.\n\n\n=== Imprisonments and allegations ===\nOn 20 July 1943, an assassination attempt was made on Muhammad Ali Jinnah by Rafiq Sabir who was assumed to be a Khaksar worker. The attack was deplored by Mashriqi, who denied any involvement. Later, Justice Blagden of Bombay High Court, in his ruling on 4 November 1943 dismissed any association of Khaksars.\nIn Pakistan, Mashriqi was imprisoned at least five times: in 1950 prior to election; in 1958 for alleged complicity in the murder of republican leader Khan Abdul Jabbar Khan; and, in 1962 for suspicion on attempt to overthrow President Ayub's government. However, none of the charges were proved, and he was acquitted in each case.\nIn 1957 Mashriqi allegedly led 300,000 of his followers to the borders of Kashmir, intending, it is said, to launch a fight for its liberation. However, the Pakistan government persuaded the group to withdraw and the organisation was later disbanded.\n\n\n== Death ==\nMashriqi died at the Mayo Hospital in Lahore on 27 August 1963 following a short battle with cancer. His funeral prayers were held at the Badshahi Mosque and he was laid to rest in Ichhra. He was survived by his wife and seven children.\n\n\n== Mashriqi's works ==\nMashriqi's prominent works include:\nArmughan-i-Hakeem, a poetical work\nDahulbab, a poetical work\nIsha’arat, the \"Bible\" of the Khaksar movement\nKhitab-e-Misr (The Egypt Address), based on his 1925 speech in Cairo as a delegate to the Motmar-e-Khilafat\nMaulvi Ka Ghalat Mazhab\nTazkirah Volume I, 1924, discussions on conflicts between religions, between religion and science, and the need to resolve these conflicts\nTazkirah Volume II. Posthumously published in 1964\nTazkirah Volume III.\n\n\n=== Fellowships ===\nMashriqi's fellowships included:\nFellow of the Royal Society of Arts, 1923\nFellow of the Geographical Society (F.G.S), Paris\nFellow of Society of Arts (F.S.A), Paris\nMember of the Board at Delhi University\nPresident of the Mathematical Society, Islamia College, Peshawar\nMember of the International Congress of Orientalists (Leiden), 1930\nPresident of the All World's Faiths Conference, 1937\n\n\n=== Edited works ===\nGod, man, and universe: as conceived by a mathematician (works of Inayatullah Khan el-Mashriqi), Akhuwat Publications, Rawalpindi, 1980 (edited by Syed Shabbir Hussain).\n\n\n== See also ==\nPakistan Movement\nTeilhard de Chardin\nKarl Marx\n\n\n== References ==", "ns": 0, "pageid": 4146026, "title": "Inayatullah Khan Mashriqi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}