{"batchcomplete": "", "query": {"normalized": [{"to": "Iris Marion Young", "from": "Iris_Marion_Young"}], "pages": {"4213262": {"extract": "Iris Marion Young (2 January 1949 – 1 August 2006) was a political theorist and feminist focused on the nature of justice and social difference. She served as Professor of Political Science at the University of Chicago and was affiliated with the Center for Gender Studies and the Human Rights program there. Her research covered contemporary political theory, feminist social theory, and normative analysis of public policy. She believed in the importance of political activism and encouraged her students to involve themselves in their communities.\n\n\n== Early life ==\nYoung was born in New York City and studied philosophy and graduated with honors at Queens College. She was awarded a Master's degree and PhD in philosophy by Pennsylvania State University in 1974.\n\n\n== Career ==\nBefore coming to the University of Chicago she taught political theory for nine years in the Graduate School of Public and International Affairs at the University of Pittsburgh, and before then taught philosophy at several institutions, including the Worcester Polytechnic Institute and Miami University. During the summer term of 1995 Young was a Visiting Professor of Philosophy at the Johann Wolfgang Goethe University in Frankfurt, Germany. Young held visiting fellowships at several universities and institutes around the world, including the Institute for Advanced Study in Princeton, New Jersey, the Institute for Human Sciences in Vienna, the Australian National University, the University of Canterbury in New Zealand, and the Human Sciences Research Council of South Africa.\n\n\n== Philosophical contributions ==\nYoung's interests ranged broadly, including contemporary theories of justice; democracy and difference; feminist political theory; continental political theory including Michel Foucault and Jürgen Habermas; ethics and international affairs; gender, race and public policy.\n\n\n=== Social groups and the politics of difference ===\nCentral to Young's philosophy is the contention that concepts of justice were not limited to individual desert. Instead, the recognition of social groups was essential redressing structural inequalities. Because the social rules, laws, and institutional routines constraining certain people constrain them as a group, and because our awareness of injustice almost universally compares classes of people rather than individuals directly, our evaluations of inequality and injustice must recognize the salience of social groups as constituent of a complete theory of justice.\nYoung's recognition of social groups impelled her to argue for a post-liberal \"politics of difference,\" in which equal treatment of individuals does not override the redress of group-based oppression. Young contrasted her approach with contemporary liberal political philosophers like John Rawls and Ronald Dworkin, who she claims conflate the moral equivalence of people with procedural rules that treat all people equally.\n\n\n=== Five Faces of Oppression ===\nAmong Young's most widely disseminated ideas is her model of the \"five faces of oppression,\" first published in Justice and the Politics of Difference (1990). Synthesizing feminist, queer, poststructuralist, and post-colonial critiques of classical Marxism, Young argued at least five distinct types of oppression could not be collapsed into more fundamental causes, and furthermore could not be reduced to dimensions of distributive justice. Her \"five faces\" are:\nExploitation\nMarginalization\nPowerlessness\nCultural domination\nViolence\n\n\n=== Embodied Phenomenology ===\nOne of Young's most well-known essays is \"Throwing Like a Girl: A Phenomenology of Feminine Body Comportment Motility and Spatiality,\" first published in Human Studies (1980). In it she explores differences in feminine and masculine movement in the context of a gendered and embodied phenomenological perspective based on ideas from Simone de Beauvoir and Maurice Merleau-Ponty. She discusses how girls are socialized and conditioned to restrict their body movement and think of their bodies as fragile, which then has repercussions for their confidence in accomplishing tasks and goals later in life.\n\n\n== Later life ==\nYoung died, aged 57, on 1 August 2006 after an 18-month struggle with esophageal cancer.\n\n\n== Memoriam activities ==\nIn recognition of her work with the Center for Gender Studies at the University of Chicago, the Center's distinguished faculty lecture series was renamed in her honor in November 2006. In addition, the University of Pittsburgh Gender, Sexuality, and Women's Studies Program, in collaboration with the University of Pittsburgh Graduate School of Public and International Affairs, created the Iris Marion Young Award for Political Engagement in 2008 to honor Young's memory and to recognize faculty/staff, graduate, and undergraduate members of the University who impact the community. Young was also honored at Penn State University through a series of gifts which created the Iris Marion Young Diversity Scholar Award as part of the association for Feminist Ethics and Social Theory's and the Rock Ethics Institute's Philosophy in an Inclusive Key Summer Institute. This Institute is designed to encourage undergraduate students from under-represented groups to consider future study in the field of philosophy. Students who are part of this summer institute are awarded the Iris Marion Young Diversity Award and their studies during the institute include her work.\n\n\n== Selected bibliography ==\n\n\n=== Books ===\nYoung, Iris Marion; Allen, Jeffner (1989). The thinking muse: feminism and modern French philosophy. Bloomington: Indiana University Press. ISBN 9780253205025. \nYoung, Iris (1990). Justice and the politics of difference. Princeton, New Jersey: Princeton University Press. ISBN 9780691023151. \nYoung, Iris (1997). Intersecting voices: dilemmas of gender, political philosophy, and policy. Princeton, New Jersey: Princeton University Press. ISBN 9780691012001. \nYoung, Iris Marion; DiQuinzio, Patrice (1997). Feminist ethics and social policy. Bloomington: Indiana University Press. ISBN 9780585025438. \nYoung, Iris Marion; Jaggar, Alison (2000). A companion to feminist philosophy. Malden, Massachusetts: Blackwell. ISBN 9780631227649. \nYoung, Iris (2000). Inclusion and democracy. Oxford New York: Oxford University Press. ISBN 9780198297550. \nYoung, Iris (2002) [1990]. Throwing like a girl and other essays in feminist philosophy and social theory. Ann Arbor, Michigan: UMI Books on Demand. ISBN 9780608050478. \nYoung, Iris Marion; Macedo, Stephen (2003). Child, family, and state. New York: New York University Press. ISBN 9780814756829.  (Conference proceedings)\nYoung, Iris (2007). Global challenges: war, self determination and responsibility for justice. Cambridge Malden, Massachusetts: Polity. ISBN 9780745638355. \nYoung, Iris Marion; Shanley, Mary Lyndon; O'Neill, Daniel (2008). Illusion of consent engaging with Carole Pateman. University Park, Pennsylvania: Pennsylvania State University Press. ISBN 9780271035918. \nYoung, Iris (2011). Responsibility for justice. Oxford New York: Oxford University Press. ISBN 9780199970957. \nYoung, Iris Marion; Levy, Jacob (2011). Colonialism and its legacies. Lanham, Maryland: Lexington Books. ISBN 9780739142943. \n\n\n=== Chapters in books ===\nYoung, Iris Marion (1995), \"Gender as seriality: thinking about women as a social collective\", in Brenner, Johanna; Laslett, Barbara; Arat, Yasmin, Rethinking the political: women, resistance, and the state, Chicago: University of Chicago Press, pp. 99–124, ISBN 9780226073996. \nYoung, Iris Marion (2001), \"Pushing for inclusion: Justice and the politics of difference\", in Terchek, Ronald J.; Conte, Thomas C., Theories of democracy: a reader, Lanham, Maryland: Rowman & Littlefield Publishers, pp. 268–278, ISBN 9780847697250. \nYoung, Iris Marion (2005), \"Five faces of oppression\", in Cudd, Ann E.; Andreasen, Robin O., Feminist theory: a philosophical anthology, Oxford, UK Malden, Massachusetts: Blackwell Publishing, pp. 91–104, ISBN 9781405116619. \nYoung, Iris Marion (2005), \"The logic of masculinist protection: reflections on the current security state\", in Friedman, Marilyn, Women and citizenship, Studies in Feminist Philosophy, Oxford New York: Oxford University Press, pp. 15–34, ISBN 9780195175356. \n\n\n=== Articles ===\nYoung, Iris Marion (1980). \"Throwing Like a Girl: A Phenomenology of Feminine Body Comportment Motility and Spatiality\". Human Studies 3 (2): 137-156. JSTOR 20008753.\nYoung, Iris Marion (1985). \"Humanism, gynocentrism and feminist politics\". Women's Studies International Forum. Elsevier. 8 (3): 173–183. doi:10.1016/0277-5395(85)90040-8. \nYoung, Iris Marion (January 1989). \"Polity and group difference: A critique of the ideal of universal citizenship\". Ethics. University of Chicago Press. 99 (2): 250–274. JSTOR 2381434. \nYoung, Iris Marion (1997). \"On the politization of the social in recent western political theory\". Filozofski vestnik. Slovenian Academy of Sciences and Arts. 18 (2): 153–176. OCLC 438842134. \nHer writings have been translated into several languages, including German, Italian, Portuguese, Spanish, French, Swedish and Croatian, and she lectured widely in North America, Europe, Australia and South Africa.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nFainstein, Susan S. (March 2007). \"Iris Marion Young (1949-2006): A tribute\". Antipode (journal). Wiley. 39 (2): 382–387. doi:10.1111/j.1467-8330.2007.00517.x. \nMemorial Website from Chicago Political Theory Graduate Student Caucus\nPhilosophy in an Inclusive Key Summer Institute", "ns": 0, "pageid": 4213262, "title": "Iris Marion Young"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}