{"batchcomplete": "", "query": {"normalized": [{"to": "Isaac Levi", "from": "Isaac_Levi"}], "pages": {"8997788": {"extract": "Isaac Levi (born June 30, 1930), is an American philosopher. He is the John Dewey Professor of Philosophy Emeritus at Columbia University. Levi came onto the philosophic scene with his groundbreaking first book, Gambling with Truth. In the text Levi offers a decision theoretic reconstruction of epistemology with a close-eye towards the classical pragmatist philosophers like William James and Charles Sanders Peirce. Levi is known for his pioneering work in belief revision and imprecise probability.\nLevi is one of several doctoral students of Ernest Nagel who were influential in American post-war philosophy; others were Morton White, Patrick Suppes, Henry Kyburg, and Frederic Schick. Levi also served as doctoral advisor to prominent formal philosophers, including Horacio Arló-Costa and Teddy Seidenfeld. Morgenbesser once quipped that Seidenfeld, who studied under Kyburg as an undergraduate, was Kyburg's revenge upon Levi. There is a rich literature of debate between Kyburg and Levi on topics in what has come to be known as formal epistemology.\n\n\n== Major publications ==\n\n\n=== Books ===\nLevi, Isaac (1973). Gambling with truth; an essay on induction and the aims of science. Cambridge, Massachusetts: MIT Press. ISBN 9780262620260.  Originally issued by Knopf (1967).\nLevi, Isaac (1983). The enterprise of knowledge: an essay on knowledge, credal probability, and chance. Cambridge, Massachusetts: MIT Press. ISBN 9780262620437. \nLevi, Isaac (1990). Hard choices: decision making under unresolved conflict. Cambridge New York: Cambridge University Press. ISBN 9780521386302. \nLevi, Isaac (1996). For the sake of the argument: ramsey test conditionals, inductive inference and nonmonotonic reasoning. Cambridge, Massachusetts: Cambridge university press. ISBN 9780521039017. \nLevi, Isaac (1997). The covenant of reason rationality and the commitments of thought. Cambridge New York: Cambridge University Press. ISBN 9781139173032. \nLevi, Isaac (2006). Decisions and revisions: philosophical essays on knowledge and value. Cambridge, Massachusetts: Cambridge University Press. ISBN 9780521027625. \nLevi, Isaac (2009). The fixation of belief and its undoing: changing beliefs through inquiry. Cambridge, Massachusetts: Cambridge University Press. ISBN 9780521110297. \n\n\n=== Chapters in books ===\nLevi, Isaac (2009), \"Convexity and separability in representing consensus\", in Kanbur, Ravi; Basu, Kaushik, Arguments for a better world: essays in honor of Amartya Sen | Volume I: Ethics, welfare, and measurement, Oxford New York: Oxford University Press, pp. 193–212, ISBN 9780199239115. \n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==", "ns": 0, "pageid": 8997788, "title": "Isaac Levi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}