{"batchcomplete": "", "query": {"normalized": [{"to": "Isabel Paterson", "from": "Isabel_Paterson"}], "pages": {"1400094": {"extract": "Isabel Paterson (January 22, 1886 – January 10, 1961) was a Canadian-American journalist, novelist, political philosopher, and a leading literary and cultural critic of her day. Along with Rose Wilder Lane and Ayn Rand, who both acknowledged an intellectual debt to Paterson, she is one of the three founding mothers of American libertarianism. Paterson's best-known work, her 1943 book The God of the Machine, a treatise on political philosophy, economics, and history, reached conclusions and espoused beliefs that many libertarians credit as a foundation of their philosophy. Her biographer Stephen D. Cox (2004) believes Paterson was the \"earliest progenitor of libertarianism as we know it today.\" In a letter of 1943, Ayn Rand wrote that The God of the Machine is a document that could literally save the world ... The God of the Machine does for capitalism what Das Kapital does for the Reds and what the Bible did for Christianity.\"\n\n\n== Life ==\nBorn Isabel Mary Bowler in rural Manitoulin Island, Ontario, she moved with her family to the west when she was very young. She grew up on a cattle ranch in Alberta. Paterson's family was quite poor and she had eight siblings. A voracious reader who was largely self-educated, she had brief and informal public schooling during these years: about three years in a country school, from the ages of 11 to 14. In her late teen years, Bowler left the ranch for the city of Calgary, where she took a clerical job with the Canadian Pacific Railway. As a teenager, she worked as a waitress, stenographer, and bookkeeper, working at one point as an assistant to future Canadian Prime Minister R. B. Bennett.\nThis hardscrabble youth probably led Paterson to attach great importance to productive \"self-starters\". Although she was articulate, well-read, and erudite, Paterson had extremely limited formal education, an experience she shared with Rose Wilder Lane, who was also Paterson's friend and correspondent for many years.\nIn 1910, at the age of 24, Bowler entered into a short-lived marriage with Canadian Kenneth B. Paterson. The marriage was not happy, and they parted in 1918. It was during these years, in a foray south of the border, that Paterson landed a job with a newspaper, the Inland Herald in Spokane, Washington. Initially she worked in the business department of the paper, but later transferred to the editorial department. There her journalistic career began. Her next position was with a newspaper in Vancouver, British Columbia, where for two years she wrote drama reviews.\n\n\n=== Writer and critic ===\nIn 1914, Paterson started submitting her first two novels, The Magpie's Nest and The Shadow Riders, to publishers, without much success. It was not until 1916 that her second novel The Shadow Riders was accepted and published by John Lane Company, which also published The Magpie's Nest the following year in 1917.\nAfter World War I, she moved to New York City, where she worked for the sculptor Gutzon Borglum. He was creating statues for the Cathedral of Saint John the Divine and would later carve the memorial at Mount Rushmore. Paterson also wrote for the World and the American in New York.\nIn 1921, Paterson became an assistant to Burton Rascoe, the new literary editor of the New York Tribune, later the New York Herald Tribune. For 25 years, from 1924 to 1949, she wrote a column (signed \"I.M.P.\") for the Herald Tribune's \"Books\" section. Paterson became one of the most influential literary critics of her time. She covered a time of great expansion in the United States literary world, with new work by the rising generation of Ernest Hemingway, F. Scott Fitzgerald and many others, African Americans of the Harlem Renaissance, as well as the first American generation of the great waves of European immigrants. Her friends during this period included the famous humorist Will Cuppy. In 1928 she became an American citizen, at the age of 42.\nShe was notorious for demonstrating her sharp wit and goring of sacred cows in her column, where she also first articulated many of the political ideas that reached their final form in The God of the Machine. Her thinking, especially on free trade, was also foreshadowed in her historical novels of the 1920s and 1930s. Paterson opposed most of the economic program known as the New Deal, which American president Franklin D. Roosevelt put into effect during the Great Depression. She advocated less government involvement in both social and fiscal issues.\n\n\n=== Paterson and Ayn Rand ===\nBy the late 1930s, Paterson led a group of younger writers, many of them other Herald Tribune employees, who shared her views. One was future Time magazine correspondent and editor Sam Welles.\nAnother was the young Ayn Rand. From their many discussions, Paterson is credited with adding to Rand's knowledge of American history and government, and Rand with contributing ideas to The God of the Machine. Paterson believed Rand's ethics to be a unique contribution, writing to Rand in the 1940s, \"You still don't seem to know yourself that your idea is new. It is not Nietzsche or Max Stirner... Their supposed Ego was composed of whirling words – your concept of the Ego is an entity, a person, a living creature functioning in concrete reality.\"\nPaterson and Rand promoted each other's books and conducted an extensive correspondence over the years, in which they often touched on religion and philosophy. An atheist, Rand was critical of the deist Paterson's attempts to link capitalism with religion. Rand believed the two to be incompatible, and the two argued at length. Their correspondence ended after they quarreled in 1948. During a visit to Rand at her home in California, Paterson's remarks about writer Morrie Ryskind and abrasive behavior toward businessman William C. Mullendore, other guests of Rand, resulted in Rand's disillusionment with \"Pat.\"\nSimilarly, Paterson had broken with another friend and political ally, Rose Wilder Lane, in 1946.\nAs a sign of the political tenor of the times, The God of the Machine was published in the same year as Rand's novel The Fountainhead and Rose Wilder Lane's The Discovery of Freedom. Writer Albert Jay Nock wrote that Lane's and Paterson's nonfiction books were \"the only intelligible books on the philosophy of individualism that have been written in America this century.\" The two women had \"shown the male world of this period how to think fundamentally... They don't fumble and fiddle around – every shot goes straight to the centre.\" Journalist John Chamberlain credits Paterson, Lane and Rand with his final \"conversion\" from socialism to what he called \"an older American philosophy\" of libertarian and conservative ideas.\n\n\n=== Later years ===\nPaterson further influenced the post-WWII rise of lettered American conservatism through her correspondence with the young Russell Kirk in the 1940s, and with the young William F. Buckley in the 1950s. Buckley and Kirk went on to found the National Review, to which Paterson contributed for a brief time. However, she sometimes sharply differed from Buckley, for example by disagreeing with the magazine's review of Rand's novel, Atlas Shrugged.\nIn her retirement, Paterson declined to enroll in Social Security and kept her Social Security card in an envelope with words \"'Social Security' Swindle\" written on it.\nPaterson died on January 10, 1960, and was interred in the Welles family plot at Saint Mary's Episcopal Churchyard in Burlington, New Jersey.\n\n\n== Quotations ==\n\"Most of the harm in the world is done by good people, and not by accident, lapse, or omission. It is the result of their deliberate actions, long persevered in, which they hold to be motivated by high ideals toward virtuous ends... when millions are slaughtered, when torture is practiced, starvation enforced, oppression made a policy, as at present over a large part of the world, and as it has often been in the past, it must be at the behest of very many good people, and even by their direct action, for what they consider a worthy object.\" (The God of the Machine)\n\n\n== Bibliography ==\n1916. The Shadow Riders (online e-book).\n1917. The Magpie's Nest (online e-book).\n1924. The Singing Season\n1926. The Fourth Queen\n1930. The Road of the Gods\n1933. Never Ask the End (online e-book).\n1934. The Golden Vanity\n1940. If It Prove Fair Weather\n1943. The God of the Machine (online e-book).\nUnpublished. Joyous Gard (Completed 1958.)\n\n\n== References ==\n\n\n== Further reading ==\nBeito, David T. and Beito, Linda Royster, \"Isabel Paterson, Rose Wilder Lane, and Zora Neale Hurston on War, Race, the State, and Liberty\", Independent Review 12 (Spring 2008).\nBurns, Jennifer. Goddess of the Market: Ayn Rand and the American Right, Oxford Univ. Press, 2009.\nChamberlain, John. A Life with the Printed Word. Chicago: Regnery, 1982.\nCox, Stephen, ed. (2015). Culture and Liberty: Writings of Isabel Paterson. New Brunswick NJ, USA: Transaction Publishers, 2015.\nCox, Stephen (2008). \"Paterson, Isabel (1886–1961)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 372–3. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \nCox, Stephen. “Representing Isabel Paterson,” American Literary History, 17 (Summer, 2005), 244-58.\nCox, Stephen. The Woman and the Dynamo: Isabel Paterson and the Idea of America. New Brunswick NJ, USA: Transaction Publishers, 2004.\nDoherty, Brian, Radicals for Capitalism: A Freewheeling History of the Modern American Libertarian Movement. New York: Public Affairs, 2007.\nHeller, Anne C. (2010). Ayn Rand and the World She Made. New York: Nan A. Talese-Doubleday.\n\n\n== External links ==\nCato Institute: Isabel Paterson 1886–1961.\nCato Institute: The God of the Machine.\nDoherty, Brian, Review of Cox (2004), Reason, February 2005.\nNeglectedBooks.com: Review and Excerpt from The Golden Vanity\nNeglectedBooks.com: Review of If It Prove Fair Weather\nNeglectedBooks.com: Review and Excerpt from Never Ask the End\nNeglectedBooks.com: Review of The Shadow Riders\nRationalReview.com: Essay-Review on Cox by Jeff Riggenbach\nReview of The Golden Vanity, Milwaukee Journal, December 23, 1934.\nIsabel Paterson at Find a Grave\nIsabel Paterson, The Humanitarian with the Guillotine (1943)\nIsabel Paterson at Goodreads", "ns": 0, "pageid": 1400094, "title": "Isabel Paterson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}