{"batchcomplete": "", "query": {"normalized": [{"to": "Israr Ahmed", "from": "Israr_Ahmed"}], "pages": {"2618354": {"extract": "Israr Ahmed (Urdu: ڈاکٹر اسرار احمد‎; 26 April 1932 – 14 April 2010; Msc, MBBS) was a prominent Pakistani Islamic theologian, philosopher, and an Islamic scholar followed particularly in South Asia as well as by a number of South Asian Muslums in the Middle East, Western Europe, and North America.\nHe was the founder of the Tanzeem-e-Islami and an offshoot activist of the rightist Jamaat-e-Islami. Ahmed wrote and published 60 books on different aspects of Islam and religion, nine of which were translated into English. Prior to that, he was a television personality and daily hosted a religious show on Peace TV.\n\n\n== Early life and education ==\nIsrar Ahmed was born in Hisar, a province of East Punjab of British Indian Empire, on 26 April 1932. His father was a civil servant in British Government and had his family settled from Hisar to Montgomery, now Sahiwal, Punjab Province of Pakistan. His brother Absar Ahmed is a philosopher.\nAfter graduating from a local high school, Ahmed moved to Lahore to attend the King Edward Medical University in 1950. There, he received MBBS from King Edward Medical University in 1954 and began practising medicine. During his university studies, he worked briefly for Muslim Students Federation and was Nazim-e-Aala of the Islami Jamiat-e-Talba.\nIn 1950, he joined Jamaat-e-Islami led by Abul Ala Maududi, but left the party when the latter opted for participating in electoral politics in 1957. Ahmed resigned from the Jamaat-e-Islami in April 1957 because of its involvement in the national politics, which he believed was irreconcilable with the revolutionary methodology adopted by the Jama'at in the pre-1947 period. His interest in Islam and philosophy grew further and he subsequently moved to Karachi, Sindh Province in the 1960s where he enrolled in Karachi University. After submitting his thesis in 1965, he earned his MSc in Islamic Studies from Karachi University.\n\n\n== Work ==\n\n\n=== Religious teachings ===\nAhmed studied Islamic philosophy and recited the Qur'an while a student at Karachi University. At the university, he briefly lectured in philosophy and lectured in Qur'anic as well as Islamic traditions in different universities of Pakistan. In 1965, he sometime affiliated with the religious society but alleviated himself due to methodological differences.\nHe maintained a visiting lectureship position in Karachi University to lecture in philosophy, later moving to the Punjab University during the last years of his life.\n\n\n=== Literature and philosophy ===\nIn 1967, Ahmed wrote and published the important philosophy book, the \"Islamic Renaissance: The Real Task Ahead\", in which he briefly explained the abstract idea of the Caliphate system. He vehemently maintained that only by revitalising concept and importance of faith among the Muslims in general and intelligentsia in particular. His solution was to teach Qur'an in contemporary idiom backed by the highest level of scholarship. Commenting on scientific aspects, Ahmed wrote that \"this undertaking would remove the existing dichotomy between modern physical and social sciences on the one hand, and Islamic revealed knowledge on the other.\"\nIn 1971 Ahmed gave up his medical practice to devote himself fully to the Islamic revival. In 1972, he established (or helped establish) the Markazi Anjuman Khuddam-ul-Qur'an Lahore, Tanzeem-e-Islami was founded in 1975, and Tahreek-e-Khilafat Pakistan was launched in 1991.\nHe criticised modern democracy and the prevalent electoral system and argued that the head of an Islamic state could reject the majority decisions of an elected assembly. Although he did not like to receive it personally, Ahmed was awarded Sitara-i-Imtiaz in 1981. He has to his credit over 60 books in Urdu on topics related to Islam and Pakistan, nine of which have been translated into English and other languages.\nHis television lectures generally focused on the revitalisation of the Islamic faith through studies of the Quran. Since early 2000s he started appearing on PeaceTV and lectured on Qur'an and Islam.\n\n\n== Health ==\nAhmed relinquished the leadership of Tanzeem-e-Islami in October 2002 on grounds of bad health and Hafiz Akif Saeed is the present Ameer of the Tanzeem to whom all rufaqaa of Tanzeem renewed their pledge of Baiyah.\n\n\n== Influences ==\nSupporters describe his vision of Islam as having been synthesised from the diverse sources. He has also acknowledged the \"deep influence\" of Shah Waliullah Dehlavi, the 18th century Indian Islamic leader, anti-colonial activist, jurist, and scholar. Ahmed followed the thinking of Maulana Hamiduddin Farahi and Maulana Amin Ahsan Islahi, concerning what his followers believe is the \"internal coherence of and the principles of deep reflection in the Qur'an\". Furthermore, Ahmed followed Maulana Abul Kalam Azad and Maulana Sayyid Abul Ala Maududi in regards to what he believes is the \"dynamic and revolutionary conception of Islam.\"\n\"In the context of Qur'anic exegesis and understanding, Ahmed was a firm traditionalist of the genre of Maulana Mehmood Hassan Deobandi and Allama Shabbir Ahmed Usmani; yet he presented Qur'anic teachings in a scientific and enlightened way\". Ahmed believed in what he called \"Islamic revolutionary thought,\" which consists of the idea that Islam – the teachings of the Qur'an and the Sunnah – must be implemented in the social, cultural, juristic, political, and economic spheres of life. In this he is said to follow Mohammad Rafiuddin and Muhammad Iqbal. The first attempt towards the actualisation of this concept was reportedly made by Maulana Abul Kalam Azad through his short-lived party, the Hizbullah. Another attempt was made by Maulana Sayyid Abul Ala Maududi through his Jamaat-e-Islami party. Although the Jamaat-e-Islami has reached some influence, Ahmed resigned from the party in 1956 when it entered the electoral process and believed that such an involvement led to \"degeneration from a pure Islamic revolutionary party to a mere political one\".\n\n\n== Tanzeem-e-Islami ==\nOriginally a member of Jamaat-e-Islami, Ahmed became disappointed with its electoral activity, \"significant policy matters\", and what he saw as the \"lack of effort to create an Islamic renaissance through the revolutionary process.\" He and some other individuals resigned from JI and in 1956 founded the nucleus of Tanzeem-e-Islami, an attempt to create a \"disciplined organization.\" \"A resolution was passed which subsequently became the Mission Statement of Tanzeem-e-Islami.\"\nAlong with his work to revive \"the Qur'an-centered Islamic perennial philosophy and world-view\" Ahmed aimed with his party to \"reform the society in a practical way with the ultimate objective of establishing a true Islamic State, or the System of Khilafah\".\n\n\n=== Caliphate ===\nAccording to the Tanzeem-e-Islami website Ahmed and the party believe \"the spiritual and intellectual center of the Muslim world has shifted from the Arab world to the region of Khorasan\" and \"conditions are much more congenial for the establishment of Khilafah in Pakistan\" than in other Muslim countries.\n\n\n=== Hizb ut-Tahrir ===\nAccording to Tanzeem-e-Islami's FAQ, while both Hizb ut-Tahrir and Tanzeem-e-Islami share belief in reviving the Caliphate as a means of implementing Islam in all spheres of life, Tanzeem-e-Islami does not believe in involvement in electoral politics, armed struggle, coup d'état to establish a caliphate, and has no set plan of detailed workings for the future Caliphate. Tanzeem-e-Islami emphasises that iman (faith) among Muslims must be revived in \"a significant portion of the Muslim society\" before there can be an Islamic revival.\n\n\n=== Abul Ala Maududi ===\nWhile Ahmed \"considers himself a product\" of the teachings of \"comprehensive and holistic concept of the Islamic obligations\" of Abul Ala Maududi, he opposes Jamaat-e-Islami's \"plunge\" into \"the arena of power politics,\" which he considered to have been \"disastrous.\"\n\n\n=== Danger of foreign powers ===\n\nIn response to the state of emergency in 2007, Ahmed called for lifting the emergency, reinstatement of Supreme Court justices, and withdrawal of all actions taken in pursuance of the proclamation of emergency and the PCO law besides resignation of President Pervez Musharraf.\nIn a televised press conference, Ahmed called for resignation of Pervez Musharraf from both president and chief of army staff. Ahmed appealed to President General Musharraf to lift the state emergency and step down for the nation's greater interests. At the television news channels, Ahmed also predicted and warned the nation that:\n\n\"If the situation worsens, the NATO forces are waiting on the western front to move into Pakistan and may deprive the country of its nuclear assets while on the eastern front, India is ready to stage an action replay of 1971 events and has alerted its armed forces to intervene in to check threats to peace in the region.\"\n\n\n== Criticism and controversy ==\nIn 2006 Canada's National Post newspapers quoted Ahmed saying:\n\n\"Islam's renaissance will begin in Pakistan... because the Arab world is living under subjugation. Only the Pakistan region has the potential for standing up against the nefarious designs of the global power-brokers and to resist the rising tides of the Jewish/Zionist hegemony.\n\nAsia Times reports that in September 1995 Ahmed told the annual convention of the Islamic Society of North America that:\n\nThe process of the revival of Islam in different parts of the world is real. A final showdown between the Muslim world and the non-Muslim world, which has been captured by the Jews, would soon take place. The Gulf War was just a rehearsal for the coming conflict.\n\nHe appealed to the Muslims of the world, including those in the US, to prepare themselves for the coming conflict.\"\n\n\n== Death and funeral ==\nAhmed died of a cardiac arrest at his home in Lahore on the morning of 14 April 2010 between 3:00 and 3:30 am. According to his son, his health deteriorated at around 1:30 am with pain in the back. He was a long time heart patient.\nHis funeral (Namaz-e-Janazah) was held after the Asr (afternoon) prayers at Central Model-town Park (near Barkat Market) in the city of Lahore.\nTribute was paid to Israr Ahmed by Ibtisam Ilahi Zaheer of Jamait-e-Ahl-e-Hadees, Rafi Usmani of Daarul Uloom Karachi, and Hussain Ahmed of Jamaat-e-Islami.\n\n\n== See also ==\nContemporary Islamic philosophy\nTanzeem-e-Islami\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nOfficial website of Quran Academy\n\nWhat is The Real Blessing of Allah By Dr Israr Ahmad", "ns": 0, "pageid": 2618354, "title": "Israr Ahmed"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}