{"batchcomplete": "", "query": {"normalized": [{"to": "Israel Kirzner", "from": "Israel_Kirzner"}], "pages": {"220602": {"extract": "Israel Meir Kirzner (also Yisroel Mayer Kirzner; born February 13, 1930) is an American economist closely identified with the Austrian School.\n\n\n== Early life ==\nThe son of a well-known rabbi and Talmudist, Kirzner was born in London and came to the United States via South Africa.\n\n\n== Education ==\nAfter studying with the University of Cape Town, South Africa in 1947–48 and with the University of London External Programme in 1950–51, Kirzner received his B.A. summa cum laude from Brooklyn College in 1954, an MBA in 1955 and Ph.D. in 1957 from New York University, where he studied under Ludwig von Mises.\n\n\n== Economics ==\n\nKirzner is emeritus professor of economics at New York University and a leading authority on Ludwig von Mises's thinking and methodology in economics. Kirzner's research on entrepreneurship economics is also widely recognized. His book, Competition and Entrepreneurship criticizes neoclassical theory for its preoccupation with the model of perfect competition, which neglects the important role of the entrepreneur in economic life. Kirzner's work integrating entrepreneurial action into neoclassical economics has been more widely accepted than nearly any other Austrian idea of the late twentieth century. Kirzner's major work is in the economics of knowledge and entrepreneurship and the ethics of markets. Kirzner has said that he agrees with Roger Garrison's statement that Kirzner's work takes the middle ground, as opposed to the recent, more extreme position of some Austrian School economists who deny the relevance of market equilibrium. In 2006, Kirzner received the Global Award for Entrepreneurship Research \" for developing the economic theory emphasizing the importance of the entrepreneur for economic growth and the functioning of the capitalist process.\". Universidad Francisco Marroquín granted him an Honorary Doctorate Degree for his contributions to economic theory.Honorary Doctoral Degrees at Universidad Francisco Marroquín UFM also named its Kirzner Entrepreneurship Center in his honor.\n\n\n== Author ==\nSome of his works on economics include:\n\"Entrepreneurial Discovery and The Competitive Market Process: An Austrian Approach,\" Journal of Economic Literature. (March 1997) via JSTOR\nThe Meaning of Market Process, (Routledge 1992)\nDiscovery, Capitalism and Distributive Justice, (Basil Blackwell 1989)\nDiscovery and the Capitalist Process, (Chicago, 1985)\nThe Economic Point of View: An Essay in the History of Economic Thought, (Kansas City: Sheed and Ward, Inc., 1976; online)\nPerception, Opportunity and Profit: Studies in the Theory of Entrepreneurship, (Chicago, 1973)\nCompetition and Entrepreneurship, (Chicago 1973), ISBN 0-226-43776-0.\nAn Essay on Capital, (A.M. Kelley, 1966)\nMarket Theory and the Price System, (Van Nostrand, 1963)\nLiberty Fund is currently publishing Israel Kizner's Collected Works in ten volumes under the supervision of Peter Boettke and Frederic Sautet. The first volume, The Economic Point of View, came out in December 2009, the second volume, Market Theory and the Price System, in May 2011 and the third volume, Essays on Capital, in June 2012. The fourth volume, Competition and Entrepreneurship, is scheduled to come out in 2013, which will also be the year of the 40th anniversary of the publication of the book.\n\n\n== Judaic scholar ==\nKirzner is also an ordained rabbi and Talmudic scholar, and serves as the rabbi of the congregation once headed by his father in Brooklyn, New York. He is one of the most famous disciples of Rabbi Isaac Hutner, the late dean of the Yeshiva Rabbi Chaim Berlin, where he studied for many years during the same years he obtained his academic training. Kirzner is an authority on Hutner's writings and is one of the few official editors of all sources that Hutner quotes.\n\n\n== References ==\n\nDoherty, Brian (2008). \"Kirzner, Israel M. (1930– )\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 271–2. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \n\n\n== External links ==\nIsrael Kirzner's Faculty Page\nFirst volume of Israel M. Kirzner's Collected Works edited by Peter Boettke and Frederic Sautet published in 2009 by Liberty Fund\nCausa Liberal's Collection of Kirzner essay links\nAn Interview with Israel M. Kirzner: Between Mises and Keynes\nIsrael Kirzner at DMOZ\nArticle \"Azione e funzione imprenditoriale: Kirzner e i suoi critici\", by Adriano Gianturco Gulisano, Nuova civilità delle macchine. Liberalismo e anarcocapitalismo, n° 1–2, 2011, pp. 371–96. (in Italian)\nIsrael Kirzner at Goodreads", "ns": 0, "pageid": 220602, "title": "Israel Kirzner"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}