{"batchcomplete": "", "query": {"normalized": [{"to": "Ivan Sviták", "from": "Ivan_Sviták"}], "pages": {"22794175": {"extract": "Ivan Sviták (10 October 1925 in Hranice na Moravě – 20 October 1994 in Prague) was a Czech philosopher, critic, and poet who ranked among Europe's most prominent proponents of Marxist humanism. In a vast oeuvre of essays, Sviták addressed questions of democracy and socialism, of art in bureaucratic and consumer societies, and of the \"unbearable burden\" of political catastrophe in Czech history. In addition, Sviták wrote an extensive body of fiction and poetry, in which he \"sought a unity of philosophy, literature, and politics, a unity of engagement, wisdom, and poetry.\" In this, Sviták consciously followed in the footsteps of the surrealist movement that he admired and critically defended on numerous occasions\nIn the 1960s, Sviták was one of Czechoslovakia's most vocal advocates of democratic socialism (a distinction he shared with Karel Kosík, Czechoslovakia's other prominent Marxist humanist philosopher). After the Warsaw Pact invasion of Czechoslovakia in August 1968, Sviták was stripped of his citizenship and sentenced to a lengthy jail term. Instead of serving the jail term, he chose to emigrate, first to New York and in 1970 to Chico, California, where he was offered an academic position. Sviták worked at Cal State Chico until 1990, when he returned to Czechoslovakia after the end of Communist Party rule. In the early 1990s Sviták remained a staunch proponent of democratic socialism, turning his critical pen to the new, post-Communist regime. He died in Prague in 1994.\n\n\n== Selected Publications in English ==\nMan and his World: A Marxian View, New York, Dell Pub. Co., 1970 (translation of Lidský smysl kultury, including a slightly different selection of essays)\nThe Czechoslovak Experiment, 1968-1969, New York, Columbia U. Press, 1971\n“Illusions of Czech Socialist Democracy”. Telos 22 (Winter 1974-75). New York: Telos Press.\nThe Unbearable Burden of History: The Sovietization of Czechoslovakia, Academia, 1990\n\n\n== Selected Publications in Czech ==\nLidský smysl kultury : eseje (\"The Human Meaning of Culture,\" translated as \"Man and His World\"), Prague 1968\nDialektika moci (\"The Dialectic of Power\"), Cologne, 1973\nDěvčátko s červenou mašlí : povídky a pohádky (\"The Girl with the Red Ribbon: Stories and Fairy Tales\"), Zürich, 1975\nNevědecká antropologie : dialectica modo bohemico demonstrata (\"Unscientific Anthropology\"), Chico, California, 1984\nNárod na křižovatce : dialektika dějin (\"The Nation at a Crossroads: The Dialectic of History\"), Prague, 1989\nBudoucnost bez komunismu (\"The Future without Communism\"), Prague, 1990\nKulatý čtverec : dialektika demokratizace : úvahy a statě, članky z let 1968-1969 (\"Squaring the Circle: The Dialectic of Democratization: Reflections and Articles from 1968-1969\"), Prague, 1990\nZtracené iluze : výroční zpráva o sametové revoluci (\"Lost Illusions: An Anniversary Message about the Velvet Revolution\"), Prague, 1990\nCesta odnikud nikam (\"The Road from Nowhere to Nowhere\"), Prague, 1991\nDevět životů : konkrétní dialektika (\"Nine Lives: Concrete Dialectics\"), Prague, 1992\n\n\n== References ==", "ns": 0, "pageid": 22794175, "title": "Ivan Sviták"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}