{"batchcomplete": "", "query": {"normalized": [{"to": "Ivan Orlov (philosopher)", "from": "Ivan_Orlov_(philosopher)"}], "pages": {"4820576": {"extract": "Orlov, Ivan Efimovich (October 1 (old style) 1886 Galich, Kostroma district Russia – 1936) was a philosopher, a forerunner of relevant and other substructural logics, and an industrial chemist. The date of his death is unknown but is believed to have occurred no earlier than 1936.\n\n\n== Education and Scientific Career ==\nOrlov studied at the Natural Sciences Faculty of Moscow University. His academic career began in 1916, when he published several papers related to the method of inductive reasoning and the notion of inductive proof. For 7 years beginning 1916, he published no scientific work, presumably because of the political turmoil of the era. In the 1920s, he taught in the newly established Communist Academy, and was an officer at the Chemical Institute.\nIn 1923 Orlov resumed his academic activity, becoming very productive. Most of his papers were published in leading Soviet ideological journals, where he waxed polemical in the manner typical of that place and time. Orlov's work bore on the philosophy of mathematics and logic, specifically on the so-called dialectical logic, Marxist in nature. He wrote on the theory of probability, psychology, theory of music, and on chemical engineering.\n\n\n== Logic ==\nAnalyzing the development of the natural sciences, he sought to uncover their specific \"logic.\" According to Orlov, the laws of thought should be treated as formal rules, bounded by the laws of identity and contradiction. (When Orlov wrote this, the invention of natural deduction, the sequent calculus, and the semantic tableaux all lay in the future.) We must seek the semantic relation between antecedent and consequent. The main \"contradiction of logic\" manifests itself in the linkage of premise and corollary, and requires a logic different from the traditional one. If we insist that a corollary be a necessary condition of the premises then, according to Orlov, we necessarily arrive at a non-Aristotelian logic, dialectical in nature.\n\n\n=== The Logic of Compatibility Propositions ===\nOrlov proposed a logic of just this type in his work \"The Logic of Compatibility of Propositions\" published in 1928 in a Soviet mathematical journal. This paper analysed the problem of compatibility (noncompatibility) of propositions through the interpretative prism of an implication procedure. He also foresaw the translation of systems with intuitionistic negation into S4 modal logic with classical negation.\nOrlov's work was very little known for a long time, because his publications, all in Russian, were almost totally unknown outside of the Soviet Union. It is only with the post-WWII rise of what have come to be known as substructural logics (Restall 2000) that Orlov's pioneering role has gradually emerged. Substructural logics, a category including intuitionistic, relevant, linear logics, etc., can be obtained by restricting the natural deduction (\"structural\") rules for classical logic. For example, relevant logic does not employ the structural rule of weakening (also called the rule of monotonicity), and this rule is unlike the other structural rules (Dosen).\nOrlov believed in a mechanistic reduction of the laws of nature. He castigated the set theory of Georg Cantor, the theory of relativity (he believed in the existence of aether), and the heliobiology of A. Chizhevsky.\n\n\n== Industrial Chemistry ==\nAround 1928, Orlov ceased publishing logical and philosophical work, turning to industrial chemistry, specifically the production of bromine and iodine, and in translating German works on chemistry into Russian.\n\n\n== Further reading ==\nOrlov, I. E., 1925. The Logic of the Natural Sciences. Moscow-Leningrad. (in Russian).\n------, 1928, \"The Logic of Compatibility of Propositions\" in Matematicheskii Sbornik 35 (3-4): 263-86 (in Russian).\nBazhanov, V. A., 2003, \"The Scholar and the 'Wolfhound Era': The Fate of Ivan E. Orlov's Ideas in Logic, Philosophy, and Science,\" Science in Context 16 (4): 535-50.\nDošen, K., 1992, \"The First Axiomatization of Relevant Logic,\" Journal of Philosophical Logic 21: 339-56.\nDošen, K., 1993, \"A Historical Introduction to Substructural Logics\" in Substructural Logics, eds. Schroeder-Heister P., and Došen K. Oxford Univ. Press: 1-36.\nRestall, Greg, 2000. Substructural Logics. Routledge.\nStelzner, Werner, 2002. Compatibility and relevance: Bolzano and Orlov, Logic and Logical Philosophy 10: 137-171.", "ns": 0, "pageid": 4820576, "title": "Ivan Orlov (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}