{"batchcomplete": "", "query": {"normalized": [{"to": "İoanna Kuçuradi", "from": "İoanna_Kuçuradi"}], "pages": {"20265342": {"extract": "Ioanna Kuçuradi (born October 4, 1936) is a Turkish philosopher. She is currently the president of Philosophical Society of Turkey and a full-time academic of Maltepe University.\n\n\n== Biography ==\nOf Greek (Rûm) descent, Kuçuradi was born on October 4, 1936 in Istanbul, Turkey. After finishing Zappeion Greek Gymnasium for Girls in Istanbul in 1954, she studied philosophy at Istanbul University, from where she graduated with a B.A. degree in 1959. She earned a Ph.D. degree at the same university in 1965. Ioanna Kuçuradi worked as an assistant professor at her alma mater and the Atatürk University in Erzurum.\nShe was founder and head of the Department of Philosophy at Hacettepe University, where she also taught as professor of Philosophy. From 1997 to 2005, Kuçuradi was founding director of the Centre for Research and Application of the Philosophy of Human Rights at Hacettepe University. She is also holder of a UNESCO Chair of Philosophy since 1998. Since 2006, Kuçuradi teaches philosophy and acts as director of the Centre for Research and Application of Human Rights at Maltepe University.\n\n\n== Positions ==\nIoanna Kucuradi is a holder of UNESCO Chair of Philosophy of Human Rights since 1998 at Hacettepe University and since 2009 in Maltepe University.\nShe is also director of the Centre for Research and Application of Human Rights at Maltepe University. She has worked at Istanbul University, Atatürk University, Hacettepe University and Yeditepe University since 1959.\n\n\n== Honours ==\nKuçuradi has received numerous honors, among which:\nGoethe-Medaille (1996)\nDoctor honoris causa, University of Crete, Greece (1996)\nPrize of the Turkish Academy of Sciences (1996)\nHacettepe University Prize for Scientific Achievement (Academic years 1994-1995 and 1995–1996)\nDoctor honoris causa, University Ricardo Palma, Lima, Peru (2000)\nFreedom of the Press 1999 Prize of the Journalists Association of Turkey (2000)\nGrosses Verdienstkreuz des Verdienstordens der Bundesrepublik Deutschland (2001)\nHonourable Mention, UNESCO Human Rights Education Prize (2002)\nHuésped Ilustra de la Ciudad de La Habana (2002)\nMustafa N. Parlar Prize for Scientific Achievement (2003)\nUNESCO Aristotle Medaille (2003)\nDiyarbakır Medical Association’s Prize for Peace, Friendship and Democracy (2004)\nCouncil of Secular Humanism’s Planetary Humanist Philosopher’s Award (2005)\n\n\n== References ==\n\n\n== External links ==\nhttp://www.tfk.org.tr/ Official website of Phılosophıcal Socıety of Turkey", "ns": 0, "pageid": 20265342, "title": "İoanna Kuçuradi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}