{"batchcomplete": "", "query": {"normalized": [{"to": "J. Barkley Rosser", "from": "J._Barkley_Rosser"}], "pages": {"679224": {"extract": "John Barkley Rosser Sr. (December 6, 1907 – September 5, 1989) was an American logician, a student of Alonzo Church, and known for his part in the Church–Rosser theorem, in lambda calculus. He also developed what is now called the \"Rosser sieve\", in number theory. He was later director of the Army Mathematics Research Center at the University of Wisconsin–Madison. Rosser also authored mathematical textbooks.\nIn 1936, he proved Rosser's trick, a stronger version of Gödel's first incompleteness theorem which shows that the requirement for ω-consistency may be weakened to consistency. Rather than using the liar paradox sentence equivalent to \"I am not provable,\" he used a sentence that stated \"For every proof of me, there is a shorter proof of my negation\".\nIn prime number theory, he proved Rosser's theorem.\nThe Kleene–Rosser paradox showed that the original lambda calculus was inconsistent.\nRosser died of an aneurysm September 5, 1989, at his home in Madison, Wisconsin.\nRosser's son, John Barkley Rosser, Jr., is a mathematical economist and professor at James Madison University in Harrisonburg, Virginia.\n\n\n== Selected publications ==\nA mathematical logic without variables by John Barkley Rosser, Univ. Diss. Princeton, NJ 1934, p. 127–150, 328–355\nLogic for mathematicians by John B. Rosser, McGraw-Hill 1953; 2nd ed., Chelsea Publ. Co. 1978, 578 p., ISBN 0-8284-0294-9\nHighlight of the History of Lambda calculus, by J. Barkley Rosser, Annals of the History of Computing, 1984, vol 6, n 4, pp. 337–349\nSimplified Independence Proofs: Boolean Valued Models of Set Theory, by J. Barkley Rosser, Academic Press, 1969\nSee Barkley Rosser papers for a complete list of Rosser's publications.\n\n\n== References ==\n\n\n== External links ==\nJ. Barkley Rosser at the Mathematics Genealogy Project\nInterview with Rosser and Stephen Kleene about their experiences at Princeton", "ns": 0, "pageid": 679224, "title": "J. Barkley Rosser"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}