{"batchcomplete": "", "query": {"normalized": [{"to": "J. M. E. McTaggart", "from": "J._M._E._McTaggart"}], "pages": {"30871418": {"extract": "John McTaggart Ellis McTaggart, commonly John McTaggart or J. M. E. McTaggart (/məkˈtæɡərt/; 3 September 1866 – 18 January 1925), was an idealist metaphysician. For most of his life McTaggart was a fellow and lecturer in philosophy at Trinity College, Cambridge. He was an exponent of the philosophy of Georg Wilhelm Friedrich Hegel and among the most notable of the British idealists.\n\n\n== Personal life ==\nJ. M. E. McTaggart was born in 1866 in London to Francis and Ellen Ellis. At birth, he was named John McTaggart Ellis, after his maternal grand-uncle, John McTaggart. Early in his life, his family took the surname McTaggart as a condition of inheritance from that same uncle.\nMcTaggart attended Clifton College, Bristol, before going up to Trinity College, Cambridge, in 1885. At Trinity he was taught for the Moral Sciences Tripos by Henry Sidgwick and James Ward, both distinguished philosophers. After obtaining First class honours (the only student of Moral Sciences to do so in 1888), he was, in 1891, elected to a prize fellowship at Trinity on the basis of a dissertation on Hegel's Logic. McTaggart had in the meantime been President of the Union Society, a debating club, and a member of the secretive Cambridge Apostles society. In 1897 he was appointed to a college lectureship in Philosophy, a position he would hold until his retirement in 1923 (although he continued to lecture until his death). He received the honorary degree Doctor of Letters (D.Litt.) from the university in May 1902.\nMcTaggart, although radical in his youth, became increasingly conservative and was influential in the expulsion of Bertrand Russell from Trinity for pacifism during World War I. But McTaggart was a man of contradictions: despite his conservatism he was an advocate of women's suffrage; and though an atheist from his youth was a firm believer in human immortality and a defender of the Church of England. He was personally charming and had interests ranging beyond philosophy, known for his encyclopaedic knowledge of English novels and eighteenth-century memoirs.\nHis honours included an honorary LLD from the University of St. Andrews and Fellowship of the British Academy.\nHe died in London in 1925. In 1899 he had married Margaret Elizabeth Bird in New Zealand whom he met while visiting his mother (then living near New Plymouth, Taranaki) and was survived by her; the couple had no children.\n\n\n== Hegel scholarship ==\nMcTaggart's earlier work was devoted to an exposition and critique of Hegel's metaphysical methods and conclusions and their application in other fields. His first published work Studies in Hegelian Dialectic (1896), an expanded version of his Trinity fellowship dissertation, focused on the dialectical method of Hegel's Logic. His second work Studies in Hegelian Cosmology (1901) is directed more towards a critique of the applications of Hegelian ideas made, both by Hegel and earlier neo-Hegelians, to the fields of ethics, politics and religion. In this book a number of his distinctive doctrines already appear, for example, his belief in human immortality. His final book specifically on Hegel was A Commentary on Hegel's \"Logic\" (1910), in which he attempted to explain and, to an extent, defend the argument of the Logic.\nAlthough he defended the dialectical method broadly construed and shared a similar outlook to Hegel, McTaggart's Hegelianism was not uncritical and he disagreed significantly both with Hegel himself and with earlier neo-Hegelians. He believed that many specific features of Hegel's argument were gravely flawed and was similarly disparaging of Hegel's application of his abstract thought. However, he by no means reached the same conclusions as the previous generations of British Idealists and in his later work came to hold strikingly different and original views. Nonetheless, in spite of his break from earlier forms of Hegelianism, McTaggart inherited from his predecessors a pivotal belief in the ability of a priori thought to grasp the nature of the ultimate reality, which for him like earlier Hegelians was the absolute idea. Indeed, his later work and mature system can be seen as largely an attempt to give substance to his new conception of the absolute.\n\n\n== \"The Unreality of Time\" (1908) ==\nIn The Unreality of Time (1908), the work for which he is best known today, McTaggart argued that our perception of time is an illusion, and that time itself is merely ideal. He introduced the notions of the \"A series\" and \"B series\" interpretations of time, representing two different ways that events in time can be arranged. The A series corresponds to our everyday notions of past, present, and future. The A series is \"the series of positions running from the far past through the near past to the present, and then from the present to the near future and the far future\" (p. 458). This is contrasted with the B series, in which positions are ordered from earlier-than to later-than relations. Thus the A series represent the events in time in a moving relation (from future to present to past) to the temporally moving observer, whereas the B series orders the time events as in firm and fixed relations to other time events.\nMcTaggart argued that the A series was a necessary component of any full theory of time since change only occurs in the A series, but that it was also self-contradictory and that our perception of time was, therefore, ultimately an incoherent illusion.\n\n\n=== The necessity of the A series ===\nThe first, and longer, part of McTaggart's argument is his affirmative answer to the question \"whether it is essential to the reality of time that its events should form an A series as well as a B series\" (p. 458). Broadly, McTaggart argues that if events are not ordered by an A as well as a B series then there cannot be said to be change. At the centre of his argument is the example of the death of Queen Anne. This event is a death, it has certain causes and certain effects, it is later than the death of Queen Elizabeth etc., but none of these properties change over time. Only in one respect does the event change:\n\n\"It began by being a future event. It became every moment an event in the nearer future. At last it was a present event. Then it became past, and will always remain so, though every moment it becomes further and further past. Thus we seem forced to the conclusion that all change is only a change in the characteristics imparted to events by their presence in the A series\" (p. 460).\n\nDespite its power and originality this half of McTaggart's argument has, historically, received less attention than the second half.\n\n\n=== The incoherence of the A series ===\nWhat is most often presented as McTaggart's attempted proof of the incoherence of the A series (the argument of pages 468–9) appears in the original paper only as a single part of a broader argument for this conclusion, but it can be extended to have general application. According to the argument, the contradiction in our perception of time is that all events exemplify all three of the properties of the A-series, viz. being past, present and future. The obvious response is that while exemplifying all three properties at some time, no event exemplifies all three at once, no event is past, present, and future. A single event is present, will have been future, will be past, and here there is, it seems, no contradiction.\nMcTaggart's great insight is that this assent will apparently give rise to a vicious circle or infinite regress. On the one hand, the response depends upon the A-series to make sense. To distinguish the properties of being present, having been future and going to be past requires a conception of time divided into past, present and future, and hence of the A-series.\n\n\"Accordingly the A series has to be pre-supposed in order to account for the A series. And this is clearly a vicious circle\" (p. 468).\n\nThe same difficulty can be represented as a 'vicious infinite series' (infinite regress). One can construe the response above as \"constructing a second A series, within which the first falls, in the same way in which events fall within the first\" (p. 469). But even if the idea of a second A series within which the first falls makes sense (and McTaggart doubts it does, p. 469), it will face the same contradiction. And so, we must construct a third A series within which the second falls. And this will require the construction of a fourth A series and so on ad infinitum. At any given stage the contradiction will appear; however far we go in constructing A series, each A series will be, without reference to a further A series containing it, contradictory. One ought to conclude, therefore, that the A series is indeed contradictory and, therefore, does not exist.\n\n\n== Mature system: The Nature of Existence ==\nIn his later work, particularly his two-volume The Nature of Existence, McTaggart developed his own, highly original, metaphysical system. The most famous element is his defence of The Unreality of Time, but McTaggart's system was much broader. In The Nature of Existence McTaggart defended a similar Hegelian view of the universe to that of his earlier work on the basis not of Hegel's dialectics but rather in the mode of more modern metaphysics.\nMcTaggart concluded the world was composed of nothing but souls, each soul related to one or more of the others by love. While he argued against belief in a personal God for any one personality and denied the absolute (thereby justifying his atheism), McTaggart's philosophy was fundamentally optimistic. McTaggart believed each of the souls (which are identified with human beings) to be immortal and defended the idea of reincarnation. McTaggart held the view that all selves are unoriginated and indestructible. The Nature of Existence also seeks to synthesise McTaggart's denial of the existence of time, matter etc. with their apparent existence.\nDespite the mystical tone of its conclusions, the philosophical method of The Nature of Existence is far from mystical. McTaggart arrived at his conclusions by a careful analysis of the essential requirements of any successful metaphysical system (Volume I) followed by a purported proof that only his system satisfies these requirements (Volume II). The logical rigour of his system is in evidence, for example, in McTaggart's famous attempted proof of The Unreality of Time.\n\n\n== Influence ==\nMcTaggart was a friend and teacher of Bertrand Russell and G. E. Moore, and, according to Martin Gardner, the three were known as \"The Mad Tea-Party of Trinity\" (with McTaggart as the Dormouse). Along with Russell and Moore, McTaggart was a member of the Cambridge Apostles through which he would have a personal influence on an entire generation of writers and politicians (his involvement with the Apostles presumably overlapped with that of, among others, the members of the Bloomsbury group) .\nIn particular, McTaggart was an early influence on Bertrand Russell. It was through McTaggart that the young Russell was converted to the prevalent Hegelianism of the day, and it was Russell's reaction against this Hegelianism that began the arc of his later work.\nMcTaggart was the most influential advocate of neo-Hegelian idealism in Cambridge at the time of Russell and Moore's reaction against it, as well as being a teacher and personal acquaintance of both men. With F.H. Bradley of Oxford he was, as the most prominent of the surviving British Idealists, the primary target of the new realists' assault. McTaggart's indirect influence was, therefore, very great. Given that modern analytic philosophy can arguably be traced to the work of Russell and Moore in this period, McTaggart's work retains interest to the historian of analytic philosophy despite being, in a very real sense, the product of an earlier age.\nThe Nature of Existence, with Green's Prolegomena to Ethics and Bradley's Appearance and Reality, marks the greatest achievement of British Idealism, and McTaggart was the last major British Idealist of the classic period (for the later development of British Idealism, see T.L.S. Sprigge).\n\n\n== Selected bibliography ==\n\n\n=== Books ===\n1896 Studies in the Hegelian Dialectic Cambridge University Press.\n1901 Studies in Hegelian Cosmology Cambridge University Press, revised second edition 1918.\n1906 Some Dogmas of Religion London: Arnold.\n1910 A Commentary on Hegel's 'Logic' Cambridge University Press.\n1916 Human Immortality and Pre-existence London: Arnold.\n1921-1927 The Nature of Existence: in two volumes, Cambridge University Press: Volume 1 1921; Volume 2 1927.\n1934 Philosophical studies, edited with an introduction by S.V. Keeling. London: Arnold.\n\n\n=== Articles ===\n1890, The further determination of the Absolute\n1892, \"The Changes of Method in Hegel's Dialectic\", Mind 1, pp. 56–71 & 188–205.\n1895, \"The Necessity of Dogma\", International Journal of Ethics 5, pp. 147–16.\n1896, \"Hegel's Theory of Punishment\", International Journal of Ethics 6, pp. 479–502.\n1897, \"Hegel's Treatment of the Categories of the Subjective Notion\", Mind 7, pp. 164–181 & 342–358.\n1897, \"The Conception of Society as an Organism\", International Journal of Ethics 7, pp. 414–434.\n1900, \"Hegel's Treatment of the Categories of the Idea\", Mind 9, pp. 145–183.\n1904, \"Human Pre-Existence\", International Journal of Ethics, pp. 83–95.\n1902, \"Hegel's Treatment of the Categories of Quality\", Mind 11, pp. 503–526.\n1903, \"Some Considerations Relating to Human Immortality\", International Journal of Ethics 13, pp. 152–171\n1904, \"Hegel's Treatment of the Categories of Quality\", Mind 13, pp. 180–203.\n1908, \"The Unreality of Time\", Mind 17, pp. 457–474.\n1908, \"The Individualism of Value\", International Journal of Ethics 18, pp. 433–445.\n1909, \"The Relation of Time and Eternity\", Mind 18, pp. 343–362.\n1915, \"The Meaning of Causality\", Mind 24, pp. 326–344.\n1923, \"Propositions Applicable to Themselves\", Mind 32, pp. 462–464.\n\n\n== See also ==\nBritish Idealism\nNeo-Hegelianism\n\n\n== Notes ==\n\n\n== References ==\n\"McTaggart, John McTaggart Ellis (1866–1925)\", by C. D. Broad (revised C. A. Creffield) Oxford Dictionary of National Biography, Oxford University Press, 2004.\n1921, & 1927, The Nature of Existence (Volumes 1 & 2). Cambridge: At the University Press.\n\n\n== Further reading ==\nJohn McTaggart Ellis McTaggart, by G. Lowes Dickinson, with chapters by Basil Williams & S.V. Keeling. Cambridge: At the University Press (1931).\nAn Examination of McTaggart's Philosophy, by C. D. Broad in two volumes, extracts from which are online: Volume 1 published 1933; Volume 2 published 1938 at Cambridge University Press.\nTruth, Love and Imortality : An Introduction to McTaggart's Philosophy, by P. T. Geach. London: Hutchinson (1979).\n\"McTaggart, John McTaggart Ellis (1866–1925)\", in Routledge Encyclopaedia of Philosophy, ed. E. Craig (1998).\n\n\n== External links ==\n Works written by or about J. M. E. McTaggart at Wikisource\nMcDaniel, Chris. \"John M E McTaggart\". Stanford Encyclopedia of Philosophy. \nJohn McTaggart Ellis McTaggart article in the Internet Encyclopedia of Philosophy\nJohn McTaggart Ellis McTaggart: a bibliography. Provides full pdf's of all of McTaggart's writings.\nWorks by or about J. M. E. McTaggart at Internet Archive\nWorks by J. M. E. McTaggart at LibriVox (public domain audiobooks)", "ns": 0, "pageid": 30871418, "title": "J. M. E. McTaggart"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}