{"batchcomplete": "", "query": {"normalized": [{"to": "Jack Russell Weinstein", "from": "Jack_Russell_Weinstein"}], "pages": {"18845954": {"extract": "Jack Russell Weinstein is an American philosopher specializing in the history of philosophy, political philosophy, Adam Smith, and contemporary liberal theory. He is currently a Professor in the Department of Philosophy and Religion at the University of North Dakota. He is the director of The Institute for Philosophy in Public Life and the host of the public radio show Why? Philosophical discussions about everyday life.\nJack Russell Weinstein is also responsible for the viral video instructing people to leave restaurants without paying if another customer openly carrying a weapon, even a holstered gun, comes into the restaurant. Although he acknowledges that open carry is a legal option in most states, one should still fear for their lives and flee the restaurant and thus having the restaurant, or even the open carrying customer, pick up the tab for dinner.\n\n\n== Life and education ==\nJack Russell Weinstein was born on October 1, 1969, in New York City, to parents Joyce Ellen (artist and high school teacher) and Mark Weinstein (philosopher and jazz flute-player). He grew up in Washington Heights, Manhattan, and initially fared poorly in school. He went on to college at the State University of New York at Plattsburgh through a students-at-risk program. It was there that his academic interest flourished, where he was able to pursue his long-held interests in reading, writing, and learning in the free university environment. He began his studies in English but quickly changed to Philosophy with a minor in Political Science. While in school, Weinstein participated actively in politics and became a political organizer for student issues around New York state. He was also a D.J. for a ska show on WPLT 93.9 FM, and worked on the student paper as editor in chief and a columnist. Receiving his undergraduate diploma in 1991, he went on to graduate school at Boston University, where he received his M.A. in 1996 and Ph.D. in 1998, both in Philosophy.\nWeinstein deliberated extensively whether or not to go on to graduate school or continue as a political organizer, an activity he had immersed himself in during his college years. He was named plaintiff in a class action suit (Cianfrocco & Weinstein v. Clinton County Board of Elections, 1989—the name is not exact) intended to give college students in New York the right to vote in their college towns, and leading a contingent of over a hundred students who stormed the State House in Albany, New York. That same day, his image appeared in the front page of more than fifty newspapers across the state. He and others were protesting tuition hikes in the State University System by hosting a mock funeral to portray \"the death of public education.\" The image showed Weinstein lying blindfolded by a baby's coffin.\nIn 1994, Weinstein travelled to Vienna, Austria where he served as a Junior Visiting Fellow at the Institute for Human Sciences (Insituut fuer die Wissenschaften vom Menschen/IWM). The fellowship lasted only six months, but he stayed in Vienna, playing guitar as a street musician for six months, before managing to get another fellowship at IWM. According to Weinstein, \"It was, by far, one of the best things I ever did. I learned so much about myself and the world from being outside of the country and by taking some time away from my academic trajectory to explore other interests.\" He returned to the states to teach as an adjunct professor and finish his dissertation, \"John Maynard Keynes and the Problem of Neutrality in Contemporary Liberal Theory.\"\nAfter moving to teach at California State University, Fresno, Weinstein met Kim Donehower, a fellow professor in the English department. They eventually moved together to Grand Forks, North Dakota to accept teaching positions at the University of North Dakota. Currently, Donehower-Weinstein is a professor in the English department and director of the local site of the National Writing Project. A chance meeting with Richard Simmons, at Detroit Metro Airport reportedly led Weinstein to propose to Donehower and the two were married in January, 2003, in Donehower's home town of Asheville, North Carolina.\n\n\n== Work ==\nWeinstein has held full-time positions in departments of philosophy and religion at Montclair State University, Berea College, California State University, Fresno, and currently teaches at the University of North Dakota. In 2007, he received the Individual Excellence in Undergraduate Teaching Award at UND.\nWeinstein is the author of two books in the Wadsworth Philosophers Series, On John Maynard Keynes(2001) and On MacIntyre (2003), and John Maynard Keynes' Pluralism: Rationality, Education, and the Moral Sentiments (Yale U.P.). He has edited several collections and journals, as well as numerous articles, essays and reviews on topics such as philosophy of education and moral theory, as well as a number of presentations on the philosophy of Adam Smith. He is committed to the project of advancing public philosophy, working with the Institute for Philosophy in Public Life to bring philosophy to the general public while simultaneously making a place for public philosophy work in the academy. He wants faculty to be able to get \"research credit\" for their public philosophy work just as they do for more specializes writing.\nWeinstein's current project is a restructuring of contemporary liberal political theory, building off of the moral psychology and political economy of Adam Smith. In multiple volumes, Weinstein plans to offer an interpretation of Adam Smith that views his Theory of Moral Sentiments as primary and offer its connection to contemporary liberal theory.\n\n\n== Selected bibliography ==\nAdam Smith's Pluralism: Rationality, Education, and the Moral Sentiments. New Haven: Yale University Press.\nGuest Editor, On Second Thought (\"The Philosophy Issue\"), North Dakota Humanities Council, (June, 2010), forthcoming.\nThe Two Adams: Ferguson and Smith on Sympathy and Sentiment, in Adam Ferguson: A Reassessment, Philosophy, Politics and Society edited by Eugene Heath and Vincenze Merolle (London: Rickering & Chatto Publishers, LTD, 2009.): 89 - 106.\nAdam Smith, entry for the Internet Encyclopedia of Philosophy at http://www.iep.utm.edu/s/smith.htm\nGuest Editor, \"Symposium on Adam Smith and Education\" The Adam Smith Review, No. 3 (2007): 49 - 158.\n\"On the Meaning of the Term 'Progressive': A Philosophical Investigation,\" The William Mitchell Law Review 33:1 (2006), 1-50.\nIs Money All There Is? Other Aspects of Life in Adam Smith's Free Market. North Dakota Humanities Council Larry Remele Fellowship Tabloid (4 pages with essay and interview), 2005.\nOn MacIntyre (Wadsworth Philosophers Series). Belmont: Wadsworth Publishing Company, 2003.\nOn Adam Smith (Wadsworth Philosophers Series). Belmont: Wadsworth Publishing Company, 2001.\nGuest Editor, Inquiry: Critical Thinking Across the Disciplines. Special Issue: Political Philosophy and Critical Thinking. Montclair: Institute for Critical Thinking, vol. 18, no. 1 (Autumn, 1998).\nEditor, Academic Inquiry: in Progress. Vienna: Institute for Human Sciences (Institut für die Wissenschaften vom Menschen), 1995.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nList of Jewish American philosophers\n\n\n== References ==\n\n\n== External links ==\nUniversity of North Dakota, Philosophy and Religion Faculty Bio Page: Jack Russell Weinstein\nJack Weinstein: My Bio Page\nResearch Page\nSUNY Plattsburgh Alumni Profile: Jack Weinstein\nDr. Jack Russell Weinstein's Philosophy Page!\n\"Adam Smith\": entry in Internet Encyclopedia of Philosophy by Jack Weinstein\nThe Institute for Philosophy In Public Life\nWhy? Philosophical Discussions About Everyday Life", "ns": 0, "pageid": 18845954, "title": "Jack Russell Weinstein"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}