{"batchcomplete": "", "query": {"normalized": [{"to": "Jack Copeland", "from": "Jack_Copeland"}], "pages": {"5717942": {"extract": "Brian Jack Copeland (born 1950) is Professor of Philosophy at the University of Canterbury, Christchurch, New Zealand, and author of books on computing pioneer Alan Turing.\nHis education includes a BPhil and a DPhil from the University of Oxford in philosophy, where he undertook research on modal and non-classical logic under the supervision of Dana Scott.\nJack Copeland is the Director of the Turing Archive for the History of Computing, an extensive online archive on the computing pioneer Alan Turing. He has also written and edited books on Turing. He is one of the people responsible for identifying the concept of hypercomputation and machines more capable than Turing machines.\nCopeland has held visiting professorships at the University of Sydney, Australia (1997, 2002), the University of Aarhus, Denmark (1999), the University of Melbourne, Australia (2002, 2003), and the University of Portsmouth, United Kingdom (1997–2005). In 2000, he was a Senior Fellow in the Dibner Institute for the History of Science and Technology at the Massachusetts Institute of Technology, United States.\nHe is also President of the US Society for Machines and Mentality and a member of the UK Bletchley Park Trust Heritage Advisory Panel. He is the founding editor of The Rutherford Journal, established in 2005.\nCopeland was awarded Lecturer of the Year 2010 by the University of Canterbury's student union.\n\n\n== Books ==\nArtificial Intelligence: A Philosophical Introduction (Blackwell, 1993, 2nd edition due) ISBN 0-631-18385-X\nLogic and Reality Essays on the Legacy of Arthur Prior (Oxford University Press, 1996) ISBN 0-19-824060-0\nThe Essential Turing (Oxford University Press, 2004) ISBN 0-19-825080-0\nAlan Turing’s Automatic Computing Engine: The Master Codebreaker's Struggle to Build the Modern Computer (Oxford University Press, 2005) ISBN 0-19-856593-3\nColossus: The Secrets of Bletchley Park's Codebreaking Computers (Oxford University Press, 2006) ISBN 0-19-284055-X\nTuring: Pioneer of the Information Age (Oxford University Press, 2014: Paperback edition) ISBN 978-0198719182\n\n\n== References ==\n\n\n== External links ==\nHome page\nAlanTuring.net\nAlan Turing: Father of the Modern Computer\nList of publications from Microsoft Academic Search\nJack Copeland at DBLP Bibliography Server", "ns": 0, "pageid": 5717942, "title": "Jack Copeland"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}