{"batchcomplete": "", "query": {"normalized": [{"to": "Jacopo Zabarella", "from": "Jacopo_Zabarella"}], "pages": {"2158972": {"extract": "Giacomo (or Jacopo) Zabarella (5 September 1533 – 15 October 1589) was an Italian Aristotelian philosopher and logician.\n\n\n== Life ==\nZabarella was born into a noble Paduan family. He received a humanist education and entered the University of Padua, where he received a doctorate in 1553. His teachers included Francesco Robortello in humanities, Bernardino Tomitano in logic, Marcantonio Genua in physics and metaphysics, and Pietro Catena in mathematics. In 1564 he succeeded Tomitano in a chair of logic. In 1577 he was promoted to the first extraordinary chair of natural philosophy. He died in Padua at the age of 56 in 1589. His entire teaching career was spent at his native university. His successor was Cesare Cremonini.\n\n\n== Work ==\n\nZabarella's work reflects his teaching in the Aristotelian tradition. His first published work was Opera logica (Venice 1578), followed by Tabula logicae (1578). His commentary on Aristotle's Posterior Analytics appeared in 1582. His great work in natural philosophy was De rebus naturalibus, published posthumously in 1590. It constituted 30 treatises on Aristotelian natural philosophy, the introduction to which was written only weeks before his death. His two sons edited his incomplete commentaries on Aristotle's texts, also published posthumously (the commentary on the Physics in 1601 and the commentary on On the Soul (1605).\nZabarella consulted newly recovered Greek commentators such as Alexander of Aphrodisias, Philoponus, Simplicius, and Themistius, as well as medieval commentators like Thomas Aquinas, Walter Burley, and Averroes. Unlike some earlier scholastic philosophers, he was literate in Greek, and was therefore able to use the Greek texts of Aristotle. He devoted much effort to presenting what he considered to be the true meaning of Aristotle's texts.\n\n\n== Writings ==\nOpera logica [Logic works] (in Latin) (First ed.). Venetia. 1578. OCLC 634125454, 220636245. Retrieved 2015-12-31.  Contains:\n\nOpera Logica (Tertia ed.). Coloniae: Zetzner. 1597. OCLC 245830047. Retrieved 2015-12-31.  With the addition of:\n\nOpera Logica, anastatic reprint of the Kōln 1597 edition by Wilhelm Risse, Hildesheim: Georg Olms, 1966.\nDe rebus naturalibus libri XXX, Ed. José M. García Valverde, Brill, 2016.\nDe mente agente. De rebus naturalibus liber XXIX. Edited by J. M. García Valverde, Fragmentos de Filosofía, 9(2011).\nDe sensu gente. De rebus naturalibus liber XXIV. Edizione a cura di J.M. García Valverde, Rivista di Storia della Filosofia, 2012.\nDe inventione aeterni motoris. De rebus naturalibus liber IV. Edición de J.M. García Valverde, Bruniana & Campanelliana, 2012.\nIn libros Aristotelis Physicorum commentarii, (Venise, 1601).\nCommentarii in Meteora, In Commentarii in Aristotelis libros physicorum, item In libros De generatione et corruptione, item In Meteora, (Frankfurt, 1602).\nCommentarii in III libros De anima, (Venise, 1605).\n\n\n== Editions and translations ==\nIacobus Zabarella, Tables de logique. Sur l'Introduction de Porphyre, les Catégories, le De l'interprétation et les Premiers Analytiques d'Aristote: Petite synopse introductive à la logique aristotélicienne. Paris: L'Harmattan, 2003, translated by Michel Bastit.\nJacques Zabarella, La nature de la logique, Paris: Vrin 2009, translated by Dominique Bouillon.\nJacopo Zabarella, On Methods and On Regressus, edited and translated by John P. McCaskey (I Tatti Renaissance Library; Harvard University Press, 2014).\nVolume 1, On Methods, Books I–II.\nVolume 2, On Methods, Books III–IV and On Regressus.\n\n\n== Bibliography ==\nEdwards, William F. (1960): The Logic of Iacopo Zabarella (1533–1589). Unpublished Ph.D.thesis, Columbia University.\nH. Mikkeli (1992): An Aristotelian Response to Renaissance Humanism. Jacopo Zabarella on the Nature of Arts and Sciences, Helsinki: The Finnish Historical Society.\nRandall, J.H. (1961): The School of Padua and the Emergence of Modern Science. Padova: Editrice Antenore.\n\n\n== References ==\n\n\n== External links ==\nMikkeli, Heikki. \"Giacomo Zabarella\". Stanford Encyclopedia of Philosophy. \nBiography at The Galileo Project\nUlrich G. Leinsle (1998). \"Jacopo Zabarella\". In Bautz, Traugott. Biographisch-Bibliographisches Kirchenlexikon (BBKL) (in German). 14. Herzberg: Bautz. cols. 292–295. ISBN 3-88309-073-5. , biography of Jacopo Zabarella\nPhilosophy Institute of the Düsseldorf University: Philosophengalerie, article \"Jacobus Zabarella (Giacomo Zabarella)\" (in German) online : with picture\nTexts of Zabarella\nGerman translation of De ordine intelligendi, by Rudolf Schicker\nGerman translation of Zabarella's De natura, by Rudolf Schicker\nOpera Logica (PDF)", "ns": 0, "pageid": 2158972, "title": "Jacopo Zabarella"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}