{"batchcomplete": "", "query": {"normalized": [{"to": "James Tully (philosopher)", "from": "James_Tully_(philosopher)"}], "pages": {"11699202": {"extract": "James Hamilton Tully (born 1946) is a Distinguished Professor Emeritus of Political Science, Law, Indigenous Governance and Philosophy at the University of Victoria, Canada. His research and teaching comprise a public philosophy that is grounded in place (Canada) yet reaches out to the world of civic engagement with the problems of our time. He does this in ways that strive to contribute to dialogue between academics and citizens. For example, his research areas include the Canadian experience of coping with the deep diversity of multicultural and multinational citizenship; relationships between indigenous and non-indigenous people; and the emergence of citizenship of the living earth as the ground of sustainable futures.\nTully is a Fellow of the Royal Society of Canada and Emeritus Fellow of the Trudeau Foundation. In May 2014, he was awarded the University of Victoria’s David H. Turpin Gold Medal for Career Achievement in Research. In 2011, he received the Thousand Waves Peacemaker Award. In 2010, he was awarded the prestigious Killam prize in recognition of his distinguished career and exceptional contributions to Canadian scholarship and public life. Also in 2010, he was awarded the C.B. Macpherson Prize by the Canadian Political Science Association for the \"best book in political theory written in English or French\" in Canada 2008-10 for his 2008 two-volume Public Philosophy in a New Key.\n\n\n== Biography ==\nJames Tully is one of the four general editors of the Cambridge University Press Ideas in Context Series. He first gained his reputation for his scholarship on the political philosophy of John Locke, and has written on constitutionalism, diversity, indigenous politics, recognition theory, multiculturalism, and the problem of imperialism. He was special advisor to the Royal Commission on Aboriginal Peoples (1991–1995).\nTully has held positions at McGill University, the University of Toronto, Cambridge University, Oxford University, and the University of Victoria.\nAfter completing his BA at the University of British Columbia and PhD at Cambridge University, he taught in the departments of Philosophy and Political Science at McGill University 1977-1996. He was Professor and Chair of the Department of Political Science at the University of Victoria 1996-2001. In 2001-2003 he was the inaugural Henry N.R. Jackman Distinguished Professor in Philosophical Studies at the University of Toronto in the departments of Philosophy and Political Science and the Faculty of Law. He returned to the University of Victoria in 2003, where he is now the Distinguished Professor of Political Science, Law, Indigenous Governance and Philosophy.\n\n\n== Political Philosophy ==\n\n\n=== Renewing and transforming public philosophy ===\nTully’s approach to the study and teaching of politics is a form of historical and critical reflection on problems of political practice in the present. It is an attempt to renew and transform the tradition of public philosophy so it can effectively address the pressing political problems of our age in a genuinely democratic way. It does this by means of a dual dialogue of reciprocal and mutual learning among equals: between academics in different disciplines addressing the same problems (multidisciplinary); and between academics and citizens addressing the problems and struggles on the ground by their own ways of knowing and doing (democratic). The aim is to throw critical light on contemporary political problems by means of studies that free us to some extent from hegemonic ways of thinking and acting politically, enabling us to test their limits and to see and consider the concrete possibilities of thinking and acting differently.\n\n\n=== The politics of cultural recognition ===\n\nTully’s 1995, Strange Multiplicity: Constitutionalism in an Age of Diversity engages with the famous indigenous sculpture Spirit of Haida Gwaii by Bill Reid as a metaphor for the kind of democratic constitutionalism that can help reconcile the competing claims of multicultural and multinational societies. The ‘strange multiplicity’ of cultural diversity is embodied in the varied and assorted canoe passengers “squabbling and vying for recognition and position.” There is no universal constitutional order imposed from above nor a single category of citizenship, because identities and relations change over time. This view rejects the “mythic unity of the community” imagined “in liberal and nationalist constitutionalism.”\nTully argues that the concept of ‘culture’ is more flexible and constructive for thinking about the rival claims of political groups than the more rigid and exclusive concept ‘nation.’ Culture more readily suggests that group identities are plural, overlapping, and changing over time in their encounters with others. Unlike nationalism, the politics of cultural recognition does not assume that every group aspires to its own culturally homogenous ‘nation-state.’ Rather, cultures must find ways to share spaces and co-exist. While they may always strive to determine their own identities and relations, pursuant to “self rule, the oldest political good in the world,” the solution is not to crack down on diversity or to impose one cultural model over others.\nThe solution is to broaden opportunities for participation and contestation, to further democratize institutions and relations of governance, including foundational constitutions. According to Tully, “a constitution should not be seen as a fixed set of rules but, rather, as an imperfect form of accommodation of the diverse members of a political association that is always open to negotiation by the members of the association.” No aspect of relations should be off limits to deliberation if called into question by participants affected by those relations. This is what Tully means by “democratic constitutionalism” as opposed to more conventional “constitutional democracy.” From this perspective, Tully can claim that “[t]he constitution is thus one area of modern politics that has not been democratised over the last three hundred years.”\nFor Tully, The Spirit of Haida Gwaii prefigures a more democratic, pluralistic, and just society. It evokes a simpler, more elegant, and sustainable ethos of gift-reciprocity in all our relationships, human and non-human. Getting along may be messy and imperfect business, but the passengers continue to row cooperatively, and the canoe of society glides onward.\n\n\n=== Practices of civic freedom and global citizenship ===\nIn Public Philosophy in a New Key, Volume I: Democracy and Civic Freedom, and Volume II: Imperialism and Civic Freedom (2008), Tully expands his approach “to a broader range of contemporary struggles: over diverse forms of recognition, social justice, the environment and imperialism.” The two volumes mark a shift toward a principal emphasis on freedom. “The primary question,” Tully writes, “is thus not recognition, identity or difference, but freedom; the freedom of the members of an open society to change the constitutional rules of mutual recognition and association from time to time as their identities change.” This is “civic freedom,” referring to the capacity people have to participate in the constitution of their own governance relations.\nTo the extent that governance relations restrict this basic freedom, “they constitute a structure of domination, the members are not self-determining, and the society is unfree.\" Conditions of oppression, however, do not rule out or discount practices of civic freedom. Tully’s public philosophy is not concerned with ideal conditions or hoped-for peaceful futures. Rather, civic freedom exists in conduct and in relations in the “here and now,” not least under conditions of oppression and conflict. Against violence and tyranny, Tully argues, practices of civic freedom make the best “strategies of confrontation,” because they generate conditions for transformative change. The concluding chapter of Public Philosophy in a New Key, Vol. II examines “the democratic means to challenge and transform imperial relationships [and] brings together the three themes of the two volumes: public philosophy, practices of civic freedom and the countless ways they work together to negotiate and transform oppressive relationships.”\nTully’s civics-based approach offers a new way of thinking about a diverse array of contemporary and historical traditions of democratic struggle, including environmental movements and indigenous struggle. Tully summarizes the approach and its potential:\n\n‘Practices of civic freedom’ comprise the vast repertoire of ways of citizens acting together on the field of governance relationships and against the oppressive and unjust dimensions of them. These range from ways of ‘acting otherwise’ within the space of governance relationships to contesting, negotiating, confronting and seeking to transform them. The general aim of these diverse civic activities is to bring oppressive and unjust governance relationships under the on-going shared authority of the citizenry subject to them; namely, to civicise and democratize them from below.\n\nFrom this perspective, these kinds of powerful, civic movements are not deviations or anomalies to be corrected or appeased through discipline or cooptation, but exemplars of civic freedom. They disclose their positions or grievances not only through words and stated goals but through the very world they bring into being by their actions: civic “activists have to be the change that they wish to bring about.” “Underlying this way of democratization,” Tully argues, “is the Gandhian premise that democracy and peace can be brought about only by democratic and peaceful means.” However, this is no utopian vision, according to Tully, referring to the “thousands” and “millions of examples of civic” practices everyday that make another world not only possible but “actual.”\nTo clarify and reinforce this approach, Tully argues for an expanded conception of the term citizenship to encompass all forms of governance-related conduct, with an emphasis on “negotiated practices.” Civic or global citizenship refers to the myriad of relations and practices (global and local) people find themselves embedded and participating in. The term global draws attention to the diverse and overlapping character of governance — and hence citizen — relations. Modes of civic and global citizenship “are the means by which cooperative practices of self-government can be brought into being and the means by which unjust practices of governance can be challenged, reformed and transformed by those who suffer under them.”\nTully carefully distinguishes his expanded notion of citizenship (diverse, cooperative, civic, global) from the narrower but more conventional notion of citizenship, which he calls “civil citizenship” (modern, institutional, and international). Where civic denotes practice and pluralism, civil citizenship singularly refers to “a status given by the institutions of the modern constitutional state in international law.” This kind of (civil) citizenship is associated with the dominant tradition of liberalism, in which the state ensures a free market, a set of negative liberties (especially protections against state infringements into the private sphere), and a narrow range of participation through institutions of free speech and representative government. Tully argues that this dominant module of civil citizenship is neither universal nor inevitable; rather, it is “one singular, historical form of citizenship among others.” More problematically, the civil tradition often plays handmaiden to empire, insofar as imperial powers operate under international banners of ‘progress’ and ‘liberalism’:\n\nthe dominant forms of representative democracy, self-determination and democratisation promoted through international law are not alternatives to imperialism, but, rather, the means through which informal imperialism operates against the wishes of the majority of the population of the post-colonial world.\n\nBy contextualizing and de-centering, or “provincializing,” modern categories of “allegedly universal” citizenship, Tully aims to broaden and democratize the field of citizenship and citizen practices. “This [civic and global] mode of citizenship,” he argues, “has the capacity to overcome the imperialism of the present age and bring a democratic world into being.”\nMore recently, Tully has emphasized the importance of “coordinating” the different ways that civil (deliberative) and civic (cooperative) citizens address the same political problems, such as social and ecological justice.\n\n\n=== The transformative power of nonviolence ===\nIn the closing pages of Public Philosophy in a New Key, Vol. II, Tully explicitly links his work to the study and practice of nonviolence. He identifies four main components of Mahatma Gandhi’s life practice of Satyagraha that offer a model for approaching civic freedom and global citizenship practices: 1) noncooperation with unjust institutions, 2) a commitment to nonviolent means of resistance, 3) a focus on local, community-based modes of self-reliance and self-governance, and 4), as a precursor to these three components, “personal practices of self-awareness and self-formation.” According to Tully, these cornerstones of nonviolent power “are daily practices of becoming an exemplary citizen.”\nTully has since focused increasingly on the study and practice nonviolent ethics and nonviolent resistance. For example, he writes,\n\nthe alternative of a politics of reasonable nonviolent cooperation and agonistics (Satyagraha) was discovered in the twentieth century by William James, Gandhi, Abdul Gaffar Khan, Einstein, Ashley Montagu, Bertrand Russell, Martin Luther King Junior, Thomas Merton, Thich Nhat Hanh, Gene Sharp, Petra Kelly, Johan Galtung and Barbara Deming. They argued that the antagonistic premise of western theories of reasonable violence is false. Nonviolent practices of cooperation, disputation and dispute resolution are more basic and prevalent than violent antagonism. This is a central feature of civic freedom.\n\nA major overlap between Tully’s civic freedom and the study of nonviolence is the shared emphasis on practice, on methods, on means rather than on ends. “For cooperative citizens,” Tully writes, “means and ends are internally related, like a seed to the full-grown plant, as Gandhi put it.” This is because means “are pre-figurative or constitutive of ends. Consequently, democratic and peaceful relationships among humans are brought about by democratic and non-violent means.\"\nTully repudiates the “depressing history” of “self-defeating violent means.” He rejects the idea, prevalent across the spectrum of Western political thought, from revolutionaries to reactionaries (the “reigning dogma of the left and right”) that peaceful and democratic societies can be brought about by coercive and violent means. Rather, according to Tully, “the means of violence and command relationships do not bring about peace and democracy. They too are constitutive means. They bring about security dilemmas and the spiral of the command relations necessary for war preparation, arms races and more violence.”\nFor these reasons, Tully extends his civics-based public philosophy to “practitioners and social scientists [who] are beginning to appreciate the transformative power of participatory non-violence and the futility of war in comparison.”\n\n\n=== Sustainability and Gaia citizenship ===\nTully’s approach to nonviolent citizenship practices includes relations with the non-human world. Tully argues that Homo Sapiens should see themselves as interdependent civic citizens of the ecological relationships in which they live and breathe and have their being. As such, they have responsibilities to care for and sustain these relationships that, in reciprocity, sustain them and all the other life forms that are interdependent on them.\nTully’s \"Gaia citizenship\" draws on earth sciences and life sciences as well as indigenous traditions. For example, pointing to the work of ecological scientists from Aldo Leopold, Rachel Carson, and Barry Commoner to the Intergovernmental Panels on Climate Change, Tully links the unsustainability crisis of the Anthropocene to his own critique of “modern civil” modes of governmentality (as violent, exploitative, and destructive). Likewise, he points to Indigenous knowledge that conceptualises human interconnectedness with the earth as gift-reciprocity relationships and as a model for social relationships. The famous Indigenous artwork Spirit of Haida Gwaii remains exemplary of democratic and pluralistic ways of thinking and acting – between humans and the natural environments on which they depend.\nTully’s argument is that his account of interdependent agents in relationships of governance and situated freedom can be extended with modifications to describe human situatedness in ecological relationships – as either giving rise to ‘virtuous’ or ‘vicious cycles’, depending on how we act in and on them.\n\n\n== Selected publications ==\n\n\n=== Books ===\nFreedom and Democracy in an Imperial Context, Dialogues with James Tully (Edited by Robert Nichols, Jakeet Singh), Routledge, 2014, ISBN 978-0-415-81599-4. This text contains eleven chapters by various authors and Tully’s responses to them.\nOn Global Citizenship: Dialogue with James Tully, Critical Powers Series (London: Bloomsbury Academic, 2014), ISBN 9781849664929. This text includes “On Global Citizenship” (a reprint of the concluding chapter of Public Philosophy in a New Key Vol. II plus a new “Afterword – The crisis of global citizenship: Civil and civic responses”), seven chapters by other authors on Tully’s work, and finally Tully’s “Replies”.\nPublic Philosophy in a New Key, Volume I: Democracy and Civic Freedom (Cambridge University Press, 2008), ISBN 0-521-44961-8.\nPublic Philosophy in a New Key, Volume II: Imperialism and Civic Freedom (Cambridge University Press, 2008), ISBN 0-521-44966-9.\nRethinking the foundations of modern political thought (edited with Annabel Brett), Cambridge University Press, 2006, ISBN 0-521-84979-9.\nWittgenstein and political philosophy: Understanding Practices of critical Reflection in The Grammar of politics. Wittgenstein and Political Philosophy, pp. 17–42. Ed. Cressida J. Heyes (Ithaca, N.Y.: Cornell University Press, 2003). An earlier version appeared as \"Wittgenstein and Political Philosophy: Understanding Practices of Critical Reflection,\" Political Theory 17, no.2 (1989):172-204, copyright @ 1989 by Sage Publications, Inc.\nStrange Multiplicity: Constitutionalism in the Age of Diversity, Cambridge University Press, 1995, ISBN 0-521-47117-6.\nAn Approach To Political Philosophy: Locke in Contexts, Cambridge University Press, 1993, ISBN 0-521-43638-9.\nMeaning and Context: Quentin Skinner and his Critics, Polity Press and Princeton University Press, 1988. ISBN 0-691-02301-8.\nA Discourse on Property: John Locke and his Adversaries, Cambridge University Press, 1980, ISBN 0-521-22830-1.\n\n\n=== Recent Articles and Chapters ===\n“Trust, Mistrust and Distrust in Diverse Societies,” in Dimitrios Karmis, ed. Trust and Distrust in Diverse Societies, forthcoming 2015.\n“Two Traditions of Human Rights,” in Matthias Lutz-Bachmann and Amos Nascimento, eds., Human Rights, Human Dignity and Cosmopolitan Ideals, (London: Ashgate, 2014), pp. 139–158. (Reprinted and revised from 2012 “Rethinking Human Rights and Enlightenment”)\n“Global Disorder and Two Responses,” Journal of Intellectual History and Political Thought, 2.1 (November 2013). (PDF of the essay)\n“Communication and Imperialism”, in Arthur Kroker and Marilouise Kroker, eds., Critical Digital Studies A Reader, Second Edition (Toronto: University of Toronto Press, 2013), pp. 257–283 (Reprint of 2008).\n“Two Ways of Realizing Justice and Democracy: Linking Amartya Sen and Elinor Ostrom”, Critical Review of International Social and Political Philosophy, 16.2 (March 2013) 220-233.\n‘“Two Concepts of Liberty” in Context’, Isaiah Berlin and the Politics of Freedom, ed. Bruce Baum and Robert Nichols (London: Routledge, 2013), 23-52.\n“Middle East Legal and Governmental Pluralism: A view of the field from the demos”, Middle East Law and Governance, 4 (2012), 225-263.\n“Dialogue”, in ‘Feature Symposium: Reading James Tully, Public Philosophy in a New Key (Vols. I & II),’ Political Theory, 39.1 (February 2011), 112-160, 145-160.\n“Rethinking Human Rights and Enlightenment”, in Self-evident Truths? Human Rights and the Enlightenment: The Oxford Amnesty Lectures of 2010, ed. Kate Tunstall (London: Bloomsbury, 2012), 3-35. (reprinted and revised as “Two Traditions of Human Rights,” 2014).\n“Conclusion: Consent, Hegemony, Dissent in Treaty Negotiations”, in Consent Among Peoples, ed. J. Webber and C. MacLeod (Vancouver: University of British Columbia Press, 2010), 233-256.\n“Lineages of Contemporary Imperialism”, Lineages of Empire: The Historical Roots of British Imperial Thought, ed. Duncan Kelly (Oxford: Oxford University Press and The British Academy, 2009), 3-30.\n“The Crisis of Global Citizenship,” Radical Politics Today, July 2009. (PDF of the essay)\n“Two Meanings of Global Citizenship: Modern and Diverse”, in Global Citizenship Education: Philosophy, Theory and Pedagogy, ed. M.A. Peters, A. Britton, H. Blee (Sense Publishers, 2008), 15-41.\n\"Modern Constitutional Democracy and Imperialism.\" Osgoode Hall Law Journal 46.3 (2008): 461-493. (Special issue on Comparative Constitutionalism & Transnational Law).\n\"Communication and Imperialism\" in 1000 Days of Theory (edited by Arthur and Marilouise Kroker), CTheory (2006). Reprinted in The Digital Studies Reader, ed. A. & M. Kroker ( University of Toronto Press, 2008). Available: http://www.ctheory.net/printer.aspx?id=508.\n\"A New Kind of Europe? Democratic Integration in the European Union\". Constitutionalism Web-Papers, 4 (2006). (PDF available)\n\n\n== Recent Public Lectures ==\n“Reflecting on Public Philosophy with Jim Tully”, video interview by former students, Government House meditation garden, Victoria BC, March, 2015, (Video available).\n“On Civic Freedom Today”, The Encounter with James Tully, organized by Chantal Mouffe, Centre for the Study of Democracy, University of Westminster, London, UK, June 24, 2014.\n“Civic Freedom in an Age of Diversity: James Tully’s Public Philosophy”, Groupe de Recherche sur les sociétiés plurinationale, Centre Pierre Péladeau, UQAM, Montreal, April 24–26, 2014. (Video available)\n“Reconciliation Here on Earth: Shared Responsibilities”, Ondaatje Hall, McCain Building, Dalhousie University, Department of Social Anthropology, College of Sustainability, Faculty of Law, Faculty of Arts and Social Science, March 20, 2014. (Video available)\n“Life Sustains Life”, the Heyman Centre Series on Social and Ecological Value, with Jonathan Schell and Akeel Bilgrami, Columbia University, May 2, 2013.\n“Citizenship for the love of the World,” Department of Political Science, Cornell University, March 14, 2013.\n“Transformative Change and Idle No More,” Indigenous Peoples and Democratic Politics, First Peoples’ House, University of British Columbia, March 1, 2013.\n“Charles Taylor on Deep Diversity”, The Conference on the Work of Charles Taylor, Museum of Fine Arts and University of Montreal, Montreal, March 28–30, 2012. (Video available)\n“Citizenship for the Love of the World”, Keynote Address, The Conference on Challenging Citizenship, Centro de Estudos Sociais, University of Coimbra, Coimbra Portugal, June 2–5, 2011.\n“Diversity and Democracy after Franz Boas”, The Stanley T. Woodward Keynote Lecture, Yale University, September 15, 2011, at the Symposium on Franz Boas.\n“On Global Citizenship”, The James A. Moffett 29 Lecture in Ethics, Centre for Human Values, Princeton University, April 21, 2011.\n\n\n== References ==\n\nSee also:\nArmitage, David (February 2011). \"Probing the Foundations of Tully's Public Philosophy\". Political Theory. 39 (1): 124–130. doi:10.1177/0090591710386552. \nTemelini, Michael (2014). \"Dialogical Approaches to Struggles Over Recognition and Distribution\". Critical Review of International Social and Political Philosophy. 17 (4): 423–447. doi:10.1080/13698230.2013.763517. \n\n\n== External links ==\nDr. James Tully webpage, University of Victoria\n…", "ns": 0, "pageid": 11699202, "title": "James Tully (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}