{"batchcomplete": "", "query": {"normalized": [{"to": "James Earl Baumgartner", "from": "James_Earl_Baumgartner"}], "pages": {"5825279": {"extract": "James Earl Baumgartner (March 23, 1943 – December 28, 2011) was an American mathematician who worked in set theory, mathematical logic and foundations, and topology.\nBaumgartner was born in Wichita, Kansas, began his undergraduate study at the California Institute of Technology in 1960, then transferred to the University of California, Berkeley, from which he received his PhD in 1970 from for a dissertation entitled Results and Independence Proofs in Combinatorial Set Theory. His advisor was Robert Vaught. He became a professor at Dartmouth College in 1969, and there spent his entire career.\nOne of Baumgartner's results is the consistency of the statement that any two \n  \n    \n      \n        \n          ℵ\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle \\aleph _{1}}\n  -dense sets of reals are order isomorphic (a set of reals is \n  \n    \n      \n        \n          ℵ\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle \\aleph _{1}}\n  -dense if it has exactly \n  \n    \n      \n        \n          ℵ\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle \\aleph _{1}}\n   points in every open interval). With András Hajnal he proved the result (Baumgartner–Hajnal theorem) that the partition relation \n  \n    \n      \n        \n          ω\n          \n            1\n          \n        \n        →\n        (\n        α\n        \n          )\n          \n            n\n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle \\omega _{1}\\to (\\alpha )_{n}^{2}}\n   holds for \n  \n    \n      \n        α\n        <\n        \n          ω\n          \n            1\n          \n        \n        ,\n        n\n        <\n        ω\n      \n    \n    {\\displaystyle \\alpha <\\omega _{1},n<\\omega }\n  . He died of a heart attack in 2011.\n\n\n== See also ==\nBaumgartner's axiom\n\n\n== Selected publications ==\nBaumgartner, James E., A new class of order types, Annals of Mathematical Logic, 9:187–222, 1976\nBaumgartner, James E., Ineffability properties of cardinals I, Infinite and Finite Sets, Keszthely (Hungary) 1973, volume 10 of Colloquia Mathematica Societatis János Bolyai, pages 109–130. North-Holland, 1975\nBaumgartner, James E.; Harrington, Leo; Kleinberg, Eugene, Adding a closed unbounded set, Journal of Symbolic Logic, 41(2):481–482, 1976\nBaumgartner, James E., Ineffability properties of cardinals II, Robert E. Butts and Jaakko Hintikka, editors, Logic, Foundations of Mathematics and Computability Theory, pages 87–106. Reidel, 1977\nBaumgartner, James E.; Galvin, Fred, Generalized Erdős cardinals and 0#, Annals of Mathematical Logic 15, 289–313, 1978\nBaumgartner, James E.; Erdős, Paul; Galvin, Fred; Larson, J., Colorful partitions of cardinal numbers, Can. J. Math. 31, 524–541, 1979\nBaumgartner, James E.; Erdős, Paul; Higgs, D., Cross-cuts in the power set of an infinite set, Order 1, 139–145, 1984\nBaumgartner, James E. (Editor), Axiomatic Set Theory (Contemporary Mathematics, Volume 31), 1990\n\n\n== References ==\n\nValley News obituary", "ns": 0, "pageid": 5825279, "title": "James Earl Baumgartner"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}