{"batchcomplete": "", "query": {"normalized": [{"to": "James Childress", "from": "James_Childress"}], "pages": {"5286984": {"extract": "James Franklin Childress (/ˈtʃɪldrɛs/; born October 4, 1940) is a philosopher and theologian mainly concerned with ethics, particularly biomedical ethics. Currently he is the John Allen Hollingsworth Professor of Ethics at the Department of Religious Studies at the University of Virginia and teaches public Policy at the Frank Batten School of Leadership and Public Policy. He is also Professor of Medical Education at this university and directs its Institute for Practical Ethics. He has obtained a B.A. from Guilford College, a B.D. from Yale Divinity School, and an M.A. and Ph.D. from Yale University. He was vice-chairman of the national Task Force on Organ Transplantation, and he has also served on the Board of Directors of the United Network for Organ Sharing (UNOS), the UNOS Ethics Committee, the Recombinant DNA Advisory Committee, the Human Gene Therapy Subcommittee, the Biomedical Ethics Advisory Committee, and several Data and Safety Monitoring Boards for NIH clinical trials. From 1996 to 2001, he served on the presidentially-appointed National Bioethics Advisory Commission. He is a fellow of the Hastings Center, an independent bioethics research institution.\nHis works include:\nwith Tom Beauchamp: Principles of Biomedical Ethics (1985; Oxford University Press, Oxford 2009, 6 ed.).\nPractical reasoning in bioethics, Bloomington: Indiana Univ. Pr. 1997.\nA new dictionary of Christian ethics, London: SCM Press 1986 (co-edited with John Macquarrie).\nWho should decide? Paternalism in health care, New York: Oxford Univ. Pr. 1982.\nMoral responsibility in conflicts. Essays on nonviolence, war, and conscience, Baton Rouge: Louisiana State Univ. Pr. 1982.\nPriorities in biomedical ethics, Philadelphia: Westminster Pr. 1981.\nCivil disobedience and political obligation. A study in Christian social ethics, New Haven: Yale Univ. Pr. 1971.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nPrinciplism\n\n\n== External links ==\nPersonal webpage at University of Virginia", "ns": 0, "pageid": 5286984, "title": "James Childress"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}