{"batchcomplete": "", "query": {"normalized": [{"to": "James Mill", "from": "James_Mill"}], "pages": {"174052": {"extract": "James Mill (born James Milne, 6 April 1773 – 23 June 1836) was a British historian, economist, political theorist, and philosopher. He is counted among the founders of Ricardian school and was the father of John Stuart Mill, the philosopher of liberalism. His influential History of British India contains a complete denunciation and rejection of Indian culture and civilisation. He divided Indian history into three parts: Hindu, Muslim and British.\n\n\n== Life ==\nJames Milne, later known as James Mill, was born at Northwater Bridge, in the parish of Logie Pert, Angus, Scotland, the son of James Milne, a shoemaker and small farmer. His mother, Isabel Fenton, of a family that had suffered from connection with the Stuart rising, resolved that he should receive a first-rate education, and sent him first to the parish school and then to the Montrose Academy, where he remained until the unusual age of seventeen and a half. He then entered the University of Edinburgh, where he distinguished himself as a Greek scholar.\nIn October 1798, he was ordained as a minister of the Church of Scotland, but met with little success. From 1790 to 1802, in addition to holding various tutorships, he occupied himself with historical and philosophical studies. Finding little prospect of a career in Scotland, in 1802 he went to London, England, in company with Sir John Stuart of Fettercairn, then member of parliament for Kincardineshire, and devoted himself to literary work. From 1803 to 1806, he was editor of an ambitious periodical called the Literary Journal, which professed to give a summary view of all the leading departments of human knowledge. During this time he also edited the St James's Chronicle, belonging to the same proprietor. In 1804, he wrote a pamphlet on the corn trade, arguing against a bounty on the exportation of grain. In 1805, he published a translation (with notes and quotations) of An Essay on the Spirit and Influence of the Reformation of Luther, a C.F. Villers's work on the Reformation, an attack on the alleged vices of the papal system. About the end of this year he began his The History of British India, which he took twelve years to complete, instead of three or four, as had been expected.\nIn that year he also married Harriet Burrow, whose mother, a widow, kept what was then known as an establishment for lunatics in Hoxton. He then took a house in Pentonville, where his eldest son, John Stuart Mill, was born in 1806.\n\nIn 1808, he became acquainted with Jeremy Bentham, and was for many years his chief companion and ally. He adopted Bentham's principles in their entirety, and determined to devote all his energies to bringing them before the world. Between 1806 and 1818, he wrote for the Anti-Jacobin Review, the British Review and The Eclectic Review; but there is no means of tracing his contributions. In 1808, he began to write for the Edinburgh Review, to which he contributed steadily till 1813, his first known article being \"Money and Exchange.\" He also wrote on Spanish America, China, Francisco de Miranda, the East India Company, and the Liberty of the Press. In the Annual Review for 1808 two articles of his are traced—a \"Review of Fox's History,\" and an article on \"Bentham's Law Reforms,\" probably his first published notice of Bentham. In 1811 he co-operated with William Allen (1770–1843), a Quaker and chemist, in a periodical called the Philanthropist. He contributed largely to every issue—his principal topics being Education, Freedom of the Press, and Prison Discipline (under which he expounded Bentham's Panopticon). He made powerful onslaughts on the Church in connection with the Bell and Lancaster controversy, and took a part in the discussions that led to the foundation of the University of London in 1825. In 1814 he wrote a number of articles, containing an exposition of utilitarianism, for the supplement to the fifth edition of the Encyclopædia Britannica, the most important being those on \"Jurisprudence,\" \"Prisons\", \"Government\" and \"Law of Nations\".\nIn 1818, The History of British India was published, and obtained a great and immediate success. It brought about a change in the author's fortunes. The year following he was appointed an official in the India House, in the important department of the examiner of Indian correspondence. He gradually rose in rank until he was appointed, in 1830, head of the office, with a salary of £1900, raised in 1836 to £2000. His great work, the Elements of Political Economy, appeared in 1821 (3rd and revised ed. 1825).\nFrom 1824 to 1826, Mill contributed to the Westminster Review, started as the organ of his party, a number of articles in which he attacked the Edinburgh and Quarterly Reviews and ecclesiastical establishments. In 1829 appeared the Analysis of the Phenomena of the Human Mind. From 1831 to 1833, Mill was largely occupied in the defence of the East India Company, during the controversy attending the renewal of its charter, he being in virtue of his office the spokesman of the court of directors. For the London Review, founded by Sir William Molesworth in 1834, he wrote a notable article entitled \"The Church and its Reform,\" which was much too sceptical for the time, and injured the Review. His last published book was the Fragment on Mackintosh (1835).\n\n\n== Intellectual legacy ==\n\n\n=== The History of British India ===\n\nMill preferred to take a more theoretical approach to social subjects than the empirical one common at the time. His best known literary work is his History of British India, in which he describes the acquisition of the Indian Empire by England and later the United Kingdom. He also brings political theory to bear on the delineation of the Hindu civilization, and subjects the conduct of the actors in the successive stages of the conquest and administration of India to severe criticism. The work itself, and the author's official connection with India for the last seventeen years of his life, effected a complete change in the whole system of governance in the country. Mill never visited the Indian colony, relying solely on documentary material and archival records in compiling his work. This fact has led to severe criticism of Mill's History of India by notable economist Amartya Sen.\nAccording to Thomas Trautmann, \"James Mill's highly influential History of British India (1817) – most particularly the long essay 'Of the Hindus' comprising ten chapters – is the single most important source of British Indophobia and hostility to Orientalism\". In the chapter titled General Reflections in \"Of the Hindus\", Mill wrote \"under the glosing exterior of the Hindu, lies a general disposition to deceit and perfidy\". According to Mill, \"the same insincerity, mendacity, and perfidy; the same indifference to the feelings of others; the same prostitution and venality\" were the conspicuous characteristics of both the Hindoos and the Muslims. The Muslims, however, were perfuse, when possessed of wealth, and devoted to pleasure; the Hindoos almost always penurious and ascetic; and \"in truth, the Hindoo like the eunuch, excels in the qualities of a slave\". Furthermore, similar to the Chinese, the Hindoos were \"dissembling, treacherous, mendacious, to an excess which surpasses even the usual measure of uncultivated society\". Both the Chinese and the Hindoos were \"disposed to excessive exaggeration with regard to everything relating to themselves\". Both were \"cowardly and unfeeling\". Both were \"in the highest degree conceited of themselves, and full of affected contempt for others\". And, above all, both were \"in physical sense, disgustingly unclean in their persons and houses\".\n\n\n=== British politics ===\nMill also played a great part in British politics, and was a dominant figure in the establishment of what was called \"philosophic radicalism\". His writings on government and his personal influence among the Liberal politicians of his time determined the change of view from the French Revolution theories of the rights of man and the absolute equality of men to the claiming of securities for good government through a wide extension of the franchise. It was under this banner that the Reform Bill was fought and won. His Elements of Political Economy followed up the views of his friend David Ricardo. By 1911, the Encyclopædia Britannica described it as being of mainly historical interest, \"an accurate summary of views that are now largely discarded\". Among the more important of its theses are:\nthat the chief problem of practical reformers is to limit the increase of population, on the assumption that capital does not naturally increase at the same rate as population (ii. § 2, art. 3)\nthat the value of a thing depends entirely on the quantity of labour put into it; and\nthat what is now known as the \"unearned increment\" of land is a proper object for taxation.\n\n\n=== Other areas ===\nBy his Analysis of the Phenomena of the Human Mind and his Fragment on Mackintosh Mill acquired a position in the history of psychology and ethics. He took up the problems of mind very much after the fashion of the Scottish Enlightenment, as then represented by Thomas Reid, Dugald Stewart and Thomas Brown, but made a new start, due in part to David Hartley, and still more to his own independent thinking. He carried out the principle of association into the analysis of the complex emotional states, as the affections, the aesthetic emotions and the moral sentiment, all which he endeavoured to resolve into pleasurable and painful sensations. But the salient merit of the Analysis is the constant endeavour after precise definition of terms and clear statement of doctrines. He had a great effect on Franz Brentano who discussed his work in his own empirical psychology. The Fragment on Mackintosh severely criticizes the alleged flimsiness and misrepresentations of Sir James Mackintosh's Dissertation on the Progress of Ethical Philosophy (1830), and discusses the foundations of ethics from the author's utilitarian point of view.\n\n\n== Major works ==\n\nAn Essay on the Impolicy of a Bounty on the Exportation of Grain, 1804.\n\"Lord Lauderdale on Public Wealth\", 1804, Literary Journal\nCommerce Defended, 1808.\nThomas Smith on Money and Exchange, 1808\nThe History of British India, 3 vols., 1818 (and many later editions)\n\"Government\", 1820, Encycl. Britannica\nElements of Political Economy, 1821\n\"Liberty of the Press\", 1823\nEssays on Government, Jurisprudence, Liberty of the Press, Education, and Prisons and Prison Discipline, 1823.\nAn Analysis of the Phenomena of the Human Mind, 2 vols., 1829.\nAnalysis of the Phenomena of the Human Mind. 1869.\nEssay on the Ballot and Fragment on Mackintosh, 1830.\n\"Whether Political Economy is Useful\", 1836\nThe Principles of Toleration, 1837.\n\n\n== See also ==\nCapitalism\nContributions to liberal theory\nFree trade\nJames Tod\n\n\n== Notes ==\n\n\n== References ==\n Stephen, Leslie (1894). \"Milton, John (1608-1674)\". In Lee, Sidney. Dictionary of National Biography. 38. London: Smith, Elder & Co. p. 32. \nAttribution:\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Mill, James\". Encyclopædia Britannica. 19 (11th ed.). Cambridge University Press. pp. 453–454.  Endnotes:\nStephen, Leslie (1900). The English Utilitarians. ii. \n Stephen, Leslie (1894). \"Mill, James (1773-1836)\". In Lee, Sidney. Dictionary of National Biography. 37. London: Smith, Elder & Co. pp. 382–388. \nBain, Alexander (1882). James Mill, A Biography (1 ed.). London: Logmans, Green & Co. \nBower, G.S. (1881). Hartley and James Mill. \nMcCosh, James (1885). Scottish Philosophy. \nMill, J.S. (1873). Autobiography. \nRibot, Théodule-Armand (1873) [1870]. La Psychologie anglaise (Eng. trans. ed.). \nMorley, John (1882). \"?\". Fortnightly Review. xxxvii. \nWallas, Graham (1898). The Life of Francis Place. \n\n\n== Further reading ==\nBain, Alexander (January 1876). \"The Early Life of James Mill\". Mind. 1 (1). \nRudolph, Lloyd I. (2008). \"Tod vs Mill: Clashing Perspectives on British Rule in India and Indian Civilization\". In Tillotson, Giles. James Tod's Rajasthan: The Historian and His Collections. Mumbai: Radhika Sabavala for Marg Publications on behalf of the National Centre for the Performing Arts. ISBN 81-85026-80-7. \n \"Mill, James\". New International Encyclopedia. 1905. \n\" Mill, James\". A Short Biographical Dictionary of English Literature. Wikisource. 1910 \n\n\n== External links ==\nJames Mill\nStanford Encyclopedia of Philosophy entry\nJames Mill's common place books", "ns": 0, "pageid": 174052, "title": "James Mill"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}