{"batchcomplete": "", "query": {"normalized": [{"to": "Jamie Whyte", "from": "Jamie_Whyte"}], "pages": {"17183019": {"extract": "Dr Jamie Whyte is a New Zealand politician who is a former leader of ACT New Zealand, a free market political party of New Zealand, and unsuccessfully contested the Pakuranga electorate in the 2014 general election. At the election, Whyte held the first position on the party list, but Act did not achieve enough party votes to secure any list seats. Soon after the 2014 general election, he resigned from the leadership of ACT.\nWhyte is a former philosophy lecturer, currency trader and management consultant. He has written books and newspaper columns about reasoning and politics.\n\n\n== Early life and academia ==\nWhyte was born in Auckland, New Zealand. He received his undergraduate degree from the University of Auckland. He then moved to the UK to study for an M.Phil and Ph.D at St John's College, Cambridge.\nUpon graduation, Whyte remained at Cambridge University for three years as a research fellow at Corpus Christi College and temporarily lectured in the Philosophy faculty. He won the Analysis journal prize for the best article by a philosopher under the age of 30.\n\n\n== Early career ==\nWhyte then took up a job with the New York-based management consultancy firm Oliver Wyman. He also worked as a foreign currency trader.\n\n\n== Writing and media ==\nSince 2004, Whyte has written books for general audiences and newspaper columns, aiming to expose shoddy reasoning, especially by politicians. In 2006 he won the Reason Foundation Bastiat Prize for journalism (jointly with Tim Harford of the Financial Times) and in 2010 he was named runner up. In June 2014, Whyte won the Institute of Economic Affairs Arthur Seldon Memorial Award for Excellence for Quack Policy.\nHe is the author of Crimes Against Logic (titled Bad Thoughts: A Guide to Clear Thinking in the UK; 2004), A Load of Blair (2005), Free Thoughts (2012) and Quack Policy (2013) and has also written columns for many notable publications, including The Times, City A.M., Standpoint, Financial Times and The Wall Street Journal.\nWhyte has also occasionally broadcast on BBC Radio 4 and television.\n\n\n== Political career ==\nIn his youth, Whyte was a campaign volunteer for Bob Jones' New Zealand Party in the 1984 general election.\nDespite no prior experience in political office, at a board meeting in February 2014, Whyte was elected to the ACT party's leadership, beating former MP, John Boscawen. At the same meeting, David Seymour was chosen as ACT's candidate for the Epsom electorate and Kenneth Wang was later elected as Whyte's deputy leader in April 2014.\nIn the 2014 general election, ACT only won enough votes to be represented by David Seymour in the Epsom electorate. After the election, on 3 October 2014 Whyte resigned from the leadership of the party, saying: \"Clearly, I make this announcement with regret, however the election result is clear, and I must now turn to my career and my family.\" He was replaced as ACT leader by David Seymour on the day of his resignation.\nWhyte's political philosophy is classical liberalism, in the tradition of Friedrich Hayek.\n\n\n== References ==\n\n\n== External links ==\nACT Party profile", "ns": 0, "pageid": 17183019, "title": "Jamie Whyte"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}