{"batchcomplete": "", "query": {"normalized": [{"to": "Janet Biehl", "from": "Janet_Biehl"}], "pages": {"2795188": {"extract": "Janet Biehl (born September 4, 1953) is a political writer with a focus on libertarian municipalism and social ecology, the body of ideas developed and publicized by Murray Bookchin. She also opposes eco-feminism.\n\n\n== Education ==\nBiehl graduated from Wesleyan University in 1974. While living in New York City, she made her living as a copyeditor for major book publishers and studied theater and art. In 1986 she attended the Institute for Social Ecology, where she met the social theorist Murray Bookchin. In January 1987 she moved to Burlington, Vermont, to study further with Bookchin. They began a collaborative relationship to advance and promote social ecology.\n\n\n== Career ==\nFrom 1987 to 2003 they co-wrote and co-published the theoretical newsletter Green Perspectives, later renamed Left Green Perspectives. BIehl edited and compiled The Murray Bookchin Reader (1997), which Bookchin considered to be the best introduction to his work. To summarize Bookchin's ideas on assembly democracy, known as libertarian municipalism, she wrote The Politics of Social Ecology: Libertarian Municipalism (1998). She wrote numerous articles about or related to Bookchin’s ideas.\nSince Bookchin's death in 2006, she authored Ecology or Catastrophe: The Life of Murray Bookchin, published in 2015 by Oxford University Press. In 2011 Biehl separated from social ecology, explaining that she could no longer advocate an antistatist ideology. She blogs at Ecology or Catastrophe.\nBiehl is a supporter of the Kurdish freedom movement. After Abdullah Öcalan, leader of the insurgent Kurdistan Workers' Party, was captured and imprisoned in 1999, he became an avid reader of Bookchin's work in Turkish translation and recommended it to the movement. Drawing on libertarian municipalism, he formulated democratic confederalism as a political program, which the PKK adopted. In 2004 several intermediaries tried to arrange a dialogue between Bookchin and Öcalan but were unsuccessful due to Bookchin's failing health. (PDFs of the correspondence are published here). In 2012 Biehl translated (German to English) the book Democratic Autonomy in North Kurdistan by the solidarity group TATORT Kurdistan, a field study of democratic institutions built by the Kurdish movement in southeastern Turkey to implement democratic confederalism.\nIn 2014 and 2015 she visited Rojava, the mostly Kurdish region of northern Syria. There the Kurdish movement is attempting, in wartime conditions, to implement democratic confederalism, gender equality, and ecology. She published several articles about her visits. In October 2016 her translation of Revolution in Rojava: Democratic Autonomy and Women's Liberation in Northern Syria, written by Michael Knapp, Anja Flach, and Ercan Ayboga, was published by Pluto Press.\n\n\n== Selected works ==\nBiehl, Janet (1991). Finding Our Way: Rethinking Ecofeminist Politics. Montreal: Black Rose Books. ISBN 0921689780. \nBiehl, Janet (1995). Ecofascism: Lessons from the German Experience. Edinburgh and San Francisco: AK Press. ISBN 1873176732. \nBiehl, Janet (editor) (1997). The Murray Bookchin Reader. London: Cassell. ISBN 0304338745. \nBiehl, Janet (1998). The Politics of Social Ecology: Libertarian Municipalism. Montreal: Black Rose Books. ISBN 1551641003. \nBiehl, Janet (2011). Mumford Gutkind Bookchin: The Emergence of Eco-decentralism. Porsgrunn, Norway: New Compass. ISBN 9788293064107. \nBiehl, Janet (2015). Ecology or Catastrophe: The Life of Murray Bookchin. New York: Oxford University Press. ISBN 0199342482. \n\n\n== References ==\n\n\n== External links ==\nJanet Biehl at Goodreads\nJanet Biehl on Facebook\nJanet Biehl on Twitter \nEcology or Catastrophe", "ns": 0, "pageid": 2795188, "title": "Janet Biehl"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}