{"batchcomplete": "", "query": {"normalized": [{"to": "Janet Coleman", "from": "Janet_Coleman"}], "pages": {"5921009": {"extract": "Janet Coleman FRHistS (born 1945, New York) is a British academic and historian of political theory.\nShe is currently the Professor of Ancient and Medieval Political Thought at the London School of Economics. She was the first woman to receive a chair in the LSE government department. Her research interests include ancient Greek and Roman political thought, medieval philosophy, and theories of citizenship and the state.\nColeman studied at L'Ecole Pratique des Hautes Etudes in Paris and received her Ph.D. degree from Yale University. She has held teaching appointments in politics at Exeter University and on the History Faculty of the University of Cambridge.\nIn 1980 she co-founded (with Iain Hampsher-Monk) the academic journal History of Political Thought, which she continues to co-edit. She is a Fellow of the Royal Historical Society.\nColeman has taught at LSE since 1989, where from 2001 to 2004 she held a Leverhulme Major Research Fellowship. Her lectures in the introductory government course at the LSE are known for her attempts to \"'be' political philosophers from the ancient Greeks to Machiavelli.\" Coleman plans to retire in 2010. She has been offered a Global Distinguished Professorship at New York University.\nColeman resides in Cambridge.\n\n\n== Select bibliography ==\nEnglish Literature in History 1350-1400: Medieval Readers and Writers, 1981\nAgainst the State: Studies in Sedition and Rebellion, 1990\nAncient and Medieval Memories: Studies in the Reconstruction of the Past, 1992\nThe Individual in Political Theory and Practice, 1996\nScholastics, Enlightenments and Philosophic Radicals: Essays in Honour of J. H. Burns (ed.), 1999\nA History of Political Thought, from Ancient Greece to Early Christianity, 2000\nA History of Political Thought, from the Middle Ages to the Renaissance, 2000\n\n\n== References ==\n\n\n== External links ==\nColeman's LSE profile\nWorks by or about Janet Coleman in libraries (WorldCat catalog)", "ns": 0, "pageid": 5921009, "title": "Janet Coleman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}