{"batchcomplete": "", "query": {"normalized": [{"to": "Jay Rosenberg", "from": "Jay_Rosenberg"}], "pages": {"16214567": {"extract": "Jay Frank Rosenberg (April 18, 1942 in Chicago IL – February 21, 2008 in Chapel Hill NC) was a Professor of Philosophy at the University of North Carolina at Chapel Hill. He was a student of Wilfrid Sellars and established his reputation with ten books and over 80 articles in metaphysics, epistemology, the philosophy of language, and the history of philosophy (especially Kant). His most commercially successful work, The Practice of Philosophy: A Handbook for Beginners, is a standard text in introductory philosophy courses, and has been translated into German.\nRosenberg's first publication, The Impoverished Students' Book of Cookery, Drinkery, and Housekeepery!, written while an undergraduate at Reed College, has since been republished and is available from the Reed College bookstore. Also while at Reed, Rosenberg was a keen observer and commenter of the tabletop game Empire, though he never played.\nRosenberg won almost $50,000 on the television game show Jeopardy! in 1986 and returned for the program's Ultimate Tournament of Champions.\n\n\n== Books ==\nReadings in the Philosophy of Language, co-edited with Charles Travis; Prentice-Hall, Inc.; Englewood Cliffs, NJ; 1971.\nLinguistic Representation, D. Reidel Publishing Co.; Dordrecht, Holland; 1974.\nPallas Paperback edition, 1978; · Second edition, 1981.\n\nThe Practice of Philosophy, Prentice-Hall, Inc.; Englewood Cliffs, NJ; 1978\nSecond edition, revised and enlarged, 1984.\nThird edition, newly revised and enlarged, Prentice-Hall, Inc.; Upper Saddle River, NJ; 1996.\n\nOne World and Our Knowledge of It, D. Reidel Publishing Co.; Dordrecht, Holland; 1980.\nThinking Clearly About Death, Prentice-Hall, Inc.; Englewood Cliffs, NJ.; 1983.\nSecond edition, revised and enlarged; Hackett Publishing Co.; Indianapolis, IN, and Cambridge, MA; 1998.\n\nThe Thinking Self, Temple University Press; Philadelphia, PA; 1986.\nBeyond Formalism: Naming and Necessity for Human Beings, Temple University Press; Philadelphia, PA; 1994\nThree Conversations About Knowing, Hackett Publishing Co.; Indianapolis, IN, and Cambridge, MA; 2000\nThinking About Knowing, Oxford University Press; Oxford; 2002\nAccessing Kant, Oxford University Press; Oxford: 2005\nWilfrid Sellars: Fusing the Images, Oxford University Press; Oxford: 2007\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\nhttp://leiterreports.typepad.com/blog/2008/02/in-memoriam-jay.html\nhttp://www.legacy.com/NewsObserver/Obituaries.asp?Page=LifeStory&PersonID=104791474\nhttp://philosophy.unc.edu/rberg.htm (Homepage at UNC)\nhttp://www.unc.edu/~jfr (Personal Homepage)\nhttp://www.unc.edu/%7Ejfr/CV4Web-070324.htm (CV)", "ns": 0, "pageid": 16214567, "title": "Jay Rosenberg"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}