{"batchcomplete": "", "query": {"normalized": [{"to": "Jean Grondin", "from": "Jean_Grondin"}], "pages": {"34156749": {"extract": "Jean Grondin, OC (born August 27, 1955) is a philosopher and Canadian professor. He is a specialist in the thought of Immanuel Kant, Hans-Georg Gadamer, and Martin Heidegger. His research focuses on hermeneutics, phenomenology, German classical philosophy and the history of metaphysics.\n\n\n== Education and career ==\nAfter completing his philosophical studies at the University of Montreal, he wrote a thesis on the concept of truth in hermeneutics in 1982 at the University of Tübingen, where he also studied classical philology and theology. He taught at Université Laval, in Quebec City from 1982 to 1990 and at the University of Ottawa in the academic year 1990-1991.\nGrondin has taught at the University of Montreal since 1991. In addition to his authored volumes, translated into more than twelve languages, he is also the author of many articles in various philosophical journals. His two volumes on Kant continue to be authoritative and his major contributions on the universality of hermeneutics and phenomenology place Grondin in a Platonic philosophical tradition that goes back to Augustine and passes through Kant, Edmund Husserl, Heidegger, and Gadamer. He can be seen as the principal advocate for the work of Gadamer and Paul Ricoeur and is prominent in contemporary hermeneutics.\nHe was appointed an officer of the Order of Canada on December 30, 2012. In 2014 Jean Grondin was awarded the Molson Prize.\n\n\n== Influences and work ==\nThe influence of Gadamer and his magnum opus Truth and Method (Warheit und Methode; 1960) is apparent in much of Grondin's work. Grondin has also written the first intellectual biography of Gadamer, Hans-Georg Gadamer: A Biography. This book was eagerly awaited in Germany, in part due to the confirmed Nazism of Gadamer's teacher and friend, Martin Heidegger, and the question of Gadamer's own sympathies during World War II.\nGrondin's most well-known work is The Universality of Hermeneutics (1993), which has been translated into twelve languages. Grondin here defends the concept of a hermeneutics founded on the universality of interior language: behind discourse itself, understanding is held to be an interior sense that exceeds the limited terms of exterior language. This concept is further developed in his essay, 'On the Meaning of Life' (2003), wherein Grondin argues for an immanent meaning of life based on this internalized discourse.\nGrondin has also worked extensively on German idealism, the hermeneutics of Wilhelm Dilthey and Ricoeur, the theory of interpretation put forward by Emilio Betti, the deconstruction of Jacques Derrida, and the new phenomenology of Jean-Luc Marion. Grondin has, in addition to this original work, produced translations of many of Gadamer's writings.\n\n\n== Notable works ==\nThe following is a list of Grondin's well-known works in French and English.\nKant et le problème de la philosophie: l’a priori (J. Vrin, 1989).\nL'universalité de l’herméneutique (PUF, 1993).\nHans-Georg Gadamer: A Biography (Yale University Press, 2003).\nDu sens de la vie (Bellarmin, 2003).\nIntroduction à la métaphysique (PUM, 2004).\n\n\n== References ==\n\n\n== External links ==\nFaculty Page at the University of Ottawa\nBrief biography at the University of Montreal Department of Philosophy", "ns": 0, "pageid": 34156749, "title": "Jean Grondin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}