{"batchcomplete": "", "query": {"normalized": [{"to": "Jean Nicod", "from": "Jean_Nicod"}], "pages": {"2078853": {"extract": "Jean George Pierre Nicod (1893, France – 16 February 1924, Geneva, Switzerland) was a French philosopher and logician.\n\n\n== Biography ==\nIn his best known work, he showed that the classical propositional calculus could be derived from one axiom and one rule, both expressed using the Sheffer stroke. He also proposed the Nicod's axiom and developed Nicod's criterion.\nNicod died at the age of 31 from tuberculosis.\nSee also Carl Hempel's raven paradox.\n\n\n== Legacy ==\nThe Institut Jean Nicod (Paris) — a branch of the French Centre National de la Recherche Scientifique (CNRS) -- is research laboratory at the interface between philosophy, cognitive science, and the social sciences — was named in honour of Nicod's memory. Jean Nicod's name is also commemorated by the prestigious Jean Nicod Lectures, delivered annually in Paris by a leading philosopher of mind or philosophically oriented cognitive scientist, and published as a series by the MIT Press. The lecturer is awarded the Jean Nicod Prize by the CNRS.\n\n\n== Main works ==\n1917, \"A Reduction in the Number of Primitive Propositions of Logic\", Proc. Camb. Phil. Soc. 19: 32-41.\n1921, \"La géométrie des sensations de mouvement\", Revue de métaphysique et de morale 28: 537-43.\n1922, \"Les tendances philosophiques de M. Bertrand Russell\", Revue de métaphysique et de morale 29: 77-84.\n1922, \"Mathematical Logic and the Foundations of Mathematics\" in Encyclopædia Britannica: The New Volumes, vol. 3, 12th ed. 874-76.\n1923. La géométrie dans le monde sensible. Thèse, Univ. de Paris.\n1923. Le problème logique de l'induction. Thèse complémentaire, Univ. de Paris.\n1924. \"Les relations des valeurs et les relations de sens en logique formelle\", Revue de métaphysique et de morale 31: 467-80.\n1924, \"Freedom of Association and Trade Unionism: An Introductory Survey\", International Labor Review 9: 467-80.\n1930. Foundations of Geometry & Induction, Containing Geometry in a Sensible World and the Logical Problem of Induction, with prefaces by Bertrand Russell and André Lalande. London: Kegan Paul, Trench, Trubner & Co. New York: Harcourt, Brace & Co. Reprinted 2000, London: Routledge.\n\n\n== References ==\n\n\n== External links ==\nJean Nicod (1893-1924): Biographical note and works (in French)\nInstitut Jean Nicod (CNRS)", "ns": 0, "pageid": 2078853, "title": "Jean Nicod"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}