{"batchcomplete": "", "query": {"normalized": [{"to": "Jean Anthelme Brillat-Savarin", "from": "Jean_Anthelme_Brillat-Savarin"}], "pages": {"262801": {"extract": "Jean Anthelme Brillat-Savarin (French pronunciation: ​[ʒɑ̃ ɑ̃tɛlm bʁija savaʁɛ̃]; 1 April 1755, Belley, Ain – 2 February 1826, Paris) was a French lawyer and politician, and gained fame as an epicure and gastronome: \"Grimod and Brillat-Savarin. Between them, two writers effectively founded the whole genre of the gastronomic essay.\"\n\n\n== Biography ==\nBrillat-Savarin was born in the town of Belley, Ain, where the Rhône River then separated France from Savoy, to a family of lawyers. He studied law, chemistry and medicine in Dijon in his early years and later practiced law in his hometown. In 1789, at the opening of the French Revolution, he was sent as a deputy to the Estates-General that soon became the National Constituent Assembly, where he acquired some limited fame, particularly for a public speech in defense of capital punishment. His father Marc Anthelme adopted his second surname in 1733 upon the death of an aunt named Savarin who left him her entire fortune on the condition that he adopt her name.\nHe returned to Belley and was for a year the elected mayor. At a later stage of the Revolution there was a bounty on his head, and he sought shelter in Switzerland at some relatives' place in Moudon and then in the hôtel du Lion d'Argent in Lausanne. He later moved to Holland, and then to the new-born United States, where he stayed for three years in Boston, New York, Philadelphia and Hartford, living on the proceeds of giving French and violin lessons. For a time he was first violin in the Park Theater in New York.\nHe returned to France under the Directory in 1797 and acquired the magistrate post he would hold for the remainder of his life, as a judge of the Court of Cassation.\n\n\n=== Writings ===\nHe published several works on law and political economy. He also wrote an erotic short story, Voyage à Arras. He remained a bachelor, but not a stranger to love, which he counted the sixth sense: his inscription of the Physiologie to his beautiful cousin Juliette Récamier reads\n\n\"Madam, receive kindly and read indulgently the work of an old man. It is a tribute of a friendship which dates from your childhood, and, perhaps, the homage of a more tender feeling...How can I tell? At my age a man no longer dares interrogate his heart.\"\n\nHis famous work, Physiologie du goût (The Physiology of Taste), was published in December 1825, two months before his death. The full title is Physiologie du Goût, ou Méditations de Gastronomie Transcendante; ouvrage théorique, historique et à l'ordre du jour, dédié aux Gastronomes parisiens, par un Professeur, membre de plusieurs sociétés littéraires et savantes. The book has not been out of print since it first appeared, shortly before Brillat-Savarin's death. Its most notable English translation was done by food writer and critic M. F. K. Fisher, who remarked \"I hold myself blessed among translators.\" Her translation was first published in 1949.\nThe body of his work, though often wordy or excessively - and sometimes dubiously - aphoristic and axiomatic, has remained extremely important and has repeatedly been re-analyzed through the years since his death. In a series of meditations that owe something to Montaigne's Essays, and have the discursive rhythm of an age of leisured reading and a confident pursuit of educated pleasures, Brillat-Savarin discourses on the pleasures of the table, which he considers a science. His French models were the stylists of the Ancien Régime: Voltaire, Rousseau, Fénelon, Buffon, Cochin and d'Aguesseau.\nAside from Latin, he knew five modern languages well, and when the occasion suited, wasn't shy of parading them: he never hesitated to borrow a word, like the English sip when French seemed to him to fail, until he rediscovered the then-obsolete verb siroter.\nThe philosophy of Epicurus lies at the back of every page; the simplest meal satisfied Brillat-Savarin, as long as it was executed with artistry:\nThose persons who suffer from indigestion, or who become drunk, are utterly ignorant of the true principles of eating and drinking.\n\n\n== Influence ==\nBrillat-Savarin cheese, the Savarin mould, a ring mold with a rounded contour, and Gâteau Savarin are named in his honor.\nHis reputation was revitalized among modern gastronomes in many parts of the world, by his influence over Chairman Kaga of the TV series \"Iron Chef\" which introduced to millions to his famous aphorism: \"Tell me what you eat, and I will tell you what you are.\"\nBrillat-Savarin is often considered as the father of low-carbohydrate diet. He considered sugar and white flour to be the cause of obesity and he suggested instead protein-rich ingredients.\n\nSure enough, carnivorous animals never grow fat (consider wolves, jackals, birds of prey, crows, etc.). Herbivorous animals do not grow fat easily, at least until age has reduced them to a state of inactivity; but they fatten very quickly as soon as they begin to be fed on potatoes, grain, or any kind of flour. ... The second of the chief causes of obesity is the floury and starchy substances which man makes the prime ingredients of his daily nourishment. As we have said already, all animals that live on farinaceous food grow fat willy-nilly; and man is no exception to the universal law. Brillat-Savarin, Jean Anthelme (1970). The Physiology of Taste. trans. Anne Drayton. Penguin Books. pp. 208–209. ISBN 978-0-14-044614-2. \n\nEneas Sweetland Dallas wrote Kettner's Book of the Table, a Manual of Cookery, 1877, a treatise on gastronomy based on the work of Brillat-Savarin. Dallas published his book under the pseudonym of A. Kettner.\n\n\n== Quotes ==\n'Whoever receives friends and does not participate in the preparation of their meal does not deserve to have friends.'\nHe compared after-taste, the perfume or fragrance of food, to musical harmonics (Meditation ii): \"but for the odour which is felt in the back of the mouth, the sensation of taste would be but obtuse and imperfect\".\nAn avid cheese lover, Brillat-Savarin remarked: \"A dessert without cheese is like a beautiful woman with only one eye.\"\n\"The discovery of a new dish confers more happiness on humanity than the discovery of a new star.\"\n\"Tell me what you eat and I will tell you what you are.\"\n\"A man who was fond of wine was offered some grapes at dessert after dinner. 'Much obliged', said he, pushing the plate aside, 'I am not accustomed to take my wine in pills'.\"\n\"To receive guests is to take charge of their happiness during the entire time they are under your roof.\"\n\"Cooking is one of the oldest arts and one that has rendered us the most important service in civic life.\"\n\"The pleasure of the table belongs to all ages, to all conditions, to all countries, and to all areas; it mingles with all other pleasures, and remains at last to console us for their departure.\"\n\n\n== Death ==\n\nHe was buried at the Cimetière du Père Lachaise in Paris.\n\n\n== Footnotes ==\n\n\n== External links ==\nLa Physiologie du goût Original French text of the 1848 illustrated edition of The Physiology of Taste; a freely licensed copy hosted on the Bibliothèque nationale de France's digital library, Gallica.\nThe Physiology of Taste In an English translation by Fayette Robinson, available under a free licence from the University of Adelaide Library.\nWorks by Jean Anthelme Brillat-Savarin at Bibliothèque nationale de France\nWorks by Jean Anthelme Brillat-Savarin at Project Gutenberg\nWorks by or about Jean Anthelme Brillat-Savarin at Internet Archive", "ns": 0, "pageid": 262801, "title": "Jean Anthelme Brillat-Savarin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}