{"batchcomplete": "", "query": {"normalized": [{"to": "Jennifer Lackey", "from": "Jennifer_Lackey"}], "pages": {"42540664": {"extract": "Jennifer Lackey is a professor of philosophy at Northwestern University. She is known for her research in epistemology, especially on testimony, disagreement, memory, the norms of assertion, and virtue epistemology. She is the author of Learning from Words: Testimony as a Source of Knowledge and of numerous articles and book chapters. She is also co-editor of The Epistemology of Testimony  and The Epistemology of Disagreement: New Essays.\n\n\n== Education ==\nLackey graduated from Saint Mary's College in 1994 with a B.A. in philosophy and from the University of Chicago in 1995 with an M.A. in philosophy. In 2000, she graduated from Brown University with a Ph.D. in philosophy under the supervision of Ernest Sosa.\n\n\n== Research areas ==\nLackey’s primary research interests lie in social epistemology. She is known for arguing against the traditional view of testimony, according to which testimony is a merely transmissive, rather than a generative, epistemic source. On this view, hearers can acquire knowledge on the basis of testimony only if the speakers themselves possess the knowledge in question and thus testimony transmits knowledge from one person to another without being able to generate knowledge in its own right. In Learning from Words: Testimony as a Source of Knowledge, Lackey uses her widely discussed creationist teacher case  to argue that the standard view is false and that testimony can in fact be generative. In this case, a creationist teacher rejects all of the evidence supporting evolutionary theory and thus fails to either believe or know that modern day Homo sapiens evolved from Homo erectus, but nevertheless reliably conveys this fact about Homo sapiens to her students. This shows that the teacher imparts knowledge to her students that she fails to possess herself. Lackey then advances a theory of the epistemology of testimony that focuses on the linguistic or communicative items in testimonial exchanges, such as statements and other acts of communication, rather than the internal states of speakers, such as states of knowing and believing.\nIn other work, Lackey argues that reasonableness, rather than knowledge, is the norm of assertion, that memory is a generative epistemic source, and that lying requires deception.\nLackey is also known for arguing against the claim central to virtue epistemology that knowledge should be understood in terms of the knower’s deserving credit for the truth of her belief. Lackey argues that the virtue epistemologist faces a dilemma: either the standards for deserving credit for a true belief are relatively high, or they are relatively low. If they are relatively high, then the virtue epistemologist cannot account for instances of knowledge from testimony, where the credit for the hearer’s true belief goes to the speaker. On the other hand, if the standards are relatively low, then the virtue epistemologist cannot distinguish between cases of genuine knowledge and Gettier cases where a person has a justified true belief by accident.\n\n\n== Awards and fellowships ==\nLackey has received a number of awards, including a Charles A. Ryskamp Research Fellowship from the American Council of Learned Societies, the Young Epistemologist Prize, and an Alice Kaplan Institute for the Humanities Fellowship.\n\n\n== Selected works ==\nLearning from Words: Testimony as a Source of Knowledge, (2008, hardback; 2010, paperback). Oxford: Oxford University Press.\nThe Epistemology of Disagreement: New Essays (2013), co-edited with David Christensen. Oxford: Oxford University Press.\nThe Epistemology of Testimony (2006), co-edited with Ernest Sosa. Oxford: Oxford University Press.\n“Disagreement,” forthcoming in Robert Audi (ed.), The Cambridge Dictionary of Philosophy. Cambridge: Cambridge University Press.\n“Taking Religious Disagreement Seriously,” forthcoming in Timothy O’Connor and Laura Frances Goins (eds.), Religious Faith and Intellectual Virtue (Oxford: Oxford University Press).\n“Lies and Deception: An Unhappy Divorce.” Analysis 73 (2013): 236-48.\n“Disagreement and Belief Dependence: Why Numbers Matter,” in David Christensen and Jennifer Lackey (eds.), The Epistemology of Disagreement: New Essays (Oxford: Oxford University Press, 2013): 243-68.\n“Group Knowledge Attributions,” in Jessica Brown and Mikkel Gerken (eds.), Knowledge Ascriptions (Oxford: Oxford University Press, 2012): 243-69.\n“Assertion and Isolated Secondhand Knowledge,” in Jessica Brown and Herman Cappelen (eds.), Assertion (Oxford: Oxford University Press, 2011): 251-75.\n“A Justificationist View of Disagreement’s Epistemic Significance,” in Adrian Haddock, Alan Millar, and Duncan Pritchard (eds.), Social Epistemology (Oxford: Oxford University Press, 2010): 298-325.\n“What Should We Do When We Disagree?” in Tamar Szabó Gendler and John Hawthorne (eds.), Oxford Studies in Epistemology 3 (Oxford: Oxford University Press, 2010): 274-93.\n“What Luck Is Not.” Australasian Journal of Philosophy 86 (2008): 255-67.\n“Norms of Assertion.” Noûs 41 (2007): 594-626.\n“Why We Don’t Deserve Credit for Everything We Know.” Synthese 158 (2007): 345-61.\n“Learning from Words.” Philosophy and Phenomenological Research 73 (2006): 77-101.\n“Memory as a Generative Epistemic Source.” Philosophy and Phenomenological Research 70 (2005): 636-58.\n“Testimonial Knowledge and Transmission.” The Philosophical Quarterly 49 (1999): 471-90.\n\n\n== Miscellaneous ==\nLackey is Editor-in-Chief of Episteme: Journal of Individual and Social Epistemology, Associate Editor of Philosophical Studies, and an Epistemology Subject Editor for the Stanford Encyclopedia of Philosophy.\nLackey was elected an At-Large Member of the Board of Officers for the American Philosophical Association in the first-ever association-wide vote for this position. Lackey will begin this three-year appointment July 1, 2014.\nLackey has been a guest on Philosophy Talk on the topic of disagreement, has discussed social epistemology with Alvin Goldman on Philosophy TV, and has been interviewed for 3:AM Magazine.\n\n\n== References ==\n\n\n== External links ==\nJennifer Lackey’s personal homepage\nJennifer Lackey’s department page\n\n\n== Further reading ==\n\n\n=== Reviews of Learning from Words ===\nAnalysis, Michael Root\nNotre Dame Philosophical Reviews, Aaron Z. Zimmerman\nMind, Paul Faulkner\nPhilosophical Quarterly, Christoph Kelp\nErkenntnis, Nicola Mößner\nAnalytic Philosophy, Andrew Cullison\nPhilosophy Now, David Fraser\n\n\n=== Papers that discuss Lackey's work ===\nBenjamin McMyler, “Responsibility for Testimonial Belief”\nMasashi Kasaki, “Subject-Sensitive Invariantism and Isolated Secondhand Knowledge”\nSpyridon Palermos, “Dualism in the Epistemology of Testimony and the Ability Intuition,”\nRachel R. McKinnon, “What I Learned in the Lunch Room about Assertion and Practical Reasoning,”\nMatthew A. Benton, “Expert Opinion and Second-Hand Knowledge”\nNeil Levy, “What, and Where, Luck Is: A Response to Jennifer Lackey”\nDon Fallis, “Are Bald-Faced Lies Deceptive after All?”\nTimothy Perrine, “In Defense of Non-Reductionism in the Epistemology of Testimony”\nMark Nicholas Wales, “A Problem with Defining Testimony: Intention and Manifestation”\nAndrew Cullison, “On the Nature of Testimony”\nJ. Adam Carter and Emma C. Gordon, “Norms of Assertion: The Quantity and Quality of Epistemic Support,”", "ns": 0, "pageid": 42540664, "title": "Jennifer Lackey"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}