{"batchcomplete": "", "query": {"normalized": [{"to": "Jerrold Levinson", "from": "Jerrold_Levinson"}], "pages": {"12148335": {"extract": "Jerrold Levinson (born 11 July 1948 in Brooklyn) is Distinguished Professor of Philosophy at the University of Maryland, College Park. He is particularly noted for his work on the aesthetics of music, as well as for his search for meaning and ontology in film, art and humour.\n\n\n== Biography ==\nLevinson started his studies in 1965 at the Massachusetts Institute of Technology, where he gained a BS Degree in Philosophy and Chemistry in 1969. He continued his studies at the University of Michigan. There he achieved his doctorate in philosophy in 1974.\nDuring 1974-1975, Jerrold Levinson was visiting assistant professor at SUNY Albany. In 1976 he became assistant professor at the University of Maryland, was promoted to associate professor in 1982 and full professor in 1991. In 2004 he was accorded the title of Distinguished University Professor.\nLevinson has been visiting professor at several universities in the U.S., such as the Johns Hopkins University and Columbia University. He has also held visiting appointments in other countries, such as England (University of London and [University of Kent]), New Zealand (University of Canterbury), France (Université de Rennes), Belgium (Université Libre de Bruxelles), Portugal (Universidade de Lisboa) and Switzerland (Conservatorio della Svizzera Italiana). During 2010-2011 he held an International Francqui Chair  at the Katholieke Universiteit Leuven (Belgium), and in 2011 received the Premio Internazionale of the Società Italiana d'Estetica.\nIn 2003 Levinson co-directed a National Endowment for the Humanities Summer Institute, Art, Mind, and Cognitive Science, and during 2001-2003 was President of the American Society for Aesthetics.\n\n\n== Philosophy ==\nLevinson's interest in the aesthetics of music has led to an examination of musical ontology from a historical-contextual perspective, and of performance with an emphasis on performing means. He has posited theories of evaluating music and has considered the legitimacy of emotional response in musical appreciation. Within his study of performance he has also examined the distinctness of performing and critical interpretation.\nLevinson advocates the position that music has the same relation to thought as does language; i.e., if language is an expression of thought, so is music. This is particularly revealed in his analysis of Wittgenstein's ideas on the meaning in music:\nWhat Wittgenstein is underscoring here about the appreciation of music is this. Music is not understood in a vacuum, as a pure structure of sounds fallen from the stars, one which we receive via some pure faculty of musical perception. Music is rather inextricably embedded in our form of life, a form of life that is, as it happens, essentially linguistic. Thus music is necessarily apprehended, at least in part, in terms of the language and linguistic practices that define us and our world.\nThis raises interesting points in the debate on absolute music.\n\n\n== Bibliography ==\nBooks:\nMusic, Art, and Metaphysics, Ithaca: Cornell UP, 1990; 2nd edition, Oxford: Oxford UP, 2011.\nThe Pleasures of Aesthetics, Ithaca: Cornell UP, 1996.\nMusic in the Moment, Ithaca: Cornell UP, 1998.\nAesthetics and Ethics, ed., Cambridge UP, 1998.\nOxford Handbook of Aesthetics, ed., Oxford UP, 2003.\nContemplating Art, Oxford: Oxford UP, 2006.\nMusical Concerns, Oxford: Oxford UP, 2015\nArticles/papers:\nProperties and Related Entities, in Philosophy and Phenomenological Research, 39(1), 1978.\nThe Particularisation of Attributes, in Australasian Journal of Philosophy, 58 (2), 1980\nWhat a Musical Work Is, in The Journal of Philosophy, 77(1), 1980.\nAesthetic Uniqueness, in The Journal of Aesthetics and Art Criticism, 38(4), 1980.\nAutographic and Allographic Art Revisited, in Philosophical Studies, 38(4), 1980\nTruth in Music, in The Journal of Aesthetics and Art Criticism, 40(2), 1981.\nGewirth on Absolute Rights, in The Philosophical Quarterly, 32(126), 1982.\nHybrid Art Forms, in Journal of Aesthetic Education, 18(4), 1984.\nTitles, in The Journal of Aesthetics and Art Criticism, 44(1), 1985.\nEvaluating Musical Performance, in Journal of Aesthetic Education, 21(1), 1987.\nA Note on Categorical Properties and Contingent Identity, in The Journal of Philosophy, 85(12), 1988.\nRefining Art Historically, in The Journal of Aesthetics and Art Criticism, 47(1), 1989.\nMusical Literacy, in Journal of Aesthetic Education, 24(1) Special Issue: Cultural Literacy and Arts Education, 1990.\nPhilosophy as an Art, in Journal of Aesthetic Education, 24(2), 1990.\nThe Place of Real Emotion in Response to Fictions, in The Journal of Aesthetics and Art Criticism, 48(1), 1990.\nA Refiner's Fire: Reply to Sartwell and Kolak, in The Journal of Aesthetics and Art Criticism, 48(3), 1990.\nFurther Fire: Reply to Haines, in The Journal of Aesthetics and Art Criticism, 49(1), 1991.\nMusical Profundity Misplaced, in The Journal of Aesthetics and Art Criticism, 50(1), 1992.\nSeeing, Imaginarily, at the Movies, in The Philosophical Quarterly, 43(170), 1993.\nExtending Art Historically, in The Journal of Aesthetics and Art Criticism, 51(3), 1993.\nBeing Realistic about Aesthetic Properties, in The Journal of Aesthetics and Art Criticism, 52(3), 1994.\nStill Hopeful: Reply to Karl and Robinson, in The Journal of Aesthetics and Art Criticism, 53(2), 1995.\nCritical Notice of Malcolm Budd, Values of Art, in Mind, New Series, 105(420), 1996.\nWollheim on Pictorial Representation, in The Journal of Aesthetics and Art Criticism, 56(3), 1998.\nWho's Afraid of a Paraphrase?, in Theoria, 67, 2001.\nHume's Standard of Taste: The Real Problem, in The Journal of Aesthetics and Art Criticism, 60(3), 2002.\nThe Irreducible Historicality of the Concept of Art, in British Journal of Aesthetics 42, 2002.\nThe Real Problem Sustained: Reply to Wieand, in The Journal of Aesthetics and Art Criticism, 61(4), 2003.\nIntrinsic Value and the Notion of a Life, in The Journal of Aesthetics and Art Criticism, 62(4), 2004.\nMusic as Narrative and Music as Drama, in Mind and Language, 19, 2004.\nErotic Art and Pornographic Pictures, in Philosophy and Literature, 29, 2005.\nWhat Are Aesthetic Properties?, in Proceedings of the Aristotelian Society, Supplement 78, 2005.\nConcatenationism, Architectonicism, and the Appreciation of Music, in Revue Internationale de Philosophie, 2006.\nWhy There Are No Tropes, in Philosophy, 81, 2006.\nMusical Expressiveness as Hearability-as-Expression, in Contemporary Debates in Aesthetics, M. Kieran, ed., Blackwell, 2006.\nMusic and Philosophy, in Topoi, 28, 2009\nThe Aesthetic Appreciation of Music, in British Journal of Aesthetics, 49, 2009.\n\n\n== References ==", "ns": 0, "pageid": 12148335, "title": "Jerrold Levinson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}