{"batchcomplete": "", "query": {"normalized": [{"to": "Jessica Wilson", "from": "Jessica_Wilson"}], "pages": {"42352443": {"extract": "Jessica M. Wilson is an associate professor of philosophy at the University of Toronto, Scarborough and Regular Distinguished Visiting Professor at the University of Edinburgh. Her research focuses on metaphysics, especially on the metaphysics of science and mind, the epistemologies of skepticism, a priori deliberation, and necessity. Wilson was awarded the Lebowitz Prize for excellence in philosophical thought by Phi Beta Kappa in conjunction with the American Philosophical Association. She is known for introducing the 'proper subset strategy' for linking higher-level entities to their realizers through sets of causal powers, and for her defense of the idea that ordinary metaphysical relations are well-suited to characterize metaphysical dependencies.\n\n\n== Education and career ==\nWilson received her baccalaureate summa cum laude in mathematics from the University of California, San Diego in 1987, before starting a doctorate program in philosophy at the University of Colorado, Boulder in 1994, and eventually receiving her doctorate in philosophy from Cornell University in 2001. Wilson accepted an appointment as the William Wilhartz Assistant Professor of Philosophy at the University of Michigan in 2002, before accepting an associate professorship at the University of Toronto, Scarborough in 2005. Wilson also accepted a simultaneous appointment as a Regular Distinguished Visiting Professor at the Eidyn Research Centre at the University of Edinburgh in 2014. Wilson has also held visiting positions at the University of Cologne, the University of St. Andrews, the University of Barcelona, Australian National University, and the Max Planck Institute for the History of Science.\n\n\n== Research areas and publications ==\nWilson has written more than two dozen refereed articles, published several book reviews in journals, and written three encyclopedia entries. Her research has focused largely on metaphysics and epistemology, with a focus on the metaphysics of modality, fundamentality, science, and mind, and the epistemologies of skepticism, a priori deliberation, and necessity, as well as physicalism, emergentism, and mental causation. In the study of physicalism, Wilson first published on the 'proper subset strategy' for avoiding the worry that higher-level and their realizing lower-level properties would causally overdetermine their effects: properties are associated with sets of causal powers, and one property realizes another by the realized property being associated with a set of causal powers that is a proper subset of that associated with the realizing property; Wilson also argues that a nontrivial version of physicalism must be defined to exclude fundamental mental entities.\n\n\n== Works ==\nStephen Mumford; Matthew Tugby, eds. (27 June 2013). \"Nonlinearity and metaphysical emergence\". Metaphysics and Science. OUP Oxford. pp. 201–230. ISBN 978-0-19-165633-0. \n\n\n== References ==\n\n\n== External links ==\n\"Jessica Wilson\". philpapers. Retrieved April 7, 2014.", "ns": 0, "pageid": 42352443, "title": "Jessica Wilson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}