{"batchcomplete": "", "query": {"normalized": [{"to": "Jin Yuelin", "from": "Jin_Yuelin"}], "pages": {"5484556": {"extract": "Jin Yuelin (Chinese: 金岳霖) (1895–1984) was a Chinese philosopher best known for three works, one each on logic, metaphysics, and epistemology. He was also a commentator on Bertrand Russell.\n\n\n== Biography ==\nJin was born in Changsha, Hunan and attended Tsinghua University from 1911 until 1914. He obtained Ph.D. in Political Science from Columbia University in 1920. In 1926, Jin founded the Department of Philosophy at Tsinghua University. Jin was an active participant in the May 4th movement as a young, intellectual revolutionary. He helped to incorporate the scientific method into philosophy. Hao Wang was one of his students.\nHe died in Beijing.\n\n\n== Philosophical context: Eastern vs. Western thought ==\nAmong the first to introduce certain basics of modern logic into China, Jin also founded a new philosophical system combining elements from Western and Chinese philosophical traditions (especially the concept of Tao). Not much work on Jin’s philosophy has been done in the West in English, although a decent amount has been done in Chinese. Jin does not advocate a traditional, historical approach to philosophy, but rather presents philosophy as a practicing approach to solving problems – philosophy as goal in and of itself. This is quite different from how Chinese philosophers at the time viewed the study of philosophy. At the risk of oversimplifying, Jin’s approach can be viewed as a hybrid between Western and Eastern philosophical ideologies – influenced both by his Western education in logic and science, and by his Chinese roots. He was interested in Bertrand Russell’s work, and in particular with two main concepts: breaking down the complex into smaller parts, which was his understanding of Russell's logical atomism, and rebuilding through the logical method, which was Jin's reading of Russell's logicism. Both the logicism and the logical atomism affected Jin’s thinking and philosophy. However Jin can be considered a Chinese philosopher because he was most informed by Chinese philosophy, and concerned himself most with Chinese concepts, such as Tao. “However,” Zinda writes, “Jin used discursive structures borrowed from both Chinese and Western thought as modes of persuasion”.\n\n\n=== Jin's views on Chinese philosophy ===\nJin’s writing is intertwined with his desire to navigate the space between Chinese and Western philosophy. In his essay “Chinese Philosophy”, Jin highlights the differences he sees between the two spheres regarding the study of philosophy. He sees the Western approach to philosophy as being more of a meticulous scientific and logical approach that he traces back to the Hellenistic thought in Ancient Greece. In contrast, he explains Chinese philosophy as having “underdevelopment of what might be called logico-epistemological consciousness”. He explains Chinese philosophy as being more poetic in that it has “bareness and disconnectedness”, where Western philosophy is more verbose. This lack of extended explanation in Chinese philosophy leads, Jin notes, to Chinese philosophy being more about interpreting old philosopher’s work, rather than presenting new original ways of thinking. In contrast, Jin does not attribute ideas to past thinkers or quote past thinkers in his own philosophy. Additionally, he did not pursue the nationalistic aims of China in his philosophy, as many of his colleagues did. Jin notes that China has a long history of the study of philosophy and political science being intertwined; the philosophy of today is a more specialized and differentiated discipline. This detachment from the discipline, while it creates objective knowledge, distances the philosopher from the philosophy. Jin advocates for living philosophy, rather than just knowing it. Thus, he works to take advantage of the emotional attachment of Chinese words. For example, Jin chooses not to translate the word “Dao” to English, but keeps its Chinese origin.\n\n\n== Works ==\n1936: Logic (《逻辑》/《邏輯》)\n1940: On Tao (《论道》/《論道》)\n1965: Criticism of Russell's Philosophy (《罗素哲学批判》/《羅素哲學批判》)\n1983: A Theory of Knowledge (《知识论》/《知識論》)\n\n\n=== Basic writings and concepts ===\nJin’s most accomplished philosophical writings are his three principal publications written in Chinese: Logic (1935), On Tao (1940), and A Theory of Knowledge (1983). His English publication, \"Tao, Nature, and Man\" draws heavily on thought from \"On Dao\", which he considers to be one of the most central parts of his philosophical work. Jin’s metaphysics is focused mostly on Tao, which he argues is what life is made up of. It is composed of two main elements that Jin coins as Stuff and Form. In short, Stuff refers to the inexpressible matter that fills everything, while Form refers to all of reality that is being filled. Essentially, Tao is the result of when Form is filled with Stuff. Jin uses his definition of Tao to posit a universal sympathy: everything – including humans – is one in the same, and we should appreciate life as such.\n\n\n==== Stuff ====\nStuff is inexpressible. In fact, the word “Stuff” itself is simply a word Jin uses to approximate the definition because, he posits, no word or human will ever fully grasp the concept. Scholar Hu Jun writes, “What is required in order to grasp matter [Stuff] is a sort of intellectual projection, in which recognition of the limits of one’s intellect is accompanied by a leave out of the intellectual process...”. Stuff refers to the capacity of all things to change – pure activity and potentiality. It is composed of two categories – Universals and Possibilities.\n\n\n==== Universals and possibilities ====\nJin explains the notions of Universals and Possibilities as stemming from the ideal version of concepts, which in turn stems from abstracting the concrete. The Universal refers to a concept which a group of things have in common. Jin writes, “Each universal is an aspect shared by a class of objects, for example… horseness which is shared by a class of quadrupeds”. Universals are groupings that we are familiar with. A Possibility, therefore, is a concept that is not a Universal. It is that which has not been imagined yet, but could be imagined. Thus, Jin writes, “we are able to define an universal as a realized possibility… A universal is merely a Stuffed possibility”. Jin posits that the reality we feel with regard to events and objects is the realization of possibilities of those events and objects. Hu writes, “The realization of contingent possibilities gives us the richness, variety, and completeness of Tao, whereas the eternally unrealized possibilities supply us with the implements in the realm of thinking and thought”.\n\n\n==== Form ====\nForm is what Stuff must remain inside of. Hu writes, “Whether or not matter [Stuff] enters into or withdraws from possibilities, it must stay within Form”. Everything is inside of Form. Jin explains that unlike Universals, it does not have “a boundary line dividing what belongs to it from what doesn’t”. Thus Form is formless – it incorporates everything and is nothing at the same time. It is what is left when there are no possibilities – there is nothing outside of Form. Form and Stuff are inescapably intertwined. Stuff fills Form, and Form contains Stuff. Jin writes, “Un-Stuffed Form or Un-formed Stuff is a contradiction”. Jin defines their relationship as, “Stuff as a sort of raw material and Form as a kind of mould”.\n\n\n==== Tao ====\nTao is Jin’s most basic concept, but is also his highest ideal realm. Tao is the coming together of Stuff and Form to create the universe. If Tao were only Stuff then it would be fluid, and if it were only Form then it would be empty. Jin writes, “Tao is simply Stuffed Form or Formed Stuff. It is therefore neither pure Form nor pure Stuff”. Tao is all-pervasive and incorporates everything. Therefore, Jin posits that humans are part of Tao, and urges us to be “conscious of the fundamental oneness at which we are with the universe and everything there is in it”. He presents a universe where everything has the same status because everything is made up of the same fabric. Scholar Yvonne Schulz Zinda writes, “he established a kind of ontological certainty that integrates individuals the evolutionary process of dao, through which they are interrelated with each other”. While different things have different jobs – Jin gives the example of a mosquito’s job being to bite a human, and a human’s job to kill the mosquito – one thing not innately superior to the other.\n\n\n== See also ==\nFeng Youlan\nHao Wang (academic)\n\n\n== References ==", "ns": 0, "pageid": 5484556, "title": "Jin Yuelin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}