{"batchcomplete": "", "query": {"normalized": [{"to": "Jody Azzouni", "from": "Jody_Azzouni"}], "pages": {"1987344": {"extract": "Jody Azzouni (born Jawad Azzouni; born 1954) is an American philosopher, short fiction writer, and poet. He currently is Professor of Philosophy at Tufts University.\n\n\n== Education ==\nHe received his bachelor's degree and master's degree from New York University and his PhD from the City University of New York.\n\n\n== Career and philosophical positions ==\nAzzouni is currently working on the philosophy of mathematics (he holds a degree in mathematics), science, logic, language and in areas of metaphysics, epistemology, and aesthetics. He acknowledges, as do many of his peers, a debt to the renowned philosopher, Willard Van Orman Quine. Azzouni is of the nominalist bent and has centered much of his philosophical efforts around defending nominalism.\nOne of his most distinctive positions is the as yet controversial claim that mathematical objects don't exist.\n\n\n== Other work ==\nIn addition to his philosophical endeavors, Azzouni has published numerous short stories. He has written a book of poetry entitled The Lust For Blueprints.\n\n\n== Books ==\n\n\n=== Philosophy ===\nMetaphysical Myths, Mathematical Practice: The Ontology and Epistemology of the Exact Sciences (1994)\nKnowledge and Reference in Empirical Science (2000)\nDeflating Existential Consequence: A Case for Nominalism (2004)\nTracking Reason: Proof, Consequence and Truth (2006)\nTalking About Nothing: Numbers, Hallucinations and Fictions (2010)\nSemantic perception : how the illusion of a common language arises and persists (2013)\n\n\n=== Poetry ===\nThe Lust for Blueprints The Poet's Press (1999) ISBN 0-922558-07-8 ISBN 978-0922558070\nHereafter Landscapes The Poet's Press (2010) ISBN 0-922558-42-6\n\n\n== See also ==\n\nAmerican philosophy\nList of American philosophers\n\n\n== External links ==\nJody Azzouni's poetry Web site\nFaculty Profile", "ns": 0, "pageid": 1987344, "title": "Jody Azzouni"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}