{"batchcomplete": "", "query": {"normalized": [{"to": "Johann Gottfried Herder", "from": "Johann_Gottfried_Herder"}], "pages": {"294037": {"extract": "Johann Gottfried (after 1802: von) Herder (25 August 1744 – 18 December 1803) was a German philosopher, theologian, poet, and literary critic. He is associated with the periods of Enlightenment, Sturm und Drang, and Weimar Classicism.\n\n\n== Biography ==\nBorn in Mohrungen (now Morąg, Poland) in the Kingdom of Prussia, Herder grew up in a poor household, educating himself from his father's Bible and songbook. In 1762, an introspective youth of seventeen, he enrolled at the local University of Königsberg, where he became a student of Immanuel Kant. At the same time, Herder became an intellectual protégé of Johann Georg Hamann, an intensely subjective thinker who disputed the claims of pure secular reason.\nHamann's influence led Herder to confess to his wife later in life that \"I have too little reason and too much idiosyncrasy\", yet Herder can justly claim to have founded a new school of German political thought. Although himself an unsociable person, Herder influenced his contemporaries greatly. One friend wrote to him in 1785, hailing his works as \"inspired by God.\" A varied field of theorists were later to find inspiration in Herder's tantalisingly incomplete ideas.\nIn 1764, now a clergyman, Herder went to Riga to teach. It was during this period that he produced his first major works, which were literary criticism.\nIn 1769 Herder traveled by ship to the French port of Nantes and continued on to Paris. This resulted in both an account of his travels as well as a shift of his own self-conception as an author.\nBy 1770 Herder went to Strasbourg, where he met the young Goethe. This event proved to be a key juncture in the history of German literature, as Goethe was inspired by Herder's literary criticism to develop his own style. This can be seen as the beginning of the \"Sturm und Drang\" movement. In 1771 Herder took a position as head pastor and court preacher at Bückeburg under Count throughout the nation Wilhelm von Schaumburg-Lippe.\nBy the mid-1770s, Goethe was a well-known author, and used his influence at the court of Weimar to secure Herder a position as General Superintendent. Herder moved there in 1776, where his outlook shifted again towards classicism.\nTowards the end of his career, Herder endorsed the French Revolution, which earned him the enmity of many of his colleagues. At the same time, he and Goethe experienced a personal split. Another reason for his isolation in later years was due to his unpopular attacks on Kantian philosophy.\nIn 1802 Herder was ennobled by the Elector-Prince of Bavaria, which added the prefix \"von\" to his last name. He died in Weimar in 1803 at age 59.\n\n\n== Works and ideas ==\nIn 1772 Herder published Treatise on the Origin of Language and went further in this promotion of language than his earlier injunction to \"spew out the ugly slime of the Seine. Speak German, O You German\". Herder now had established the foundations of comparative philology within the new currents of political outlook.\nThroughout this period, he continued to elaborate his own unique theory of aesthetics in works such as the above, while Goethe produced works like The Sorrows of Young Werther – the Sturm und Drang movement was born.\nHerder wrote an important essay on Shakespeare and Auszug aus einem Briefwechsel über Ossian und die Lieder alter Völker (Extract from a correspondence about Ossian and the Songs of Ancient Peoples) published in 1773 in a manifesto along with contributions by Goethe and Justus Möser. Herder wrote that \"A poet is the creator of the nation around him, he gives them a world to see and has their souls in his hand to lead them to that world.\" To him such poetry had its greatest purity and power in nations before they became civilised, as shown in the Old Testament, the Edda, and Homer, and he tried to find such virtues in ancient German folk songs and Norse poetry and mythology.\n\nAfter becoming General Superintendent in 1776, Herder's philosophy shifted again towards classicism. Herder was at his best during this period, and produced works such as his unfinished Outline of a Philosophical History of Humanity which largely originated the school of historical thought. Herder's philosophy was of a deeply subjective turn, stressing influence by physical and historical circumstance upon human development, stressing that \"one must go into the age, into the region, into the whole history, and feel one's way into everything\". The historian should be the \"regenerated contemporary\" of the past, and history a science as \"instrument of the most genuine patriotic spirit\".\nHerder gave Germans new pride in their origins, modifying that dominance of regard allotted to Greek art (Greek revival) extolled among others by Johann Joachim Winckelmann and Gotthold Ephraim Lessing. He remarked that he would have wished to be born in the Middle Ages and mused whether \"the times of the Swabian emperors\" did not \"deserve to be set forth in their true light in accordance with the German mode of thought?\". Herder equated the German with the Gothic and favoured Dürer and everything Gothic. As with the sphere of art, equally he proclaimed a national message within the sphere of language. He topped the line of German authors emanating from Martin Opitz, who had written his Aristarchus, sive de contemptu linguae Teutonicae in Latin in 1617, urging Germans to glory in their hitherto despised language. Herder's extensive collections of folk-poetry began a great craze in Germany for that neglected topic.\nAlong with Wilhelm von Humboldt, Herder was one of the first to argue that language determines thought, a theme that two centuries later would be central to the Sapir–Whorf hypothesis. Herder's focus upon language and cultural traditions as the ties that create a \"nation\" extended to include folklore, dance, music and art, and inspired Jacob and Wilhelm Grimm in their collection of German folk tales.\nHerder attached exceptional importance to the concept of nationality and of patriotism – \"he that has lost his patriotic spirit has lost himself and the whole worlds about himself\", whilst teaching that \"in a certain sense every human perfection is national\". Herder carried folk theory to an extreme by maintaining that \"there is only one class in the state, the Volk, (not the rabble), and the king belongs to this class as well as the peasant\". Explanation that the Volk was not the rabble was a novel conception in this era, and with Herder can be seen the emergence of \"the people\" as the basis for the emergence of a classless but hierarchical national body.\nThe nation, however, was individual and separate, distinguished, to Herder, by climate, education, foreign intercourse, tradition and heredity. Providence he praised for having \"wonderfully separated nationalities not only by woods and mountains, seas and deserts, rivers and climates, but more particularly by languages, inclinations and characters\". Herder praised the tribal outlook writing that \"the savage who loves himself, his wife and child with quiet joy and glows with limited activity of his tribe as for his own life is in my opinion a more real being than that cultivated shadow who is enraptured with the shadow of the whole species\", isolated since \"each nationality contains its centre of happiness within itself, as a bullet the centre of gravity\". With no need for comparison since \"every nation bears in itself the standard of its perfection, totally independent of all comparison with that of others\" for \"do not nationalities differ in everything, in poetry, in appearance, in tastes, in usages, customs and languages? Must not religion which partakes of these also differ among the nationalities?\"\nFollowing a trip to Ukraine, Herder wrote a prediction in his diary (Journal meiner Reise im Jahre 1769) that Slavic nations would one day be the real power in Europe, as the western Europeans would reject Christianity and rot away, while the eastern European nations would stick to their religion and their idealism, and would this way become the power in Europe. More specifically, he praised Ukraine's \"beautiful skies, blithe temperament, musical talent, bountiful soil, etc. [...] someday will awaken there a cultured nation whose influence will spread [...] throughout the world.\" One of his related predictions was that the Hungarian nation would disappear and become assimilated by surrounding Slavic peoples; this prophecy caused considerable uproar in Hungary and is widely cited to this day.\n\n\n=== Germany and the Enlightenment ===\nThis question was further developed by Herder's lament that Martin Luther did not establish a national church, and his doubt whether Germany did not buy Christianity at too high a price, that of true nationality. Herder's patriotism bordered at times upon national pantheism, demanding of territorial unity as \"He is deserving of glory and gratitude who seeks to promote the unity of the territories of Germany through writings, manufacture, and institutions\" and sounding an even deeper call:\n\"But now! Again I cry, my German brethren! But now! The remains of all genuine folk-thought is rolling into the abyss of oblivion with a last and accelerated impetus. For the last century we have been ashamed of everything that concerns the fatherland.\"\n\nIn his Ideas upon Philosophy and the History of Mankind he even wrote, \"Compare England with Germany: the English are Germans, and even in the latest times the Germans have led the way for the English in the greatest things.\"\nHerder, who hated absolutism and Prussian nationalism, but who was imbued with the spirit of the whole German Volk, yet as historical theorist turned away from the light of the eighteenth century. Seeking to reconcile his thought with this earlier age, Herder sought to harmonize his conception of sentiment with reasoning, whereby all knowledge is implicit in the soul; the most elementary stage is sensuous and intuitive perception which by development can become self-conscious and rational. To Herder, this development is the harmonizing of primitive and derivative truth, of experience and intelligence, feeling and reasoning.\nHerder is the first in a long line of Germans preoccupied with this harmony. This search is itself the key to much in German theory. And Herder was too penetrating a thinker not to understand and fear the extremes to which his folk-theory could tend, and so issued specific warnings. He argued that Jews in Germany should enjoy the full rights and obligations of Germans, and that the non-Jews of the world owed a debt to Jews for centuries of abuse, and that this debt could be discharged only by actively assisting those Jews who wished to do so to regain political sovereignty in their ancient homeland of Israel. Herder refused to adhere to a rigid racial theory, writing that \"notwithstanding the varieties of the human form, there is but one and the same species of man throughout the whole earth\".\nHe also announced that \"national glory is a deceiving seducer. When it reaches a certain height, it clasps the head with an iron band. The enclosed sees nothing in the mist but his own picture; he is susceptible to no foreign impressions.\" And:\nThe passage of time was to demonstrate that while many Germans were to find influence in Herder's convictions and influence, fewer were to note his qualifying stipulations.\nHerder had emphasised that his conception of the nation encouraged democracy and the free self-expression of a people's identity. He proclaimed support for the French Revolution, a position which did not endear him to royalty. He also differed with Kant's philosophy for not placing reasoning within the context of language. Herder did not think that reason itself could be criticized, as it did not exist except as the process of reasoning. This process was dependent on language. He also turned away from the Sturm und Drang movement to go back to the poems of Shakespeare and Homer.\nTo promote his concept of the Volk, he published letters and collected folk songs. These latter were published in 1773 as Voices of the Peoples in Their Songs (Stimmen der Völker in ihren Liedern). The poets Achim von Arnim and Clemens von Brentano later used Stimmen der Võlker as samples for The Boy's Magic Horn (Des Knaben Wunderhorn).\nHerder also fostered the ideal of a person’s individuality. Although he had from an early period championed the individuality of cultures - for example, in his This Too a Philosophy of History for the Formation of Humanity (1774), he also championed the individuality of persons within a culture; for example, in his On Thomas Abbt's Writings (1768) and On the Cognition and Sensation of the Human Soul (1778).\nIn On Thomas Abbt's Writings, Herder stated that \"a human soul is an individual in the realm of minds: it senses in accordance with an individual formation, and thinks in accordance with the strength of its mental organs. . .. My long allegory has succeeded if it achieves the representation of the mind of a human being as an individual phenomenon, as a rarity which deserves to occupy our eyes.\"\n\n\n== Bibliography ==\nSong to Cyrus, the Grandson of Astyages (1762)\n\"Essay on Being\" (1763–64)\nOn Diligence in Several Learned Languages (1764)\nTreatise on the Ode (1764)\nHow Philosophy can become more Universal and Useful for the Benefit of the People (1765)\nFragments on Recent German Literature (1767–68)\nOn Thomas Abbt's Writings (1768)\nCritical Forests, or Reflections on the Science and Art of the Beautiful (1769-)\nJournal of my Voyage in the Year 1769 (first published 1846)\nTreatise on the Origin of Language (1772)\nSelection from correspondence on Ossian and the songs of ancient peoples (1773) See also: James Macpherson (1736–1796).\nOf German Character and Art (with Goethe, manifesto of the Sturm und Drang) (1773)\nThis Too a Philosophy of History for the Formation of Humanity (1774)\nOldest Document of the Human Race (1774–76)\n\"Essay on Ulrich von Hutten\" [\"Nachricht von Ulrich von Hutten\"] (1776)\nOn the Resemblance of Medieval English and German Poetry (1777)\nSculpture: Some Observations on Shape and Form from Pygmalion's Creative Dream (1778)\nOn the Cognition and Sensation of the Human Soul (1778)\nOn the Effect of Poetic Art on the Ethics of Peoples in Ancient and Modern Times (1778)\nFolk Songs (1778–79; second ed. of 1807 titled The Voices of Peoples in Songs)\nOn the Influence of the Government on the Sciences and the Sciences on the Government (Dissertation on the Reciprocal Influence of Government and the Sciences) (1780)\nLetters Concerning the Study of Theology (1780–81)\nOn the Influence of the Beautiful in the Higher Sciences (1781)\nOn the Spirit of Hebrew Poetry. An Instruction for Lovers of the Same and the Oldest History of the Human Spirit (1782–83)\nGod. Some Conversations (1787)\nIdeas on the Philosophy of the History of Mankind (1784–91)\nScattered Leaves (1785–97)\nLetters for the Advancement of Humanity (1791–97 or 1793–97? (various drafts))\nChristian Writings (5 vols.) (1794-8)\nTerpsichore (1795-6) A translation and commentary of the Latin poet Jakob Balde.\nPersepolisian Letters (1798). Fragments on Persian architecture, history and religion.\nLuther’s Catechism, with a catechetical instruction for the use of schools (1798)\nUnderstanding and Experience. A Metacritique of the Critique of Pure Reason. Part I. (Part II, Reason and Language.) (1799)\nCalligone (1800)\nAdrastea: Events and Characters of the 18th Century (6 vols.) (1801–3)\nThe Cid (1805; a free translation of the Spanish epic Cantar de Mio Cid)\n\n\n=== Works in English ===\nSelected Writings on Aesthetics. Edited and translated by Gregory Moore. Princeton U.P. 2006. pp. x + 455. ISBN 978-0691115955. Edition makes many of Herder's writings on aesthetics available in English for the first time.\nAnother Philosophy of History and Selected Political Writings, eds. Ioannis D. Evrigenis and Daniel Pellerin (Indianapolis: Hackett Pub., 2004). A translation of Auch eine Philosophie and other works.\nPhilosophical Writings, ed. Michael N. Forster (Cambridge: Cambridge Univ. Press, 2002). The most important philosophical works of the early Herder available in English, including an unabridged version of the Treatise on the Origin of Language and This Too a Philosophy of History for the Formation of Mankind.\nSculpture: Some Observations on Shape and Form from Pygmalion's Creative Dream, ed. Jason Gaiger (Chicago: University of Chicago Press, 2002). Herder's Plastik.\nSelected Early Works, eds. Ernest A. Menze and Karl Menges (University Park: The Pennsylvania State Univ. Press, 1992). Partial translation of the important text Über die neuere deutsche Litteratur.\nOn World History, eds. Hans Adler and Ernest A. Menze (Armonk, N.Y.: M.E. Sharpe, 1997). Short excerpts on history from various texts.\nJ. G. Herder on Social & Political Culture (Cambridge Studies in the History and Theory of Politics), ed. F. M. Barnard (Cambridge University Press, 2010 (originally published in 1969)) ISBN 978-0-521-13381-4 Selected texts: 1. Journal of my voyage in the year 1769; 2. Essay on the origin of language; 3. Yet another philosophy of history; 4. Dissertation on the reciprocal influence of government and the sciences; 5. Ideas for a philosophy of the history of mankind.\nHerder: Philosophical Writings, ed. Desmond M. Clarke and Michael N. Forster (Cambridge University Press, 2007), ISBN 978-0-521-79088-8. Contents: Part I. General Philosophical Program: 1. How philosophy can become more universal and useful for the benefit of the people (1765); Part II. Philosophy of Language: 2. Fragments on recent German literature (1767–8); 3. Treatise on the origin of language (1772); Part III. Philosophy of Mind: 4. On Thomas Abbt's writings (1768); 5. On cognition and sensation, the two main forces of the human soul; 6. On the cognition and sensation, the two main forces of the human soul (1775); Part IV. Philosophy of History: 7. On the change of taste (1766); 8. Older critical forestlet (1767/8); 9. This too a philosophy of history for the formation of humanity (1774); Part V. Political Philosophy: 10. Letters concerning the progress of humanity (1792); 11. Letters for the advancement of humanity (1793–7).\nHerder on Nationality, Humanity, and History, F. M. Barnard. (Montreal and Kingston: McGill-Queen's University Press, 2003.) ISBN 978-0-7735-2519-1.\nHerder's Social and Political Thought: From Enlightenment to Nationalism, F. M. Barnard, Oxford, Publisher: Clarendon Press, 1967. ASIN B0007JTDEI.\n\n\n== See also ==\nHerder Prize\n\n\n== Notes ==\n\n\n== References ==\nMichael N. Forster, After Herder: Philosophy of Language in the German Tradition, Oxford University Press, 2010.\n\n\n== Further reading ==\nAdler, Hans. \"Johann Gottfried Herder's Concept of Humanity,\" Studies in Eighteenth-Century Culture 23 (1994): 55–74\nAzurmendi, J. 2008. Volksgeist. Herri gogoa, Donostia, Elkar, ISBN 978-84-9783-404-9.\nBarnard, Frederick Mechner (1965). Herder's Social and Political Thought. Oxford, Oxfordshire: Oxford University Press. ISBN 0-19-827151-4. \nBerman, Antoine. L'épreuve de l'étranger. Culture et traduction dans l'Allemagne romantique: Herder, Goethe, Schlegel, Novalis, Humboldt, Schleiermacher, Hölderlin., Paris, Gallimard, Essais, 1984. ISBN 978-2-07-070076-9\nBerlin, Isaiah, Vico and Herder. Two Studies in the History of Ideas, London, 1976.\nIsaiah Berlin, Three Critics of the Enlightenment: Vico, Hamann, Herder, London and Princeton, 2000, ISBN 0-691-05726-5,\nHerder today. Contributions from the International Herder Conference, November 5–8, 1987, Stanford, California. Edited by Mueller-Vollmer Kurt. Berlin: Walter de Gruyter 1990.\nBaum, Manfred, Herder's essay on Being. In Herder Today: Contributions from the International Herder Conference, November 5–8, 1987, Stanford, California. Edited by Mueller-Vollmer Kurt. Berlin: Walter de Gruyter 1990. pp. 126–137.\nSimon Josef, Herder and the problematization of metaphysics. In Herder Today: Contributions from the International Herder Conference, November 5–8, 1987, Stanford, California. Edited by Mueller-Vollmer Kurt. Berlin: Walter de Gruyter 1990. pp. 108–125.\n\nIggers, George. The German Conception of History: The National Tradition of Historical Thought from Herder to the Present (2nd ed.; Wesleyan University Press, 1983).\nTaylor, Charles, The importance of Herder. In Isaiah Berlin: a celebration edited by Margalit Edna and Margalit Avishai. Chicago: University of Chicago Press 1991. pp. 40–63; reprinted in: C. Taylor, Philosophical arguments, Cambridge, Harvard University Press, 1995, pp. 79–99.\nZammito, John H. Kant, Herder, the birth of anthropology. Chicago: Chicago University Press 2002.\nZammito, John H., Karl Menges and Ernest A. Menze. \"Johann Gottfried Herder Revisited: The Revolution in Scholarship in the Last Quarter Century,\" Journal of the History of Ideas, Volume 71, Number 4, October 2010, pp. 661–684, in Project MUSE\n\n\n== External links ==\nWorks by or about Johann Gottfried Herder at Internet Archive\nWorks by Johann Gottfried Herder at LibriVox (public domain audiobooks) \n\"Johann Gottfried von Herder\". Stanford Encyclopedia of Philosophy. \nHerder bibliography and more\nHerder biography by Robert Matthees (PDF; German)\nInternational Herder Society\nSelected works from Project Gutenberg (in German)\n Texts on Wikisource:\n\"Herder, Johann Gottfried von\". New International Encyclopedia. 1905. \n\"Herder\". The Nuttall Encyclopædia. 1907. \n\"Herder, Johann Gottfried von\". Encyclopædia Britannica (11th ed.). 1911. \n\"Herder, Johann Gottfried von\". The New Student's Reference Work. 1914. \n\"Herder, Johann Gottfried von\". Encyclopedia Americana. 1920.", "ns": 0, "pageid": 294037, "title": "Johann Gottfried Herder"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}