{"batchcomplete": "", "query": {"normalized": [{"to": "Johan van Benthem (logician)", "from": "Johan_van_Benthem_(logician)"}], "pages": {"1498176": {"extract": "Johannes Franciscus Abraham Karel (Johan) van Benthem (born 12 June 1949 in Rijswijk) is a University Professor (universiteitshoogleraar) of logic at the University of Amsterdam at the Institute for Logic, Language and Computation and professor of philosophy at Stanford University (at CSLI). He was awarded the Spinozapremie in 1996 and elected a Foreign Fellow of the American Academy of Arts & Sciences in 2015.\nHe studied physics (B.Sc. 1969), philosophy (M.A. 1972) and mathematics (M.Sc. 1973) at the University of Amsterdam and received a PhD from the same university under supervision of Martin Löb in 1977. Before becoming University Professor in 2003, he held appointments at the University of Amsterdam (1973–1977), at the University of Groningen (1977–1986), and as a professor at the University of Amsterdam (1986–2003).\nIn 1992 he was elected member of the Royal Netherlands Academy of Arts and Sciences.\nVan Benthem is known for his research in the area of modal logic. This research has resulted in Van Benthem's Theorem, which states that modal logic is the fragment of first-order logic that is closed under bisimulation.\nHe has also been active in the fields of philosophy of science, logical structures in natural language (generalized quantifiers, categorial grammar, substructural proof theory), dynamic logic and update logic and applications of logic to game theory as well as applications of game theory to logic (game semantics). Van Benthem is a member of the group collectively publishing under the pseudonym L. T. F. Gamut. He has also taught in China. He made an effort to encourage and organize international collaboration between Chinese and Western logicians.\nProfessor van Benthem retired from the Institute for Logic, Language and Computation in September 2014.\n\n\n== Publications ==\nLogic in action, North Holland, 1991\nHandbook of Logic and Language, ed. with Alice ter Meulen, Elsevier/MIT Press, 1997\nModal Logic: A Semantic Perspective, with Patrick Blackburn\nLogic in Games, MIT Press, January 2014\n\n\n== References ==\n\n\n== External links ==\nVan Benthem's personal homepage", "ns": 0, "pageid": 1498176, "title": "Johan van Benthem (logician)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}