{"batchcomplete": "", "query": {"normalized": [{"to": "Johann Albert Fabricius", "from": "Johann_Albert_Fabricius"}], "pages": {"158401": {"extract": "Johann Albert Fabricius (11 November 1668 – 30 April 1736) was a German classical scholar and bibliographer.\n\n\n== Biography ==\nFabricius was born at Leipzig, son of Werner Fabricius, director of music in the church of St. Paul at Leipzig, who was the author of several works, the most important being Deliciae Harmonicae (1656). The son received his early education from his father, who on his deathbed recommended him to the care of the theologian Valentin Alberti.\nHe studied under J. G. Herrichen, and afterwards at Quedlinburg under Samuel Schmid. It was in Schmid’s library, as he afterwards said, that he found the two books, Kaspar von Barth's compendium Adversariorum libri LX (1624) and Daniel Georg Morhof's Polyhistor (1688), which suggested to him the idea of his Bibliothecæ, the kind of works on which his great reputation was ultimately founded.\nOn returning to Leipzig in 1686, he published anonymously two years later his first work, Scriptorum recentiorum decas, an attack on ten writers of the day. His Decas Decadum, sive plagiariorum et pseudonymorum centuria (1689) is the only one of his works to which he signs the name Faber. Fabricius then applied himself to the study of medicine, which, however, he relinquished for that of theology; and having gone to Hamburg in 1693, he proposed to travel abroad, when the unexpected tidings that the expense of his education had absorbed his whole patrimony, and even left him in debt to his trustee, forced him to abandon this project. In 1693 he published a doctoral dissertation De Platonismo Philonis Judaei which contributed to Philo of Alexandria's losing his position as an \"honorary Church Father\".\nHe therefore remained at Hamburg in the capacity of librarian to Johann Friedrich Mayer (1650–1712). In 1696 he accompanied his patron to Sweden; and on his return to Hamburg, not long afterwards, he became a candidate for the chair of logic and philosophy. The suffrages being equally divided between Fabricius and Sebastian Edzardus, one of his opponents, the appointment was decided by lot in favour of Edzardus; but in 1699 Fabricius succeeded Vincent Placcius in the chair of rhetoric and ethics, a post which he held until his death, refusing invitations to Greifswald, Kiel, Giessen, and Wittenberg. He died at Hamburg. The details of the life of Fabricius are to be found in De Vita et Scriptis J. A. Fabricii Commentarius, by his son-in-law, H. S. Reimarus, the well-known editor of Dio Cassius, published at Hamburg in 1737.\n\n\n== Works ==\nFabricius is credited with 128 books. He was a celebrated bibliographer and collector of manuscripts, and many of his volumes are compilations, editions, or anthologies.\n\n\n=== Bibliotheca Latina ===\nOne of the most famed and laborious of his works is the Bibliotheca Latina The divisions of the compilation are:\nthe writers to the age of Tiberius\nto that of the Antonines\nto the decay of the language\nfragments from old authors, and chapters on early Christian literature.\nA supplementary work was Bibliotheca Latina mediae et infimae Aetatis\n\n\n=== Bibliotheca Graeca ===\nFabricius' most important work is the Bibliotheca Graeca (1705–1728, revised and continued by G. C. Harles, 1790—1812), a work which has been denominated maximus antiquae eruditionis thesaurus (the greatest repository of ancient learning). Its divisions are marked off by Homer, Plato, Jesus, Constantine, and the capture of Constantinople in 1453, while a sixth section is devoted to canon law, jurisprudence and medicine.\n\n\n=== Other works ===\nSpecimen elencticum historiae logicae, a catalogue of the treatises on logic known by him (1699)\nBibliotheca Antiquaria, an account of the writers whose works illustrated Jewish, Greek, Roman, and Christian antiquities (1713)\nCentifolium Lutheranum, a Lutheran bibliography (1728)\nBibliotheca Ecclesiastica (1718)\nPreface to Vincent Placcius's Theatrum anonymorum et pseudonymorum (1708).\nFabricius was also influential in articulating current scholarly notions of the \"Old Testament Pseudepigrapha\" and \"New Testament Apocrypha\", through his compilations of collections of texts and excerpts:\nCodex apocryphus Novi Testamenti (1703)\nCodex pseudepigraphus Veteris Testamenti (1713)\nCodicis pseudepigraphi Veteris Testamenti Volumen alterum accedit Josephi veteris Christiani auctoria Hypomnesticon (1723)\nThese volumes were widely cited and consulted as recently as 20th century.\n\n\n== Notes ==\n\n\n== Bibliography ==\nBackus, Irene (1998). \"Renaissance Attitudes towards New Testament Apocryphal Writings: Jacques Lefèvre d'Étaples and His Epigones\". Renaissance Quarterly. 51. \nCharlesworth, James H. (1985). The Old Testament Pseudepigrapha and New Testament: Prolegomena to the Study of Christian Origins. Cambridge: Cambridge University Press. \nPetersen, E. (2001). M. Pade (ed.), ed. \"Learned Communication: Johann Albert Fabricius and the Literary Communities\". Renaissance Readings of the Corpus Aristotelicum. Copenhagen: Museum Tusculanum. \nPetersen, E. (1998). Intellectum liberare Johann Albert Fabricius: En humanist i Europa. Copenhagen: Museum Tusculanum. \nReed, Annette Yoshiko (2009). \"The Modern Invention of Old Testament Pseudepigrapha\". Journal of Theological Studies. doi:10.1093/jts/flp033. \n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"article name needed\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== External links ==\nBibliotheca Latina Mediae et Infimae Aetatis and other books. Original Latin Texts\nJ.A. Fabricius, Codex pseudepigraphus Veteris Testamenti (Hamburg and Leipzig, 1713) on GoogleBooks\nJ.A. Fabricius, Codicis pseudepigraphi Veteris Testamenti, Volumen alterum accedit Josephi veteris Christiani auctoria Hypomnesticon (Hamburg, 1723) on GoogleBooks\nJ.A. Fabricius, Codex apocryphus Novi Testamenti (Hamburg, 1703; 2nd rev.ed. 1719) on GoogleBooks", "ns": 0, "pageid": 158401, "title": "Johann Albert Fabricius"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}