{"batchcomplete": "", "query": {"normalized": [{"to": "Johann Heinrich Lambert", "from": "Johann_Heinrich_Lambert"}], "pages": {"93085": {"extract": "Johann Heinrich Lambert (German: [ˈlambɛʁt], Jean-Henri Lambert in French; 26 August 1728 – 25 September 1777) was a Swiss polymath who made important contributions to the subjects of mathematics, physics (particularly optics), philosophy, astronomy and map projections.\n\n\n== Biography ==\nLambert was born in 1728 into a Huguenot family in the city of Mulhouse (now in Alsace, France), at that time an exclave of Switzerland. Leaving school at 12, he continued to study in his free time whilst undertaking a series of jobs. These included assistant to his father (a tailor), a clerk at a nearby iron works, a private tutor, secretary to the editor of Basler Zeitung and, at the age of 20, private tutor to the sons of Count Salis in Chur. Travelling Europe with his charges (1756–1758) allowed him to meet established mathematicians in the German states, The Netherlands, France and the Italian states. On his return to Chur he published his first books (on optics and cosmology) and began to seek an academic post. After a few short posts he was rewarded (1763) by an invitation to a position at the Prussian Academy of Sciences in Berlin, where he gained the sponsorship of Frederick II of Prussia, and became a friend of Euler. In this stimulating and financially stable environment, he worked prodigiously until his death in 1777.\n\n\n== Work ==\n\n\n=== Mathematics ===\nLambert was the first to introduce hyperbolic functions into trigonometry. Also, he made conjectures regarding non-Euclidean space. Lambert is credited with the first proof that π is irrational. He used a generalized continued fraction for the function tan x. Euler believed but could not prove that π was irrational, and it is speculated that Aryabhata also believed this, in 500 CE. Lambert also devised theorems regarding conic sections that made the calculation of the orbits of comets simpler.\nLambert devised a formula for the relationship between the angles and the area of hyperbolic triangles. These are triangles drawn on a concave surface, as on a saddle, instead of the usual flat Euclidean surface. Lambert showed that the angles added up to less than π (radians), or 180°. The amount of shortfall, called the defect, increases with the area. The larger the triangle's area, the smaller the sum of the angles and hence the larger the defect CΔ = π — (α + β + γ). That is, the area of a hyperbolic triangle (multiplied by a constant C) is equal to π (in radians), or 180°, minus the sum of the angles α, β, and γ. Here C denotes, in the present sense, the negative of the curvature of the surface (taking the negative is necessary as the curvature of a saddle surface is defined to be negative in the first place). As the triangle gets larger or smaller, the angles change in a way that forbids the existence of similar hyperbolic triangles, as only triangles that have the same angles will have the same area. Hence, instead of expressing the area of the triangle in terms of the lengths of its sides, as in Euclid's geometry, the area of Lambert's hyperbolic triangle can be expressed in terms of its angles.\n\n\n=== Map projection ===\nLambert was the first mathematician to address the general properties of map projections. In particular he was the first to discuss the properties of conformality and equal area preservation and to point out that they were mutually exclusive. (Snyder 1993 p77). In 1772, Lambert published seven new map projections under the title Anmerkungen und Zusätze zur Entwerfung der Land- und Himmelscharten, (translated as Notes and Comments on the Composition of Terrestrial and Celestial Maps by Waldo Tobler (1972)). Lambert did not give names to any of his projections but they are now known as:\nLambert conformal conic\nTransverse Mercator\nLambert azimuthal equal area\nLagrange projection\nLambert cylindrical equal area\nTransverse cylindrical equal area\nLambert conical equal area\nThe first three of these are of great importance. Further details may be found at map projections and in several texts.\n\n\n=== Physics ===\nLambert invented the first practical hygrometer. In 1760, he published a book on photometry, the Photometria. From the assumption that light travels in straight lines, he showed that illumination was proportional to the strength of the source, inversely proportional to the square of the distance of the illuminated surface and the sine of the angle of inclination of the light's direction to that of the surface. These results were supported by experiments involving the visual comparison of illuminations and used for the calculation of illumination. In Photometria Lambert also formulated the law of light absorption—the Beer–Lambert law) and introduced the term albedo. He wrote a classic work on perspective and contributed to geometrical optics. The photometric unit lambert is named in recognition of his work in establishing the study of photometry. Lambert was also a pioneer in the development of three-dimensional colour models. Late in life, he published a description of a triangular colour pyramid (Farbenpyramide), which shows a total of 107 colours on six different levels, variously combining red, yellow and blue pigments, and with an increasing amount of white to provide the vertical component. His investigations were built on the earlier theoretical proposals of Tobias Mayer, greatly extending these early ideas. Lambert was assisted in this project by the court painter Benjamin Calau.\n\n\n=== Philosophy ===\nIn his main philosophical work, Neues Organon (New Organon, 1764), Lambert studied the rules for distinguishing subjective from objective appearances. This connects with his work in the science of optics. In 1765 he began corresponding with Immanuel Kant who intended to dedicate to him the Critique of Pure Reason but the work was delayed, appearing after his death.\n\n\n=== Astronomy ===\nLambert also developed a theory of the generation of the universe that was similar to the nebular hypothesis that Thomas Wright and Immanuel Kant had (independently) developed. Wright published his account in An Original Theory or New Hypothesis of the Universe (1750), Kant in Allgemeine Naturgeschichte und Theorie des Himmels, published anonymously in 1755. Shortly afterward, Lambert published his own version of the nebular hypothesis of the origin of the solar system in Cosmologische Briefe über die Einrichtung des Weltbaues (1761). Lambert hypothesized that the stars near the sun were part of a group which travelled together through the Milky Way, and that there were many such groupings (star systems) throughout the galaxy. The former was later confirmed by Sir William Herschel. In astrodynamics he also solved the problem of determination of time of flight along a section of orbit, known now as Lambert's problem. His work in this area is commemorated by the Asteroid 187 Lamberta named in his honour.\n\n\n=== Logic ===\nJohann-Heinrich Lambert is the author of a treatise on logic, which he called Neues Organon (1764), that is to say, the New Organon. The most recent edition of this work named after Aristotle's Organon was issued in 1990 by the Akademie-Verlag of Berlin. To say nothing of the fact that in it one has the first appearance of the term phenomenology, one can find therein a very pedagogical presentation of the various kinds of syllogism. In A System of Logic Ratiocinative and Inductive, John-Stuart Mill expresses his admiration for Johann Heinrich Lambert.\n\n\n== See also ==\nList of things named after Johann Lambert\n\n\n== Notes ==\n\n\n== References ==\nA Short Account of the History of Mathematics, W. W. Rouse Ball, 1908.\nAsimov's Biographical Encyclopedia of Science and Technology, Isaac Asimov, Doubleday & Co., Inc., 1972, ISBN 0-385-17771-2.\n\"La théorie des parallèles de Johann Heinrich Lambert : Présentation, traduction et commentaires\", A. Papadopoulos and G. Théret, Collection Sciences dans l'histoire, Librairie Albert Blanchard, Paris, 2014. ISBN 978-2-85367-266-5.\nMax E. Eisenring (Nov 1941). Johann Heinrich Lambert und die wissenschaftliche Philosophie der Gegenwart (PDF) (Ph.D. thesis) (in German). ETH Zürich. \n\n\n== External links ==\nJohann Heinrich Lambert (1728-1777): Collected Works - Sämtliche Werke Online\nO'Connor, John J.; Robertson, Edmund F., \"Johann Heinrich Lambert\", MacTutor History of Mathematics archive, University of St Andrews .\nEntry from \"A Short Account of the History of Mathematics\".\nBritannica\nNNDB\nRouse Ball\nDigitized works at Université de Strasbourg\nSarah Lowengard \"Number, Order, Form: Color Systems and Systematization\" and Johann Heinrich Lambert The Creation of Color in Eighteenth-Century Europe (New York: Columbia University Press, 2006)\n\"Mémoire sur quelques propriétés remarquables...\" (1761), demonstration of irrationality of π, online and analyzed BibNum (PDF).", "ns": 0, "pageid": 93085, "title": "Johann Heinrich Lambert"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}