{"batchcomplete": "", "query": {"normalized": [{"to": "Johann Georg Walch", "from": "Johann_Georg_Walch"}], "pages": {"180792": {"extract": "Johann Georg Walch (June 17, 1693 – January 13, 1775) was a German Lutheran theologian.\n\n\n== Life ==\nHe was born at Meiningen, where his father, Georg Walch, was general superintendent. He studied at Leipzig and Jena, amongst his teachers being JF Buddeus, whose only daughter he married. He published in 1716 a work, Historia critica Latinae linguae, which soon came into wide use. Two years later he became professor extraordinarius of philosophy at Jena. In 1719, he was appointed professor ordinarius of rhetoric, in 1721 of poetry, and in 1724 professor extraordinarius of theology. In 1728 he became professor ordinarius of theology, and in 1750 professor primarius.\nHis theological position was that of moderate orthodoxy, greatly influenced by the philosophy and controversies of the Deistic period. His university lectures and published works ranged over the wide fields of church history in its various branches, particularly the literature and the controversies of the church, dogmatics, ethics and pastoral theology.\nOf his works the most valuable were Bibliotheca theologica (1757–1765); Bibliotheca patristica (1770); his edition of Luther's works in 24 vols. (1740–1752); Historische und theologische Einleitung in die religiösen Streitigkeiten, welche sonderlich ausser der evangelische-lutherischen Kirche entstanden (5 vols., 1733 ff.); the companion work to this, Einleitung in die Religionsstreitigkeiten der evangel.-luth. Kirche (1730–1739), and Philosophisches Lexikon (1726, 4th ed. 1775).\nAlso important is the Historia logicae, published at Leipzig in 1721.\nHis life, with a complete list of his writings, which amounted to 287, Leben und Charakter des Kirchenraths J. G. Walch, was published anonymously by his son CWF Walch (Jena, 1777). Cf. Wilhelm Gass, Protestantische Dogmatik, iii. p. 205 sq.\nHis sons, Johann Ernst Immanuel and Christian Wilhelm Franz Walch were also noted theologians.\nJohann Georg Walch died in Jena, Germany, on 13 January 1775 at 81 years of age.\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Walch, Johann Georg\". Encyclopædia Britannica. 28 (11th ed.). Cambridge University Press.", "ns": 0, "pageid": 180792, "title": "Johann Georg Walch"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}