{"batchcomplete": "", "query": {"normalized": [{"to": "John M. Cooper", "from": "John_M._Cooper"}], "pages": {"25126563": {"extract": "John Milton Cooper, Jr. (born 1940) is an American historian, author, and educator. His specialization is late 19th- and early 20th-century American Diplomatic History. Cooper is Professor Emeritus at the University of Wisconsin-Madison.\nHis most recent book, Woodrow Wilson: A Biography, was published in 2009. It is described as \"the first major biography of America’s twenty-eighth president in nearly two decades.\" The book was a finalist for the Pulitzer Prize for Biography or Autobiography.\n\n\n== Education ==\nPrinceton University, summa cum laude, 1961\nColumbia University, PhD, 1968\n\n\n== Books ==\nThe Vanity of Power; American Isolationism and the First World War. 1914-1917. Westport, Conn., Greenwood Publishing Corp., 1969\nEditor, Causes and Consequences of World War I. Chicago: Quadrangle Books, 1972\nWalter Hines Page: The Southerner as American,1855-1918. Chapel Hill: University of North Carolina Press, 1977\nThe Warrior and the Priest: Woodrow Wilson and Theodore Roosevelt. Cambridge, Mass.,: Harvard University Press, 1983 ISBN 9780674947511\nPivotal Decades: The United States 1900-1920. New York W.W. Norton & Co., 1990\nEditor with Charles E. Neu, The Wilson Era: Essays in Honor of Arthur S. Link. Arlington Heights, ILL., Harlan Davidson, Inc., 1991\nBreaking the Heart of the World: Woodrow Wilson and the Fight for the League of Nations. New York: Cambridge University Press, 2001\nWoodrow Wilson: A Biography. New York: Vintage: 2009 ISBN 9780307265418\n\n\n== References ==\n\n\n== External links ==\nFaculty page at the University of Wisconsin-Madison\nAuthor interview at the Pritzker Military Library on February 25, 2010\nAppearances on C-SPAN", "ns": 0, "pageid": 25126563, "title": "John M. Cooper"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}