{"batchcomplete": "", "query": {"normalized": [{"to": "John of St. Thomas", "from": "John_of_St._Thomas"}], "pages": {"7497949": {"extract": "John of St. Thomas, (family name João Poinsot or Johannes Poinsot, since the 1980s in American texts also John Poinsot; 9 June 1589 – 17 June 1644), was a theologian and philosopher, born at Lisbon.\nOf noble parentage, he was sent early to the University of Coimbra, displayed talents of the first order, completed his humanities and philosophy, and obtained the degree of Master of Arts. He then entered the University of Louvain. Here, too, he showed remarkable ability, and won the title of Bachelor of Theology at an early age. He joined the Dominicans at Madrid in 1612 or 1613, taking the name of John of St. Thomas, by which he is known to history. As professor of philosophy and theology in a monastery at Alcalá, he soon took rank among the most learned men of the time, and was placed successively (1630 and 1640) in charge of the two principal chairs of theology in the university of that city. His renown drew the largest number of scholars that had ever attended its theological faculties.\nNo man enjoyed a greater reputation in Spain, or was more frequently consulted on points of doctrine and ecclesiastical matters. His theological and philosophical writings, which have gone through many editions, are among the best expositions of Thomas Aquinas's doctrine, of which he is acknowledged to be one of the foremost interpreters. Though he took an active part in the scholastic discussions of his times, his courtesy was such that he is said never to have hurt an opponent's feelings. So faithful was he to the traditions of his order and the principles of the Angelic Doctor that in his last illness he could declare that, in all the thirty years he had devoted to teaching and writing, he had not taught or written anything contrary to St. Thomas. His humility and his devotion to education caused him to refuse many dignities offered him by the Church and his order. In 1643 Philip IV offered him the office of royal confessor, a position which only religious obedience could induce him to accept. His writings comprise: Cursus philosophicus Thomisticus (9 vols.); Cursus Theologici (9 vols.), which is a commentary on the Summa Theologica of St. Thomas; Tractatus de Approbatione, Auctoritate, et Puritate Doctrinae D. Thomae Aquinatis; A Compendium of Christian Doctrine (in Spanish); and A Treatise on a Happy Death (in Spanish), written at the command of Philip IV. He died at Fraga, Spain.\n\n\n== Works ==\nBy John of St. Thomas\nIoannes a S. Thoma, O. P. (1883). Cursus philosophicus Thomisticus (in Latin). Paris: Ludovicus Vivès. OCLC 7132509. Retrieved 2011-06-17. Volumes 1, 2, and 3 available gratis online. \nIoannes a S. Thoma, O. P. (1931–1964). Cursus theologici (in Latin). Paris, Rome: Desclée. OCLC 18001569. Retrieved 2011-06-17. 5 volumes. Volumes 1, 2a, and 2b of another edition available gratis online. \nJohn of St. Thomas (2004). Introduction to the Summa Theologiae of Thomas Aquinas: The Isagogue of John of St. Thomas. Trans. McInerny, Ralph. South Bend, Ind.: St. Augustine's Press. OCLC 46928729. \nJohn of St. Thomas (1950). The Gifts of the Holy Ghost. foreword by Walter Farrell. London: Sheed and Ward. OCLC 224205817. \nPoinsot, John (1985) [1632]. Tractatus de Signis. The semiotic of John Poinsot. Trans. Deely, John. Berkeley: California University Press. OCLC 277224194. Retrieved 2011-06-17. \nOn John of St. Thomas\nDeely, John (1994). \"What happened to philosophy between Aquinas and Descartes?\". The Thomist. 58 (4): 543–568. Retrieved 2011-06-17.  \nDeely, John (2008). Descartes and Poinsot: The Crossroad of Signs and Ideas. Scranton, PA: University of Scranton Press. ISBN 9781589661745. \nDeely, John (2009). Augustine and Poinsot: The Protosemiotic Development. Scranton, PA: University of Scranton Press. ISBN 9781589661738. \n\n\n== References ==\n\n\n== Sources ==\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). \"John of St. Thomas\". Catholic Encyclopedia. New York: Robert Appleton. \n\n\n== External links ==\nGeneral Bibliography by Marco Forlivesi\nThe rediscovery of John Poinsot Annotated bibliography about the contributions of John of St. Thomas to semiotics\nCursus Philosophicus Thomisticus Latin text by John of St. Thomas", "ns": 0, "pageid": 7497949, "title": "John of St. Thomas"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}