{"batchcomplete": "", "query": {"normalized": [{"to": "John Maeda", "from": "John_Maeda"}], "pages": {"12294725": {"extract": "John Maeda is an American executive, designer, technologist. His work explores the area where business, design, and technology merge. He is Global Head, Computational Design and Inclusion at Automattic.\nHe is formerly Design Partner at Kleiner Perkins Caufield & Byers (KPCB) where he advised startups on the business impact of design and continues as a Strategic Advisor. He also serves on the Board of Directors of consumer electronics company Sonos and global advertising firm Wieden+Kennedy. He was a Professor at the MIT Media Lab for 12 years, and then became the President of the Rhode Island School of Design (RISD) in 2008. In 2011, RISD faculty held a vote of no confidence in Maeda, and Maeda eventually resigned his position in 2013. He joined eBay Inc. as Chair of their Design Advisory Board after RISD and while at KPCB. \nMaeda was originally a software engineering student at the Massachusetts Institute of Technology, when he became fascinated with the work of Paul Rand and Muriel Cooper. Cooper was a director of MIT's Visible Language Workshop. After completing his bachelor's and master's degrees at MIT, Maeda studied in Japan at Tsukuba University's Institute of Art and Design to complete his Ph.D. in design.\nAs an artist, Maeda’s early work redefined the use of electronic media as a tool for expression by combining computer programming with traditional artistic technique, laying the groundwork for the interactive motion graphics that are taken for granted on the web today. He has exhibited in one-man shows in London, New York and Paris. His work is in the permanent collections of the Museum of Modern Art, the San Francisco Museum of Modern Art and the Cartier Foundation in Paris.\nAt RISD, Maeda led the movement to transform STEM (Science, Technology, Engineering, and Math) to STEAM by adding Art. He states:\n\nI believe art and design are poised to transform our economy in the 21st century like science and technology did in the last century\n\nIn 1999, he was named one of the 21 most important people in the 21st century by Esquire. In 2001, he received the National Design Award for Communication Design in the United States and Japan's Mainichi Design Prize.\nIn 2006, Maeda published Laws of Simplicity, his best-selling book to date, based on a research project to find ways for people to simplify their life in the face of growing complexity.\nIn 2009 he was inducted into the New York Art Director’s Club Hall of Fame, and he received the AIGA Medal in 2011. He is a trustee of the Cooper–Hewitt, National Design Museum.\nIn 2015 he published his first Design In Tech Report to connect the investing world with the world of design and technology. A 2nd Design in Tech report was published in 2016.\n\n\n== Bibliography ==\nRedesigning Leadership (Simplicity: Design, Technology, Business, Life), MIT Press, 2011\nThe Laws of Simplicity, MIT Press, 2006.\nCreative Code, Thames and Hudson, 2004.\nmaeda@media, Thames and Hudson / Rizzoli / Bangert Verlag, 2000.\nDesign By Numbers, MIT Press, 1999.\nTap, Type, Write, Digitalogue Co., 1998.\n12 o’clocks, Digitalogue Co., 1997.\nFlying Letters, Digitalogue Co., 1996.\nReactive Square, Digitalogue Co., 1995.\n\n\n== References ==\n\n\n== External links ==\nKleiner Perkins Caufield & Byers (KPCB) site\n2015 KPCB #DesignInTech Report site\nJohn Maeda at TED \n\"How art, technology and design inform creative leaders\" (TEDGlobal 2012)\n\"Designing for simplicity\" (TED2007)\n\nCreative Leadership blog\nThe Laws of Simplicity site\nMaedastudio site", "ns": 0, "pageid": 12294725, "title": "John Maeda"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}