{"batchcomplete": "", "query": {"normalized": [{"to": "John Howard Yoder", "from": "John_Howard_Yoder"}], "pages": {"1447986": {"extract": "John Howard Yoder (December 29, 1927 – December 30, 1997) was an American theologian and ethicist best known for his defense of Christian pacifism. His most influential book was The Politics of Jesus, which was first published in 1972. Yoder was Mennonite and wrote from an Anabaptist perspective. He spent the latter part of his career teaching at the University of Notre Dame.\nIn 1992 media reports emerged that Yoder had sexually abused women in preceding decades, with as many as over 50 complainants. The Anabaptist Mennonite Biblical Seminary acknowledged in a statement from 2014 that sexual abuse had taken place.\n\n\n== Life ==\nYoder earned his undergraduate degree from Goshen College where he studied under Mennonite theologian Harold S. Bender. He completed his Th.D. at the University of Basel, Switzerland, studying under Karl Barth, Oscar Cullman, Walther Eichrodt, and Karl Jaspers.\nAfter World War II, Yoder traveled to Europe to direct relief efforts for the Mennonite Central Committee. Yoder was instrumental in reviving European Mennonites following World War II. Upon returning to the United States, he spent a year working at his father's greenhouse business in Wooster, Ohio.\nYoder began his teaching career at Goshen Biblical Seminary. He was Professor of Theology at Goshen Biblical Seminary and Mennonite Biblical Seminary (the two seminaries that formed Anabaptist Mennonite Biblical Seminary) from 1958 to 1961 and from 1965 to 1984. While still teaching at Associated Mennonite Biblical Seminary, he also began teaching at the University of Notre Dame, where he became a Professor of Theology and eventually a Fellow of the Institute for International Peace Studies.\nYoder sexually abused over 100 women during the 1970s and 1980s while at Anabaptist Mennonite Biblical Seminary. The abuse was widely rumored but not acted upon even when board members became aware of the numerous accusations. The Elkhart Truth first reported on the allegations June 29, 1992. The seminary has acknowledged Yoder's crimes against women and has apologized for not acting on them at the time.\nYoder's personal papers are housed at the Mennonite Church USA Archives.\n\n\n== Thought ==\nYoder is best remembered for his work related to Christian ethics. Rejecting the assumption that human history is driven by coercive power, Yoder argued that it was rather God—working in, with, and through the nonviolent, non-resistant community of disciples of Jesus—who has been the ultimate force in human affairs. If the Christian church in the past made alliances with political rulers, it was because it had lost confidence in this truth.\nHe called the arrangement whereby the state and the church each supported the goals of the other Constantinianism, and he regarded this arrangement as a dangerous and constant temptation. He argued that the early Church was a subversive community, but later after the rise of Constantine the Great the Church came to desire power and political influence. Yoder called this the Constantinian shift. He further argued that Jesus himself rejected this temptation, even to the point of dying a horrible and cruel death. Resurrecting Jesus from the dead was, in this view, God's way of vindicating Christ's unwavering obedience.\nLikewise, Yoder argued, the primary responsibility of Christians is not to take over society and impose their convictions and values on people who don't share their faith, but to \"be the church.\" By refusing to return evil for evil, by living in peace, sharing goods, and doing deeds of charity as opportunities arise, the church witnesses, says Yoder, to the fact that an alternative to a society based on violence or the threat of violence has been made possible by the life, death, resurrection and teachings of Jesus. Yoder claims that the church thus lives in the conviction that God calls Christians to imitate the way of Christ in his absolute obedience, even if it leads to their deaths, for they, too, will finally be vindicated in resurrection.\nIn bringing traditional Mennonite convictions to the attention of a wider critical audience, Yoder reenergized stale theological debates over foundational Christian ecclesiological, Christological, and ethical beliefs. Yoder rejected Enlightenment presuppositions, epitomized by Kant, about the possibility of a universal, rational ethic. Abandoning the search for a universal ethic underlying Christian and non-Christian morality, as well as attempts to \"translate\" Christian convictions into a common moral parlance, he argued that what is expected of Christians, morally, need not be binding for all people. Yoder defended himself against charges of incoherence and hypocrisy by arguing for the legitimacy of moral double standards, and by pointing out that since world affairs are ultimately governed by God's providence, Christians are better off being the Church, than following compromised moral systems that try to reconcile biblical revelation with the necessities of governance.\n\n\n== The Politics of Jesus (1972) ==\nOf his many books, the most widely recognized has undoubtedly been The Politics of Jesus; it has been translated into at least ten languages. In it, Yoder argues against popular views of Jesus, particularly those views held by Reinhold Niebuhr, which he believed to be dominant in the day. Niebuhr argued for a Realist philosophy, which Yoder felt failed to take seriously the call or person of Jesus Christ. After showing what he believed to be inconsistencies of Niebuhr's perspective, Yoder attempted to demonstrate by an exegesis of the Gospel of Luke and parts of Paul's letter to the Romans that, in his view, a radical Christian pacifism was the most faithful approach for the disciple of Christ. Yoder argued that being Christian is a political standpoint, and Christians ought not ignore that calling.\nThe Politics of Jesus was ranked by evangelical publication Christianity Today as the 5th most important Christian book of the 20th century.\n\n\n== Uncovering as sexual predator ==\nAccording to articles in the Elkhart Truth, allegations that Yoder had sexually abused, harassed, and assaulted women circulated for decades and became known in wider Christian circles, but were never publicly acknowledged until 1992. After repeated institutional failures to address these abuses a group of victims threatened to engage in a public protest at a Bethel College (located in North Newton, Kansas) conference where Yoder was to be a speaker. The college President rescinded Yoder's invitation, the student newspaper reported the story, and one of the victims reported that Bethel was \"the first institution in the church that has taken this seriously\" (Mennonite Weekly Review, March 12, 1992). The Elkhart Truth articles detail extensive allegations of harassment of students and others.\nFrom the summer of 1992 to the summer of 1996, Yoder submitted to the discipline of the Indiana–Michigan Conference of the Mennonite Church for allegations of sexual misconduct. Yoder's writing in the unpublished 1995 book \"The Case for Punishment\" suggested he believed he was the innocent scapegoat of a conspiracy. Upon the conclusion of the process, the church urged Yoder \"to use his gifts of writing and teaching.\"\nDespite the allegations of abuse, Yoder's obituary in the New York Times did not mention any improprieties. Sixteen years after his death, in October 2013, the New York Times ran an article discussing the allegations, quoting one of the complainants Carolyn Heggen who claimed that more than 50 women \"said that Mr. Yoder had touched them or made advances.\" The article also discussed the recent formation of a support group for victims.\nMore recently, the Mennonite church and Christian peace theologians are actively trying to come to grips with the sexual abuse - and apparent institutional cover-up - which taints the legacy of John Howard Yoder. See in particular Rachel Waltner Goossen's article \"’Defanging the Beast’: Mennonite Responses to John Howard Yoder’s Sexual Abuse,” Mennonite Quarterly Review 89 (January), based on newly available documents and interviews with 29 individuals. Excerpts from this article were published in The Mennonite magazine under the title \"The failure to bind and loose: Responses to Yoder’s sexual abuse\" on January 2, 2015 at https://themennonite.org/feature/failure-bind-loose-responses-john-howard-yoders-sexual-abuse/.\nIn October 2014, the governing board of Anabaptist Mennonite Biblical Seminary released the following statement: \"With a desire to contribute to the larger church discernment process and to own the specific responsibility of the seminary, the AMBS board in their Oct. 23–25 meeting approved a statement acknowledging the pain suffered by women who were victimized by Yoder: As an AMBS Board, we lament the terrible abuse many women suffered from John Howard Yoder. We also lament that there has not been transparency about how the seminary’s leadership responded at that time or any institutional public acknowledgement of regret for what went so horribly wrong. We commit to an ongoing, transparent process of institutional accountability which the president along with the board chair initiated, including work with the historian who will provide a scholarly analysis of what transpired. We will respond more fully once the historical account is published. We also support the planning of an AMBS-based service of lament, acknowledgement and hope in March 2015.\" Seminary leaders held an AMBS-based gathering, including a Service of Lament, Confession, and Hope on the weekend of March 21–22, 2015.\nMost sobering were Yoder's excuses for his actions. Claiming to be practicing \"new forms of Christians intimacy\" Yoder used his understanding of the Gospel to defend his actions saying \"that the world—or uncomprehending skeptics in his own circles—will always misunderstand the revolutionary claims of the gospel.\"\n\n\n== Selected works ==\nThe Christian and Capital Punishment (1961)\nChrist and the Powers (translator) by Hendrik Berkhof (1962)\nThe Christian Pacifism of Karl Barth (1964)\nThe Christian Witness to the State (1964)\nDiscipleship as Political Responsibility (1964)\nReinhold Niebuhr and Christian Pacifism (1968)\nKarl Barth and the Problem of War (1970)\nThe Original Revolution: Essays on Christian Pacifism (1971)\nNevertheless: The Varieties and Shortcomings of Religious Pacifism (1971)\nThe Politics of Jesus (1972)\nThe Legacy of Michael Sattler, editor and translator (1973)\nThe Schleitheim Confession, editor and translator (1977)\nChristian Attitudes to War, Peace, and Revolution: A Companion to Bainton (1983)\nWhat Would You Do? A Serious Answer to a Standard Question (1983)\nGod's Revolution: The Witness of Eberhard Arnold, editor (1984)\nThe Priestly Kingdom: Social Ethics as Gospel (1984)\nWhen War Is Unjust: Being Honest In Just-War Thinking (1984)\nHe Came Preaching Peace (1985)\nThe Fullness of Christ: Paul's Revolutionary Vision of Universal Ministry (1987)\nThe Death Penalty Debate: Two Opposing Views of Capital Punishment (1991)\nA Declaration of Peace: In God's People the World's Renewal Has Begun (with Douglas Gwyn, George Hunsinger, and Eugene F. Roop) (1991)\nBody Politics: Five Practices of the Christian Community Before the Watching World (1991)\nThe Royal Priesthood: Essays Ecclesiological and Ecumenical (1994)\nAuthentic Transformation: A New Vision of Christ and Culture (with Glen Stassen and Diane Yeager) (1996)\nFor the Nations: Essays Evangelical and Public (1997)\nTo Hear the Word (2001)\nPreface to Theology: Christology and Theological Method (2002)\nKarl Barth and the Problem of War, and Other Essays on Barth (2003)\nThe Jewish-Christian Schism Revisited (2003)\nAnabaptism and Reformation in Switzerland: An Historical and Theological Analysis of the Dialogues Between Anabaptists and Reformers (2004)\nThe War of the Lamb: The Ethics of Nonviolence and Peacemaking (2009)\nChristian Attitudes to War, Peace and Revolution (2009)\nNonviolence: A Brief History—The Warsaw Lectures (2010)\n\n\n=== Articles and book chapters ===\n(1988) The Evangelical Round Table: The Sanctity of Life (Volume 3)\n(1991) Declaration on Peace: In God's People the World's Renewal Has Begun\n(1997) God's Revolution: Justice, Community, and the Coming Kingdom\n\n\n== See also ==\nList of peace activists\nAnabaptism\nChristian anarchism\nChristian pacifism\nLiberation theology\nMennonite Church\nNonresistance\nNonviolence\nPeace churches\nRadical Christianity\nYoder (surname)\n\n\n== Notes ==\n\n\n== External links ==\nThe Yoder Index. \"A searchable index of the writings of John Howard Yoder\" by John Nugent, Branson Parler, and Jason Vance.\nA simplified summary of John H. Yoder's book: The Politics of Jesus at the Wayback Machine (archived March 18, 2008) by Nathan Hobby with James Patton\nSteinfels, Peter (January 7, 1998). \"John H. Yoder, Theologian At Notre Dame, Is Dead at 70\". The New York Times. Retrieved February 5, 2010. \nRemembering John Howard Yoder, by Stanley Hauerwas, First Things\nMemorial Page on FindaGrave\nArticles and video of John Howard Yoder, New online articles and video of Yoder, by Jesus Radicals\nJohn H. Yoder Reading Room, Online texts by and on Yoder (Tyndale Seminary)\nJohn Howard Yoder Digital Collection, Primarily unpublished works by Yoder, (by Goshen College Mennonite Historical Library, Anabaptist Mennonite Biblical Seminary, and Mennonite Church USA Archives)", "ns": 0, "pageid": 1447986, "title": "John Howard Yoder"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}