{"batchcomplete": "", "query": {"normalized": [{"to": "John Hospers", "from": "John_Hospers"}], "pages": {"531463": {"extract": "John Hospers (June 9, 1918 – June 12, 2011) was an American philosopher and politician. In 1972 he became the first presidential candidate of the Libertarian Party, and was the only minor party candidate to receive an electoral vote in that year's U.S. Presidential election.\n\n\n== Education and career ==\nHospers was born on June 9, 1918 in Pella, Iowa, the son of Dena Helena (Verhey) and John De Gelder Hospers. Hospers graduated from Central College. Hospers earned advanced degrees from the University of Iowa and Columbia University. He conducted research, wrote, and taught in areas of philosophy, including aesthetics and ethics. He taught philosophy at Brooklyn College and at the University of Southern California, where for many years he was chairman of the philosophy department and professor emeritus.\nIn 2002, an hour-long video about Hospers' life, work, and philosophy was released by the Liberty Fund of Indianapolis, as part of its Classics of Liberty series.\n\n\n== Works ==\nHospers' books include:\nMeaning and Truth in the Arts (1946)\nIntroductory Readings in Aesthetics (1969)\nArtistic Expression (1971)\nLibertarianism – A Political Philosophy for Tomorrow (1971)\nUnderstanding the Arts (1982)\nLaw and the Market (1985)\nHuman Conduct (now in its 3rd edition, 1995)\nAn Introduction to Philosophical Analysis (now in the 4th edition, 1996)\nHospers was editor of three anthologies, and contributed to books edited by others. He wrote more than 100 articles in various scholarly and popular journals.\nHospers was editor of The Personalist (1968–1982) and The Monist (1982–1992), and was a senior editor at Liberty magazine.\n\n\n== Friendship with Ayn Rand ==\nDuring the period he taught philosophy at Brooklyn College, Hospers was very interested in Objectivism. He appeared on radio shows with Ayn Rand, and devoted considerable attention to her ideas in his ethics textbook Human Conduct.\nAccording to Rand's biographer, Barbara Branden, Hospers met Rand when she addressed the student body at Brooklyn College. They became friends, and had lengthy philosophical conversations. Rand's discussions with Hospers contributed to her decision to write nonfiction. Hospers read Atlas Shrugged (1957), which he considered an aesthetic triumph. Although Hospers became convinced of the validity of Rand's moral and political views, he disagreed with her about issues of epistemology, the subject of their extensive correspondence. Rand broke with Hospers after he criticized her talk on \"Art and Sense of Life\", before the American Society of Aesthetics at Harvard.\n\n\n== 1972 presidential candidacy ==\nIn the 1972 U.S. Presidential election, Hospers and Tonie Nathan were the first presidential and vice-presidential nominees, respectively, of the newly formed Libertarian Party. The Libertarian Party was poorly organized, and Hospers and Nathan managed to get on the ballot in only two states (Washington and Colorado), receiving 3,674 popular votes.\nHospers and Nathan received one electoral vote from faithless elector Roger MacBride, a Republican from Virginia, resulting in Nathan becoming the first woman to receive an electoral vote in a United States presidential election.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nJohnHospers.com\nAppearances on C-SPAN\nDr John Hospers at Find a Grave\nJohn Hospers at Goodreads", "ns": 0, "pageid": 531463, "title": "John Hospers"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}