{"batchcomplete": "", "query": {"normalized": [{"to": "John Venn", "from": "John_Venn"}], "pages": {"251482": {"extract": "John Venn, FRS, FSA, (4 August 1834 – 4 April 1923) was an English logician and philosopher noted for introducing the Venn diagram, used in the fields of set theory, probability, logic, statistics, and computer science.\n\n\n== Life and career ==\nJohn Venn was born on 4 August 1834 in Kingston upon Hull, Yorkshire to Martha Sykes and Rev. Henry Venn, who was the rector of the parish of Drypool. His mother died when he was three years old. Venn was descended from a long line of church evangelicals, including his grandfather John Venn.Venn was brought up in a very strict atmosphere at home. His father Henry had played a significant part in the Evangelical movement and he was also the secretary of the ‘Society for Missions to Africa and the East’.\nHe began his education in London joining Sir Roger Cholmeley's School, now known as Highgate School, with his brother Henry in September 1846. He moved on to Islington proprietary school and in October 1853 he went to Gonville and Caius College, Cambridge. In 1857, he obtained his degree in mathematics and became a fellow. In 1903 he was elected President of the College, a post he held until his death. He would follow his family vocation and become an Anglican priest, ordained in 1859, serving first at the church in Cheshunt, Hertfordshire, and later in Mortlake, Surrey.\nIn 1862, he returned to Cambridge as a lecturer in moral science, studying and teaching logic and probability theory, and, beginning around 1869, giving intercollegiate lectures. These duties led to his developing the diagram which would eventually bear his name.\n\nI began at once somewhat more steady work on the subjects and books which I should have to lecture on. I now first hit upon the diagrammatical device of representing propositions by inclusive and exclusive circles. Of course the device was not new then, but it was so obviously representative of the way in which any one, who approached the subject from the mathematical side, would attempt to visualise propositions, that it was forced upon me almost at once.\n\nIn 1868, he married Susanna Carnegie Edmonstone with whom he had one son, John Archibald Venn.\nIn 1883, he resigned from the clergy, having concluded that Anglicanism was incompatible with his philosophical beliefs. In that same year, Venn was elected a Fellow of the Royal Society and was awarded a Sc.D. by Cambridge.\nHe died on 4 April 1923.\n\n\n== Memorials ==\nVenn is commemorated at the University of Hull by the Venn Building, built in 1928\nA stained glass window in the dining hall of Gonville and Caius College, Cambridge, commemorates Venn's work.\nIn commemoration of the 180th anniversary of Venn's birth, on 4 August 2014, Google replaced its normal logo on global search pages with an interactive and animated Google doodle that incorporated the use of a Venn diagram.\nIn 1866, Venn published The Logic of Chance, a ground-breaking book which espoused the frequency theory of probability, offering that probability should be determined by how often something is forecast to occur as opposed to “educated” assumptions. Venn then further developed George Boole's theories in the 1881 work Symbolic Logic, where he highlighted what would become known as Venn diagrams.\n\n\n== Publications ==\nVenn compiled Alumni Cantabrigienses, a biographical register of former members of the University of Cambridge. This work is still being updated online, see #External links, below. His other works include:\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nA Cambridge Alumni Database\nThe Venn archives clarify the confusing timeline of the various Venns.\nObituary of John Venn (New York Times)\nPortrait of Venn by Charles Brock, and a link to a site about Venn\nAnother (clearer) view of the Venn stained glass window\nJohn Venn at Find a Grave", "ns": 0, "pageid": 251482, "title": "John Venn"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}