{"batchcomplete": "", "query": {"normalized": [{"to": "John Harsanyi", "from": "John_Harsanyi"}], "pages": {"442291": {"extract": "John Charles Harsanyi (Hungarian: Harsányi János Károly; May 29, 1920 – August 9, 2000) was a Hungarian-American economist and Nobel Memorial Prize in Economic Sciences winner.\nHe is best known for his contributions to the study of game theory and its application to economics, specifically for his developing the highly innovative analysis of games of incomplete information, so-called Bayesian games. He also made important contributions to the use of game theory and economic reasoning in political and moral philosophy (specifically utilitarian ethics) as well as contributing to the study of equilibrium selection. For his work, he was a co-recipient along with John Nash and Reinhard Selten of the 1994 Nobel Memorial Prize in Economics.\n\n\n== Early life ==\nHarsanyi was born on May 29, 1920 in Budapest, Hungary, the son of Alice (Gombos) and Charles Harsanyi, a pharmacy owner. His parents converted from Judaism to Catholicism a year before he was born. He attended high school at the Lutheran Gymnasium in Budapest. In high school, he became one of the best problem solvers of the KöMaL, the Mathematical and Physical Monthly for Secondary Schools. Founded in 1893, this periodical is generally credited with a large share of Hungarian students' success in mathematics. He also won the first prize in the Eötvös mathematics competition for high school students.\nAlthough he wanted to study mathematics and philosophy, his father sent him to France in 1939 to enroll in chemical engineering at the University of Lyon. However, because of the start of World War II, Harsanyi returned to Hungary to study pharmacology at the University of Budapest (today: Eötvös Loránd University), earning a diploma in 1944. As a pharmacology student, Harsanyi escaped conscription into the Hungarian Army which, as a person of Jewish descent, would have meant forced labor.\nHowever, in 1944 (after the fall of the Horthy regime and the seizure of power by the Arrow Cross Party) his military deferment was cancelled and he was compelled to join a forced labor unit on the Eastern Front. After seven months of forced labor, when the German authorities decided to deport his unit to a concentration camp in Austria, John Harsanyi managed to escape and found sanctuary for the rest of the war in a Jesuit house.\n\n\n== Postwar ==\nAfter the end of the war, Harsanyi returned to the University of Budapest for graduate studies in philosophy and sociology, earning his Ph.D. in both subjects in 1947. Then a devout Catholic, he simultaneously studied theology, also joining lay ranks of the Dominican Order. He later abandoned Catholicism, becoming an atheist for the rest of his life. Harsanyi spent the academic year 1947–1948 on the faculty of the Institute of Sociology of the University of Budapest, where he met Anne Klauber, his future wife. He was forced to resign the faculty because of openly expressing his anti-Marxist opinions, while Anne faced increasing peer pressure to leave him for the same reason.\nHarsanyi remained in Hungary for the following two years attempting to sell his family's pharmacy without losing it to the authorities. After it became apparent that the communist party would confiscate the pharmacy in 1950, he fled with Anne and her parents by illegally crossing the border with Austria and then going to Australia where Klauber's parents had some friends.\n\n\n== Australia ==\nThe two did not marry until they arrived in Australia because Klauber's immigration papers would need to be changed to reflect her married name. The two arrived with her parents on December 30, 1950 and they looked to marry immediately. Harsanyi and Klauber were married on January 2, 1951. Neither spoke much English and understood little of what they were told to say to each other. Harsanyi later explained to his new wife that she had promised to cook better food than she usually did.\nHarsanyi's Hungarian degrees were not recognized in Australia, but they earned him credit at the University of Sydney for a master's degree. Harsanyi worked in a factory during the day and studied economics in the evening at the University of Sydney, finishing with a M.A. in 1953. While studying in Sydney, he started publishing research papers in economic journals, including the Journal of Political Economy and the Review of Economic Studies. The degree allowed him to take a teaching position in 1954 at the University of Queensland in Brisbane. While in Brisbane, Harsanyi's wife became a fashion designer for a small factory.\n\n\n== Later years ==\nIn 1956, Harsanyi received a Rockefeller scholarship that enabled him and Anne to spend the next two years in the United States, at Stanford University and, for a semester, at the Cowles Foundation. At Stanford Harsanyi wrote a dissertation in game theory under the supervision of Kenneth Arrow, earning a second PhD in economics in 1959, while Anne earned an MA in psychology. Harsanyi's student visa expired in 1958 and the two returned to Australia.\nAfter working for a short time as a researcher at the Australian National University in Canberra, Harsanyi became frustrated with the lack of interest in game theory in Australia. With the help of Kenneth Arrow and James Tobin, he was able to move to the United States, taking a position as professor of economics at the Wayne State University in Detroit between 1961–1963. In 1964, he moved to Berkeley, California, he remained at the University of California, Berkeley until retiring in 1990. Shortly after arriving in Berkeley, he and Anne had a child, Tom. While teaching at Berkeley, John Harsanyi did extensive research in game theory. From 1966 to 1968, Harsanyi was part of a team of game theorists tasked with advising the United States Arms Control and Disarmament Agency in collaboration with Mathematica, a consulting group from Princeton University led by Harold Kuhn and Oskar Morgenstern.\nJohn Harsanyi died on August 9, 2000 from a heart attack in Berkeley, California, after he suffered from Alzheimer's disease.\n\n\n== Publications ==\nHarsanyi began researching utilitarian ethics while at the University of Queensland in Brisbane. He published two papers explaining that before understanding moral problems, the difference between people's personal preferences and their moral preferences must be distinguished.\nAfter Nash's publications on game theory, Harsanyi became increasingly interested in the topic.\nHarsanyi, John C. (October 1953). \"Cardinal utility in welfare economics and in the theory of risk-taking\". Journal of Political Economy. Chicago Journals. 61 (5): 434–435. doi:10.1086/257416. JSTOR 1827289.  Pdf.\nHarsanyi, John C. (August 1955). \"Cardinal welfare, individualistic ethics, and interpersonal comparisons of utility\". Journal of Political Economy. Chicago Journals. 63 (4): 309–321. doi:10.1086/257678. JSTOR 1827128.  Pdf.\nHarsanyi, John C. (March 1962). \"Bargaining in ignorance of the opponent's utility function\". Journal of Conflict Resolution. Sage. 6 (1): 29–38. doi:10.1177/002200276200600104. JSTOR 172875. \nHarsanyi, John C. (November 1967). \"Games with incomplete information played by \"Bayesian\" players, I-III. part I. The Basic Model\". Management Science, special issue: Theory Series. INFORMS. 14 (3): 159–182. doi:10.1287/mnsc.14.3.159. JSTOR 2628393. \nHarsanyi, John C. (1976). Essays on ethics, social behavior, and scientific explanation. Dordrecht, Holland Boston: D. Reidel Pub. Co. ISBN 9782266001656. \nHarsanyi, John C. (1977). Rational behavior and bargaining equilibrium in games and social situations. Cambridge England New York: Cambridge University Press. ISBN 9780521208864. \nHarsanyi, John C. (Winter 1977). \"Morality and the theory of rational behavior\". Social Research, special issue: Rationality, Choice, and Morality. The New School. 44 (4): 623–656. JSTOR 40971169. \n\nReprinted as: Harsanyi, John C. (1982), \"Morality and the theory of rational behaviour\", in Sen, Amartya; Williams, Bernard, Utilitarianism and beyond, Cambridge: Cambridge University Press, pp. 39–62, ISBN 9780511611964. \n\nHarsanyi, John C. (1982). Papers in game theory. Dordrecht, Holland Boston U.S.A. Hingham, Massachusetts: D. Reidel Pub. Co. Sold. ISBN 9789027713612. \nHarsanyi, John C.; Selten, Reinhard (1988). A general theory of equilibrium selection in games. Cambridge, Massachusetts: MIT Press. ISBN 9780262081733. \n\n\n== See also ==\nList of economists\nList of Jewish Nobel laureates\n\n\n== References ==\n\n\n== External links ==\nHarsanyi's autobiography from the Nobel website\nIDEAS/RePEc\nNews article remembering Harsanyi's life and career\nObituary in The Independent (London)\nJohn C. Harsanyi (1920–2000). The Concise Encyclopedia of Economics. Library of Economics and Liberty (2nd ed.). Liberty Fund. 2008.", "ns": 0, "pageid": 442291, "title": "John Harsanyi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}