{"batchcomplete": "", "query": {"normalized": [{"to": "John Hawthorne", "from": "John_Hawthorne"}], "pages": {"9596802": {"extract": "John Hawthorne is Professor of Philosophy at the University of Southern California. He is recognized as a leading contemporary contributor to metaphysics and epistemology.\nHis 2006 collection Metaphysical Essays offers original treatments of fundamental topics in philosophy, including identity, ontology, vagueness, and causation, which one reviewer called \"essential reading for anyone currently engaged in analytic metaphysics\". In his book Knowledge and Lotteries, Hawthorne defends a view in epistemology according to which the presence of knowledge is dependent on the subject's interests (he calls this view 'Subject-Sensitive Invariantism'). Unlike contextualism, Hawthorne's view does not require that the meaning of the word \"know\" changes from one context of ascription to another. His view is thus a variety of invariantism. However, whether a subject has knowledge depends to a surprising extent on features of the subject's context, including practical concerns. This position can be classed as a form of pragmatism. The American philosopher Jason Stanley holds a similar view.\nHawthorne has also written on philosophy of language and philosophical logic, philosophy of religion, philosophy of mind, and on Leibniz.\n\n\n== Education ==\nHawthorne earned his Ph.D. from Syracuse University, where he studied with William Alston and Jonathan F. Bennett. From 2006-2015, he was the Waynflete Professor of Metaphysical Philosophy at the University of Oxford. He has also taught at the University of New South Wales, Arizona State University, Syracuse University, Rutgers University, New Brunswick, and Princeton University.\n\n\n== Works ==\n\n\n=== Books ===\nThe Reference Book (with David Manley, Oxford University Press, 2012)\nRelativism and Monadic Truth (with Herman Cappelen, Oxford University Press 2010)\nMetaphysical Essays (Oxford University Press, 2006)\nKnowledge and Lotteries (Oxford University Press, 2004)\nSubstance and Individuation in Leibniz (with J. A. Cover, Cambridge University Press 2003)\nThe Grammar of Meaning: Normativity and Semantic Discourse (with Mark Norris Lance, Cambridge University Press, 1997)\n\n\n=== Edited books ===\nContemporary Debates in Metaphysics (edited with Theodore Sider and Dean Zimmerman, Blackwell, 2007)\nPerceptual Experience (edited with Tamar Gendler, Oxford University Press, 2006)\nConceivability and Possibility (edited with Tamar Gendler, Oxford University Press, 2002)\n\n\n== References ==\n\n\n== External links ==\nUniversity of Southern California Webpage\nWorks by or about John Hawthorne in libraries (WorldCat catalog)\nGoogle Scholar Page", "ns": 0, "pageid": 9596802, "title": "John Hawthorne"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}