{"batchcomplete": "", "query": {"normalized": [{"to": "John Etchemendy", "from": "John_Etchemendy"}], "pages": {"5503538": {"extract": "John W. Etchemendy (born 1952 in Reno, Nevada) is Stanford University's twelfth and current Provost. He succeeded John L. Hennessy to the post on September 1, 2000.\n\nJohn Etchemendy received his bachelor's and master's degrees at the University of Nevada, Reno before earning his PhD in philosophy at Stanford in 1982.\nHe has been a faculty member in Stanford's Department of Philosophy since 1983, prior to which he was a faculty member in the Philosophy Department at Princeton University. He is also a faculty member of Stanford's Symbolic Systems Program and a senior researcher at the Center for the Study of Language and Information at Stanford.\nEtchemendy's research interests include logic, semantics and the philosophy of language. He has challenged orthodox views on the central notions of truth, logical consequence and logical truth. His most well-known book, The Concept of Logical Consequence (1990, 1999), criticizes Alfred Tarski's widely accepted analysis of logical consequence. The Liar: An essay on truth and circularity (1987, 1992), co-authored with the late Jon Barwise, develops a formal account of the liar paradox modelled using a version of set theory incorporating the so-called Anti-Foundation Axiom.\nEtchemendy's recent work has focused on the role of diagrams and other nonlinguistic forms of representation in reasoning. His latest book, written with Jon Barwise and Dave Barker-Plummer, is Language, Proof and Logic (2000, 2006), a popular introductory logic textbook. He has also developed numerous pieces of instructional software, including Turing's World, Tarski's World, Fitch, and Hyperproof, software that allows computers to support the reasoning process.\nAt Stanford, Etchemendy served as director of the Center for the Study of Language and Information from 1990 to 1993, senior associate dean in the School of Humanities and Sciences from 1993 to 1997, and chair of the Department of Philosophy from 1998 to 2000.\nHe is a member of the American Philosophical Association, on the editorial boards of Synthese and Philosophia Mathematica, and a former editor of the Journal of Symbolic Logic. His wife is the writer Nancy Etchemendy and they have one son Max Etchemendy.\n\n\n== External links ==\nStanford Provost's office\nEtchemendy's Biography from Stanford", "ns": 0, "pageid": 5503538, "title": "John Etchemendy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}