{"batchcomplete": "", "query": {"normalized": [{"to": "John Anderson (philosopher)", "from": "John_Anderson_(philosopher)"}], "pages": {"23742928": {"extract": "John Anderson (1 November 1893 – 6 July 1962) was a Scottish-Australian philosopher who occupied the post of Challis Professor of Philosophy at Sydney University from 1927 to 1958. He founded the empirical brand of philosophy known as Australian realism (see Scottish realism).\nAnderson's promotion of 'free thought' in all subjects, including politics and morality, was controversial and brought him into constant conflict with the august senate of the university. However, he is credited with educating a generation of influential 'Andersonian' thinkers and activists—some of whom helped to place Sydney in the forefront of the 'sexual revolution' of the 1950s and 1960s.\nTo Anderson, an acceptable philosophy must have significant 'sweep' and be capable of challenging and moulding ideas in every aspect of intellect and society.\n\n\n== Early life ==\nAnderson was born in Stonehouse, Lanarkshire, Scotland and educated at the former Hamilton Academy from which school he won a bursary to attend the University of Glasgow in the university's Bursary Competition of 1911. Anderson was listed among notable former pupils of Hamilton Academy in a 1950 magazine article on the school. His elder brother was William Anderson, Professor of Philosophy at Auckland University College, 1921 to his death in 1955, and described as \"the most dominant figure in New Zealand philosophy.\"\nAnderson graduated MA from Glasgow University in 1917, with first-class honours in Philosophy (Logic and Moral Philosophy), and first-class honours in Mathematics and Natural Philosophy. After graduation, he was awarded the Ferguson Scholarship in Philosophy and the Shaw Philosophical Fellowship, the examinations for which were open to graduates of any of the four Scottish universities.\nHe served as Assistant in Philosophy at the University College, Cardiff (Cardiff) (1917–19), in Moral Philosophy and Logic in the University of Glasgow (1919–20) and lectured in Logic and Metaphysics at the University of Edinburgh (1920–26).\n\n\n== Social theory ==\nAfter arriving in Sydney in 1927 he associated with the Communist Party of Australia and contributed to their journals, sometimes under a nom de plume but, by about 1932 he began to believe that communism under Joseph Stalin in the Soviet Union was a dictatorship with no room for workers' control or participation. He then became aligned with the Trotskyist movement for a period of time. But \"[h]e could not put up any longer with dialectical materialism or with the servile state which he saw was being imposed by the doctrine of the dictatorship of the proletariat\".\nAnderson later abandoned authoritarian forms of socialism and became what would today be called a libertarian and pluralist—an opponent of all forms of authoritarianism. Sometimes he described himself as an anarchist but, after the 1930s, he gave up his earlier political utopianism.\n\n\n== Advocacy of academic freedom ==\nAs Sydney University's Challis Professor of Philosophy, Anderson was a formidable champion of the principle of academic freedom from authoritarian intervention. For example, he fought a successful battle to end the role of the British Medical Association in setting course standards and student quotas in the medical school. He also railed against the presence on campus of a military unit—the Sydney University Regiment—and lived to see the day in 1960 when the regiment's campus HQ was destroyed by fire. (The regiment was subsequently rehoused at a new facility on university-owned land at Darlington.)\nAnderson was censured by the Sydney University Senate in 1931 after criticising the role of war memorials in sanctifying war. In 1943 he was censured by the Parliament of New South Wales after arguing that religion has no place in schools. He founded the Sydney University Free Thought Society which ran from 1931 to 1951. He was president of the society throughout that period.\nIt is legendary that the university's Senate, accepting that it could not realise its desire to sack the controversial Challis Professor, sought to reduce Anderson's stature and influence by creating a new chair of \"Moral and Political Philosophy\" to which Alan Stout was appointed. This purpose was not achieved, as Anderson continued to lecture on ethics and politics. Stout (who had been urged by Anderson to apply for the position) was a steady admirer and supporter of the Challis Professor and declined to undercut his prestige in any way. The result was that Sydney gained a second prestigious and personable philosopher who \"brought a quick intelligence, intellectual grasp, a flair for putting things simply and clearly, together with a genuine respect for the views of others and readiness to appreciate their point of view\". On Anderson's retirement, the two departments were merged under Stout as 'the Professor of Philosophy'.\n\n\n== Thought and influence ==\nAs a committed empiricist, Anderson argued that there is only one realm of \"being\" and it can be best understood through science and naturalistic philosophy. He asserted that there is no supernatural god and that there are no non-natural realms along the lines of Platonic ideals. He rejected all notions that knowledge could be obtained by means other than descriptions of facts and any belief that revelation or mysticism could be sources for obtaining truth. He was arguing that traditional Christian concepts of good and evil were only meant for slaves and that, in actuality, the idea of morality was empty. For Anderson, the term \"good\" was valid when applied objectively to human activities which were free, critical and creative but the more common subjective applications were to be avoided or exposed as deceptive. Not surprisingly, Anderson's influence was both extensive and controversial as he constantly examined and fearlessly criticised hallowed beliefs and institutions.\n\nHe is, arguably, the most important philosopher who has worked in Australia. Certainly he was the most important in both the breadth and depth of influence. Among the philosophers who got their original intellectual formation from Anderson are John Passmore, John Mackie, A.J. ('Jim') Baker, David Stove and myself. There are lots more. But for every student who became a philosopher there were far, far, more in the law, in medicine, in journalism, in other academic disciplines, that were profoundly influenced by him. I am inclined to think that, especially in the thirties and forties of the last century, Anderson was the person who set the agenda, and set the tone, for intellectual discussion in Sydney. – David Armstrong (2005)\n\nAnderson's influence has spread through his personal impact on several generations of students, the \"Andersonians\", who include the philosophers named above, together with Hedley Bull and Eugene Kamenka; the World War II organiser Alf Conlon, many members of the Sydney Push, Tonga's 'I. Futa Helu, and jurist John Kerr, later to be Australia's best-remembered governor-general.\n\n\n== Free Thought Society and the Sydney Libertarians ==\nAnderson's insistence on unceasing inquiry and criticism became central to the intellectual principles of the university's Libertarian Society which supplanted the Free Thought Society in the early 1950s and provided a philosophic platform for the much broader subculture known as \"the Push\" throughout the 1960s. He was a defender of free speech and was critical of the Australian government's bans on certain political publications (1928). He advocated religious and sexual freedoms and free discussion of issues in an era when mention of taboo subjects commonly resulted in angry public condemnation by prominent moralists.\nAfter the Second World War, however, Anderson began exhibiting more conservative views. Jim Baker interprets this latter stage not so much as \"a definite change in his overall thinking than ... an alteration of emphasis and interest\". In other words, according to Baker, while Anderson's political positions changed over time his philosophy remained constant. To many, however, it seemed that Anderson was departing from his pluralism. During the 1949 coal miners' strike, for instance, he supported the government's action in using troops as strikebreakers. At a Free Thought Society meeting in August 1950 he refused to oppose conscription for the war in Korea. In 1951 he refused to allow students to use the Free Thought Society to canvass the 'No' case for Menzies' attempt to ban the Communist Party in the referendum of that year. This was the last straw for many Freethinkers; Anderson's apparent authoritarianism caused most to abandon the Free Thought Society and to establish the Libertarian Society. (It must be pointed out that Anderson did not support the banning of the Communist Party—in fact he attacked the proposal.) The Free Thought Society held its last meeting in 1951. The Libertarian Society functioned from 1952 to 1969.\nAnderson broke off contact with the former disciples who formed the Libertarian Society and never associated with \"Push\" people who routinely sang his praises along with the bawdy songs he had imported to his new country. However, even after retirement in 1958 and to the brink of his death in 1962, he was seen daily in his study, continuing his work and reviewing earlier work. Among his last publications were Classicism (1960), Empiricism and Logic (1962) and Relational Arguments (1962)\n\n\n== References ==\n\n\n== Further reading ==\nJ. Anderson (Introduction by D. Armstrong), Space, Time and the Categories: Lectures on Metaphysics 1949–50 (Sydney University Press, 2007) (ISBN 978-1-920898-62-5) Details.\nJ. Anderson, Regular contributions to The Australasian Journal of Psychology and Philosophy\nJ. Anderson, Studies in Empirical Philosophy (Sydney: Angus and Robertson, 1962) [1] (ISBN 1-920898-17-4)\nJ. Anderson, Religion in Education in \"Religion in Education – Five Addresses Delivered Before the New Education Fellowship (N.S.W.)\". The New Education Fellowship, Sydney, 1943.\nJanet Anderson, Graham Cullum, Kimon Lycos (eds.), Art and Reality: John Anderson on Literature and Aesthetics (Sydney: Hale and Iremonger, 1982)\nA. J. Baker, Anderson's Social Philosophy: The Social Thought and Political Life of Professor John Anderson (Sydney: Angus & Robertson, 1979)\nA. J. Baker, Australian Realism: The Systematic Philosophy of John Anderson (Cambridge University Press, 1986)\nA. Barcan, Radical Students: The Old Left at Sydney University (Carlton South, Vic.: Melbourne University Press, 2002) review\nJ. Franklin, Corrupting the Youth: A History of Philosophy in Australia (Macleay Press, 2003), chs 1–2\nB. Kennedy, A Passion to Oppose: John Anderson, Philosopher (Carlton South, Vic.: Melbourne University Press, 1995)\nMark Weblin (ed.), A Perilous and Fighting Life: From Communist to Conservative: The Political Writings of Professor John Anderson (North Melbourne: Pluto Press, 2003)\n\n\n== External links ==\nJohn Anderson Archive, University of Sydney\nJohn Anderson Studies in Empirical Philosophy Sydney University Press, 1962\nProfessor John Anderson 1893–1962, Lecture Notes and Other Writings University of Sydney, Australian Studies Resources\nABC Radio National transcript Philosopher's Zone, 8 September 2007\nABC Radio National transcript Philosopher's Zone, 1 November 2008\nABC Radio National audio Late Night Live, originally 19 February 2004\nClive James on John Anderson (The Monthly, July 2005)\nW. M. O'Neill Anderson, John (1893–1962) Biography at Australian Dictionary of Biography, 1979", "ns": 0, "pageid": 23742928, "title": "John Anderson (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}