{"batchcomplete": "", "query": {"normalized": [{"to": "John Arthur (philosopher)", "from": "John_Arthur_(philosopher)"}], "pages": {"32071706": {"extract": "John Arthur (September 22, 1946 – January 22, 2007) was an American professor of philosophy and an expert in legal theory, constitutional theory, social ethics, and political philosophy. He taught at the State University of New York at Binghamton for 18 years.\n\n\n== Early life and education ==\nJohn Arthur, son of L. James Arthur and Elizabeth Gleason Arthur, grew up in Denver, Colorado. Arthur earned his bachelor's degree in philosophy and history at Cornell College and his master's degree in political sociology and PhD in philosophy at Vanderbilt University.\n\n\n== Academic career ==\nIn total, John Arthur spent time teaching at five colleges and universities, including Brandeis University, Harvard University, Tennessee State University, the College of Charleston and Lake Forest College.\nFrom 1981–1988 Arthur taught at Tennessee State University. Finding the segregated conditions at TSU to be in violation of the Equal Protection Clause of the United States Constitution, he organized a biracial group to file suit against the State of Tennessee. The resulting settlement included a desegregation plan for the entire post-secondary education system of Tennessee and brought in millions of dollars to improve Tennessee State University. In 1989, soon after leaving Tennessee State University, Arthur published his first book, The Unfinished Constitution: Philosophy and Constitutional Practice. Arthur served as a fellow in law and philosophy at Harvard Law School from 1986–1988.\nIn 1988, Arthur became a professor of philosophy at Binghamton University, where he worked for 18 years. He created an interdisciplinary academic major for Binghamton undergraduate students called the \"Program in Philosophy, Politics, and Law\", of which Arthur was the director. He received the University and Chancellor’s Awards for Excellence in Teaching in 1992. In 1995, Arthur served as a research fellow at the University of St Andrews' Centre for Philosophy and Public Affairs, and from 2002–2003 he was a fellow in law and philosophy at the University of Oxford.\n\n\n== Personal life ==\nIn 1990, John Arthur married consumer protection lawyer Amy Shapiro in Denver, Colorado. Arthur's previous marriage had ended in divorce.\nJohn Arthur died in hospice care at Lourdes Hospital in Binghamton, New York on the morning of January 22 after a year-long battle with lung cancer. He was buried in Denver, Colorado and was survived by his wife.\n\n\n== Works ==\nJohn Arthur wrote three books, the last of which was published posthumously.\nArthur, John (1989). The unfinished constitution: philosophy and constitutional practice. Belmont, Calif: Wadsworth Pub. Co. ISBN 9780534100148. \nArthur, John (1995). Words that bind: judicial review and the grounds of modern constitutional theory. Boulder: Westview Press. ISBN 9780813323497. \nArthur, John (2007). Race, equality, and the burdens of history. Cambridge, UK New York: Cambridge University Press. ISBN 9780521704953. \nArthur also co-edited and co-authored several books, including:\nArthur, John; Scalet, Steven P (2009). Morality and moral controversies: readings in moral, social, and political philosophy. Upper Saddle River, N.J: Pearson Prentice Hall. ISBN 9780136031376. \nArthur, John; Shaw, William H (2010). Readings in the philosophy of law. Upper Saddle River, N.J: Pearson Prentice Hall. ISBN 9780205708093. \n\n\n== References ==\n\n\n== External links ==\nProgram in Philosophy, Politics, and Law at Binghamton University", "ns": 0, "pageid": 32071706, "title": "John Arthur (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}