{"batchcomplete": "", "query": {"normalized": [{"to": "John Peters Humphrey", "from": "John_Peters_Humphrey"}], "pages": {"224317": {"extract": "John Peters Humphrey, OC (April 30, 1905 – March 14, 1995) was a Canadian legal scholar, jurist, and human rights advocate. He is most famous as the author of the first draft of the Universal Declaration on Human Rights.\n\n\n== Childhood, education and academic career ==\nHumphrey was born to Frank Humphrey and Nellie Peter on April 30, 1905, in Hampton, New Brunswick. His childhood was touched by tragedy as he lost both his parents to cancer and he also lost one of his arms in an accident whilst playing with fire. Humphrey attended a boarding school where he endured teasing from other students; it is claimed that this was influential in building his character and compassion.\nJohn Humphrey applied to Mount Allison University at age 15 from the Rothesay Collegiate School and was accepted. He transferred to McGill University and lived with his sister Ruth who was a teacher in Montreal. Humphrey graduated from McGill in 1925 where he was awarded a Bachelor of Commerce degree from the School of Commerce, part of the Desautels Faculty of Management. He promptly enrolled in a Bachelor of Arts and Bachelor of Law at McGill, graduating in 1927 and 1929 respectively. Upon graduation, Humphrey was awarded a fellowship to study in Paris, sailing from Montreal on the RMS Aurania. He met fellow passenger Jeanne Godreau while onboard and they were married in Paris shortly after arriving.\nHumphrey returned to Montreal after the fellowship to practice law for five years before accepting a teaching position as a professor at McGill; he also enrolled in a Master of Law program, specializing in international law. During the 1930s Humphrey was considered a renaissance man with the majority of his interests in education, the arts and humanitiess. While teaching at McGill in the early 1940s, Humphrey met Henri Laugier, a refugee from France who was working on behalf of the Free French. In1943, Laugier moved to Algeria to teach at the University of Algiers and later became the Assistant Secretary-General of the United Nations.\nWhile at McGill University, John Peters Humphrey founded the McGill Debating Union, one of the world's most successful and prominent debate societies.\n\n\n== Universal Declaration of Human Rights ==\nIn 1946, Assistant Secretary-General to the United Nations, Henri Laugier, appointed John Peters Humphrey as the first Director of the United Nations Division of Human Rights, within the United Nations Secretariat.\nHumphrey was a principal drafter of the Universal Declaration of Human Rights. After consulting with the executive group of the Commission, chaired by Eleanor Roosevelt, Professor Humphrey prepared the first preliminary draft of what was to become the Universal Declaration of Human Rights. On the night of December 10, 1948, the General Assembly unanimously adopted the Declaration, dubbed by Mrs. Eleanor Roosevelt as \"the international Magna Carta of all humankind.\"\n\n\n== Career in the United Nations ==\nHumphrey remained with the UN for 20 years. During this period, the oversaw the implementation of 67 international conventions and the constitutions of dozens of countries. He worked in areas including the freedom of the press, status of women, and racial discrimination. In 1988, on the 40th anniversary of the Declaration, the UN Human Rights award was bestowed on Professor Humphrey.\nIn 1963, he proposed the idea of a United Nations High Commissioner for Human Rights. While the idea was initially received quite positively, it was only after more than thirty years, under Secretary-General Dr. Boutros Boutros-Ghali, that the office became a reality.\n\n\n== Later life ==\nHumphrey retired from the UN in 1966 to resume his teaching career at McGill University. He remained active in the promotion of human rights in Canada and internationally for the rest of his life.\nHe served as a director of the International League for Human Rights; served as a member of the Royal Commission on the Status of Women; a member of the team that launched Amnesty International's chapter in Canada; and, with colleagues from McGill University, was instrumental in creating the Canadian Human Rights Foundation, now renamed Equitas. He took part in a number of international commissions of inquiry, including a mission to the Philippines investigating human rights violations under Ferdinand Marcos and the International Commission of Inquiry into the 1932-33 Famine in Ukraine. At the UN he sought compensation for Korean women forced to act as sex slaves. He also campaigned with the War Amps for reparations for Canadian prisoners of war under Japanese captivity.\nIn 1974, he spoke in opposition of Bill 22, the Quebec Language Law. He testified on July 19, 1974 that English was also an official language in the province, despite the proposed law. Together with Frank R. Scott, Irwin Cotler and four other McGill professors, he said:\n\nSection 1, which provides that French is 'the official language of the province of Quebec,' is misleading in that it suggests that English is not also an official language in Quebec, which it is by virtue of Section 133 of the BNA Act and the federal Official Languages Act. ... No legislation in the National Assembly proclaiming French the sole official language in the province can affect these bilingual areas protected by the BNA Act.\n\nTwo years after the death of his wife Jeanne in 1979, Humphrey married Montreal physician Margaret Kunstler, herself a widow. John Peters Humphrey died on March 14, 1995, at the age of 89 in Montreal.\n\n\n== Honours and recognition ==\nAmong his many honors, Professor Humphrey was made an Officer of the Order of Canada in 1974, \"in recognition of his contributions to legal scholarship and his world-wide reputation in the field of human rights\". In 1985 he was made an Officer of the Ordre nationale du Québec.\nThe John Peters Humphrey Model United Nations is held in his honour every May in Fredericton, New Brunswick..\nSince 1988, the McGill University Faculty of Law has held the John P. Humphrey Lectureship in Human Rights, an annual lecture on the role of international law and organizations in the worldwide protection of human rights.\nIn September 1998, Nelson Mandela unveiled a commemorative plaque to Humphrey at the Human Rights Monument, Ottawa, as part of Canada's tribute on the sixtieth anniversary of the Declaration.\nThe John Humphrey Freedom Award, presented by the Canadian human rights group Rights & Democracy, is awarded each year to organizations and individuals around the world for exceptional achievement in the promotion of human rights and democratic development.\nIn June 2008, a memorial to Dr. Humphrey was unveiled in his hometown of Hampton, New Brunswick. The memorial, located just a few hundred yards from his childhood home, consists of a UN-style wooden bench with a young and old Humphrey seated. Several brass doves sit on the end of the bench, which sits beside two tall stone plinths, one of which has several articles from the Universal Declaration of Human Rights carved into it in English, French and Maliseet. The memorial sits on the front lawn of the County Court House in the center of the town.\n\n\n== Bibliography ==\nHumphrey, John Peters, Human Rights and the United Nations: A Great Adventure (New York: Transnational Publishers, 1984) (autobiography)\n\n\n== See also ==\nList of civil rights leaders\n\n\n== References ==\n\n\n== Sources ==\nOn the Edge of Greatness: the Diaries of John Humphrey, First Director of the United Nations Division of Human Rights, 4 volumes. Edited by A.J. Hobbins and published as Fontanus Monographs 4, 9, 12 and 13. Montreal, McGill-Queen's University Press. 1995-2001. ISBN 0-7735-1458-9, ISBN 0-7735-1456-2, ISBN 0-7735-1454-6, ISBN 0-7735-1383-3.\nHobbins, A.J. and Steward, A. “Humphrey and the quest for compensation: Individual claims against States and the creation of new international law.” Canadian Yearbook of International Law, 2003. XLI (2004). pp. 187–223.\nHobbins, A.J. “Humphrey and the High Commissioner: the Genesis of the Office of the UN High Commissioner for Human Rights.” Journal of the History of International Law. III (2001), pp. 38–74\nHobbins, A.J. “Mentor and Protégé: Percy Corbett’s relationship with John Peters Humphrey.” Canadian Yearbook of International Law, 1999. XXXVII (2000), pp. 3–56.\nHobbins, A.J. \"René Cassin and the Daughter of Time: the First Draft of the Universal Declaration of Human Rights\". Fontanus II (1989) pp. 7 26.\nHobbins, A.J. and Boyer, D. “Seeking Historical Truth: the International Commission of Inquiry into the 1932-33 Famine in Ukraine. Dalhousie Law Journal. XXIV (2002), pp. 139-191\nKing, J and Hobbins, A.J.. “Hammarskjöld and Human Rights: the Deflation of the UN Human Rights Programme, 1953-1961.” Journal of the History of International Law. V (2003), pp. 337–386.\n\n\n== External links ==\nCanadian Encyclopedia - John Peters Humphrey\nHistorica Video Minutes - John Humphrey\nHistorica Radio Minutes - John Humphrey", "ns": 0, "pageid": 224317, "title": "John Peters Humphrey"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}