{"batchcomplete": "", "query": {"normalized": [{"to": "John Burnheim", "from": "John_Burnheim"}], "pages": {"386402": {"extract": "John Burnheim (born in 1927 in Sydney, Australia) is a former professor of General Philosophy at the University of Sydney, Australia.\nIn his book Is Democracy Possible? The alternative to electoral politics (1985) Burnheim used the term \"demarchy\" (created by Friedrich Hayek in his Law, Legislation and Liberty) to describe a political system without the state or bureaucracies, and based instead on randomly selected groups of decision makers. This has striking resemblances to classical democratic ideas, as reported by Thucydides. In 2006 Burnheim published a second edition with a new preface in which he directed the reader to an emphasis that \"a polity organised by negotiation between specialised authorities would work much better than one based on centralised authority\".\nDemarchy as Burnheim conceives it has two features that distinguish it from other proposals for selection by lot in politics.\nFirst, an insistence on putting distinct policy areas under mutually independent authorities which would settle problems of coordination between them by negotiation or arbitration rather than by dictation from above. The point of this is to remedy the defect of existing democracies in which issues are settled according to the power strategies of politicians rather than the merits of the case.\nSecond that the committee in charge of each policy body should be statistically representative of those who are most substantially affected by their decisions. The hope is that this would lead to better decisions, not just the wishful thinking of populist spin.\nBurnheim used to be a Roman Catholic priest and, from 1958-1968, was rector of St John's, the Catholic college attached to the university. He was a major figure in the disturbances of the 1970s that split the university's Department of Philosophy.\n\n\n== References ==\n\nFranklin, J. (2003), Corrupting the Youth: A History of Philosophy in Australia, Macleay Press, ch. 11\n\n\n== External links ==\nBurnheim J \"To reason why: from religion to philosophy and beyond\" Sydney 2011\nBurnheim J Is democracy possible? The alternative to electoral politics 2nd edition (2006) Sydney University Text and Imaging Service (SETIS)\nBurnheim J \"Is Democracy Possible?\" 3rd edition (2014) Kindle\nWorks by or about John Burnheim in libraries (WorldCat catalog)", "ns": 0, "pageid": 386402, "title": "John Burnheim"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}