{"batchcomplete": "", "query": {"normalized": [{"to": "John Oswald (activist)", "from": "John_Oswald_(activist)"}], "pages": {"3731936": {"extract": "John Oswald (c. 1760/1730 – 14 September 1793) was a Scottish philosopher, writer, poet, social critic and revolutionary.\n\n\n== Early life ==\nLittle is known for certain regarding Oswald's early life. He was born between 1755 and 1760 in Edinburgh. His father is said to have been a coffee-house-keeper, or a goldsmith. He became a student goldsmith himself. It is said that Oswald learned Latin and Greek without a tutor, and later learned Arabic.\n\n\n== Oswald in India ==\n\nOswald served in the British Army as a Lieutenant of the Royal Highland Regiment, the forty-second regiment of foot. He served as a recruiting officer in Scotland during the American Revolution, and then in 1780 to the Malabar Coast of India. Oswald's exposure to Hindu vegetarianism in India influenced his philosophy which he describes in The Cry of Nature or An Appeal to Mercy and Justice on Behalf of the Persecuted Animals, published in 1791. This is considered an important work of western vegetarianism.\n\n\n== Return to Britain ==\nOswald could no longer continue as an army officer. He left the army and returned to Britain in 1783, and began a period as an author of poetry and social criticism, and editor of The British Mercury, a periodical publication. During this period, Oswald wrote a sharp polemic in favour of republicanism, Review of the Constitution of Great Britain, and an anti-religious leaflet Ranae Comicae Evangelizantes: or the Comic Frogs turned Methodist, in which he supported atheism.\n\n\n== Oswald in France ==\nWith the outbreak of the French Revolution of 1789, Oswald travelled to Paris, and soon joined the Jacobin Club. In that body, he pressed for more energetic intervention by the Jacobins in British affairs, arguing that a revolution in England was essential for peace between the two nations. An address to a Manchester radical organization was sent by the Jacobins on Oswald's urgings. According to some reports, Oswald was sent to Ireland to offer French support for an Irish rebellion, but little appeared to come of this effort.\nIn March 1792, Oswald called for the universal arming of the masses, and began organizing a small army of sans-culottes in Paris known as the First Battalion of Pikers. With the outbreak of monarchist counter-revolution in La Vendée, the First Battalion proceeded against the insurgents. Oswald died in the battle of Ponts-de-Cee on 14 September 1793.\n\n\n== The Cry of Nature ==\nJohn Oswald, like his contemporary Rousseau, argued that modern society was in conflict with man's nature. Oswald argued in The Cry of Nature or an Appeal to Mercy and Justice on Behalf of the Persecuted Animals, that man is naturally equipped with feelings of mercy and compassion.  If each man had to personally experience the death of the animals he ate, so argued Oswald, a vegetarian diet would be far more common. The division of labour, however, allows modern man to eat flesh without experiencing the prompting of man's natural sensitivities, while the brutalization of modern man made him inured to these sensitivities. Although Oswald gave compassion a central place in his philosophy, and was a vegetarian, he was not a pacifist, as evidenced by the fact that he died fighting in the French Revolution.\n\n\n== Works by John Oswald ==\nReview of the Constitution of Great Britain, London 1784 (3rd ed.), Paris 1792\nRanae Comicae Evangelizantes: or the Comic Frogs turned Methodist (as Sylvester Otway), 1786\nThe Alarming Progress of French Politics, 1787\nEuphrosyne or an Ode to Beauty, London, 1788\nPoems, to which is added \"The Humors of John Bull\" an Operatic Farce, London 1789 (published under the pseudonym Sylvester Otway)\nThe Cry of Nature, or An Appeal To Mercy and Justice On Behalf of the Persecuted Animals, 1791. Online at AnimalRightsHistory.org. Reprinted Edwin Mellen Pr, 2000, edited by Jason C. Hribal, ISBN 0-7734-7668-7.\n(French) La Tactique du Peuple, Paris, 179?\n(French) Le Gouvernement du Peuple, ou Plan de constitution pour la République universelle, Paris, 1793. (Dutch) De Volksregering, Of Oprichtingsplan Voor De Universele Republiek Dutch language translation by Roger Jacobs, February 2003. Both online at (Dutch) Athene: Webtijdschrift voor directe democratie (Athene: Web illustrated magazine for direct democracy), Dutch web magazine.\nThe British Mercury, editor.\n\n\n== Writings about John Oswald ==\nCommerce des lumières : John Oswald and the British in Paris, 1790–1793 / David V. Erdman. ISBN 0-8262-0607-7\nT. F. Henderson, ‘Oswald, John (c.1760–1793)’, rev. Ralph A. Manogue, Oxford Dictionary of National Biography, Oxford University Press, 2004; online edn, May 2006, accessed 11 April 2007\n\n\n== Notes ==", "ns": 0, "pageid": 3731936, "title": "John Oswald (activist)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}