{"batchcomplete": "", "query": {"normalized": [{"to": "Jonathan Wolff (philosopher)", "from": "Jonathan_Wolff_(philosopher)"}], "pages": {"2985096": {"extract": "Jonathan Wolff (born 25 June 1959) is a British philosopher and academic. He is Professor of Philosophy and Dean of the Faculty of Arts and Humanities at University College London.\n\n\n== Life and Career ==\nWolff was born on 25 June 1959 to Herbert Wolff and Doris Wolff (née Polakoff). He earned his MPhil from UCL under the direction of G.A. Cohen in 1985. Apart from one year as a Harkness Fellow at Harvard University, he has taught at UCL ever since. As of September 1, 2016, he will take up the Blavatnik Chair in Public Policy in the Blavatnik School of Government at Oxford University.\nHe was formerly the secretary of the British Philosophical Association and has been Editor and then honorary secretary of the Aristotelian Society, which publishes Proceedings of the Aristotelian Society. Recently, Wolff's work has specialized in disadvantage and equality and public policy decision making.\nAs a scholar on the topic of Marxism, Wolff published \"Marx and Exploitation\", an article about Marxist thinking, in The Journal of Ethics. He also co-edited (with Michael Rosen) Political Thought (ISBN 0-19-289278-9), an introductionary reader on political philosophy.\nHe has also published a critique of Robert Nozick's Anarchy, State, and Utopia called Robert Nozick: Property, Justice and the Minimal State, a short book on Karl Marx, Why Read Marx Today?, and An Introduction to Political Philosophy. He currently writes a monthly column for The Guardian and occasionally blogs at Brian Leiter's \"Leiter Reports\" blog.\nJonathan Wolff presented a 4-part series about the UK's National Health Service for the BBC's Radio 3 programme 'The Essay' during the week of 27 July 2009. The series, entitled \"Doctoring Philosophy\", marked the 60th anniversary of the NHS and commenced by studying the philosophical background which led to the foundation of the service and the changing definitions of sickness and health. It went on to explore entitlement, issues of equality of service, and issues of priorities in a world of universal access.\nHe is currently a member of the Nuffield Council on Bioethics. He has been a member of two of the Council’s Working Parties; on the ethics of animal research, and the ethics of personalised healthcare\n\n\n== Bibliography ==\nBooks\nRobert Nozick: Property, Justice and the Minimal State. Oxford: Polity in association with Basil Blackwell. 1991. ISBN 978-0-7456-0603-3. \nAn Introduction to Political Philosophy, Third Edition. Oxford Oxfordshire: Oxford University Press. 2015. ISBN 9780199658015. \nMichael Rosen (1999). Political Thought. Oxford Oxfordshire: Oxford University Press. ISBN 0-19-289278-9. \nWhy Read Marx Today?. Oxford Oxfordshire: Oxford University Press. 2002. ISBN 978-0-19-280335-1. \nDisadvantage, co authored with Avner de Shalit. New York: Oxford University Press, USA. 2007. ISBN 978-0-19-927826-8. \nEthics and Public Policy: A Philosophical Inquiry. Abingdon: Routledge. 2011. ISBN 9780415668538. \nThe Human Right to Health. New York: W. W. Norton & Company, USA. 2012. ISBN 978-0-393-07900-5. \nJournal articles\nWolff, Jonathan (December 2003). \"Scanlon on well-being\". Ratio. Wiley. 16 (4): 332–345. doi:10.1046/j.1467-9329.2003.00227.x. \n\nSee also: Scanlon, T.M. (December 2003). \"Replies\". Ratio. Wiley. 16 (4): 424–439. doi:10.1046/j.1467-9329.2003.00231.x. \n\n\n== References ==\n\n\n== External links ==\nWolff's website at UCL\n\"Four Forms of Redistribution\" by Jonathan Wolff\n\"A Comment on Professor Wolff's 'Four Forms of Redistribution'\" by Tony Flood'", "ns": 0, "pageid": 2985096, "title": "Jonathan Wolff (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}