{"batchcomplete": "", "query": {"normalized": [{"to": "Jonathan Dancy", "from": "Jonathan_Dancy"}], "pages": {"7780773": {"extract": "Jonathan Peter Dancy (born 8 May 1946) is a British philosopher, who has worked on epistemology, ethics, and philosophy of action. He is currently Research Professor at the University of Reading and Professor of Philosophy at University of Texas at Austin.\n\n\n== Career ==\nDancy was educated at Winchester College, where he was Head Boy and played cricket for the school, and Corpus Christi College, Oxford, where he obtained a double first in classics (1965-7:Classical Honour Moderations: First Class Honours; 1967-9: Literae Humaniores: First Class Honours, BA).\nAfter graduating he served as a lecturer at Pembroke College, Oxford for a year. In 1971 he became a lecturer at Keele University, becoming professor there in 1991.\nAfter being mentioned by his daughter-in-law, American actress Claire Danes, during an appearance on The Late Late Show with Craig Ferguson, Dancy appeared as a guest on the program on 1 April 2010.\nHe was elected a Fellow of the British Academy in 2016.\n\n\n== Philosophical Work ==\nAfter having worked on problems of epistemology, and more particularly on the nature of perception (argument from illusion), he emerged as the leading proponent in ethics of moral particularism, the idea that all moral reasons are particular and context-sensitive, rather than general. He also defends what he calls the holism of reasons, namely the idea that a consideration that is a reason for acting in a certain way in one case may not be a reason for acting in that way, or even a reason for not acting in that way, in other cases. In this sense, reasons are context-dependent. Dancy argues that the holism of reasons provides a major support for the main claim of his particularism, i.e., that there are no moral principles but that morality can get on perfectly well without them. Dancy edited some of George Berkeley writings and dedicated a book to the Anglo-Irish thinker.\n\n\n== Personal life ==\nIn 1973 he married Sarah Birley; they have three children the actor Hugh Dancy, husband of actress Claire Danes; Jack Dancy who runs a travel company and Kate Redman who works for UNESCO.\n\n\n== Works ==\n\n\n=== Articles ===\n\"On Moral Properties\", Mind, 1981, XC, pp. 367–385.\n“Ethical Particularism and Morally Relevant Properties.” Mind, n.s.; 92, 368 (Oct., 1983): 530 – 547.\n“The Role of Imaginary Cases in Ethics.” Pacific Philosophical Quarterly, 66 (1985): 141 – 153.\n“An Ethic of Prima Facie Duties.” In A Companion to Ethics, ed. Peter Singer. Oxford: Blackwell Publishing, 1991. 219 – 229.\n“Can a Particularist Learn the Difference Between Right and Wrong?” In The Proceedings of the Twentieth World Congress of Philosophy, vol. 1, ed. K. Brinkmann. Bowling Green, OH: Philosophy Documentation Center, 1999. 59 – 72.\n\"Intention and permissibility: Jonathan Dancy\". Aristotelian Society, Supplementary Volume. 74 (1): 319–338. July 2000. doi:10.1111/1467-8349.00074. \n\nSee also: Scanlon, T.M. (July 2000). \"Intention and permissibility: T. M. Scanlon\". Aristotelian Society, Supplementary Volume. 74 (1): 301–317. doi:10.1111/1467-8349.00073.  Pdf.\n\n“The Particularist’s Progress.” In Moral Particularism, ed. Brad Hooker and Margaret Olivia Little. Oxford: Clarendon Press, 2000. 130 – 156.\n\"Moral Particularism\" in the Stanford Online Encyclopedia of Philosophy\n\n\n=== Books (author) ===\nAn Introduction to Contemporary Epistemology, Oxford: Blackwell, 1985.\nBerkeley: An Introduction, Oxford: Blackwell, 1987.\nMoral Reasons, Oxford: Blackwell Publishing, 1993.\nPractical Reality, Oxford: Oxford University Press, 2000.\nEthics Without Principles. Oxford: Clarendon Press, 2004.\n\n\n=== Books (editor) ===\nPerceptual Knowledge, Oxford: OUP, 1988.\nReading Parfit, Oxford : Blackwell,1997.\nNormativity (Ratio conference 1998) Oxford : Blackwell, 2000.\n\n\n== References ==\n\n\n== External links ==\nJonathan Dancy’s homepage\n\"Moral Particularism\" – J. Dancy's art. in Stanford Encyclopedia of Philosophy\nPublications list", "ns": 0, "pageid": 7780773, "title": "Jonathan Dancy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}