{"batchcomplete": "", "query": {"normalized": [{"to": "Joseph Diaz Gergonne", "from": "Joseph_Diaz_Gergonne"}], "pages": {"3431943": {"extract": "Joseph Diaz Gergonne (19 June 1771 at Nancy, France – 4 May 1859 at Montpellier, France) was a French mathematician and logician.\n\n\n== Life ==\nIn 1791, Gergonne enlisted in the French army as a captain. That army was undergoing rapid expansion because the French government feared a foreign invasion intended to undo the French Revolution and restore Louis XVI to the throne of France. He saw action in the major battle of Valmy on 20 September 1792. He then returned to civilian life but soon was called up again and took part in the French invasion of Spain in 1794.\nIn 1795, Gergonne and his regiment were sent to Nîmes. At this point, he made a definitive transition to civilian life by taking up the chair of \"transcendental mathematics\" at the new École centrale. He came under the influence of Gaspard Monge, the Director of the new École polytechnique in Paris.\nIn 1810, in response to difficulties he encountered in trying to publish his work, Gergonne founded his own mathematics journal, officially named the Annales de mathématiques pures et appliquées but generally referred to as the Annales de Gergonne. The most common subject of articles in his journal was geometry, Gergonne's specialty. Over a period of 22 years, the Annales de Gergonne published about 200 articles by Gergonne himself, and other articles by many distinguished mathematicians, including Poncelet, Servois, Bobillier, Steiner, Plücker, Chasles, Brianchon, Dupin, Lamé, even Galois.\nGergonne was appointed to the chair of astronomy at the University of Montpellier in 1816. In 1830, he was appointed Rector of the University of Montpellier, at which time he ceased publishing his journal. He retired in 1844.\n\n\n== Work ==\nGergonne was among the first mathematicians to employ the word polar. In a series of papers beginning in 1810, he contributed to elaborating the principle of duality in projective geometry, by noticing that every theorem in the plane connecting points and lines corresponds to another theorem in which points and lines are interchanged, provided that the theorem embodied no metrical notions. Gergonne was an early proponent of the techniques of analytical geometry and in 1816, he devised an elegant coordinate solution to the classical problem of Apollonius: to find a circle which touches three given circles, thus demonstrating the power of the new methods.\nIn 1813, Gergonne wrote the prize-winning essay for the Bordeaux Academy, Methods of synthesis and analysis in mathematics, unpublished to this day and known only via a summary. The essay is very revealing of Gergonne's philosophical ideas. He called for the abandonment of the words analysis and synthesis, claiming they lacked clear meanings. Surprisingly for a geometer, he suggested that algebra is more important than geometry at a time when algebra consisted almost entirely of the elementary algebra of the real field. He predicted that one day quasi-mechanical methods would be used to discover new results.\nIn 1815, Gergonne wrote the first paper on the optimal design of experiments for polynomial regression. According to S. M. Stigler, Gergonne is the pioneer of optimal design as well as response surface methodology.\nHe published his \"Essai sur la théorie des définitions\" (An essay on the theory of definition) in his Annales in 1818. This essay is generally credited for first recognizing and naming the construct of implicit definition.\n\n\n== Quote ==\n\"It is not possible to feel satisfied at having said the last word about some theory as long as it cannot be explained in a few words to any passer-by encountered in the street.\"\n\n\n== Notes ==\n\n\n== References ==\nGergonne, J. D. (November 1974) [1815]. \"The application of the method of least squares to the interpolation of sequences\". Historia Mathematica (Translated by Ralph St. John and S. M. Stigler from the 1815 French ed.). 1 (4): 439–447. doi:10.1016/0315-0860(74)90034-2. \nStigler, Stephen M. (November 1974). \"Gergonne's 1815 paper on the design and analysis of polynomial regression experiments\". Historia Mathematica. 1 (4): 431–439. doi:10.1016/0315-0860(74)90033-0. \n\n\n== External links ==\nBiography in the MacTutor History of Mathematics archive: Joseph Gergonne.", "ns": 0, "pageid": 3431943, "title": "Joseph Diaz Gergonne"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}