{"batchcomplete": "", "query": {"normalized": [{"to": "Joseph Fletcher", "from": "Joseph_Fletcher"}], "pages": {"329486": {"extract": "Joseph Francis Fletcher (April 10, 1905 in Newark, New Jersey - October 28, 1991 in Charlottesville, Virginia) was an American professor who founded the theory of situational ethics in the 1960s, and was a pioneer in the field of bioethics. Fletcher was a leading academic proponent of the potential benefits of abortion, infanticide, euthanasia, eugenics, and cloning. Ordained as an Episcopal priest, he later identified himself as an atheist.\n\n\n== Life ==\nFletcher was a prolific academic, teaching, participating in symposia, and completing ten books, and hundreds of articles, book reviews, and translations. He taught Christian Ethics at Episcopal Divinity School, Cambridge, Massachusetts, and at Harvard Divinity School from 1944 to 1970. He was the first professor of medical ethics at the University of Virginia and co-founded the Program in Biology and Society there. He retired from teaching in 1977.\nIn 1974, the American Humanist Association named him Humanist of the Year. He was one of the signers of the Humanist Manifesto.\nHe served as president of the Euthanasia Society of America (later renamed the Society for the Right to Die) from 1974 to 1976. He was also a member of the American Eugenics Society and the Association for Voluntary Sterilization.\n\n\n== Quotes ==\n\"We need to educate people to the idea that the quality of life is more important than mere length of life. Our cultural tradition holds that life has absolute value, but that is really not good enough anymore. Sometimes, no life is better.\"\n\"Ethics critically examines values and how they are to be acted out; but whether they are acted out or not, loyalty to them depends on character or personal quality, and so it follows that the quality of medicine depends on the character of its clinicians.\"\n\"We ought to love people and use things; the essence of immorality is to love things and use people.\"\n\"People [with children with Down's syndrome]... have no reason to feel guilty about putting a Down's syndrome baby away, whether it's \"put away\" in the sense of hidden in a sanitarium or in a more responsible lethal sense. It is sad; yes. Dreadful. But it carries no guilt. True guilt arises only from an offense against a person, and a Down's is not a person.\"\n\n\n== Notes ==\n\n\n== References ==\n\"Memoir of an Ex-Radical,\" Joseph Francis Fletcher Papers (20: 29).\n\"Recollections,\" Joseph Francis Fletcher Papers (20: 31).\nJoseph Francis Fletcher Papers, The Claude Moore Health Sciences Library, Department of Historical Collections and Services, University of Virginia.\n\n\n== Notable works ==\n1954 Morals and Medicine N.J.: Princeton University Press. (on euthanasia)\n1966 Situation Ethics: The New Morality, Philadelphia: Westminster Press. (translated into 5 languages)\n1974 The Ethics of Genetic Control: Ending Reproductive Roulette. New York: Doubleday. (on eugenic cloning)\n\n\n== External links ==\nBibliography", "ns": 0, "pageid": 329486, "title": "Joseph Fletcher"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}