{"batchcomplete": "", "query": {"normalized": [{"to": "Joseph Fins", "from": "Joseph_Fins"}], "pages": {"2490422": {"extract": "Joseph J. Fins, M.A.C.P. (born 1959) is an American physician and medical ethicist. He is chief of the Division of Medical Ethics at New York Presbyterian Hospital and Weill Cornell Medical College, where he serves as The E. William Davis, Jr., M.D. Professor of Medical Ethics, and Professor of Medicine, Professor of Public Health, and Professor of Medicine in Psychiatry. Fins is also Director of Medical Ethics and an attending physician at New York Presbyterian Hospital-Weill Cornell Medical Center. Fins is also a member of the adjunct faculty of Rockefeller University and has served as Associate for Medicine at The Hastings Center. He was appointed by President Bill Clinton to The White House Commission on Complementary and Alternative Medicine Policy and currently serves on The New York State Task Force on Life and the Law by gubernatorial appointment.\nIn October 2010, Fins was elected a member of the Institute of Medicine (IOM) of the United States National Academies. In 2012, he was elected a Fellow of the American Academy of Arts and Sciences. In December 2013 he was elected an Academico de Honor de la Real Academia Nacional de Medicina de Espana (Honored Academic of the Royal Academy of Medicine of Spain).\nFins' scholarship in medical ethics and health policy has focused on palliative care, rational approaches to ethical dilemmas and the development of \"clinical pragmatism\" as a method of moral problem-solving drawing upon the American pragmatic tradition of William James and John Dewey. His more recent work has been in neuroethics and disorders of consciousness following severe brain injury. He was a co-author of the landmark Nature paper describing the first use of deep brain stimulation in the minimally conscious state.\nFins has been a visiting professor in Medical Ethics at The Complutense University in Madrid and Philipps University in Marburg, Germany. He is a recipient of a Soros Open Society Institute Project on Death in America Faculty Scholars Award, a Woodrow Wilson National Fellowship Foundation Visiting Fellowship and a Robert Wood Johnson Foundation Investigator Award in Health Policy Research.\nFins received a B.A. (College of Letters with Honors) from Wesleyan University in 1982 and an M.D. from Cornell University Medical College in 1986. After an internship at the Payne Whitney Psychiatric Clinic, he completed his internal medicine residency training and fellowship in general internal medicine at The New York Hospital-Cornell Medical Center. He is the author of A Palliative Ethic of Care: Clinical Wisdom at Life's End published by Jones and Bartlett (2006) and Rights Come to Mind: Brain Injury, Ethics, and the Struggle for Consciousness published by Cambridge University Press (2015).\nA board certified internist, Fins has served as a governor of the American College of Physicians and vice chair of the College's Committee on Professionalism and Human Rights. He is a recipient of the College's Laureate Award and is a Master (MACP) of the College.\nHe has served on the boards of the American Society of Bioethics and Humanities, the Fund for Modern Courts and Wesleyan University, where he is now a trustee emeritus. He is also a member of the Governing Board of the International Neuroethics Society. Fins also served as a member of New York’s Attorney General’s Commission on Quality Care at the End of Life and sits on a number of editorial boards, including the Journal of Pain and Symptom Management, The Cambridge Quarterly of Healthcare Ethics, The Oncologist, BioMed Central Medical Ethics, \"Neuroethics\" and the Basic Bioethics Series of MIT Press.\nIn October 2009, Fins was elected president of the American Society of Bioethics and Humanities. He served his two-year term from 2011 to 2013. He is a member of the Hastings Center Board of Trustees and chair of its Fellow's Council.\n\n\n== References ==", "ns": 0, "pageid": 2490422, "title": "Joseph Fins"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}