{"batchcomplete": "", "query": {"normalized": [{"to": "Joseph Raz", "from": "Joseph_Raz"}], "pages": {"2424356": {"extract": "Joseph Raz (Hebrew: יוסף רז‎‎; born 21 March 1939) is an Israeli legal, moral and political philosopher. He is one of the most prominent advocates of legal positivism and is well known for his conception of perfectionist liberalism. Raz spent most of his career as a professor of philosophy of law at the University of Oxford associated with Balliol College, but is now a professor of law at Columbia University Law School and a part-time professor at King's College London.\n\n\n== Life and Career ==\nBorn in Mandate Palestine in 1939, Joseph Raz graduated in 1963 from the Hebrew University of Jerusalem with a Magister Juris (summa cum laude). Later, with funds provided by the Hebrew University, Raz pursued a Doctor of Philosophy at the University of Oxford under the supervision of H. L. A. Hart. Raz had met Hart earlier at a conference in Israel, impressing him by pointing out a flaw in his reasoning that had previously eluded him; Hart encouraged him to go to Oxford for further study. Raz studied at Balliol College and completed his DPhil in 1967.\nHe then returned to Israel to teach at the Hebrew University as a lecturer in the Faculty of Law and Department of Philosophy. In 1971, he was tenured and promoted to Senior Lecturer. In 1972, he returned to Balliol as a Fellow and Tutor in Law, becoming a Professor of Philosophy of Law, Oxford University, from 1985 to 2006, and then a Research Professor from 2006 to 2009. Since 2002 he has also been a Professor in the Law School at Columbia University, New York. Raz, now retired from Oxford, is currently also a visiting professor of law at King's College London.\n\n\n== Philosophical Work ==\nA pupil of H. L. A. Hart, Raz has been important in continuing the development of legal positivism both before and since Hart's death. Raz was also co-editor of a second edition of Hart's The Concept of Law with a postscript including Hart's responses to other philosophers' criticisms of his work.\nRaz's first book, The Concept of a Legal System, was based on his doctoral thesis. A later book, The Morality of Freedom won two prizes: the 1987 W.J.M. Mackenzie Book Prize from the Political Studies Association of the United Kingdom, awarded to the best book in political science each calendar year; and the 1988 Elaine and David Spitz Book Prize from the Conference for the Study of Political Thought, New York, awarded annually for the best book in liberal and/or democratic theory that had been published two years earlier. The book develops a conception of perfectionist liberalism.\nRaz has argued for a distinctive understanding of legal commands as exclusionary reasons for action and for the \"service conception\" of authority, according to which those subject to an authority \"can benefit by its decisions only if they can establish their existence and content in ways which do not depend on raising the very same issues which the authority is there to settle.\" This, in turn, supports Raz's argument for legal positivism, in particular \"the sources thesis,\" \"the idea that an adequate test for the existence and content of law must be based only on social facts, and not on moral arguments.\".\nRaz is acknowledged by his contemporaries as being one of the most important living legal philosophers. He has authored and edited eleven books to date, namely The Concept of a Legal System (1970), Practical Reason and Norms (1975), The Authority of Law (1979), The Morality of Freedom (1986), Authority (1990), Ethics in the Public Domain (1994), Engaging Reason (1999), Value, Respect and Attachment (2001), The Practice of Value (2003), Between Authority and Interpretation (2009), and From Normativity to Responsibility (2011). His most recent work deals less with legal theory and more with political philosophy and practical reasoning. In moral theory, Raz defends value pluralism and the idea that various values are incommensurable.\nRaz's work has been cited by the Supreme Court of Canada in such cases as Imperial Tobacco v. British Columbia and Sauvé v. Canada (Chief Electoral Officer).\nSeveral of Raz's students have become important legal and moral philosophers, including the three current Professors in Jurisprudence at Oxford, John Gardner, Leslie Green, and Timothy Endicott.\n\n\n== Honours and awards ==\nRaz has held visiting appointments at several universities, and has also served on a number of editorial boards for the publication of journals and books. He was elected a Fellow of the British Academy in 1987 and of the American Academy of Arts & Sciences in 1992. He has been awarded Honorary Doctorates by the Catholic University of Brussels, 1993, and by King's College London, 2009. In 2005 he received the International Prize for Legal Research 'Hector Fix-Zamudio' from the National Autonomous University of Mexico, and in 2009 a Vice-Presidency Award from the Law Society of University College Dublin.\nIn 2000–2001, he gave the Tanner Lectures on Human Values on \"The Practice of Value\" at the University of California Berkeley.\n\n\n== Publications ==\nBooks\nThe Concept of a Legal System (1970; 2nd ed., 1980)\nPractical Reason and Norms (1975; 2nd ed., 1990)\nThe Authority of Law (1979; 2nd ed., 2009)\nThe Morality of Freedom (1986)\nEthics in the Public Domain (1994; rev. pbk. ed., 1995)\nEngaging Reason (1999)\nValue, Respect and Attachment (2001)\nThe Practice of Value (2003)\nBetween Authority and Interpretation (2009)\nFrom Normativity to Responsibility (2011)\nJournal articles\nRaz, Joseph (December 2003). \"Numbers, with and without contractualism\". Ratio. Wiley. 16 (4): 346–367. doi:10.1046/j.1467-9329.2003.00228.x. \n\nSee also: Scanlon, T.M. (December 2003). \"Replies\". Ratio. Wiley. 16 (4): 424–439. doi:10.1046/j.1467-9329.2003.00231.x. \n\n\n== See also ==\nPhilosophy of law\n\n\n== Notes ==\n\n\n== References ==\n\"Symposium: The Works of Joseph Raz\". Southern California Law Review. 62 (3): 731–1235. 1988–89.  Including a response by Raz.\nLukas H. Meyer et al. (eds.), Rights, Culture and the Law: Themes from the Legal and Political Philosophy of Joseph Raz, Oxford: Oxford University Press, 2003.\nR. Jay Wallace et al. (eds.), Reason and Value: Themes from the Moral Philosophy of Joseph Raz, Oxford: Clarendon Press, 2004.\n\n\n== External links ==\nPage at Oxford University\nPage at Columbia University\nPage at King's College London\nPersonal page\nA summary of Raz on the right to euthanasia\nA blog summary of Raz's argument for the sources thesis, part one\nA blog summary of Raz's argument for the sources thesis, part two", "ns": 0, "pageid": 2424356, "title": "Joseph Raz"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}