{"batchcomplete": "", "query": {"normalized": [{"to": "Joshua Cohen (philosopher)", "from": "Joshua_Cohen_(philosopher)"}], "pages": {"8320911": {"extract": "Joshua Cohen (born 1951) is an American philosopher specializing in political philosophy. He has taught at Stanford University and Massachusetts Institute of Technology and is currently a member of the faculty at Apple University.\n\n\n== Education and Career ==\nCohen earned B.A. and M.A. degrees in philosophy from Yale University in 1973, and earned his Ph.D. at Harvard University under the direction of John Rawls 1979. He taught at MIT from 1979 until 2007, when he moved to Stanford University. At Stanford, he was Marta Sutton Weeks Professor of Ethics in Society (2008–2014) and professor of political science, philosophy, and law (2006–2014) At Stanford, Cohen was also one of the program leaders (along with Larry Diamond and Terry Winograd) for the Program on Liberation Technologies at Stanford's Freeman Spogli Institute for International Studies. Cohen became part of the faculty of Apple University in 2011, joining full-time on October 15, 2014 and resigning from Stanford. He also spends one day a week running a law and philosophy workshop series at the University of California, Berkeley.\nHe has published articles and book in political philosophy, including deliberative democracy, and global justice, as well as such topics as freedom of expression, electoral finance, and new models of democratic governance. His 2012 Comte Lectures at the London School of Economics discussed the issues he teaches about: mobile for development and human-centered design.\nCohen has been editor of Boston Review since 1991 (co-editor with Deb Chasman since 2002), and co-editor of many short anthologies based on articles first published in the magazine. He also frequently takes part in video discussions with other media personalities, for the site BloggingHeads.tv.\n\n\n== Books ==\nCohen, Joshua; Rogers, Joel (1983). On democracy. Middlesex, England: Penguin Books. \nCohen, Joshua; Rogers, Joel (1986). Inequity and intervention: The Federal Budget and Central America. Boston: South End Press. \nCohen, Joshua; Rogers, Joel (1986). Rules of the game. Boston: South End Press. \nCohen, Joshua; Rogers, Joel (1995). Associations and democracy. The Real Utopias Project. London: Verso Books. ISBN 1859849288.  with Paul Q. Hirst, Claus Offe, Jane Mansbridge, Andrew Szasz, Andrew Levine, Philippe C. Schmitte, Wolfgang Streeck, Ira Katznelson, Ellen M. Immergut, Iris Marion Young, and Heinz Klug.\nCohen, Joshua; Rogers, Joel (1999). The new inequality. Boston: Beacon Press. \nCohen, Joshua; Okin, Susan Moller; Nussbaum, Martha; Howard, Matthew (1999). Is multiculturalism bad for women?. Princeton, New Jersey: Princeton University Press. ISBN 9780691004327.  Originally an essay (pdf).\nCohen, Joshua; Shanley, Mary Lyndon; Chasman, Deborah (2004). Just marriage. Oxford UK New York: Oxford University Press. ISBN 9780195176261. \nCohen, Joshua (2009). Philosophy, politics, democracy: Selected papers. Cambridge: Harvard University Press. \nCohen, Joshua (2010). The arc of the moral universe and other papers. Cambridge: Harvard University Press. \nCohen, Joshua (2011). Rousseau: A free community of equals. New York: Oxford University Press. \n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\n\"Joshua Cohen. Political Science\". Stanford University. Emeriti section of the website. Archived from the original on January 12, 2015. Retrieved January 12, 2015. \nVideo debates featuring Cohen on Bloggingheads.tv\nJoshua Cohen on Citizens United on YouTube 2011 Dewey Lecture at University of Chicago\nJoshua Cohen Playlist Appearance on WMBR's Dinnertime Sampler radio show April 2, 2003\nJoshua Cohen's 2012 Comte Lectures On mobile-for-development and human-centered design.", "ns": 0, "pageid": 8320911, "title": "Joshua Cohen (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}