{"batchcomplete": "", "query": {"normalized": [{"to": "Juan Luis Vives", "from": "Juan_Luis_Vives"}], "pages": {"314917": {"extract": "Juan Luis Vives (Latin: Ioannes Lodovicus Vives; Catalan: Joan Lluís Vives i March; Dutch: Jan Ludovicus Vives; 6 March 1493 – 6 May 1540) was a Valencian scholar and humanist who spent most of his adult life in the Southern Netherlands. His beliefs on the soul, insight into early medical practice, and perspective on emotions, memory and learning earned him the title of the \"father\" of modern psychology.  Vives was the first to shed light on some key ideas that established how we perceive psychology today.\n\n\n== Early life ==\nVives was born in Valencia to a family which had converted from Judaism to Christianity. As a child, he saw his father, grandmother and great-grandfather, as well as members of their wider family, executed as Judaizers at the behest of the Spanish Inquisition; his mother was acquitted but died of the plague when he was 15 years old. Shortly thereafter, he left Spain never to return.\nWhile still in Spain, he attended the Valencia Academy, where he was taught by Jerome Amiguetus and Daniel Siso. The school was dominated by scholasticism, with the dialectic and disputation playing a central role in the delivery of education.\n\nEven the youngest scholars are accustomed never to keep silence; they are always asserting vigorously whatever comes uppermost to their minds, lest they should seem to be giving up the dispute. Nor does one disputation, or even two a day prove sufficient, as for instance at dinner. They wrangle at breakfast; they wrangle after breakfast; they wrangle before supper and they wrangle after supper. At home they dispute, out of doors they dispute. They wrangle over their food, in the bath, in the sweating room, in the church, in the town, in the country, in public, in private. At all times they are wrangling.\n\n\n== Academic career ==\nVives studied at the University of Paris from 1509 to 1512, and in 1519 was appointed professor of humanities at the University of Leuven. At the insistence of his friend Erasmus, he prepared an elaborate commentary on Augustine's De Civitate Dei, which was published in 1522 with a dedication to Henry VIII of England. Soon afterwards, he was invited to England, and acted as tutor to the Princess Mary, for whose use he wrote De ratione studii puerilis epistolae duae (1523) and, ostensibly, De Institutione Feminae Christianae, on the education of girls (a book he dedicated to the English queen Catherine of Aragon).\nWhile in England, he resided at Corpus Christi College, Oxford, where Erasmus had strong ties. Vives was made doctor of laws and lectured on philosophy. Having declared himself against the annulment of the marriage of Henry VIII and Catherine of Aragon, he lost royal favour and was confined to his house for six weeks. On his release, he withdrew to Bruges, where he devoted the rest of his life to the composition of numerous works, chiefly directed against the scholastic philosophy and the preponderant unquestioning authority of Aristotle. The most important of his treatises is the De Causis Corruptarum Artium, which has been ranked with Bacon's Organon.\nHis most important pedagogic work are Introductio ad sapientiam (1524); De disciplinis, which stressed the urgent importance of more rational programs of education and studying; De prima philosophia; and the Exercitatio linguae latinae, which is a Latin textbook consisting of a series of brilliant dialogues. His philosophical works include De anima et vita (1538), De veritate fidei Christianae; and \"De Subventione Pauperum Sive de Humanis Necessitatibus\" (On Assistance To The Poor) (1526), the first tract of its kind in the Western world to treat the problem of urban poverty and propose concrete suggestions for a policy of social legislation. Vives detected through philological analysis that the supposed author of the so-called Letter of Aristeas, purporting to describe the Biblical translation of the Septuagint, could not have been a Greek but must have been a Jew who lived after the events he described had transpired.\nHe died in Bruges in 1540, at the age of 47, and was buried in the St. Donatian's Cathedral.\n\n\n== State assistance for those in poverty ==\nDuring the Middle Ages, poor relief was usually the responsibility of the Church and individuals through almsgiving. As society became more advanced, these efforts became inadequate. In 1525, the Dutch city of Bruges requested Vives to suggest means to address the issue of relief for the poor. He set out his views in his essay De Subventione Pauperum Sive de Humanis Necessitatibus (On Assistance To The Poor). Vives argued that the state had a responsibility to provide some level of financial relief for the poor, as well as craft training for the unskilled poor. The city of Bruges did not implement Vives's suggestions until 1557, but his proposals influenced social relief legislation enacted in England and the German Empire during the 1530s.\n\n\n== Contemporary relevance ==\nVives imagined and described a comprehensive theory of education. He may have directly influenced the essays of Michel Eyquem de Montaigne. He was admired by Thomas More and Erasmus, who wrote that Vives \"will overshadow the name of Erasmus.\"\nVives is considered the first scholar to analyze the psyche directly. He did extensive interviews with people, and noted the relation between their exhibition of affect and the particular words they used and the issues they were discussing. While it is unknown if Freud was familiar with Vives's work, historian of psychiatry Gregory Zilboorg considered Vives a godfather of psychoanalysis. (A History of Medical Psychology, 1941) and the father of modern psychology by Foster Watson (1915.)\n\nVives taught monarchs. His idea of a diverse and concrete children's education long preceded Jean Jacques Rousseau, and may have indirectly influenced Rousseau through Montaigne.\nHowever influential he may have been in the 16th century, Vives now attracts minimal interest beyond specialized academic fields. The values of Vives inspired two Belgian Schools for higher education (KATHO and Katholieke Hogeschool Brugge-Oostende) to choose the name ‘Vives’ as the name for their cooperation/merger starting from September 2013. Also, the regional link of Vives with the province of West Flanders (Bruges is the capital of this province) played a role.\n\n\n=== Gender Roles and Responsibilities ===\nSome see Vives altering classical rhetoric to express his own sort of pro-virginity half-feminism - which remains of interest to historians of gender. Among 16th century Spain's numerous \"treatises for and against women,\" some see Vives \"steer[ing] a middle path\" (p. xxiv-xxv), neither misogynist nor sanctifying.\nOthers see him as prescribing quite patriarchal and misogynistic views.\nHe stated that women should not be educators:\n\"For Adam was created first, then Eve, and Adam was not seduced but the woman was seduced and led astray. Therefore, since woman is a weak creature and of uncertain judgment and is easily deceived (as Eve, the first parent of mankind, demonstrated, whom the devil deluded with such a slight pretext), she should not teach, lest when she has convinced herself of some false opinion, she transmit it to her listeners in her role as a teacher and easily drag others into her error, since pupils willingly follow their teacher.\"\nHis De institutione feminae christianae, published in 1523, was commissioned by Catherine of Aragon, Catholic Queen consort of Henry VIII of England, for her daughter, Mary to instruct her on the proper roles for her sex. Interestingly, it forbids the very role Queen regnant Elizabeth I would later fulfill with the support of England and its navy in defeating the Armada of Catholic Spain, originating from the country of the Catholic Monarchs, Catherine of Aragon's parents and leaders of the Spanish Inquisition that executed Vives' relatives:\n“An unmarried young woman should rarely appear in public . . . who can have respect for a man who he sees is ruled by a woman?”\"\nThe book describes a longer list of attributes for a married woman. She must be loyal, dedicated, and obedient to her spouse; she must dress appropriately, covering her face in public; she must not allow any man into her house without her husband’s permission. While a wife’s obedience and dedication to her spouse determined her honor, a husband’s honor stemmed from his ability to control his wife and ensure she remained virtuous.\nVives’s text for husbands, De los deberes del marido, fills less than half the pages of his advice book for women and focuses substantially on selecting and governing a good wife rather than detailing how a husband should behave in his own right.\n\n\n=== Thoughts on the soul ===\nVives expressed an interest in the soul. He believed that understanding how the soul functions is more valuable than understanding the soul itself. “He was not concerned with what the soul is, but rather what the soul was like”. Norena explains that Vives thought that the soul had certain characteristics. He believed that the best part of the soul is its ability to \"…understand, remember, reason, and judge.\"  Vives touched on the mind in terms of his explanations of the soul—he claims that one cannot simply define what the soul is, but by piecing together parts of it, a better concept of how the soul works can be achieved. He compared the soul to art with an analogy by stating: “How we perceive a painted picture is more telling than declaring what the picture is itself”. Vives rejected the deterministic view of human behavior, and said instead that our soul can \"modify our behavior in ethically and socially.\" He also suggested that the way we feel day to day affects whether our soul is attaining good or evil.\n\n\n=== Insight on medicine ===\nVives is acknowledged for integrating psychology and medicine. “His ideas were new and they paved the way for other contributions that have greatly impacted our society today in terms of how we view the impact of medicine on humans”. He expressed the importance of animal testing before doing so on to people -–“Although Vives did not perform actual medical procedures, his suggestions were among the first of his time.\"  Vives had hopes that his ideas would influence the public. “With time, some may argue that a sort of social reform was created largely due to Vives’ ideas on medicine”. Clements described Vives’ contributions as being “original,\" yet many would classify him as being very underrated in terms of his accomplishments and ideas. Vives also made important early observations on the health of the human body-—he urged that “Personal habits of cleanliness and temperance greatly impacted health”. He claimed that the cleanliness of the body impacts the welfare of the body and the mind. He touched on how to medicate the mentally unstable by saying that mocking, exciting, and irritating those individuals who are mentally ill does not contribute to their treatment. Vives said that “Using the mentally ill as a form of entertainment is one of the most inhumane practices he had ever encountered”. His belief was that the some individuals who are mentally ill should be provided medication, but others just need friendly treatment.\n\n\n=== Emotions and the body ===\n\nAnother psychological contribution from Vives involves his thoughts on emotion. His ideas were largely influenced by the ideologies that came from Galen and Hippocrates in terms of how emotion is related to bile in the body. He agreed with the two with the belief that “different colored biles that humans have reflected different types of emotions”. Further, Vives believed that “Certain emotions color bile inside of human bodies and colored bodies likewise influences emotions”. According to Norena, Vives followed Galen’s recommendations of eating certain types of food for certain types of temperaments. Vives also suggested that almost all of our emotions, even those considered to be negative, are actually beneficial in a lot of ways. He expressed how there is potential to learn and grow from negative emotions as well as positive emotions. His emphasis on animism, or animal spirits, influenced Decartes according to Clements. Vives suggested in his work that the degree in which how strongly a person believes in his or her morals have a great impact on the way they feel about themselves-—“mental strength can influence physical strength”. Emotions, according to Vives, can be divided up into “Hot, cold, moist, dry, and varying combinations of the four”. Personality disturbances with emotions could be fixed when applying the correct temperature on to the body.\n\n\n=== Memory ===\nVives placed emphasis on memory. He defined memory as “…relating to the past, while perception relates to the present”. “Memory is something that is retained by either externally or internally perceiving it”.  He especially emphasized how humans imagine something internally and connect it with an event in order to create a memory. This, according to Vives, makes information retrieval of memory easier. He touched on memories in which we are unaware of, otherwise known as the unconscious. He said information is the “Most accessible from memory when a certain amount of attention is given.\" According to Murray, Vives showed understanding of the modern-day conception of how humans process retrieval. Vives observed that the more a memory is connected to a strong emotional experience, the easier it can be remembered. In terms of retaining memory, imagination was thought to play a key role, especially in children.  He also believed in a theory that pointed towards the fact that memory can be improved with practice. He advised that \"One should memorize something every day, even a useless quotation.\" Vives even touched on childhood memory-—he believed that children learn quickly because their mind is less cluttered with worries that adult minds have. Vives also believed that recall of memory is brought about by a concept in which the soul processes the memory. Vives himself had a recall experience as a child where he ate cherries when he had a fever. When he was adult and had cherries again and he \"felt as though he was sick just as he was when he was a child.\" He found this remarkable and determined that memory can exist unconsciously for a very long time. He also believed that “memory declines every day that the mind is not exercised.\"\n\n\n=== Learning ===\nVives used the word “intelligence” in a way that can be translated to the word “supervisor” as we know its meaning today: intelligence, according to Vives, involves functions directing attention from different kinds of stimulus. Intelligence is very much a cognitive structure according to Vives. When we learn, the memory of the experience is locked in an order of the actual intelligence. Vives’ perception on intelligence is that it is only important when it is put to use. Having an intelligent gift is only meaningful when the person is actively exercising it. The exercising of intelligence is important in retaining memory, which creates a better learning experience in general. Vives was among the first to suggest that the health of a student, the personality of the teacher, the classroom environment and the types of authors that the students are required to read from are all very important in how the student learns. “Vives placed special stress upon the proper environment of the school as the first ecological ingredient of the child’s sense experience.\" He compared learning and gaining knowledge to how humans digest food. Feeding the mind with knowledge is the same as feeding the body with food; it is essential to the human being.\n\n\n== Major works ==\nOpuscula varia (1519), collection of small works include Vives' first philosophical works, De initiis, sectis et laudibus philosophiae.\nAdversus pseudodialecticos (1520)\nDe subventione pauperum. Sive de humanis necessitatibus libri II (1525), dealing with the problem of poverty.\nDe Europae dissidis et Republica (1526).\nDe concordia et discordia in humano genere (1529).\nDe pacificatione (1529).\nQuam misera esset vita chistianorum sub Turca (1529).\nDe disciplinis libri XX (1531). An encyclopedical work, divided into three parts: De causis corruptarum artium, De tradendis disciplinis and De artibus\nDe conscribendis epistolis (1534), a treatise on letter writing.\nDe anima et vita (1538)\nDe Europeae statu ac tumultibus, a mediation addressing to the Pope to ask peace between the Christian princes.\nIntroductio ad sapientiam (1524), the most important of his pedagogical works.\nDe institutione feminae christianae, was dedicated to Catherine of Aragon.\n\n\n== See also ==\nVives Network\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Vives, Juan Luis\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n Lejay, Paul (1913). \"Juan Luis Vives\". In Herbermann, Charles. Catholic Encyclopedia. New York: Robert Appleton Company. \nClements, R. D. (1967). \"Physiological-Psychological Thought in Juan Luis Vives\". Journal of the History of the Behavioral Sciences. 3: 219–235. doi:10.1002/1520-6696(196707)3:3<219::aid-jhbs2300030302>3.0.co;2-r. \n\"JUAN LUIS VIVES (1492?-1540), by Ricardo Marín Ibáñez, Prospects: the quarterly review of comparative education (Paris, UNESCO: International Bureau of Education), vol. XXIV, no. 3/4, 1994, p. 743-759. UNESCO: International Bureau of Education, 2000\nMurray, D. J., & Ross, H. E. (1982). \"Memory and Recall.\" Canadian Psychology, 23, 22-30. Retrieved from http://psycnet.apa.org/journals/cap/23/1/22.pdf\nNorena, Carlos G. (1970). Juan Luis Vives. The Hague: Nijhoff.\nWatson, F. (September 1915). The Psychological Review: \"The Father of Modern Psychology.\" Archive.org, Vol. XXII. No. 5. Retrieved from https://archive.org/stream/psychologicalrev22ameruoft#page/332/mode/2up\n\n\n== Further reading ==\nFantazzi, Charles, ed. (2008). A Companion to Juan Luis Vives, Leiden: Brill (Brill's Companions to the Christian Tradition, 12).\nWatson, Foster (1908). Introduction to Tudor School-boy Life: The Dialogues of Juan Luis Vives. London: J.M. Dent & Company, pp. vii–li.\nWatson, Foster (1909). \"A Suggested Source of Milton's Tractate of Education,\" The Nineteenth Century and After, Vol. LXVI, pp. 607–617.\n\n\n== External links ==\n Media related to Juan Luis Vives at Wikimedia Commons\nWorks by or about Juan Luis Vives at Internet Archive\nJuan Luis Vives (Joannes Ludovicus Vives) at the Stanford Encyclopedia of Philosophy\n\"JUAN LUIS VIVES (1492?-1540)\", by Ricardo Marín Ibáñez, originally published in Prospects: the quarterly review of comparative education (Paris, UNESCO: International Bureau of Education), vol. XXIV, no. 3/4, 1994, p. 743-759. ©UNESCO: International Bureau of Education, 2000", "ns": 0, "pageid": 314917, "title": "Juan Luis Vives"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}