{"batchcomplete": "", "query": {"normalized": [{"to": "Julian Gumperz", "from": "Julian_Gumperz"}], "pages": {"2571345": {"extract": "Julian Gumperz (May 12, 1898 in New York City – February 1972 in Gaylordsville, Connecticut) was a United States-born German sociologist, communist activist, publicist, and translator.\n\n\n== Institute for Social Research ==\nJulian Gumperz studied political economy at Halle University. He left university as a committed Marxist and published an anti-war magazine called Der Gegner. One of its contributors was George Grosz.\nGumperz married Hede Massing. In her autobiography she described him as being refined, soft-spoken, and a sensitive young man, not hardened by politics although he too then belonged to the left circle.\" \nJulian Gumperz was an assistant at the Institute for Social Research (Institut für Sozialforschung) at Frankfurt am Main in Germany, one of the lesser known communist proponents of the Frankfurt School. His work there focused on economics. Gumperz married Hede Eisler (born Hedwig Thune, later Hede Massing) in 1927, but the marriage did not last.\nIn the summer of 1922, he attended the Institute's \"Erste Marxistische Arbeitswoche\" (First Marxist Week) in Ilmenau, Thuringia. Among the participants at the week-long session were Georg Lukács, Karl Korsch, Richard Sorge, Friedrich Pollock, Karl August Wittfogel, Bela Fogarasi, Karl Schmuckle, and Konstantin Zetkin, the younger of the two sons of socialist leader and feminist Clara Zetkin.\nIn 1933, due to political persecution in Germany, the institute sent Gumperz to the U.S. to explore the situation. Gumperz had been a student of Pollock’s since 1929 and a Communist Party member, but he gave it all up and became a stockbroker. He worked as a publicist and translator and later wrote an anti-communist book. Gumperz returned to Germany with a favorable report, assuring Max Horkheimer and the others that the Institute’s endowment, which still brought in about $30,000 a year, would be enough to guarantee survival in depression era America.\n\n\n== Publicist ==\nFor a time, Gumperz was the editor of the Communist newspaper Die Rote Fahne. In 1919 Gumperz and Karl Otten founded the Berlin monthly publication Der Gegner (\"The Opponent\"). It was published between April 1919 and 1922 by Gumperz with Wieland Herzfelde. One of a series of small German periodicals published in Berlin following WWI (Jedermann sein eigner Fussball, Die Pleite and Der Blutige Ernst), which followed on the heels of the German review Der Dada. Frequent banning orders compelled a constant change of title. With art by George Grosz, Der Gegner decried an art with no relevance to the working class and which ignored revolutionary action. The communist uprising in Berlin in 1918, crushed by the government, had given rise to these satirical, radical, and political reviews.\nIn 1947, he and Karl Volk co-authored a book, Pattern for World Revolution, writing under the pseudonym \"Ypsilon\".\n\n\n== References ==\n\nWalter Fähnders: Verlagshausierer. Ein unveröffentlichter Brief von Franz Jung an Julian Gumperz. In: Sklaven (Berlin) 1997, Nr. 34, p. 17-20.", "ns": 0, "pageid": 2571345, "title": "Julian Gumperz"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}