{"batchcomplete": "", "query": {"normalized": [{"to": "Julian Savulescu", "from": "Julian_Savulescu"}], "pages": {"4024033": {"extract": "Julian Savulescu (born 22 December 1963) is an Australian philosopher and bioethicist. He is Uehiro Professor of Practical Ethics at the University of Oxford, Fellow of St Cross College, Oxford, Director of the Oxford Uehiro Centre for Practical Ethics, Sir Louis Matheson Distinguished Visiting Professor at Monash University, and Head of the Melbourne–Oxford Stem Cell Collaboration, which is devoted to examining the ethical implications of cloning and embryonic stem cell research. He is the editor of the Journal of Medical Ethics, which is ranked as the No.1 journal in bioethics worldwide by Google Scholar Metrics as of 2013. In addition to his background in applied ethics and philosophy, he also has a background in medicine and completed his MBBS (Hons) at Monash University.\nHe completed his PhD at Monash University, under the supervision of bioethicist Peter Singer.\n\n\n== Procreative beneficence ==\nJulian Savulescu coined the phrase procreative beneficence. It is the controversial putative moral obligation of parents in a position to select their children, for instance through preimplantation genetic diagnosis (PGD), to favor those expected to have the best life. An argument in favor of this principle is that traits (such as empathy, memory, etc.) are \"all-purpose means\" in the sense of being instrumental in realizing whatever life plans the child may come to have.\nIn some of his publications he has argued for the following: (1) that parents have a responsibility to select the best children they could have, given all of the relevant genetic information available to them, a principle that he extends to the use of in-vitro fertilization (IVF) and preimplantation genetic diagnoses (PGD) in order to determine the intelligence of embryos and possible children; and (2) that stem cell research is justifiable even if one accepts the view of the embryo as a person.\nJulian Savulescu also justifies the destruction of embryos and fetuses as a source of organs and tissue for transplantation to adults. In his abstract he argues, \"The most publicly justifiable application of human cloning, if there is one at all, is to provide self-compatible cells or tissues for medical use, especially transplantation. Some have argued that this raises no new ethical issues above those raised by any form of embryo experimentation. I argue that this research is less morally problematic than other embryo research. Indeed, it is not merely morally permissible but morally required that we employ cloning to produce embryos or fetuses for the sake of providing cells, tissues or even organs for therapy, followed by abortion of the embryo or fetus.\" He argues that if it is permissible to destroy fetuses, for social reasons, or no reasons at all, it must be justifiable to destroy them to save lives.\nAlong with neuro-ethicist Guy Kahane, Savulescu's article \"Brain Damage and the Moral Significance of Consciousness\" appears to be the first mainstream publication to argue that increased evidence of consciousness in patients diagnosed with being in persistent vegetative state actually supports withdrawing or withholding care.\nIn 2009, Professor Savulescu presented a paper at the ’Festival of Dangerous Ideas,’ held at the Sydney Opera House in October 2009, entitled \"Unfit for Life: Genetically Enhance Humanity or Face Extinction,\" which appears on Vimeo. Savulescu argues that humanity is on the brink of disappearing in a metaphorical ‘Bermuda Triangle’ unless humans are willing to undergo 'moral enhancement'.\n\n\n== Reception ==\nRobert Sparrow wrote, in the Journal of Medical Ethics, that Savulescu's justification for the principle of procreative beneficence can and should be extended further. If parents have a moral obligation to create children likely to have the best possible life, they should prefer to have children that have been genetically engineered for an optimal chance at such a life, even if those children bear little or no genetic relation to them.\n\n\n== Other information ==\nIn 2009 Professor Savulescu was awarded a Distinguished Alumni Award by Monash University.\nIn 2009 he was also announced as the winner in the Thinking category of The Australian newspaper's Emerging Leaders Awards.\nHe has co-authored two books: Medical Ethics and Law: The Core Curriculum with Tony Hope and Judith Hendrick and Unfit for the Future: The Need for Moral Enhancement (published by Oxford University Press) with Ingmar Persson.\nProfessor Savulescu is a member of the Board of Directors Executive Committee of the International Neuroethics Society.\nHe has also edited the books Human Enhancement (together with Nick Bostrom) and Enhancing Human Capacities.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nThe Oxford Uehiro Centre for Practical Ethics.\nThe Hinxton Group: An International Consortium on Stem Cells, Ethics & Law.\nStronger, smarter, nicer humans.\nPhilosophy Bites podcast of Julian Savulescu interviewed by Nigel Warburton on the Yuk Factor.", "ns": 0, "pageid": 4024033, "title": "Julian Savulescu"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}