{"batchcomplete": "", "query": {"normalized": [{"to": "Julius Binder", "from": "Julius_Binder"}], "pages": {"5334706": {"extract": "Julius Binder (May 12, 1870 in Würzburg – August 28, 1939 in Göttingen) was a German philosopher of law. He is principally known as an opponent of legal positivism, and for having remained as an active scholar during the 1930s in Nazi Germany who did not speak out against the prevailing government of that time.\n\n\n== Life ==\nAfter studying law in Würzburg with honors (1894) and Habilitation (1898), he became professor in Rostock (1900), Erlangen (1903), Würzburg (1913) and Göttingen (1919). He founded the \"International Hegel Federal\" and became a member of the Göttingen Academy of Sciences.\nAfter he had applied in earlier works the concept of rights from Immanuel Kant (as in: \"Legal concept and idea of law\" from the year 1915), he later became a strong critic of Neokantian legal philosophy, especially the philosophy of law of Rudolf Stammler. Since the 1920s, Julius Binder—and later along with Karl Larenz, Gerhard Dulckeit and Walther Schönfeld –- he applied a Neohegelian approach to jurisprudence in the system of the so-called \"objective idealism\". Binder was the academic teacher of the German legal philosopher and civil law proponent Karl Larenz. He rejected legal positivism.\nIn addition, Binder, along with others such as Ernst Forsthoff, Carl Schmitt, Karl Larenz among legal philosophers, did not criticize the Nazi legal system.\nSince 1890 he was a member of the Corps Bavaria Würzburg.\n\n\n== Literary works ==\nDas Problem der Juristischen Persönlichkeit (1907)\nRechtsbegriff und Rechtsidee, 1915\nPhilosophie der Rechts, 1925\nGrundlegung zur Rechtsphilosophie, 1935\nSystem der Rechtsphilosophie, 1937\n\n\n== References ==\n\n\n== External links ==\nWorks by or about Julius Binder at Internet Archive", "ns": 0, "pageid": 5334706, "title": "Julius Binder"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}