{"batchcomplete": "", "query": {"normalized": [{"to": "Julia Annas", "from": "Julia_Annas"}], "pages": {"7624133": {"extract": "Julia Elizabeth Annas (born 1946) is a British philosopher who has taught in the United States for the last quarter-century. She is Regents Professor of Philosophy at the University of Arizona.\n\n\n== Biography ==\nAnnas graduated from Oxford University in 1968 with a B.A., and from Harvard University with an A.M. (1970) and a Ph.D. (1972). She was a Fellow and Tutor at St Hugh's College, Oxford for fifteen years, before joining the faculty at Arizona in 1986, where she has taught since, apart for one year as a professor at Columbia University. She concentrates on the study of ancient Greek philosophy, including Ethics, Psychology and Epistemology. Her current research interests are in Platonic ethics. She was elected a Fellow of the American Academy of Arts and Sciences in 1992, and a Fellow of the American Philosophical Society in 2013. She is the founder and former editor of the annual journal, Oxford Studies in Ancient Philosophy. She is married to the Hume scholar, David Owen, also a professor of philosophy at the University of Arizona.\n\n\n== Philosophy ==\nJulia Annas has advocated ethics based on character, building on ideas attributed to Greek philosopher, Aristotle and making them relevant for contemporary moral discourse. She has argued that being virtuous involves “practical reasoning” which can be compared to the “exercising of a practical skill”. Hence, she argues, rather than relating virtues to rules, principles, or an end goal, Annas says, first, people should ask how they can improve their moral “skills”.\n\n\n== Major writings ==\n\n\n=== Books ===\nIntelligent Virtue (Oxford, 2011).\nPlato: A Very Short Introduction (Oxford, 2003).\nAncient Philosophy: A Very Short Introduction (Oxford, 2000).\nVoices of Ancient Philosophy: An Introductory Reader (Oxford, 2000).\nPlatonic Ethics, Old and New (Cornell, 1999).\nAnnas, Julia (1993). The Morality of Happiness. Oxford University Press. ISBN 978-0-19-509652-1.  (reprint 1995, ISBN 978-0-19-509652-1)\nHellenistic Philosophy of Mind (California, 1992).\nThe Modes of Scepticism (Cambridge, 1985), with Jonathan Barnes.\nAn Introduction to Plato's Republic (Oxford, 1981).\nAristotle's Metaphysics, Books M and N, translated with introduction and notes, (Oxford 1976).\n\n\n=== Translations ===\nPlato, Statesman (Cambridge, 1995), with Robin Waterfield.\nSextus Empiricus, Outlines of Scepticism (Cambridge, 1994), with Jonathan Barnes.\nAristotle, Aristotle's Metaphysics Books M and N (Oxford, 1976).\n\n\n=== Recent articles ===\n\"What are Plato’s “Middle” Dialogues in the Middle Of?\" (Harvard University Press, 2002)\n\"Democritus and Eudaimonism\" (Presocratic Philosophy: Essays in Honour of Alex Mourelatos, edited by Victor Caston and Daniel Graham, Ashgate, Aldershot, 2002)\n\"Aristotle and Kant on Morality and Practical Reasoning\" (Aristotle, Kant & The Stoics,ed. S. Ergstrom and J. Whiting, Cambridge 1996)\n\"Virtue and Eudaimonism\" (Virtue and Vice, ed. E. Paul, J. Jaul and F. Miller, Cambridge, 1998)\n\"Prudence and Morality in Ancient and Modern Ethics\" (Ethics, January 1995)\n\"Epicurus on Agency\" (Passions and Perceptions, Cambridge, 1993)\n\"The Good Life and the Good Lives of Others\" (The Good Life and the Human Good, Cambridge, 1992)\n\"Plato the Sceptic\" (Oxford Studies in Ancient Philosophy, Supp. Vol., 1992).\n\"Plato's Myths of Judgement\" (Phronesis Vol. 27 No. 2, 1982; pp. 119–143).\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nSigmund H. Danziger, Jr. Memorial Lecture in the Humanities\n\n\n== References ==\n\n\n== External links ==\nAuthor's website (Her website includes several downloadable articles)]\nReview of Morality of Happiness\nReview of Intelligent Virtue", "ns": 0, "pageid": 7624133, "title": "Julia Annas"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}