{"batchcomplete": "", "query": {"normalized": [{"to": "Kaibara Ekken", "from": "Kaibara_Ekken"}], "pages": {"5356924": {"extract": "Kaibara Ekken (貝原 益軒, December 17, 1630 – October 5, 1714) or Ekiken, also known as Atsunobu (篤信) was a Japanese Neo-Confucianist philosopher and botanist.\nKaibara was born into a family of advisors to the daimyo of Fukuoka Domain in Chikuzen Province (modern-day Fukuoka Prefecture). He accompanied his father to Edo in 1648, and was sent in 1649 to Nagasaki to study Western science. At his father's urging, he continued his studies in Nagasaki as a rōnin from 1650 through 1656. He then re-entered service to Kuroda, which led to his continuing studies in Kyoto. After his father's death in 1665, he returned to Fukuoka.\nKaibara's two most significant contributions to Japanese culture were the study of nature based on a blend of Western natural science and Neo-Confucianism, and the translation of the complex writings of Neo-Confucianism into vernacular Japanese.\n\nKaibara's science was confined to Botany and Materia medica and focused on the \"natural law\". Kaibara became as famous in Japan as people such as Charles Darwin when it came to science. He advanced the study of botany in Japan when he wrote Yamato honzō,(Medicinal herbs of Japan) which was a seminal study of Japanese plants. The 19th-century German Japanologist Philipp Franz von Siebold called him the \"Aristotle of Japan.\"\nKaibara was known for his manuals of behavior, such as changing his Confucian ethical system based on the teachings of Zhu Xi (also known as Chu Hsi) into an easy \"self-help\" manuals. As an educator and philosopher, it appears that Kaibara's main goal in life was to further the process of weaving Neo-Confucianism into Japanese culture. In this context, he is best known for such books as Precepts for Children and Greater Learning for Women (Onna daigaku); but modern scholarship argues that it was actually prepared by other hands. Although the genesis of the work remains unchallenged, the oldest extant copy (1733) ends with the lines \"as related by our teacher Ekiken Kaibara\" and the publisher's colophon states that the text was written from lectures of our teacher Kaibara.\"\n\n\n== Published works ==\nDazaifu jinja engi (History of Dazaifu Shrine).\nJingikun (Lessons of the Deities).\nOnna daigaku (Greater Learning for Women), c. 1729.\nShinju heikō aimotorazaru ron (Treatise on the Non-Divergence of Shintō and Confucianism).\nYamato honzō (Medicinal herbs of Japan), 1709.\nYamato sōhon (Grasses of Japan).\nYōjōkun (The Book of Life-nourishing Principles), 1713.\n\n\n== Notes ==\n\n\n== References ==\nKaibara, Ekiken and Shingoro Takaishi. (1905). Women and the Wisdom of Japan (Basil Hall Chamberlain, translator). London: John Murray....Click link for digitized, full-text copy of this book\nCranmer-Byng, L. and S.A. Kapadia, eds. (1914). Women and the Wisdom of Japan. London: John Murray....Click link for digitized, full-text copy of this book\n\nKo, Dorothy, JaHyun Kim Haboush and Joan R. Piggott. (2003). Women and Confucian Cultures in Premodern China, Korea, and Japan. Berkeley: University of California Press. ISBN 0-520-23138-4\nYonemoto, Marcia. (2003). Mapping Early Modern Japan: Space, Place, and Culture in the Tokugawa Period (1603–1868). Berkeley: University of California Press. ISBN 0-520-23269-0\n\n\n== External links ==\nEast Asia Institute, University of Cambridge: Further reading/bibliography\nNational Archives of Japan, illustrated scrolls plus text by Kaibara Eiken:\nYoshinoyama shokeizu, guide to Mt. Yoshino, text by Eiken (circa 1714)\nItsukushima kakei, guide to Itsukushima, text by Eiken (circa 1720)\nTanngo no kuni Amano hashidate no zu, guide to Ama-no-Hashidate, text by Eiken (circa 1726)", "ns": 0, "pageid": 5356924, "title": "Kaibara Ekken"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}