{"batchcomplete": "", "query": {"normalized": [{"to": "Karla Jessen Williamson", "from": "Karla_Jessen_Williamson"}], "pages": {"19914570": {"extract": "Karla Jessen Williamson (born 1954 in Appamiut, Maniitsoq, Greenland) is Executive Director of the Arctic Institute of North America (AINA), the first woman and first Inuk to hold the position. Fluent in Danish, English, and Greenlandic, she is an educator and researcher on cross-culturalism, multiculturalism, antiracism, and Aboriginal epistemology.\n\n\n== Early years ==\nWilliamson, a Kalaaleq, was born in Greenland, and received her primary education there. She graduated from high school in Denmark. She received her bachelor's degree and her master's degree in Education from the University of Saskatchewan in Canada, and her Ph.D. from the Department of Anthropology, University of Aberdeen in Scotland.\n\n\n== Career ==\nWilliamson's research includes Inuit childbearing and gender roles in post-colonial Greenland. She taught for sixteen years in the Indian and Northern Education program at the University of Saskatchewan before moving to the AINA on 15 September 2000. She is also a Senior Researcher with the Inuit Tapiriit Kanatami.\nBecause of her role with the Inuit Tapiriit Kanatami and the Arctic Human Health Initiative, Williamson became the Activity Leader for the IPY 2007-2008 project \"Arctic Resiliency and Diversity: Community Response to Change\" in collaboration with the Inuit Circumpolar Conference. She is a notable presenter on masking and promotes it for Inuit understanding of gender equality in relationship to ancestors, animals, and the environment. In addition, Williamson has been an editor for the Gabriel Dumont Institute's Journal of Indigenous Studies.\n\n\n== Personal life ==\nWilliamson was married to Dr. Robert Gordon Williamson (1931-2012, Oxley, Wolverhampton, Staffordshire, England), an anthropologist, and Professor Emeritus at the University of Saskatchewan. They have two children. Karla is currently living near Saskatoon and working as assistant professor in the Department of Educational Foundations as the University of Saskatchewan.\n\n\n== Quote ==\n\nThe Arctic is really the canary in the coal mine in terms of climate change.\n\n\n== Partial bibliography ==\nJessen Williamson, Karla(2011) Inherit my Heaven: Kalaalit Gender Relations. Inussuk, Nuuk.\nWilliamson, K. J. (1987). \"Consequence of Schooling: Cultural Discontinuity amongst the Inuit\". Canadian Journal of Native Education. 14 (2), 60-69. OCLC 93453172\n\n\n== References ==\n\n\n== External links ==\nPhoto", "ns": 0, "pageid": 19914570, "title": "Karla Jessen Williamson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}