{"batchcomplete": "", "query": {"normalized": [{"to": "Karl Loewenstein", "from": "Karl_Loewenstein"}], "pages": {"22952591": {"extract": "Karl Loewenstein (Munich, November 9, 1891 – Heidelberg, July 10, 1973) was a German philosopher and political scientist, regarded as one of the prominent figures of Constitutional law in the twentieth century.\nHis research and investigations into the deep typology of the different constitutions have had some impact on the Western constitutional thought. He studied in his native city of Munich (Bavaria), where he got a doctor's degree in Public law and Political science.\nWhen Adolf Hitler's Nazi Party took power in 1933, he was exiled and came to the United States, country where he would carry out most of his doctrine work and writings.\n\n\n== His philosophical and political views ==\nLoewenstein has a clear leaning towards liberal democracy, as shown in the most important book he wrote, “Theory of the Constitution”.\n\n\n== Constitutional classification ==\n\n\n=== Original and derived constitutions ===\nOriginal constitutions: Their contents have been truly innovating for the history of constitutionalism within a particular country, or the ones that inaugurate a new doctrine or political spirit. They introduce institutions or political solutions that have not been tested before in a particular territory. Among them are the following ones:\nThe 1787 United States Constitution.\nThe 1791 and 1793 French and Napoleonic constitutions.\nThe 1831 Belgian Constitution.\nThe German 1919 Constitution, under the Weimar Republic (1919–1933).\nThe 1918 and 1924 Soviet socialist (communist) constitutions.\n\nDerived constitutions: They follow the basic fundamental traits left by the original constitutional convention. Naturally, most present-day constitutions worldwide are derived ones. But he alleges that some post World War II European constitutions (such as the 1949 West German one) are partially derived.\n\n\n=== Ideological-programatic and utilitarian constitutions ===\nIdeological-programatic constitutions: They convey an ideological burden in their articles, and they mean to show that the new State being constituted will defend some sort of “creed”. Among them there are the first constitutions born during the European liberal revolutions tinged with that ideology (like the 1791 French constitution, the 1812 Spaniard one, or the 1831 Belgian one). Also, the fascism and socialist (Marxist) constitutions fall into this category.\nUtilitarian constitutions: They present, specially in their organic part, the structural and functional organization of the State's institutions. Although they have an ideological background, it is diluted within their text.\n\n\n=== Ontological classification ===\nLoewenstein states that there are some several types of Constitutions, but a true constitution is one that, besides containing essential guarantees and an outline about the organization of the supreme political institutions of a country, also incarnates the deepest values of liberal democracy, as long as the (historical) reality of the social group it will be imposed upon. This is what he calls “ontological classification”.\nOntological classification: Pays attention to the real effectiveness of the constitutional text and the way in which it is assimilated by the social body. Loewenstein draws a distinction among:\nAnalytically, Loewenstein considers three different kinds of constitutions:\nNormative constitution: It is really enforced, felt or “lived” by both the political rulers and the citizens in general. It is an effective constitution that ultimately controls or governs the political processes within a particular country and the democratic or republican principles it claims to uphold clearly corresponds to the real political practice. The (Federal) Constitution of the United States is an example of these virtuous and “alive” ones, which are “lived” by the societies ruled by it. Loewenstein uses the analogy of a suit that perfectly fits its user.\nNominal constitution: Its contents not always corresponds to the local reality, that is, the real policies carried out within a country. Its text is mainly (or even only) nominal and thus it is not really enforced, due to the lack of appropriate conditions or because the social body is not still ready for them. Nevertheless, it may have an educational value for the people in general, and might become a normative constitution sometime in the future (in the long-term). Loewenstein claims that most of the current world constitutions are nominal to some extent. He compares them to a badly tailored suit.\nSemantic constitution (which he also called “pseudo-constitution”) is a fundamental law enforced to formalize and legalize the monopoly of power previously held by some social and/or economic groups, who in fact may have already become illegitimate (compare with the marxist concept of superstructure). It is a clear means by which dictatorial governments pretend to disguise their authoritarianism or even totalitarianism. In fact, instead of limiting the government's power in favor of the individual rights, those so-called “constitutions” do exactly the opposite: they are meant to reinforce or strengthen an already oppressive previous political system. The historical or remaining communist regimes are clear cases or instances of this phenomenon: the former Soviet Union, the other Eastern Bloc countries, China, Cuba, etc. Loewenstein directly compares them with a mere fancy dress.\nOn the other hand, Loewenstein discarded the idea of trying to devise a “perfect theoretical constitution”, instead claiming that “an ideal constitution has never existed, and will never exist”.\n\n\n== Political systems ==\n\n\n=== Regimes ===\nLoewenstein claims that political regimes are divides into:\nAutocracies: Real power is concentrated in very few hands, who are virtually not subjected to any kind of parliamentarian or administrative control, and that don't recognize the traditional principle of popular sovereignty (or don't wish to do so). He includes in this group the remaining absolute monarchies (like the Saudi Arabian one) and presidential systems with a very strong executive authority, that have degenerated in Bonapartism (sometimes called “hyperpresidentialism”).\nConstitutional democracy: Power is the expression of the sovereignty of the people, as individuals elected for political posts are subject to different controls that ensure the supremacy of the rule of law.\nMost present-day parliamentary republics and constitutional monarchies (sometimes called “pseudo-monarchies” in political science) republics fall into this group. Not always nominal presidential republics, like the Latin American ones, fall into this category, although the USA is a huge exception to this rule.\nAccording to Loewenstein, this classification not only has to be made looking to the laws that regulate those institutions, but also to the political practices actually observed, because the mere existence of a constitution is not enough to tell whether a certain governments is a democratic or an authoritarian one.\n\n\n=== A new tripartite division of power ===\nLoewenstein considered it was extremely difficult to try to change the division of power into the executive, legislative and judicial branches -as established by Montesquieu- which is a sort of “sacred dogma” for the constitutional theory and practice of liberal democracies.\nHowever, he presented a new tripartite division of power into (three) functions.\nDetermination of policies: This means that the state authorities must choose among several different political possibilities that come before them.\nExecution of political decisions: That is, the implementation or carrying out of the previously selected policies.\nPolitical control: It involves the control of a political decision, by an organ a different governmental organ that took it, verifying that it was done following the standard pre-set rules.\nThe most efficient mechanism to divide power and to control the national political decisions is to distribute the main government functions into different “departments”, and do the same with their subordinate equivalents in the state, provincial or regional level.\nPower distribution means that the (usually three main) different administrative departments are like a watertight compartments that mutually control and limit the otherwise potentially expansive sphere of influence of the others. In the modern parliamentary and presidential republics this is traditionally done through counterweights usually referred to as “checks and balances”. Loewenstein considers that this last function is the most important in his views about the tripartite division of the political power, because if it didn't exist the other two would automatically fall apart, as even the reach and implications of the national political decisions couldn't be determined or estimated.\n\n\n== See also ==\nConstitutional law\n\n\n== External links ==\nLoewenstein's biography (German)", "ns": 0, "pageid": 22952591, "title": "Karl Loewenstein"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}