{"batchcomplete": "", "query": {"normalized": [{"to": "Kazimierz Twardowski", "from": "Kazimierz_Twardowski"}], "pages": {"1022980": {"extract": "Kazimierz Jerzy Skrzypna-Twardowski (20 October 1866 – 11 February 1938) was a Polish philosopher and logician.\n\n\n== Life ==\nTwardowski's family belonged to the Ogończyk coat of arms.\nTwardowski studied philosophy in Vienna with Franz Brentano and Robert Zimmermann. In 1892 he received his doctorate with his dissertation, Idee und Perzeption (Idea and Perception), and in 1894 he presented his habilitation thesis, Zur Lehre vom Inhalt und Gegenstand der Vorstellungen (On the Doctrine of the Content and Object of Presentations). He originated many novel ideas related to metaphilosophy.\nHe lectured in Vienna in the years 1894–95, then was appointed professor at Lwów (Lemberg in Austrian Galicia, now Lviv in the Ukraine). An outstanding lecturer, he was also a rector of the Lwów University during World War I.\nThere Twardowski established the Lwów–Warsaw school of logic and also became the \"father of Polish logic\", beginning the tradition of scientific philosophy in Poland. Among his students were the logicians Stanisław Leśniewski, Jan Łukasiewicz and Tadeusz Czeżowski, the historian of philosophy Władysław Tatarkiewicz, the phenomenologist and aesthetician Roman Ingarden, as well as philosophers close to the Vienna Circle such as Tadeusz Kotarbiński and Kazimierz Ajdukiewicz.\n\n\n== Work ==\nIn his On the Content and Object of Presentations, Twardowski argues for a distinction between content and object in the frame of the theory of intentionality of his teacher Franz Brentano. According to him the mind is divided in two main areas: acts or mental phenomena, and a physical phenomenon. For example, an act of presentation is aimed at a presentation. This is what he called ‘intentionality’, aboutness. Every act is about something, but also every presentation goes together with an act of presentation.\nThis theory suffers from the problem that it is not clear what the presentation exactly is. Is the presentation something only in the mind, or is it also in the world as object? Twardowski says that sometimes presentation is used for the object in the world and sometimes for the immanent content of a mental phenomena.\nTwardowski offers a solution for this problem and proposes to make a distinction between the content of a presentation and the object of a presentation.\nIn his book Twardowski offers an analogy to clarify this distinction. He uses the example of a painting. People say of a landscape that it is painted, but also of a painting that it is painted. In the first case the word ‘painting’ is used in a modifying way (a painted landscape is not a landscape at all), while in the latter case the word painting is used in a qualitative or attributive way. Twardowski argues that presentations are similar. The content is the painted painting and the object is the painted landscape. The content resembles the present ‘picture’ in one's mind, and the object the landscape.\n\n\n== Bibliography ==\n\n\n=== Works in German and Polish ===\nÜber den Unterschied zwischen der klaren und deutlichen Perzeption und der klaren und deutlichen Idee bei Descartes (1891) (doctoral dissertation)\nIdee und perzeption. Eine erkenntnis-theoretische Untersuchung aus Descartes (1892)\nZur Lehre vom Inhalt und Gegenstand der Vorstellungen (1894)\nWyobrażenie i pojęcie (1898)\nO tzw. prawdach względnych (1900)\nÜber sogenannte relative Wahrheiten (1902)\nÜber begriffliche Vorstellungen (1903)\nDas Wesen der Begriffe allegato a Jahresbericht der Wiener philosophischen Gesellschaft (1903)\nO psychologii, jej przedmiocie, zadaniach, metodzie, stosunku do innych nauk i jej rozwoju (1913)\nRozprawy i artykuły filozoficzne (1927)\nWybrane pisma filozoficzne (1965) (Collection of the philosophical essays)\nWybór pism psychologicznych i pedagogicznych (1992) (Collection of the psychological and pedagogical essays)\nDzienniki (1997)\n\n\n=== Translations ===\nOn the Content and Object of Presentations. A Psychological Investigation. The Hague: Martinus Nijhoff 1977. Translated and with an introduction by Reinhardt Grossmann.\nOn Actions, Products and Other Topics in Philosophy. Edited by Johannes Brandl and Jan Wolenski. Amsterdam: Rodopi 1999. Translated and annotated by Arthur Szylewicz.\nOn Prejudices, Judgments and Other Topics in Philosophy. Edited by Anna Brożek e Jacek Jadacki. Amsterdam: Rodopi 2014.\nSur les objets intentionnels (1893–1901). Paris: Vrin 1993. French translation of Zur Lehre vom Inhalt und Gegenstand der Vorstellungen and other texts by Edmund Husserl.\n\n\n== See also ==\nSchool of Brentano\nRepresentationalism\nLwów–Warsaw school of logic\nPolish logic\nHistory of philosophy in Poland\nList of Poles\n\n\n== Notes ==\n\n\n== References ==\nJens Cavallin, Content and Object: Husserl, Twardowski and Psychologism, Phaenomenologica 142, Dordrecht: Kluwer, 1997.\nSandra Lapointe et al., (eds.), \"The Golden Age of Polish philosophy. Kazimierz Twardowski's philosophical legacy\". New York: Springer, 2009.\nPeter M. Simons, Philosophy and Logic in Central Europe from Bolzano to Tarski: Selected Essays, Springer, 2013.\nMaria van der Schaar, Kazimierz Twardowski: A Grammar for Philosophy, Brill, 2015.\n\n\n== External links ==\nBetti, Arianna. \"Kazimierz Twardowski\". Stanford Encyclopedia of Philosophy. \nWolenski, Jan. \"Lvov-Warsaw School\". Stanford Encyclopedia of Philosophy. \nKazimierz Twardowski at the Mathematics Genealogy Project\nPolish Philosophy Page: Kazimierz Twardowski\nKazimierz Twardowski on the Content and Object of Presentations\nAnnotated bibliography of and about Twardowski\nArchives of the Lvov-Varsovie School – Archiwum Kazimierza Twardowskiego Digital library of the works of Twardowski", "ns": 0, "pageid": 1022980, "title": "Kazimierz Twardowski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}