{"batchcomplete": "", "query": {"normalized": [{"to": "Keith Lehrer", "from": "Keith_Lehrer"}], "pages": {"2254444": {"extract": "Keith Lehrer (born January 10, 1936) is Regent's Professor emeritus of Philosophy at the University of Arizona and a Research Professor of Philosophy at the University of Miami in Florida, where he spends half of each academic year.\n\n\n== Education and Career ==\nLehrer received his Ph.D. in philosophy from Brown University where he studied under Richard Taylor and Roderick Chisholm. He joined the faculty at the University of Arizona in 1973, where he helped build a major graduate program. Prior to that, he taught at the University of Rochester.\nHis research interests include epistemology, free will, rational consensus, Thomas Reid and, recently, aesthetics.\nLehrer is a former president of the Pacific Division of the American Philosophical Association (APA) and also served as the APA executive director for a number of years. He is an elected Fellow of the American Academy of Arts and Sciences.\nLehrer, and his wife Adrienne Lehrer, are also artists. Their work has been on display at the Vincent Gallery in Coconut Grove, Florida, concurrent with his stay at the University of Miami, where he was a visiting professor.\n\n\n== Philosophical Work ==\nLehrer is best-known for his defense of a coherentist theory of knowledge. According to Lehrer, \"a person is justified in accepting a proposition just in case that proposition coheres with the relevant part of her cognitive system.\"\nLehrer's work, \"Why Not Skepticism?\" is used in many introductory philosophy courses as a coherent and readable introduction to the subject. He has authored seven books on philosophical subjects, and over 170 scholarly articles. Lehrer is perhaps best known for his defense of the coherence theory of justification in epistemology. He is the originator of the widely discussed TrueTemp example.\n\n\n== Publications ==\nBooks\nArt, Self, and Knowledge (Oxford, 2011)\nSelf Trust: A Study of Reason, Knowledge and Autonomy (Oxford, 1997)\nPhilosophical Problems and Arguments: An Introduction (Hackett, 1992, 4th ed.), with James Cornman and George Pappas\nMetamind (Oxford, 1990)\nTheory of Knowledge (Westview, 1990)\nThomas Reid (Routledge, 1989)\nRational Consensus in Science and Society: A Philosophical and Mathematical Study (D. Reidel, 1981), with Carl Wagner\nKnowledge (Oxford, 1974)\nRecent articles\n\"Love and Autonomy,\" in a volume Love Analyzed, ed. R. Lamb, Westview Press, 1997.\n\"Semantic Fields and Vectors of Meaning,\" with Adrienne Lehrer, In Lexical Semantics, Cognition and Philosophy, B. Lewandowska-Tomaszcyzyk, Lødz University Press, 1998.\n\"Meaning, Exemplarization and MEtarepresentation,\" written for Metarepresentation, Dan Sperber ed., a volume of Vancouver Studies in Cognitive Science.\n\"Acceptance and Belief Reconsidered,\" in a volume edited by P. Engel, Belief and Acceptance, to be published by Kluwer in Philosophical Studies Series.\n\"Justification, Knowledge and Coherence,\" to be published in Erkenntnis.\n\"Rationality,\" to be published in Guidebook to Epistemology, Blackwell's, edited by J. Greco and E. Sosa.\n\"Individualism versus Communitarianism: A Consensual Compromise,\" written for a symposium at the World Congress of Philosophy, Boston, August, 1998, and to published in the proceedings.\n\"Reid, Hume and Common Sense,\" to be published in Reid Studies.\nBooks edited\nKnowledge, Teaching and Wisdom (Kluwer, forthcoming), with Jeannie Lum, Beverly Slichta and Nicholas Smith\nAustrian Philosophy, Past & Present (Kluwer, in process), with Johann Marek.\nAn Opened Curtain: A U.S.-Soviet Philosophical Summit (Westview, 199), with Ernest Sosa\nKnowledge and Skepticism (Westview, 1989), with Marjorie Clay\nScience and Ethics (Rodopi, 1988) Thomas Reid's Inquiry and Essays (Hackett, 1983), with Ronald Beanblossom\nAnalysis and Metaphysics: Essays in Honor of R.M. Chisholm (D. Reidel, 1975)\nNew Readings in Philosophical Analysis (Appleton-Century-Crofts, 1972), with Herbert Feigl and Wilfrid Sellars\nTheory of Meaning (Prentice Hall, 1970) with Adrienne Lehrer\nFreedom and Determinism (Random House, 1966).\nBooks about Keith Lehrer\nKeith Lehrer, edited by Radu Bogdan, Reidel, 1980.\nThe Current State of the Coherence Theory: Critical Essays on the Epistemic Theories of Keith Lehrer and Laurence Bonjour, edited by John W. Bender, Kluwer, 1989.\nMetamind, Knowledge, and Coherence: Essays on the Philosophy of Keith Lehrer, edited by Johannes Brandl, Wolfgang Gombocz, and Christian Piller, Rodopi, 1991.\nThe Epistemology of Keith Lehrer (Series: Philosophical Studies Series, Vol. 95), edited by Erik J.Olsson, 2003, 364 p., Hardcover.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nLehrer's faculty page at the University of Arizona\nLehrer's faculty page at the University of Miami\nLehrer's Painting", "ns": 0, "pageid": 2254444, "title": "Keith Lehrer"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}