{"batchcomplete": "", "query": {"normalized": [{"to": "Kevin Carson", "from": "Kevin_Carson"}], "pages": {"2410846": {"extract": "Kevin Amos Carson (born 1963) is an American author, anarchist and political theorist on the topics of mutualism, individualist anarchism, left-libertarianism, and freemarketism. He graduated from the University of Arkansas in 1987.\n\n\n== Research career ==\nIn November 2008, Carson became a research associate at the Center for a Stateless Society. He was the center's first paid staff member. Additionally, he holds the center's Karl Hess Chair in Social Theory.\nSince January 2009, Carson has produced several studies and commentaries for the center.\n\n\n== Philosophy and Ideas ==\n\n\n=== State ===\nCarson agrees with individualist anarchist Benjamin Tucker regarding the \"big four\" monopolies (land, money, tariffs, and patents). However, he goes further arguing that the state has also transferred wealth to the wealthy by subsidizing organizational centralization, in the form of transportation and communication subsidies.\n\n\n=== Free markets vs. capitalism ===\n\nUnlike some other market anarchists, Carson defines capitalism in historical terms, emphasizing the history of state intervention in market economies. He has said \"[i]t is state intervention that distinguishes capitalism from the free market.\" He does not define capitalism in the idealized sense but says that when he talks about \"capitalism\" he is referring to what he calls \"actually existing capitalism.\" He believes that \"laissez-faire capitalism, historically speaking, is an oxymoron\" but has no quarrel with anarcho-capitalists who use the term and distinguish it from \"actually existing capitalism.\"\nIn response to claims that he misuses the term \"capitalism\", Carson has said he deliberately resurrected what he has claimed to be an old definition of the term in order to \"make a point.\" He has claimed that \"the term 'capitalism,' as it was originally used, did not refer to a free market, but to a type of statist class system in which capitalists controlled the state and the state intervened in the market on their behalf.\" Carson holds that “Capitalism, arising as a new class society directly from the old class society of the Middle Ages, was founded on an act of robbery as massive as the earlier feudal conquest of the land. It has been sustained to the present by continual state intervention to protect its system of privilege without which its survival is unimaginable.” Carson argues that in a truly laissez-faire system, the ability to extract a profit from labor and capital would be negligible.\nCarson has argued the centralization of wealth into a class hierarchy is due to state intervention to protect the ruling class, by using a money monopoly, granting patents and subsidies to corporations, imposing discriminatory taxation, and intervening militarily to gain access to international markets. Carson’s thesis is that under an authentic free market economy, the separation of labour from ownership and the subordination of labor to capital would be impossible, bringing a more egalitarian society in which most people could easily choose self-employment over wage labor.\nCarson has written sympathetically about several anarcho-capitalists, arguing that they use the word \"capitalism\" in a different sense than he does and that they represent a legitimate strain of anarchism. He says \"most people who call themselves individualist anarchists today are followers of Murray Rothbard's Austrian economics, and have abandoned the labor theory of value.\" With the release of his book, Studies in Mutualist Political Economy, Carson aimed to revive interest in \"mutualism.\" In his book he attempts to synthesize Austrian economics with the labor theory of value, or \"Austrianize\" it, by incorporating both subjectivism and time preference.\n\n\n=== \"Vulgar libertarianism\" ===\nCarson coined the pejorative term \"vulgar libertarianism\" to describe the use of free market rhetoric in defense of corporate capitalism and economic inequality. According to Carson, the term is derived from the phrase \"vulgar political economy,\" which Karl Marx described as an economic order that \"deliberately becomes increasingly apologetic and makes strenuous attempts to talk out of existence the ideas which contain the contradictions [existing in economic life].\"\nCarson writes that\n\nVulgar libertarian apologists for capitalism use the term \"free market\" in an equivocal sense: they seem to have trouble remembering, from one moment to the next, whether they’re defending actually existing capitalism or free market principles. So we get the standard boilerplate article in The Freeman arguing that the rich can’t get rich at the expense of the poor, because \"that’s not how the free market works\"—implicitly assuming that this is a free market. When prodded, they’ll grudgingly admit that the present system is not a free market, and that it includes a lot of state intervention on behalf of the rich. But as soon as they think they can get away with it, they go right back to defending the wealth of existing corporations on the basis of \"free market principles.\"\n\nMuch of Carson's writing is dedicated to critiquing other writers whom he perceives as vulgar libertarians. A sporadically recurring feature on his blog is called \"Vulgar Libertarian Watch.\"\n\n\n=== Intellectual property and agriculture ===\nCarson has been highly critical of intellectual property. In 2014, he wrote a piece for CounterPunch drawing attention to the fact that the Pennsylvania Department of Agriculture was investigating the Pennsylvania Seed Library for 'Agri-terrorism'. The department was considering whether the library's seed saving practices violate the Seed Act 2004. (In 2016 the department decided that seed libraries and non-commercial seed exchanges are not subject to the requirements of the Seed Act.)\n\n\n== Criticisms ==\nEconomist and anarcho-capitalist Walter Block has characterized Carson as a Marxist, for his embrace of labor value exploitation theory, and argued that Carson's philosophy is full of errors, mostly due to his acceptance of the labor theory of value. Block has commented that \"for someone in this day and age to even take this doctrine seriously, let alone actually try to defend it, is equivalent to making a similarly widely and properly rejected position vis à vis the flat earth, or the phlogiston theory. It is, in a word, medieval.\" Carson alleges that Block misrepresents many of his views and probably did not actually read his book.\nAuburn University professor and Center for a Stateless Society Senior Fellow Roderick T. Long has criticized Carson's claim that full private property rights do not stem from the concept of self-ownership, and presents an argument that if one accepts self-ownership, as Carson does, then non-Lockean proviso homesteading rights must be accepted. However, Long has accepted the concept of public property as valid and written that communities may acquire land \"by collectively homesteading,\" which could \"[provide] a basis for No-Proviso Lockeans to recognize as legitimate the property arrangements of Mutualist, Georgist, and Proviso-Lockean communities.\"\nIn 2012, Deric Shannon wrote that while he agreed with Carson's criticism of the state violence used to enforce capitalism, he felt that Carson's solution - to eliminate the state - would not bring about a society free of all forms of oppression.\n\n\n== Publications ==\nCarson has published several books and produced articles for a range of publications including The Freeman: Ideas on Liberty, CounterPunch, Land&Liberty, Just Things and The Ecologist. His writings have also appeared on the web at The Art of the Possible, P2P Foundation blog and AntiWar.Com. The Anarchist FAQ has cited his work on political economy. The primary focus of his most recent work has been decentralized manufacturing and the informal and household economies.\n\n\n=== Selected works ===\nThe Iron Fist behind the Invisible Hand, (2001)homepage\nAustrian and Marxist Theories of Monopoly-Capital, (2004)homepage\nContract Feudalism, (2006)\nStudies in Mutualist Political Economy, (2007) - includes theoretical sections attempting to integrate marginalist critiques into the labor theory of value. The book was the subject of a symposium in the Journal of Libertarian Studies. homepage\nOrganization Theory: A Libertarian Perspective, (2008) homepage\nThe Ethics of Labor Struggle, (2008)\nThe Great Domain of Cost-Plus: The Waste Production Economy, (2010) pdf\nThe Homebrew Industrial Revolution, (2010) homepage\nThe Desktop Regulatory State, (2016) homepage\n\n\n== See also ==\n\nAnarchism in the United States\nAnarchist economics\nCost the limit of price\nPost-scarcity economics\nProsumer\nLeft-wing market anarchism\n\n\n== References ==\n\n\n== External links ==\nKevin Carson on Twitter \nMutualist Blog: Free Market Anti-Capitalism by Kevin Carson\nMove over Karl, Anarchism Is Back! (Review of Studies in Mutualist Political Economy) at the Wayback Machine (archived December 31, 2007) by Larry Gambone\nJournal of Libertarian Studies Vol. 20 Num. 1. This issue is devoted to Mutualist political economy. It includes critiques and Carson's rejoinders.\nCenter for a Stateless Society\nKevin Carson Interview\nKevin Carson at Goodreads", "ns": 0, "pageid": 2410846, "title": "Kevin Carson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}