{"batchcomplete": "", "query": {"normalized": [{"to": "Kit Fine", "from": "Kit_Fine"}], "pages": {"3853559": {"extract": "Kit Fine (born 26 March 1946) is a Silver Professor of Philosophy and Mathematics at New York University in the NYU Department of Philosophy. He previously taught for several years at the University of Michigan and at UCLA. The author of several books and dozens of articles in international academic journals, he has made notable contributions to the fields of philosophical logic, metaphysics, and the philosophy of language and also has written on ancient philosophy, in particular on Aristotle's account of logic and modality.\nHe is also a Distinguished Research Professor in the Department of Philosophy, University of Birmingham, UK.\n\n\n== Life and writings ==\nAfter graduating from the University of Oxford (B.A., 1967) Fine received his Ph.D. from the University of Warwick in 1969, under the supervision of A. N. Prior. He was elected a Corresponding Fellow of the British Academy in 2005 and a Fellow of the American Academy of Arts & Sciences in 2006. He has held fellowships from the John Simon Guggenheim Memorial Foundation and the American Council of Learned Societies and is a former editor of the Journal of Symbolic Logic. In addition to his primary areas of research, he has written papers in ancient philosophy, linguistics, computer science, and economic theory.\nFine has described his general approach to philosophy as follows: \"I’m firmly of the opinion that real progress in philosophy can only come from taking common sense seriously. A departure from common sense is usually an indication that a mistake has been made.\"\nFine has two daughters from his former marriage to Anne Fine. Anne Fine is an author of children's books; Cordelia Fine teaches at a university in Australia; Ione Fine is a professor at the University of Washington.\n\n\n== Bibliography ==\nSemantic Relationism. Blackwell, 2007. ISBN 978-1-4051-0844-7\nModality and Tense: Philosophical Papers. Oxford University Press, 2005. ISBN 0-19-927871-7\nThe Limits of Abstraction. Oxford University Press, 2002. ISBN 0-19-924618-1\nReasoning With Arbitrary Objects. Blackwell, 1986. ISBN 0-631-13844-7\nWorlds, Times, and Selves (with A. N. Prior). University of Massachusetts Press, 1977. ISBN 0-87023-227-4\n\n\n== Notes ==\n\n\n== References ==\nSilver Dialogues: Kit Fine\nKit Fine's CV (2004)\n\n\n== External links ==\nFine's web page at New York University.\nFine's web page at University of Birmingham.\nAnnotated Bibliography of Kit Fine's Writings (1970-2016).\nKit Fine. Annotated Bibliography of the Studies on His Philosophy.\nInterview with 3AM Magazine", "ns": 0, "pageid": 3853559, "title": "Kit Fine"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}