{"batchcomplete": "", "query": {"normalized": [{"to": "L.A. Paul", "from": "L.A._Paul"}], "pages": {"37446136": {"extract": "Laurie Ann (L.A.) Paul is a professor of philosophy at the University of North Carolina at Chapel Hill, having previously taught at Yale University and the University of Arizona. She is best known for her research on the counterfactual analysis of causation and the concept of \"transformative experience.\"\n\n\n== Biography and career ==\nPaul graduated from Antioch College in Yellow Springs, Ohio in 1990 with a B.A. in chemistry. Before going to graduate school, Paul corresponded with a number of philosophers about their work, including Nancy Cartwright and Lynne Rudder Baker. In 1999, Paul graduated from Princeton University with a Ph.D in philosophy, where she wrote a dissertation titled Essays on Causation  under the supervision of David Lewis.\nPaul taught at Yale University from 1999 to 2001, and at the University of Arizona from 2001 until 2008, before moving to North Carolina. She has also held appointments at the Australian National University and at the University of St. Andrews.\nShe is married to the sociologist and blogger Kieran Healy.\n\n\n== Philosophical work ==\nPaul's principal research interests are in metaphysics and the philosophy of mind. Her work focuses on causation, mereology, the philosophy of time, and related topics in phenomenology, the philosophy of science, and philosophy of language. Her work in ontology and mereology develops a distinctive view of objects as fusions of property instances. Her article \"What You Can't Expect When You're Expecting\" develops the notion of transformative experience and explores its consequences for the possibility of rational decision-making.\nShe has written more than twenty articles, and is the editor of Causation and Counterfactuals, co-author of Causation: A User's Guide, and author of Transformative Experience.\n\n\n== Awards ==\nPaul has received the following awards:\nA grant from the John Templeton Foundation to study religious and transformative experience.http://news.nd.edu/news/49074-notre-dame-and-unc-chapel-hill-philosophers-to-examine-religious-and-transformative-experiences/\nA Guggenheim Fellowship (2014).\nAn NHC Fellowship (2011-2012) from the National Humanities Center.\nAn Institute for Advanced Study Research Fellowship at the Australian National University.\n\n\n== Selected works ==\n\"What You Can't Expect When You're Expecting\". Res Philosophica. 92 (2): 1–23. doi:10.11612/resphil.2015.92.2.1. \n2014. Transformative Experience. Oxford University Press, ISBN\n2013. Causation: A User's Guide. Oxford University Press, ISBN 978-0-19-967345-2.\n2010. \"Temporal Experience\". The Journal of Philosophy CVII (7) 333-359. Reprinted in The Future of the Philosophy of Time, edited by Adrian Bardon. New York: Routledge (2012).\n2010. \"The Counterfactual Analysis of Causation\". In The Oxford Handbook on Causation, edited by Helen Beebee, Christopher Hitchcock and Peter Menzies Oxford University Press, ISBN 978-0199279739.\n2006. \"Coincidence as Overlap\". Noûs, 40: 623-649.\n2004. Causation and Counterfactuals. Co-edited with Ned Hall and John Collins. MIT Press, ISBN 978-0-26253-2563.\n2002. \"Logical Parts\". Noûs, 36: 578-596. Reprinted in Metaphysics volume v, edited by Michael Rea. Routlege 2008, ISBN 978-0-415-39751-3.\n\n\n== Notes ==\n\n\n== External links ==\nL.A. Paul's Homepage\nL.A. Paul's Homepage at UNC Chapel Hill\nConversation on Causation and Counterfactuals with Ned Hall on Philosophy TV\nInterview on the radio show \"Philosophy Talk\" with Ken Taylor and John Perry", "ns": 0, "pageid": 37446136, "title": "L.A. Paul"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}