{"batchcomplete": "", "query": {"normalized": [{"to": "Leonard Read", "from": "Leonard_Read"}], "pages": {"937171": {"extract": "Leonard Edward Read (September 26, 1898 – May 14, 1983) was the founder of the Foundation for Economic Education (FEE), which was one of the first modern libertarian institutions of its kind in the United States. He wrote 29 books and numerous essays, including the well-known \"I, Pencil\" (1958).\n\n\n== Business career ==\nAfter a stint in the United States Army Air Service during World War I, Read started a grocery wholesale business in Ann Arbor, Michigan, which was initially successful but eventually went out of business. He moved to California where he started a new career in the tiny Burlingame Chamber of Commerce near San Francisco. Read gradually moved up the hierarchy of the United States Chamber of Commerce, finally becoming general manager of the Los Angeles branch, America's largest, in 1939.\n\n\n== Libertarian activism ==\nDuring this period his views became progressively more libertarian. Apparently, it was in 1933, during a meeting with William C. Mullendore, the executive vice president of Southern California Edison, that Read was finally convinced that the New Deal was completely inefficient and morally bankrupt. Read was also profoundly influenced by his religious beliefs. His pastor, Reverend James W. Fifield, was minister of the 4,000-member First Congregational Church of Los Angeles, of which Read was also a board member. Fifield ran a \"resistance movement\" against the \"social gospel\" of the New Deal, trying to convince ministers across the country to adopt libertarian \"spiritual ideals.\" During the period when he worked for the Chamber of Commerce, Read was also deeply influenced by more secular figures, such as Albert Jay Nock, and, later, by Ayn Rand and the economists Ludwig von Mises and Henry Hazlitt.\nIn 1945, Virgil Jordan, the President of the National Industrial Conference Board (NICB) in New York, invited Read to become its executive vice president. Read realized he would have to leave the NICB to pursue full-time the promotion of free market, limited government principles. He resigned as a result.\nOne donor from his short time at NICB, David M. Goodrich, encouraged Read to start his own organization. With Goodrich's aid, as well as financial aid from the William Volker Fund and from Harold Luhnow, Read and Hazlitt founded the Foundation for Economic Education in 1946, which, in turn, helped to inspire Friedrich Hayek to form the Mont Pelerin Society the following year. For a period in the 1940s, philosopher Ayn Rand was an important adviser, or \"ghost,\" as they called it, to Read.\nIn 1950, Read joined the board of directors for the newly founded periodical The Freeman, a free market magazine that was a forerunner of the conservative National Review, to which Read was also a contributor. In 1954, Read arranged for the struggling magazine to be transferred to a for-profit company owned by FEE. In 1956, FEE assumed direct control of the magazine, turning it into a non-profit outreach tool for the foundation.\nRead received an Honorary Doctoral Degree at Universidad Francisco Marroquín in 1976. He continued to work with FEE until his death in 1983.\n\n\n== Works ==\nRead authored 29 books, some of which are still in print and sold by FEE.\nRomance of Reality (New York: Dodd, Mead & Co., Inc., 1937) [1]\nI'd Push the Button (New York: Joseph D. McGuire, 1946) [2]\nPattern for Revolt (1948) [3]\nStudents of Liberty (FEE, 1950) [4]\nOutlook for Freedom (1951) [5]\nGovernment – an Ideal Concept (FEE, 1954; 2nd edition 1997) ISBN 1-57246-061-X [6]\n\"I, Pencil\" (FEE, 1958 & 2008) [7]\nWhy Not Try Freedom? (FEE, 1958) [8]\nElements of Libertarian Leadership (FEE, 1962) [9]\nAnything That's Peaceful: The Case for the Free Market (FEE, 1964; revised edition 1992; 2nd edition 1998) ISBN 1-57246-079-2 [10]\nThe Free Market and Its Enemy (FEE, 1965) [11]\nDeeper Than You Think (FEE, 1967) [12]\nWhere Lies This Fault? (FEE, 1967) [13]\nAccent on the Right (FEE, 1968) [14]\nThe Coming Aristocracy (FEE, 1969) [15]\nLet Freedom Reign (FEE, 1969) [16]\nTalking To Myself (FEE, 1970) [17]\nThen Truth Will Out (FEE, 1971) [18]\nTo Free or Freeze, That is the Question (FEE, 1972) [19]\nInstead of Violence (FEE, 1973) [20]\nWho's Listening (FEE, 1973) [21]\nFree Man's Almanac (FEE, 1974)\nHaving My Way (FEE, 1974) [22]\nCastles in the Air (FEE, 1975) ISBN 0-910614-52-0 [23]\nThe Love of Liberty (FEE, 1975)\nComes the Dawn (FEE, 1976) [24]\nAwake for Freedom's Sake (FEE, 1977) [25]\nVision (FEE, 1978) [26]\nLiberty: Legacy of Truth (FEE, 1978) [27]\nThe Freedom Freeway (FEE, 1979) [28]\nSeeds of Progress (FEE, 1980) [29]\nThoughts Rule the World (FEE, 1981) [30]\nHow Do We Know (FEE, 1981) [31]\nThe Path of Duty (FEE, 1982) [32]\nClichés of Socialism (FEE, various)\n\n\n== See also ==\nClassical liberalism\nLaissez-faire\n\n\n== Notes ==\n\n\n== References ==\nBoudreaux, Donald; Slepko, Nick (2008). \"Read, Leonard E. (1898–1983)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 416–8. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \nGreaves, Bettina Bien (September 1998), \"Leonard E. Read, Crusader\", The Freeman, 48 (9) \nHornberger, Jacob G. (September 1991). \"The Legacy of Leonard E. Read\". The Future of Freedom Foundation. \nSennholz, Mary (May 1996), \"Leonard Read, the Founder and Builder\", The Freeman, 46 (5) \n\n\n== External links ==\nBooks by Leonard Read at the Mises Institute.\nFoundation for Economic Education\nHonoris Causa Doctaral degrees at University Francisco Marroquín\nLeonard Read at Goodreads", "ns": 0, "pageid": 937171, "title": "Leonard Read"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}