{"batchcomplete": "", "query": {"normalized": [{"to": "Leon Henkin", "from": "Leon_Henkin"}], "pages": {"356165": {"extract": "Leon Albert Henkin (April 19, 1921, Brooklyn, New York – November 1, 2006, Oakland, California) was a logician at the University of California, Berkeley. He was principally known for the \"Henkin's completeness proof\": his version of the proof of the semantic completeness of standard systems of first-order logic.\n\n\n== The completeness proof ==\nHenkin's result was not novel; it had first been proved by Kurt Gödel in his doctoral dissertation, which was completed in 1929. (See Gödel's completeness theorem. Gödel published a version of the proof in 1930.) Henkin's 1949 proof is much easier to survey than Gödel's and has thus become the standard choice of completeness proof for presentation in introductory classes and texts.\nThe proof is non-constructive, i.e. it is a pure existence proof. While it guarantees that if a sentence α follows (semantically) from a set of sentences Σ, then there is a proof of α from Σ, it gives no indication of the nature of that proof. Henkin originally proved the completeness of Church's higher-order logic, and then observed that the same methods of proof could be applied to first-order logic.\nHis proof for higher-order logic uses a variant of the standard semantics. This variant uses general models (models in general or Henkin semantics; models in Henkin semantics are not to be confused with Henkin models, which are models in classical first-order logic): the higher types need not be interpreted by the full space of functions; a subset of the function space may be used instead.\n\n\n== Early life ==\nHenkin was born in Brooklyn, into a Russian Jewish immigrant family. His father expressed his high expectations for him by giving him the middle name \"Albert\"; at the time, the New York Times ran a series of articles on Albert Einstein's theory of relativity.\nHowever, Henkin did not use his middle name in his mathematical publications. His first degree was in mathematics and philosophy from Columbia College, in 1941. He later worked in the Signal Corps Radar Laboratory, Belmar, New Jersey. As participant in the Manhattan project, he worked on isotope diffusion, in New York, and Oak Ridge, Tennessee.\n\n\n== Academic career ==\nHe was a doctoral student of Alonzo Church at Princeton University, receiving his Ph.D. in 1947. He became Professor of Mathematics at the University of California, Berkeley, where he had a position from 1953. He received the 1964 Chauvenet Prize for exposition. He was a collaborator of Alfred Tarski, and an ally in promoting logic.\nHenkin was also a social activist who since the 1960s worked to increase higher education opportunities for women and minorities. In 1964 he spearheaded the formation of the Special Scholarships Committee at UC Berkeley, which resulted in setting up Special Opportunity Scholarships and other outreach programs at Berkeley. The Berkeley program served as a model for the federal Upward Bound Program that was founded several years later and for many outreach and special opportunities programs at other U.S. universities.\n\n\n== Awards received ==\n1964 — The Chauvenet Prize, Mathematical Association of America award to the author of an outstanding expository article on a mathematical topic by a member of the Association.\n1972 — Lester R. Ford Award — for Mathematical foundations for mathematics, American Mathematical Monthly 78 (1971), 463–487.\n1990 — First recipient of the Gung and Hu Award for Distinguished Service to Mathematics.\n1991 — Berkeley Citation — the highest honor/award bestowed by the University of California.\n2000 — Leon Henkin Citation — for Distinguished Service, which is presented to a (UC) faculty member for \"exceptional commitment to the educational development of students from groups who are underrepresented in the academy.\"\n\n\n== See also ==\nBranching quantifier\n\n\n== References ==\n\n\n== Further reading ==\nG. Weaver (2001), \"Henkin construction\", in Hazewinkel, Michiel, Encyclopedia of Mathematics, Springer, ISBN 978-1-55608-010-4 \nGeorge Weaver (1997). Henkin-Keisler models. Springer. ISBN 978-0-7923-4366-0. \nHenkin, Leon. 1949. \"The Completeness of the First-Order Functional Calculus\", Journal of Symbolic Logic. 14: 159–166.\nHenkin, Leon. 1950. \"Completeness in the theory of types\", Journal of Symbolic Logic 15: 81–91.\n\n\n== External links ==\nLeon Henkin at the Mathematics Genealogy Project\nBerkeley Citation Award\nAn interview with Henkin and others about their experiences at Princeton\nAn interview with Henkin about his experience at Princeton\nLeon Henkin, advocate for diversity in math & science, has died by Robert Sanders, UC Berkeley News press release, November 9, 2006.\nObituaries: Leon Henkin, 85: professor steered minorities and women to math by Valerie J. Nelson, Los Angeles Times, November 16, 2006, p. B-6.\nLeon A. Henkin—Cal math educator by Rick DelVecchio, San Francisco Chronicle, November 20, 2006, p. B-3.\nIn Memoriam: Leon Albert Henkin by John Addison, William Craig, Carolyn Kane, and Alan Schoenfeld (University of California Academic Senate memorial).\nIn Memoriam: Leon Albert Henkin, 1921–2006 by J. Donald Monk, The Bulletin of Symbolic Logic, vol. 15, no. 3 (Sept. 2009), pp. 326–331.", "ns": 0, "pageid": 356165, "title": "Leon Henkin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}