{"batchcomplete": "", "query": {"normalized": [{"to": "Leonard Peikoff", "from": "Leonard_Peikoff"}], "pages": {"274095": {"extract": "Leonard Sylvan Peikoff (/ˈpiːkɑːf/; born October 15, 1933) is a Canadian-American philosopher. A former professor of philosophy, he was designated by the philosopher Ayn Rand as heir to her estate. He is an author, a leading advocate of Objectivism, and the founder of the Ayn Rand Institute (ARI). For several years, he hosted a nationally syndicated radio talk show.\n\n\n== Early life and career ==\nPeikoff was born in Winnipeg, Manitoba, Canada, to Samuel Peikoff, MD, a surgeon, and his wife Bessie, a band leader. He attended the University of Manitoba from 1950 to 1953 as a pre-med student, but following his early discussions with Rand, he transferred to New York University to study philosophy, where he received his BA, MA and PhD degrees in philosophy in 1954, 1957 and 1964, respectively. His doctoral dissertation adviser was the noted American pragmatist philosopher Sidney Hook, and his dissertation dealt with the metaphysical status of the Law of Non-Contradiction. He taught philosophy for many years at various colleges.\n\n\n== Early involvement in Objectivism ==\nPeikoff first met Ayn Rand through his cousin Barbara Branden (then Barbara Weidman) in California when he was 17. He reports that this meeting with Rand made him aware of the profound importance of philosophy. When Rand moved to New York City in 1951, Peikoff decided to study philosophy at New York University. While studying at NYU, he frequently discussed philosophy privately with Rand in depth across a range of issues.\nPeikoff, along with Nathaniel Branden, Alan Greenspan, Barbara Branden, and a number of other close associates, who jokingly called themselves \"The Collective,\" met frequently with Rand to discuss philosophy and politics, as well as to read and discuss Rand's forthcoming novel, Atlas Shrugged, in her Manhattan apartment. In 1958 Branden founded the Nathaniel Branden Institute to promote Objectivism through lectures and educational seminars around the United States. Among its first lecturers were Peikoff and Greenspan. NBI soon had representatives all over the U.S. and around the world.\nIn biographical interviews of Rand recorded in the early 1960s by Barbara Branden, Rand stated that it was her discussions with Peikoff and Allan Gotthelf which motivated her to complete an extended monograph on concept-formation, Introduction to Objectivist Epistemology. Rand would later include Peikoff's essay on the \"analytic-synthetic dichotomy\" in the first hardcover edition of the work in book form. Peikoff was also an active participant in Rand's 1969–71 \"Workshops\" on the monograph, along with a number of other professional philosophers, as well as subsequent, smaller philosophy workshops at Rand's apartment.\nFollowing the dissolution of NBI in 1968, Peikoff continued to give private lecture courses on a variety of topics to large Objectivist audiences, and recordings of these have been sold for many years. His lecture courses include: The History of Philosophy (in two \"volumes\" of lectures), An Introduction to Logic, The Art of Thinking, Induction in Physics and Philosophy, Moral Virtue, A Philosophy of Education, Understanding Objectivism, The Principles of Objective Communication and Eight Great Plays. Rand endorsed his 1976 lecture series on Objectivism as the best exposition of her philosophy, the only one she knew to be accurate.\nPeikoff's first book, The Ominous Parallels, was both an Objectivist explanation of the rise of the Third Reich and the Holocaust, and a warning that America was being led down the road to totalitarianism because of far-reaching philosophical and cultural parallels between Weimar Germany and the present-day United States. In her \"Introduction,\" Rand declared it to be the first book by an Objectivist philosopher other than herself.\n\n\n== After Rand's death ==\nRand named Peikoff the legal heir to her estate. As the executor of Rand's will, Peikoff handles the copyrights to all of her works (with the exception of Anthem, which has passed into the public domain). He has supervised the editing and release of Rand's unpublished works in several volumes, including her letters, philosophical journals, and the fiction not published in her lifetime, and he has written forewords for all the current printings of her fiction. For several years, he continued Rand's tradition of lecturing annually at Boston's Ford Hall Forum, and his other lecture appearances have included an address to the cadets at West Point and another while cruising the Greek islands.\nIn 1985, Peikoff founded the Ayn Rand Institute. Peikoff revised his 1976 lecture course on Rand's ideas into book form as Objectivism: The Philosophy of Ayn Rand, published in 1991, the first comprehensive presentation of Objectivism. In the mid-1990s, Peikoff taught courses at the Ayn Rand Institute's Objectivist Graduate Center (which was later renamed the Objectivist Academic Center in 2000) along with Harry Binswanger and Peter Schwartz.\nFrom 1995 through 1999, Peikoff hosted a nationally syndicated talk radio show focusing on philosophy and culture, leaving it to work on his next book. From February 2006 to June 2007, Peikoff posted an online Q and A of various questions relating to Objectivism that had been e-mailed to him, updating with a few more answers approximately every month. In August 2007 his website announced that this would be replaced with a podcast, which debuted on October 22, 2007, and has been released regularly ever since.\nPeikoff's lectures or books have been utilized extensively in the works of Allan Gotthelf, Harry Binswanger, Andrew Bernstein and Tara Smith, writers who are associated with the Ayn Rand Institute, and also in works such as David Kelley's The Evidence of the Senses, George H. Smith's Atheism: The Case Against God, and the treatise, What Art Is: the Esthetic Theory of Ayn Rand by Louis Torres and Michelle Marder Kahmi, despite these authors' other differences with him.\nPeikoff's 1983 lecture course Understanding Objectivism was edited into a book of the same title by Michael Berliner, editor of the Letters of Ayn Rand, and Peikoff's theory of logical induction, first presented in the lecture courses Induction in Physics and Philosophy and Objectivism Through Induction, has been developed further by David Harriman in his book, The Logical Leap: Induction in Physics.\nIn his 2012 book The DIM Hypothesis, Peikoff defines the three approaches to cognitive integration—disintegration, integration, and misintegration—and applies the hypothesis to physics, philosophy, education, politics, and other fields.\nHis articles have appeared in publications as diverse as Barron's and The New Scholasticism, and his television appearances have ranged from Bill Maher's Politically Incorrect and Bill O'Reilly's The O'Reilly Factor to C-SPAN panel discussions. He also appears in Ayn Rand: A Sense of Life, the Academy Award nominated documentary by Michael Paxton.\n\n\n=== Split with David Kelley ===\nPeikoff views Objectivism as a \"closed system\" that consists solely of the philosophical principles Rand herself had articulated, and he considers disagreement with any of these principles a departure from Objectivism. The Ayn Rand Institute (ARI) promotes Peikoff's view of Objectivism.\nThe closed vs. open issue came to the fore when David Kelley, a philosopher then affiliated with Peikoff and ARI, published his essay \"A Question of Sanction,\" arguing for greater open-mindedness in working with other groups. Kelley sees Objectivism as an \"open system\" that can evolve beyond Rand's own writings and beliefs. Peikoff presented his objections to Kelley in an article called \"Fact and Value,\" arguing that Kelley's case itself contradicted Rand's understanding of the relationship between cognition and evaluation, facts and moral values. Peikoff concluded that Kelley was not a genuine Objectivist, and urged anyone agreeing with Kelley to leave the Objectivist movement. Ultimately, Kelley responded by founding the Institute for Objectivist Studies in 1990, which later changed its name to The Objectivist Center and finally The Atlas Society. (For more on the Peikoff-Kelley split, see Objectivist Movement#The Peikoff-Kelley split.)\n\n\n=== Library of Congress dispute ===\nPeikoff inherited many of Rand's manuscripts. During her lifetime, Rand had made a statement that she would bequeath her manuscripts to the Library of Congress. She later had reservations, and the bequest was not part of Rand's will. However, after her death, the Library of Congress requested the manuscripts. In July 1991, Peikoff had an assistant deliver the manuscripts of Rand's novels, except for the first and last pages of The Fountainhead, which he had framed. In their stead, he had the pages photocopied so that the manuscripts would be \"complete.\"\nOn August 16, 1998, the Los Angeles Times published an article about Peikoff, including a joke he had made to the reporter about \"stealing\" the framed pages from the Library of Congress. The Library of Congress contacted Peikoff and demanded that he deliver the pages to them, deeming them to be U. S. government property. A complaint from the U.S. Department of Justice followed in October 2000, claiming over a million dollars in damages unless Peikoff turned over the pages. Peikoff consulted his lawyer, who advised him that the case could go either way if he went to court. Based on this advice, Peikoff released the pages to a representative of the Library of Congress.\n\n\n== Thought ==\n\n\n=== Epistemology ===\nIn his book The Logical Leap: Induction in Physics (which he co-wrote with physicist David Harriman), Peikoff argues that there is no problem of induction, because all philosophy is itself an inductive science and, therefore, that any attempt to deny the validity of induction contradicts itself by implicitly accepting the validity of induction. Peikoff and Harriman also argue that scientific claims verified by induction should be considered true until new evidence warrants modifying or amending them because scientific knowledge derived from induction is contextual. In other words, those who on the basis of conclusive evidence make inductive scientific claims regarding science cannot argue that their claims are subject to no possible modification, but can argue that they are the only rational claims that can be believed based on the available evidence. They conclude that the same process of induction is essential to every rational field (except mathematics) and that, as a result, truth in any such field possesses the same objectivity as that of physics.\n\n\n=== Politics ===\nPeikoff supports laissez-faire capitalism, arguing that the role of government in society should be limited to minarchist conceptions of protecting individuals from the initiation of force and fraud. He opposes taxation, public education, welfare, business regulations, etc. He also opposes laws regulating pornography, euthanasia, stem cell research, etc. He is a supporter of abortion rights but criticizes defenders of abortion who label themselves \"pro-choice\", arguing that the term ignores the deeper philosophical issues involved. He believes that circumcision of a child too young to consent should be a crime and is evil.\nHe also continues Rand's opposition to libertarianism, remaining sharply opposed to any description of Objectivist political philosophy as \"libertarian\" and to any collaboration with most libertarian groups. He has been critical of American foreign policy, including both neoconservative and libertarian views as self-sacrificial. He objects to the terms \"isolationist\" or \"interventionist\" to describe his foreign policy views, stating that the only \"intervention\" the United States should enact is war and \"only and when it is in self-defense.\"\nPeikoff is known for campaigning on behalf of Elián González's right to remain in Florida, rather than returning to his father in Cuba, stating that \"To send a child to rot in the prison of Cuba for the alleged sake of his own well-being is criminal hypocrisy. To send him there in order to preserve his father's rights is absurdity, since there are no parental or other rights in Cuba. To send him there because 'He needs a father, no matter what' is a mindless bromide. Does he need a father who has no choice but to watch his son being broken in mind and starved in body?\"\nPeikoff claims that Palestinian people prior to the establishment of the State of Israel consisted solely of \"nomadic tribes meandering across the terrain,\" and that \"the Arabs\" today have no concept of property rights; indeed, that their \"primitivist\" antagonism to such rights is the root cause of Arab terrorism. He argues that Israel is a moral beacon which should not return any territory to Arabs or even negotiate with them. Peikoff notes that oil properties developed by western interests were confiscated by Middle Eastern regimes beginning with Iran in 1951. He advocates bringing an end to \"terrorist states,\" especially Iran, \"as quickly as possible and with the fewest U.S. casualties, regardless of the countless innocents caught in the line of fire,\" not ruling out the use of nuclear weapons, arguing that moral responsibility for innocent deaths would lie with their governments rather than the United States.\nIn April 1992, Peikoff endorsed “any Democrat nominated by his party for the Presidency”, citing President George H. W. Bush’s “truly disgraceful” record, specifically tax hikes, support for new employee protections, his foreign trade policy, foreign aid to Russia, alleged hostility to Israel, the Gulf War, anti-abortion and anti-obscenity views, and alleged failure to defend Salman Rushdie’s freedom of speech during the Satanic Verses controversy.\nIn 2004 Peikoff endorsed John Kerry (despite thinking of Kerry as a \"disgustingly bad\" candidate) against George W. Bush (whom he called \"apocalyptically bad\"), on the basis of Bush's religiosity and his refusal to crush Islamic regimes, especially Iran, along with his \"doomed\" economic policies. In advance of the 2006 elections, Peikoff recommended voting only for Democrats, to forestall what he sees is a rise in influence of the religious right, adding:\n\nGiven the choice between a rotten, enfeebled, despairing killer [Democrats], and a rotten, ever stronger, and ambitious killer [Republicans], it is immoral to vote for the latter, and equally immoral to refrain from voting at all because \"both are bad.\"\n\nOf the 2008 presidential election, Peikoff said, \"I wouldn't dream of voting\", saying that the Republicans should be \"wiped out\" or \"severely punished\" for their association with the religious right. Furthermore, he characterized Barack Obama as \"anti-American\" and a \"lying phoney\" with troubling connections to both Islam and Reverend Jeremiah Wright. He labelled Obama's running mate Joe Biden an \"enjoyably hilarious windbag\", and their Republican opponents John McCain and Sarah Palin as a \"tired moron\" and an \"opportunist\" respectively.\nIn a 2010 podcast, Peikoff explained why he supports immigration restrictions in the current context of the welfare state, and why he does not see this as a contradiction to Objectivism's general rejection of immigration restrictions. Also, in a 2010 podcast, Peikoff explained that he does not support the building of a mosque near Ground Zero in New York City, arguing that property rights are always contextual and that preventing the construction is a wartime necessity. Similarly, he supported the French ban on the burqa.\nIn September 2012, Peikoff endorsed Mitt Romney for the Presidency, citing President Obama’s alleged nihilism, taxation, economic and energy policy, ObamaCare, and his use of executive orders. However, Peikoff was not enthusiastic in his endorsement of Romney, calling him an “appeasing, directionless” candidate with “no political convictions” who would be useful for buying time. For the same reason, he endorsed the Republican Congressional nominees. Afterwards, he called Obama’s re-election a “catastrophe”, “the worst political event ever to occur in the history of this continent” and “worse than the Civil War”.\n\n\n== Personal life ==\nPeikoff resides in Irvine, in Orange County, California, which is also home to the Ayn Rand Institute.\nBy his second wife, Cynthia, Peikoff has a daughter, Kira, a novelist.\n\n\n== Books ==\n\nThe Ominous Parallels (1982) ISBN 0-452-01117-5\nThe Early Ayn Rand (edit. and introductory essays by Peikoff) (1984) ISBN 0-453-00465-2\nThe Voice of Reason: Essays in Objectivist Thought (edit. and additional essays by Peikoff) (1989) ISBN 0-453-00634-5\nIntroduction to Objectivist Epistemology (expanded second edition) (with Harry Binswanger, PhD, editor) (1990) ISBN 0-453-00724-4\nObjectivism: The Philosophy of Ayn Rand (1991) ISBN 0-452-01101-9\nThe Ayn Rand Reader (with Gary Hull, PhD, editor) (1999) ISBN 0-452-28040-0\nUnderstanding Objectivism: A Guide to Learning Ayn Rand's Philosophy (Michael Berliner, PhD, editor) (2012) ISBN 0-451-23629-7\nThe DIM Hypothesis: Why the Lights of the West Are Going Out (2012) ISBN 0-451-46664-0\nObjectivist Communication: Writing, Speaking and Arguing (2013) ISBN 0-451-41815-8\nTeaching Johnny to Think (2014) ISBN 0-979-46616-4\nThe Cause of Hitler's Germany (2014) ISBN 0-142-18147-1\n\n\n== See also ==\nAmerican philosophy\nEthical egoism\nFree market\nObjectivism and libertarianism\nList of American philosophers\nOntology\nPhilosophical realism\nPhilosophy of history\nRational egoism\n\n\n== References ==\n\n\n== External links ==\nLeonard Peikoff's Official Home Page\nThe Philosophy of Objectivism Peikoff's summary of Objectivism\nEnd States That Sponsor Terrorism Originally published as a full-page advertisement in the New York Times\nPeikoff On Abortion 7 minute audio of Peikoff on abortion\nPeikoff Lecture A Peikoff lecture (audio/video) titled \"Americans Versus America\" presented at WGBH Forum\nUnofficial Index to Peikoff's Podcasts\nAppearances on C-SPAN", "ns": 0, "pageid": 274095, "title": "Leonard Peikoff"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}