{"batchcomplete": "", "query": {"normalized": [{"to": "Leopold Kronecker", "from": "Leopold_Kronecker"}], "pages": {"318450": {"extract": "Leopold Kronecker (7 December 1823 – 29 December 1891) was a German mathematician who worked on number theory, algebra and logic. He criticized Cantor's work on set theory, and was quoted by Weber (1893) as having said, \"Die ganzen Zahlen hat der liebe Gott gemacht, alles andere ist Menschenwerk\" (\"God made the integers, all else is the work of man.\"). Kronecker was a student and lifelong friend of Ernst Kummer.\n\n\n== Biography ==\nLeopold Kranecker was born on 7 December 1823 in Liegnitz, Prussia (now Legnica, Poland) in a wealthy Jewish family. His parents, Isidor and Johanna (née Prausnitzep), took care of their children's education and provided them with private tutoring at home – Leopold's younger brother Hugo Kronecker would also follow a scientific path, later becoming a notable physiologist. Kronecker then went to the Liegnitz Gymnasium where he was interested in a wide range of topics including science, history and philosophy, while also practicing gymnastics and swimming. At the gymnasium he was taught by Ernst Kummer, who noticed and encouraged the boy's interest in mathematics.\nIn 1841 Kronecker became a student at the University of Berlin where his interest did not immediately focus on mathematics, but rather spread over several subjects including astronomy and philosophy. He spent the summer of 1843 at the University of Bonn studying astronomy and 1843–44 at the University of Breslau following his former teacher Kummer. Back in Berlin, Kronecker studied mathematics with Peter Gustav Lejeune Dirichlet and in 1845 defended his dissertation in algebraic number theory written under Dirichlet's supervision.\nAfter obtaining his degree, Kronecker did not follow his interest in research on an academic career path. He went back to his hometown to manage a large farming estate built up by his mother's uncle, a former banker. In 1848 he married his cousin Fanny Prausnitzer, and the couple had six children. For several years Kronecker focused on business, and although he continued to study mathematics as a hobby and corresponded with Kummer, he published no mathematical results. In 1853 he wrote a memoir on the algebraic solvability of equations extending the work of Évariste Galois on the theory of equations.\n\nDue to his business activity, Kronecker was financially comfortable, and thus he could return to Berlin in 1855 to pursue mathematics as a private scholar. Dirichlet, whose wife Rebecka came from the wealthy Mendelssohn family, had introduced Kronecker to the Berlin elite. He became a close friend of Karl Weierstrass, who had recently joined the university, and his former teacher Kummer who had just taken over Dirichlet's mathematics chair. Over the following years Kronecker published numerous papers resulting from his previous years' independent research. As a result of this published research, he was elected a member of the Berlin Academy in 1861.\nAlthough he held no official university position, Kronecker had the right as a member of the Academy to hold classes at the University of Berlin and he decided to do so, starting in 1862. In 1866, when Riemann died, Kronecker was offered the mathematics chair at the University of Göttingen (previously held by Carl Gauss and Dirichlet), but he refused, preferring to keep his position at the Academy. Only in 1883, when Kummer retired from the University, was Kronecker invited to succeed him and became an ordinary professor. Kronecker was the supervisor of Kurt Hensel, Adolf Kneser, Mathias Lerch, and Franz Mertens, amongst others.\nHis philosophical view of mathematics put him in conflict with several mathematicians over the years, notably straining his relationship with Weierstrass, who almost decided to leave the University in 1888. Kronecker died on 29 December 1891 in Berlin, several months after the death of his wife. In the last year of his life, he converted to Christianity. He is buried in the Alter St Matthäus Kirchhof cemetery in Berlin-Schöneberg, close to Gustav Kirchhoff.\n\n\n== Scientific activity ==\n\n\n=== Mathematics research ===\nAn important part of Kronecker's research focused on number theory and algebra. In an 1853 paper on the theory of equations and Galois theory he formulated the Kronecker–Weber theorem, without however offering a definitive proof (the theorem was proved completely much later by David Hilbert). He also introduced the structure theorem for finitely-generated abelian groups. Kronecker studied elliptic functions and conjectured his \"liebster Jugendtraum\" (\"dearest dream of youth\"), a generalization that was later put forward by Hilbert in a modified form as his twelfth problem. In an 1850 paper, On the Solution of the General Equation of the Fifth Degree, Kronecker solved the quintic equation by applying group theory (though his solution was not in terms of radicals: that was already proven impossible by the Abel–Ruffini theorem).\nIn algebraic number theory Kronecker introduced the theory of divisors as an alternative to Dedekind's theory of ideals, which he did not find acceptable for philosophical reasons. Although the general adoption of Dedekind's approach led Kronecker's theory to be ignored for a long time, his divisors were found useful and were revived by several mathematicians in the 20th century.\nKronecker also contributed to the concept of continuity, reconstructing the form of irrational numbers in real numbers. In analysis, Kronecker rejected the formulation of a continuous, nowhere differentiable function by his colleague, Karl Weierstrass.\nAlso named for Kronecker are the Kronecker limit formula, Kronecker's congruence, Kronecker delta, Kronecker comb, Kronecker symbol, Kronecker product, Kronecker's method for factorizing polynomials, Kronecker substitution, Kronecker's theorem in number theory, Kronecker's lemma, and Eisenstein–Kronecker numbers.\n\n\n=== Philosophy of mathematics ===\nKronecker's finitism made him a forerunner of intuitionism in foundations of mathematics.\n\n\n== Honours ==\nKronecker was elected as a member of several academies:\nPrussian Academy of Sciences (1861)\nFrench Academy of Sciences (1868)\nRoyal Society (1884).\nThe 25624 Kronecker asteroid is named after him.\n\n\n== Publications ==\nKronecker, Leopold (1978) [1901], Vorlesungen über Zahlentheorie, Berlin, New York: Springer-Verlag, ISBN 978-3-540-08277-4, MR 529431 \nKronecker, Leopold (1968) [1895], Hensel, Kurt, ed., Leopold Kronecker's Werke. Bände I–V, New York: Chelsea Publishing Co., MR 0237286 \n\n\n== References ==\n\n\n== Further reading ==\nBell, E. T. (1986). Men of Mathematics. New York: Simon and Schuster. \nEdwards, Harold (1987). \"An Appreciation of Kronecker\". Mathematical Intelligencer. 9 (1): 28–35. \nEdwards, Harold (1989). \"Kronecker's Views on the Foundations of Mathematics\". In Rowe, D. E.; McCleary, J. The History of Modern Mathematics. 1. Academic Press. pp. 67–78. \nDavis, Martin (2001). Engines of Logic Mathematicians and the Origin of the Computer. W. W. Norton & Company. ISBN 978-0-393-32229-3. \nJean Van Heijenoort (1977). From Frege to Gödel A Source Book in Mathematical Logic, 1879–1931. Harvard University Press. ISBN 978-0-674-32449-7. \n1887. \"On the concept of number\" in Ewald, William B., ed., 1996. From Kant to Hilbert: A Source Book in the Foundations of Mathematics, 2 vols. Oxford Uni. Press: 947–55.\nO'Connor, John J.; Robertson, Edmund F., \"Leopold Kronecker\", MacTutor History of Mathematics archive, University of St Andrews .\nWeber, H. (1893), \"Leopold Kronecker\", Mathematische Annalen, Springer Berlin / Heidelberg, 43: 1–25, doi:10.1007/BF01446613, ISSN 0025-5831 \n\n\n== External links ==\nLeopold Kronecker at the Mathematics Genealogy Project", "ns": 0, "pageid": 318450, "title": "Leopold Kronecker"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}