{"batchcomplete": "", "query": {"normalized": [{"to": "Leopold Löwenheim", "from": "Leopold_Löwenheim"}], "pages": {"755668": {"extract": "Leopold Löwenheim (26 June 1878 in Krefeld – 5 May 1957 in Berlin) was a German mathematician, known for his work in mathematical logic. The Nazi regime forced him to retire because under the Nuremberg Laws he was considered only three quarters Aryan. In 1943 much of his work was destroyed during a bombing raid on Berlin. Nevertheless, he survived the Second World War, after which he resumed teaching mathematics.\nLöwenheim (1915) gave the first proof of what is now known as the Löwenheim–Skolem theorem, often considered the starting point for model theory.\n\n\n== Important publications ==\nLeopold Löwenheim (1908). \"Über das Auflösungsproblem im logischen Klassenkalkül\". Sitzungsberichte der Berliner mathematischen Gesellschaft. 7: 89—94. \nLeopold Löwenheim (1910). \"Über die Auflösung von Gleichungen im logischen Gebietekalkül\" (PDF). Mathematische Annalen. 68: 169—207. \nLeopold Löwenheim (1913). \"Über Transformationen im Gebietekalkül\" (PDF). Mathematische Annalen. 73: 245—272. \nLeopold Löwenheim (1915). \"Über Möglichkeiten im Relativkalkül\" (PDF). Mathematische Annalen. 76: 447—470.  Translated as \"On possibilities in the calculus of relatives\" in Jean van Heijenoort, 1967. A Source Book in Mathematical Logic, 1879–1931. Harvard Univ. Press: 228–251.\nLeopold Löwenheim (1915). \"Über eine Erweiterung des Gebietekalküls, welche auch die gewöhnliche Algebra umfaßt\". Archiv für systematische Philosophie. 21: 137—148. \nLeopold Löwenheim (1940). \"Einkleidung der Mathematik in den Schöderschen Relativkalkül\". Journal of Symbolic Logic. 5: 1—15. JSTOR 2269177. \nLeopold Löwenheim (1946). \"On Making Indirect Proofs Direct\". Scripta mathematica. 12 (2): 125—147.  Translated from German and published by Willard Van Orman Quine.\n\n\n== References ==\n\n\n== Further reading ==\nBrady, Geraldine, 2000. From Peirce to Skolem. North Holland. Contains a detailed exegesis of the proof in Löwenheim (1915), and discusses how Thoralf Skolem simplified that proof and extended the scope and generality of the theorem.\n\n\n== External links ==\nLöwenheim, Leopold at encyclopedia.com\nChristian Thiel (Nov 2007). \"A Short Introduction to Löwenheim's Life and Work and to a Hitherto Unknown Paper\". History and Philosophy of Logic. 28: 289—302.", "ns": 0, "pageid": 755668, "title": "Leopold Löwenheim"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}