{"batchcomplete": "", "query": {"normalized": [{"to": "Lewis Call", "from": "Lewis_Call"}], "pages": {"15489641": {"extract": "Lewis Call is an American academic notable for being a central post-anarchist thinker. He is best known for his 2002 book Postmodern Anarchism, which develops an account of postmodern anarchism through philosophers such as Friedrich Nietzsche and cyberpunk writers such as William Gibson and Bruce Sterling. Call has written extensively on the intersection of post-anarchism and science fiction, covering philosophers and authors such as Gilles Deleuze, Jean Baudrillard, Octavia Butler, Samuel R. Delany and Ursula K. Le Guin.\n\n\n== Life and work ==\nCall graduated with a B.A. from University of California, San Diego followed by an M.A. and Ph.D. in Modern European History from the University of California, Irvine, finishing his studies in 1996. His doctoral dissertation was titled, Nietzsche as Critic and Captive of Enlightenment. He is an Associate Professor in the History Department of California Polytechnic State University in San Luis Obispo, where he teaches intellectual history, political economy and the history of network technology. Call also holds the position of Associate Editor of Anarchist Studies, an international journal of anarchist theory. He received the Distinguished Lecturer Award from the California Faculty Association (California Polytechnic chapter) in 2005, and his paper \"’Sounds Like Kinky Business to Me’: Subtextual and Textual Representations of Erotic Power in the Buffyverse\" won Slayage journal's 2008 Mr. Pointy Award for Buffy studies Scholarship. Call is a dedicated practitioner of T'ai chi ch'uan.\n\n\n== Thought ==\n\nCall is credited along with Saul Newman and Todd May with developing postanarchism from its roots in French postmodern and classical anarchist thought. Call has attempted to develop post-anarchist theory through the work of Friedrich Nietzsche, rejecting the Cartesian concept of the \"subject\". From here a radical form of anarchism is made possible; the anarchism of becoming. This anarchism does not have an eventual goal, nor flow into \"being\", it is not a final state of development, nor a static form of society, but rather becomes permanent, as a means without end. Call critiques liberal notions of language, consciousness, and rationality from an anarchist perspective, arguing that they are inherent in economic and political power within the capitalist state organization.\nCall's other research interests include intellectual history, science fiction studies, and the history of erotic power.\n\n\n== References ==\n\n\n== Selected bibliography ==\nPostmodern Anarchism. Lexington: Lexington Books. 2002. ISBN 978-0-7391-0522-1. \n\"Structures of Desire: Erotic Power in the Speculative Fiction of Octavia Butler and Samuel Delany\". Rethinking History. 9 (2/3). June–September 2005. \n\"Anarchy in the Matrix: Postmodern Anarchism in the Novels of William Gibson and Bruce Sterling\". Anarchist Studies. 7 (2). \n\"A brief history of Anarchist Studies (so far)\". Anarchist Studies. 15 (2). \nCall, Lewis. (2007). \"Postmodern Anarchism in the Novels of Ursula K. Le Guin\". SubStance. 36 (2): 87–105. doi:10.1353/sub.2007.0028. ISSN 0049-2426. \n\"A is for Anarchy, V is for Vendetta: Images of Guy Fawkes and the Creation of Postmodern Anarchism\". Anarchist Studies. 16 (2). \n\"'Sounds Like Kinky Business to Me': Subtextual and Textual Representations of Erotic Power in the Buffyverse\". Slayage: the Online International Journal of Buffy Studies. 6 (4). Summer 2007. \n\"'This Wondrous Death': Erotic Power in the Science Fiction of James Tiptree, Jr.\". Science Fiction Studies. 34 (1): 59–86. March 2007. \n\n\n== External links ==\nFaculty profile at California Polytechnic State University in San Luis Obispo", "ns": 0, "pageid": 15489641, "title": "Lewis Call"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}