{"batchcomplete": "", "query": {"normalized": [{"to": "Loren Lomasky", "from": "Loren_Lomasky"}], "pages": {"1788093": {"extract": "Loren E. Lomasky is an American philosopher, currently a Cory Professor of Political Philosophy, Policy and Law at the University of Virginia. Lomasky earned his PhD from the University of Connecticut, and has previously taught at Bowling Green State University in Ohio, the University of Minnesota in Duluth, and the Australian National University in Canberra. He has also been a contributing editor to Reason magazine.\nLomasky has written principally on ethics and political philosophy. His book Persons, Rights, and the Moral Community established his reputation as a leading advocate of a rights-based libertarian approach to moral and social issues. Besides these, his teaching interests include the philosophy of religion, medieval philosophy, and other periods in the history of philosophy.\nLomasky has been the recipient of many awards including the 1991 Matchette Prize for his Persons, Rights, and the Moral Community. Professor Lomasky has held research appointments sponsored by the NEH, the Center for the Study of Public Choice, the Australian National University and Bowling Green's Social Philosophy and Policy Center.\n\n\n== Selected bibliography ==\n\"When Hard Heads Collide: A Philosopher Encounters Public Choice,\" The American Journal of Economics and Sociology, 63 (2004).\n\"Liberty and Welfare Goods: Reflection on Clashing Liberalisms,\" Journal of Ethics 4 (2000).\n\"Aid Without Egalitarianism: Assisting Indigent Defendants,\" in William C. Heffernan & John Kleinig (eds.), From Social Justice to Criminal Justice, Oxford: Oxford University Press, 2000, ISBN 0-19-512985-7.\nDemocracy and Decision: The Pure Theory of Electoral Preference, Cambridge: Cambridge University Press, 1993, ISBN 0-521-35043-3 (with Geoffrey Brennan).\nPolitics and Process: New Essays in Democratic Thought, Cambridge: Cambridge University Press 1989, ISBN 0-521-35043-3 (co-editor, with Geoffrey Brennan).\nPersons, Rights, and the Moral Community, Oxford: Oxford University Press, 1987, ISBN 0-19-504209-3.\n\n\n== See also ==\nAmerican philosophy\nLibertarian views of rights\nList of American philosophers\n\n\n== External links ==\nLoren Lomasky's profile at University of Virginia\nLomaskys's writings at the Independent Review.\nLomasky's writings at the Competitive Enterprise Institute site.\nLomasky's writings at the Foundation for Economic Education.\n\"Is Social Security Politically Untouchable?\". The Cato Journal, 5 (Spring/Summer 1985).", "ns": 0, "pageid": 1788093, "title": "Loren Lomasky"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}