{"batchcomplete": "", "query": {"normalized": [{"to": "Lotfi A. Zadeh", "from": "Lotfi_A._Zadeh"}], "pages": {"201155": {"extract": "Lotfi Aliasker Zadeh (/ˈzɑːdeɪ/; Azerbaijani: Lütfəli Rəhimoğlu Əsgərzadə; born February 4, 1921), is a mathematician, computer scientist, electrical engineer, artificial intelligence researcher and professor emeritus of computer science at the University of California, Berkeley.\nHe is best known for proposing the fuzzy mathematics consisting of those fuzzy related concepts: fuzzy sets, fuzzy logic, fuzzy algorithms, fuzzy semantics, fuzzy languages, fuzzy control, fuzzy systems, fuzzy probabilities, fuzzy events, and fuzzy information.\nHe is a founding member of Eurasian Academy.\n\n\n== Life and career ==\nZadeh was born in Baku, Azerbaijan SSR, as Lotfi Aliaskerzadeh, to an Iranian Azerbaijani father from Ardabil, Rahim Aleskerzade, who was a journalist on assignment from Iran, and a Russian Jewish mother, also an Iranian citizen, Fanya Korenman, who was a pediatrician from Odessa. The Soviet government at this time courted foreign correspondents, and the family lived well while in Baku. Zadeh attended elementary school for three years there, which he has said \"had a significant and long-lasting influence on my thinking and my way of looking at things.\"\nIn 1931, when Zadeh was ten years old, his family moved to Tehran in Iran, his father's homeland. Zadeh was enrolled in Alborz College, which was a Presbyterian missionary school, where he was educated for the next eight years, and where he met his future wife, Fay. Zadeh says that he was \"deeply influenced\" by the \"extremely decent, fine, honest and helpful\" missionaries from the United States who ran the college. \"To me they represented the best that you could find in the United States – people from the Midwest with strong roots. They were really 'Good Samaritans' – willing to give of themselves for the benefit of others. So this kind of attitude influenced me deeply. It also instilled in me a deep desire to live in the United States.\" During this time, Zadeh was awarded several patents.\nDespite being more fluent in Russian than in Persian, Zadeh sat for the national university exams and placed third in the entire country. As a student, he ranked first in his class in his first two years. In 1942, he graduated from the University of Tehran with a degree in electrical engineering (Fanni), one of only three students in that field to graduate that year, due to the turmoil created by World War II, when the United States, Britain, and the Soviet Union invaded Iran whose ruler, the Shah, was pro-German. Over 30,000 American soldiers were based there, and Zadeh worked with his father, who did business with them as a contractor for hardware and building materials.\nIn 1943, Zadeh decided to emigrate to the United States, and traveled to Philadelphia by way of Cairo after months of delay waiting for the proper papers or for the right ship to appear. He arrived in mid-1944, and entered M.I.T. as a graduate student later that year. While in the United States, he changed his name to Lotfi Asker Zadeh.\nHe received an MS degree in electrical engineering from M.I.T. in 1946, and then applied to Columbia University, as his parents had settled in New York City. Columbia admitted him as a doctoral student, and offered him an instructorship as well. He received his PhD in electrical engineering from Columbia in 1949, and became an assistant professor the next year.\nZadeh taught for ten years at Columbia, was promoted to Full Professor in 1957, and has taught at the University of California, Berkeley since 1959. He published his seminal work on fuzzy sets in 1965, in which he detailed the mathematics of fuzzy set theory. In 1973 he proposed his theory of fuzzy logic.\n\n\n== Personal life and beliefs ==\n Zadeh is noted to be \"quick to shrug off nationalism, insisting there are much deeper issues in life\", and is quoted as stating in an interview: \"The question really isn't whether I'm American, Russian, Iranian, Azerbaijani, or anything else. I've been shaped by all these people and cultures and I feel quite comfortable among all of them.\" Zadeh also notes in the same interview: \"Obstinacy and tenacity. Not being afraid to get embroiled in controversy. That's very much a Turkish tradition. That's part of my character, too. I can be very stubborn. That's probably been beneficial for the development of Fuzzy Logic.\" He describes himself as \"an American, mathematically oriented, electrical engineer of Iranian descent, born in Russia.\"\nZadeh is married to Fay Zadeh and has two children, Stella Zadeh and Norman Zadeh.\n\n\n== Work ==\nAccording to Google Scholar, as of September 2015 Zadeh's work had been cited 150,852 times with the 1965 \"Fuzzy Sets\" paper receiving 58,251.\n\n\n=== Fuzzy sets and systems ===\nZadeh, in his theory of fuzzy sets, proposed using a membership function (with a range covering the interval [0,1]) operating on the domain of all possible values. He proposed new operations for the calculus of logic and showed that fuzzy logic was a generalisation of classical and Boolean logic. He also proposed fuzzy numbers as a special case of fuzzy sets, as well as the corresponding rules for consistent mathematical operations (fuzzy arithmetic).\n\n\n=== Other contributions ===\nLotfi Zadeh is also credited, along with John R. Ragazzini, in 1952, with having pioneered the development of the z-transform method in discrete time signal processing and analysis. These methods are now standard in digital signal processing, digital control, and other discrete-time systems used in industry and research. He is an editor of International Journal of Computational Cognition.\nZadeh's latest work includes computing with words and perceptions. His recent papers include From Search Engines to Question-Answering Systems—The Role of Fuzzy Logic, Progress in Informatics, No. 1, 1-3, 2005; and Toward a Generalized Theory of Uncertainty (GTU)—An Outline, Information Sciences, Elsevier, Vol. 172, 1-40, 2005.\n\n\n== Selected publications ==\n1965. Fuzzy sets. Information and Control. 1965; 8: 338–353.\n1965. \"Fuzzy sets and systems\". In: Fox J, editor. System Theory. Brooklyn, NY: Polytechnic Press, 1965: 29–39.\n1972. \"A fuzzy-set-theoretical interpretation of linguistic hedges\". Journal of Cybernetics 1972; 2: 4–34.\n1973. \"Outline of a new approach to the analysis of complex systems and decision processes\". IEEE Trans. Systems, Man and Cybernetics, 1973; 3: 28–44.\n1974. \"Fuzzy logic and its application to approximate reasoning\". In: Information Processing 74, Proc. IFIP Congr. 1974 (3), pp. 591–594.\n1975. \"Fuzzy logic and approximate reasoning\". Synthese, 1975; 30: 407–428.\n1975. \"Calculus of fuzzy restrictions\". In: Zadeh LA, Fu KS, Tanaka K, Shimura M, editors. Fuzzy Sets and their Applications to Cognitive and Decision Processes. New York: Academic Press, 1975: 1–39.\n1975. \"The concept of a linguistic variable and its application to approximate reasoning\", I-III, Information Sciences 8 (1975) 199–251, 301–357; 9 (1976) 43–80.\n2002. \"From computing with numbers to computing with words — from manipulation of measurements to manipulation of perceptions\" in International Journal of Applied Math and Computer Science, pp. 307–324, vol. 12, no. 3, 2002.\n2012. Computing With Words. Principal Concepts and Ideas. Berlin: Springer, 2012.\nA complete list of publications is on the website: http://www.cs.berkeley.edu/~zadeh/\n\n\n== Awards and honors ==\nZadeh is a Fellow of the Institute of Electrical and Electronics Engineers, the American Academy of Arts and Sciences, the Association for Computing Machinery, the Association for the Advancement of Artificial Intelligence and the International Fuzzy Systems Association, and a member of the National Academy of Engineering. He is also a member of the Academies of Science of Azerbaijan, Bulgaria, Finland, Korea and Poland and of the International Academy of Systems Studies in Moscow. He has received 24 honorary doctorates.\nAwards received by Zadeh include, among many others:\nIEEE Education Medal; 1973\nIEEE Richard W. Hamming Medal, for \"seminal contributions to information science and systems, including the conceptualization of fuzzy sets\"; 1992\nAmerican Society of Mechanical Engineers Rufus Oldenburger Medal; 1993.\nHonorary Professorship from the Azerbaijan State Oil Academy; 1993\nIEEE Medal of Honor, for \"pioneering development of fuzzy logic and its many diverse applications\"; 1995\nAmerican Automatic Control Council's Richard E. Bellman Control Heritage Award; 1998.\nACM Allen Newell Award; 2001\nOutstanding Contribution Award, Web Intelligence Consortium (WIC), Halifax, Canada, 2003.\nWall of Fame, Heinz Nixdorf MuseumsForum (HNF), Paderborn, Germany, 2004.\nV. Kaufmann Prize and Gold Medal, International Association for Fuzzy-Set Management and Economy (SIGEF), Barcelona, Spain, Nov. 15, 2004.\nJ. Keith Brimacombe IPMM Award in recognition of his development of fuzzy set theory and fuzzy logic, 2005.\nBenjamin Franklin Medal in Electrical Engineering from The Franklin Institute in Philadelphia, for inventing and developing the field of \"fuzzy logic\"; 2009\nInduction into the IEEE Intelligent Systems' AI's Hall of Fame, 2011, \"for his work on soft computing, fuzzy logic, and neural-net theory\".\nBBVA Foundation Frontiers of Knowledge Award in the category of Information and Communication Technologies (ICT), Spain, 2012.\n\n\n== References ==\nNotes\n\nBibliography\nMcNeil, Daniel and Freiberger, Paul. Fuzzy Logic: The discovery of a revolutionary computer technology - and how it is changing our world. New York: Simon & Schuster, 1993. ISBN 0-671-73843-7\nFurther reading\nFuzzy Sets and Systems. The main journal of the field which contains many contributions by its founder.\nZadeh, Fay. \"My Life and Travels with the Father of Fuzzy Logic\". 1998, TSI Press, Albuquerque, NM.\nZadeh, Lofti A. \"Lotfi Visions\", two-part interview with Jack J. Woehr, Dr. Dobb's Journal, July, 1994 (part 1) and August, 1994 (part 2).\nSeising, Rudolf: The Fuzzification of Systems. The Genesis of Fuzzy Set Theory and Its Initial Applications - Developments up to the 1970s (Studies in Fuzziness and Soft Computing, Vol. 216) Berlin, New York, [et al.]: Springer 2007.\n\n\n== External links ==\nLotfi Zadeh, Berkeley Commencement Speech: \"Commercialism and Human Values: When You Can't Stop for Lunch,\" in Azerbaijan International, Vol. 6:1 (Spring 1998), p. 65.\n\"Famous People: Then and Now, Lotfi Zadeh (reflecting on his childhood) in Azerbaijan International, Vol. 7:4 (Winter 1999), pp. 28-29.\n\"Lotfi Zadeh: Short Biographical Sketch\". Azerbaijan International, Vol. 2:4 (Winter 1994), p. 49.\nCS.Berkeley.edu, Academic profile – Berkeley, University of California.\nUnivagora.ro, Honorary Chair and Keynote Speaker, ICCCC 2008, A conference dedicated to the Centenary of John Bardeen.\n1965 seminal work on CS.Berkeley.edu, Fuzzy Sets\n[1], Zadeh's Google Scholar Citations\nLotfi A. Zadeh at the AI Genealogy Project.", "ns": 0, "pageid": 201155, "title": "Lotfi A. Zadeh"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}