{"batchcomplete": "", "query": {"normalized": [{"to": "Ludwig von Mises", "from": "Ludwig_von_Mises"}], "pages": {"4826588": {"extract": "Ludwig Heinrich Edler von Mises (German: [ˈluːtvɪç fɔn ˈmiːzəs]; 29 September 1881 – 10 October 1973) was a theoretical Austrian School economist. Mises wrote and lectured extensively on behalf of classical liberalism. He is best known for his work on praxeology, a study of human choice and action.\nMises emigrated from Austria to the United States in 1940. Since the mid-20th century, the libertarian movement in the United States has been strongly influenced by Mises's writings.\nMises's Austrian School was a leading group of economists. Many of its alumni, including Friedrich von Hayek and Oskar Morgenstern, emigrated from Austria to the United States and Great Britain. Mises has been described having approximately seventy close students in Austria, and the Austrians as the insiders of Chicago School of economics. The Ludwig von Mises Institute was founded in the United States to continue his teachings.\n\n\n== Biography ==\n\n\n=== Early life ===\n\nLudwig von Mises was born to Jewish parents in the city of Lemberg, in Galicia, Austria-Hungary (now L'viv, Ukraine). The family of his father Arthur Edler von Mises had been elevated to the Austrian nobility in the 19th century (Edler indicates a noble landless family); they had been involved in financing and constructing railroads. Ludwig's mother, Adele (born Landau), was a niece of Joachim Landau, a Liberal Party deputy to the Austrian Parliament. Arthur von Mises was stationed in Lemberg as a construction engineer with the Czernowitz railway company.\nBy the age of twelve, Ludwig spoke fluent German, Polish, and French, read Latin, and could understand Ukrainian. Mises had a younger brother, Richard von Mises, who became a mathematician and a member of the Vienna Circle, and a probability theorist. When Ludwig and Richard were still children, their family moved back to Vienna.\nIn 1900, Ludwig Von Mises attended the University of Vienna, becoming influenced by the works of Carl Menger. Mises' father died in 1903. Three years later, Mises was awarded his doctorate from the school of law in 1906.\n\n\n=== Life in Europe ===\nIn the years from 1904 to 1914, Mises attended lectures given by Austrian economist Eugen von Böhm-Bawerk. He graduated in February 1906 (Juris Doctor) and started a career as a civil servant in Austria's financial administration.\nAfter a few months, he left to take a trainee position in a Vienna law firm. During that time, Mises began lecturing on economics, and in early 1909, he joined the Vienna Chamber of Commerce and Industry. During World War I, Mises served as a front officer in the Austro-Hungarian artillery and as an economic adviser to the War Department.\nMises was chief economist for the Austrian Chamber of Commerce and was an economic adviser of Engelbert Dollfuss, the austrofascist but strongly anti-Nazi Austrian Chancellor. Later he was economic adviser to Otto von Habsburg, the Christian democratic politician and claimant to the throne of Austria (which had been legally abolished in 1918 following the Great War). In 1934, Mises left Austria for Geneva, Switzerland, where he was a professor at the Graduate Institute of International Studies until 1940.\nWhile in Switzerland, Mises married Margit Herzfeld Serény, a former actress and widow of Ferdinand Serény. She was the mother of Gitta Sereny.\n\n\n=== Work in the United States ===\nIn 1940 Mises and his wife fled the German advance in Europe and emigrated to New York City in the United States. He had come to the United States under a grant by the Rockefeller Foundation. Like many other classical liberal scholars who fled to the US, he received support by the William Volker Fund to obtain a position in American universities. Mises became a visiting professor at New York University, and held this position from 1945 until his retirement in 1969 - though he was not salaried by the university. Businessman and libertarian commentator Lawrence Fertig, a member of the NYU Board of Trustees, funded Mises and his work.\nFor part of this period, Mises studied currency issues for the Pan-Europa movement, which was led by Richard Coudenhove-Kalergi, a fellow NYU faculty member and Austrian exile. In 1947, Mises became one of the founding members of the Mont Pelerin Society.\nIn 1962, Mises received the Austrian Decoration for Science and Art for political economy at the Austrian Embassy in Washington, D.C.\nMises retired from teaching at the age of 87, and died at the age of 92 in New York. He is buried at Ferncliff Cemetery, in Hartsdale, New York. Grove City College houses the 20,000-page archive of Mises papers and unpublished works. The personal library of Mises was given to Hillsdale College, as bequeathed in his will.\nAt one time, Mises praised the work of philosopher and novelist Ayn Rand and she generally looked on his work with favor. But the two had a volatile relationship, with strong disagreements, for example over the moral basis of capitalism.\n\n\n== Contributions and influence in economics ==\nMises wrote and lectured extensively on behalf of classical liberalism. In his treatise Human Action, Mises adopted praxeology as a general conceptual foundation of the social sciences and set forth his methodological approach to economics.\nFriends and students of Mises in Europe included Wilhelm Röpke and Alfred Müller-Armack (advisors to German chancellor Ludwig Erhard), Jacques Rueff (monetary advisor to Charles de Gaulle), Gottfried Haberler (later a professor at Harvard), Lionel, Lord Robbins (of the London School of Economics), Italian President Luigi Einaudi, and Leonid Hurwicz, recipient of the 2007 Nobel Memorial Prize in Economic Sciences. Economist and political theorist F.A. Hayek first came to know Mises while working as his subordinate at a government office dealing with Austria's post-World War I debt. In 1956, while toasting Mises at a party, Hayek said, \"I came to know him as one of the best educated and informed men I have ever known...\"\nMises' seminars in Vienna fostered lively discussion among established economists there. The meetings were also visited by other important economists who happened to be traveling through Vienna.\nIn New York, at his NYU seminar and at informal meetings at his apartment, Mises attracted college and high school students who had heard of his European reputation. They listened while he gave carefully prepared lectures from notes. Among those who attended his informal seminar over the course of two decades in New York were Israel Kirzner, Hans Sennholz, Ralph Raico, Leonard Liggio, George Reisman and Murray Rothbard. Mises' work also influenced other Americans, including Benjamin Anderson, Leonard Read, Henry Hazlitt, Max Eastman, legal scholar Sylvester J. Petro, and novelist Ayn Rand. In his years in the United States, Mises was surrounded by followers who agreed with his views and did not challenge him much. He became increasingly isolated. His NYU seminar had little influence on the overall economics profession. Among the attendees, only Israel Kirzner has achieved mainstream respectability among economists.\n\n\n== Criticisms ==\nEconomic historian Bruce Caldwell writes that in the mid-20th century, with the ascendance of positivism and Keynesianism, Mises came to be regarded by many as the \"archetypal 'unscientific' economist.\" In a 1957 review of his book The Anti-Capitalistic Mentality, The Economist said of Mises: \"Professor von Mises has a splendid analytical mind and an admirable passion for liberty; but as a student of human nature he is worse than null and as a debater he is of Hyde Park standard.\" Conservative commentator Whittaker Chambers (who was a former communist and Soviet spy) published a similarly negative review of that book in the National Review, stating that Mises's thesis that anti-capitalist sentiment was rooted in \"envy\" epitomized \"know-nothing conservatism\" at its \"know-nothingest.\"\nIn a 1978 interview, Friedrich Hayek said about Mises's book Socialism:\n\n\"At first we all felt he was frightfully exaggerating and even offensive in tone. You see, he hurt all our deepest feelings, but gradually he won us around, although for a long time I had to – I just learned he was usually right in his conclusions, but I was not completely satisfied with his argument.\"\n\nEconomist Milton Friedman considered Mises inflexible in his thinking:\n\nThe story I remember best happened at the initial Mont Pelerin meeting when he got up and said, \"You're all a bunch of socialists.\" We were discussing the distribution of income, and whether you should have progressive income taxes. Some of the people there were expressing the view that there could be a justification for it.\n\nAnother occasion which is equally telling: Fritz Machlup was a student of Mises's, one of his most faithful disciples. At one of the Mont Pelerin meetings, Machlup gave a talk in which I think he questioned the idea of a gold standard; he came out in favor of floating exchange rates. Mises was so mad he wouldn't speak to Machlup for three years. Some people had to come around and bring them together again. It's hard to understand; you can get some understanding of it by taking into account how people like Mises were persecuted in their lives.\n\nEconomist Murray Rothbard, who studied under Mises, agreed he was uncompromising, but disputes reports of his abrasiveness. In his words, Mises was \"unbelievably sweet, constantly finding research projects for students to do, unfailingly courteous, and never bitter\" about the discrimination he received at the hands of the economic establishment of his time.\nMises' 1927 book Liberalism has been largely ignored, except for its comments on fascism. Marxists Herbert Marcuse and Perry Anderson, as well as German writer Claus-Dieter Krohn, criticized Mises for writing approvingly of Italian fascism, especially for its suppression of leftist elements. In 2009 economist J. Bradford DeLong and sociologist Richard Seymour, repeated the criticism.\nMises wrote in the 1927 book:\n\nIt cannot be denied that Fascism and similar movements aiming at the establishment of dictatorships are full of the best intentions and that their intervention has, for the moment, saved European civilization. The merit that Fascism has thereby won for itself will live on eternally in history. But though its policy has brought salvation for the moment, it is not of the kind which could promise continued success. Fascism was an emergency makeshift. To view it as something more would be a fatal error.\n\nMises biographer Jörg Guido Hülsmann says that critics who suggest that Mises supported fascism are \"absurd\", as he notes that the full quote describes fascism as dangerous. He notes that Mises thought it was a \"fatal error\" to think that it was more than an \"emergency makeshift\" against the looming threat of communism and socialism, as exemplified by the Bolsheviks in Russia.\nAfter Mises died, his widow quoted a passage that he had written about Benjamin Anderson. She said it best described Mises's own personality:\n\n\"His most eminent qualities were his inflexible honesty, his unhesitating sincerity. He never yielded. He always freely enunciated what he considered to be true. If he had been prepared to suppress or only to soften his criticisms of popular, but irresponsible, policies, the most influential positions and offices would have been offered him. But he never compromised.\"\n\n\n== Bibliography ==\nThe Theory of Money and Credit (1912, enlarged US edition 1953)\nNation, State, and Economy (1919)\n\"Economic Calculation in the Socialist Commonwealth\" (1920) (article)\nSocialism: An Economic and Sociological Analysis (1922, 1932, 1951)\nLiberalismus (1927, 1962 – translated into English, with the new title The Free and Prosperous Commonwealth)\nA Critique of Interventionism (1929)\nA Critique of Interventionism\n\nEpistemological Problems of Economics (1933, 1960)\nEpistemological Problems of Economics\n\nMemoirs (1940)\nInterventionism: An Economic Analysis (1941, 1998)\nInterventionism: An Economic Analysis\n\nOmnipotent Government: The Rise of Total State and Total War (1944)\nBureaucracy (1944, 1962)\nPlanned Chaos (1947, added to 1951 edition of Socialism)\nPlanned Chaos\n\nHuman Action: A Treatise on Economics (1949, 1963, 1966, 1996)\nPlanning for Freedom (1952, enlarged editions in 1962, 1974, and 1980)\nThe Anti-Capitalistic Mentality (1956)\nTheory and History: An Interpretation of Social and Economic Evolution (1957)\nTheory and History\n\nThe Ultimate Foundation of Economic Science (1962)\nThe Ultimate Foundation of Economic Science\n\nThe Historical Setting of the Austrian School of Economics (1969)\nThe Historical Setting of the Austrian School of Economics\n\nNotes and Recollections (1978)\nClash of Group Interests and Other Essays (1978)\nThe Clash of Group Interests and Other Essays\n\nOn the Manipulation of Money and Credit (1978)\nThe Causes of the Economic Crisis, reissue\n\nEconomic Policy: Thoughts for Today and Tomorrow (1979, lectures given in 1959)\nEconomic Policy: Thoughts for Today and Tomorrow\n\nMoney, Method, and the Market Process (1990)\nMoney, Method, and the Market Process\n\nEconomic Freedom and Interventionism (1990)\nThe Free Market and Its Enemies (2004, lectures given in 1951)\nThe Free Market and Its Enemies\n\nMarxism Unmasked: From Delusion to Destruction (2006, lectures given in 1952)\nLudwig von Mises on Money and Inflation (2010, lectures given in the 1960s)\n\n\n== See also ==\n\n\n== References ==\n*Note regarding personal names: 'Edler' (in English: 'noble') is a German title, in rank similar to that of a baronet. It is not a first or middle name. The female form is 'Edle'. Similarly, below, 'Ritter' is German for 'knight' and 'Graf' for 'count'.\n\n\n== Further reading ==\nButler, Eamonn, Ludwig von Mises – A Primer, Institute of Economic Affairs (2010)\nEbeling, Richard M. Political Economy, Public Policy, and Monetary Economics: Ludwig von Mises and the Austrian Tradition, (London/New York: Routledge, 2010) 354 pages, ISBN 978-0-415-77951-7.\nEbeling, Richard M. \"Ludwig von Mises: The Political Economist of Liberty, Part I\", (The Freeman, May 2006)\nEbeling, Richard M. \"Ludwig von Mises: The Political Economist of Liberty, Part II\", (The Freeman, June 2006)\nEbeling, Richard M. \"Ludwig von Mises and the Vienna of His Time, Part I\", (The Freeman, March 2005)\nEbeling, Richard M. \"Ludwig von Mises and the Vienna of His Time, Part II\", (The Freeman, April 2005)\nEbeling, Richard M. \"Austrian Economics and the Political Economy of Freedom\", (The Freeman, June 2004)\nGordon, David (2011-02-23) Mises's Epistemology, Ludwig von Mises Institute\nRothbard, Murray N. \"Mises, Ludwig Edler von,\" The New Palgrave: A Dictionary of Economics, 1987, v. 3, pp. 479–80.\nShelton, Judy (1994). Money Meltdown: Restoring Order to the Global Currency System. New York, NY: Free Press. p. 399. ISBN 978-0029291122. OCLC 797359731. \nReviewed in: Dornbusch, Rudi (July 10, 1994). \"Money Meltdown\". The Washington Post. Retrieved May 25, 2013. The hero in this book is Ludwig von Mises.  (from HighBeam Research)\n\nvon Mises, Margit (1976). My Years with Ludwig von Mises. Arlington House Publishers. ISBN 0-87000-368-2. \nYeager, Leland (2008). \"Mises, Ludwig von (1881–1973)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 334–6. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \n\n\n== External links ==\nLudwig von Mises Institute Europe\nMises.org, Ludwig von Mises Institute USA\nMises.de, Books and Articles in the original German versions by Ludwig von Mises and other Authors of the Austrian School\nLudwig von Mises at DMOZ\nAudio of von Mises subtitled in Spanish and English \"Do wage earners and their employers have interests in conflict?\"\n\"A Tribute to Ludwig Von Mises\". A list of works by and on Ludwig Von Mises by the Foundation for Economic Education\nLudwig von Mises (1881–1973). The Concise Encyclopedia of Economics. Library of Economics and Liberty (2nd ed.). Liberty Fund. 2008. \nLudwig von Mises at Find a Grave\nLudwig von Mises at Goodreads", "ns": 0, "pageid": 4826588, "title": "Ludwig von Mises"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}