{"batchcomplete": "", "query": {"normalized": [{"to": "Mani Kaul", "from": "Mani_Kaul"}], "pages": {"1122717": {"extract": "Mani Kaul (25 December 1944 – 6 July 2011) was an Indian Kashmiri Pandit director of Hindi films and an influential figure in Indian parallel cinema. He graduated from the Film and Television Institute of India (FTII) where he was a student of Ritwik Ghatak and later became a teacher. Starting his career with Uski Roti (1969), which won him the Filmfare Critics Award for Best Movie, he went on to win four of them in all. He won the National Film Award for Best Direction in 1974 for Duvidha and later the National Film Award for his documentary film, Siddheshwari in 1989.\n\n\n== Early life and background ==\nBorn Rabindranath Kaul, in Jodhpur, Rajasthan, in a Kashmiri Pandit family, Kaul first joined FTII, Pune as an acting student and later shifted to the direction course, where noted film director Ritwik Ghatak was a teacher, graduating in 1966.\nHe was the nephew of actor-director Mahesh Kaul, who made films like Raj Kapoor starrer Sapnon Ka Saudagar (1968).\n\n\n== Career ==\nHis first film Uski Roti (1969) has been described as \"one of the key films of the New Indian Cinema or the Indian New Wave\". It marked a drastic departure from earlier Indian cinema technique, form and narrative. It was one of the early formal experimental films in Indian cinema.\nAshadh Ka Ek Din (1971), his next film, was based on a play by Mohan Rakesh.\nDuvidha, his third film, was his first in colour. It grew out of a short story by Vijaydan Detha and tells the story of a merchant's son, who returns with his new bride. When he departs on a business trip, a ghost falls in love with the wife. It was widely shown across Europe. He was awarded the prestigious Jawaharlal Nehru Fellowship in 1974.\nKaul was one of the co-founders of the Yukt Film Co-operative (Union of Kinematograph Technicians) in 1976, leading to avant-garde films. Critics opined in \"Mani Kaul's cinematic conception, fiction and documentary films have no clear demarcated dividing line.\" He also taught music in the Netherlands, and was Creative Director of the film house at Osian's Connoisseurs of Art, Mumbai.\nIn 1971, he was a member of the jury at the 21st Berlin International Film Festival.\nHe was a visiting lecturer at Harvard University for the 2000–2001 school year.\n\n\n== Death ==\nMani Kaul died on 6 July 2011 at his home in Gurgaon, near Delhi, after prolonged battle with cancer. He is survived by two sons and two daughters.\n\n\n== Tribute ==\nAccording to a tribute from Prabha Mahajan on the Indian documentary film discussion network Docuwallahs2 [1], Mani Kaul's significant body of work included both feature films and documentaries. In an interview Mani stated: \"The dividing line from my films and documentaries is thin. Some of my films like Siddheshwari are like poetic documentaries.\" Mani Kaul's fellow alumni from FTII intend to put together a collective tribute to Mani Kaul and his work, and interested persons were invited to send in their thoughts on Mani as a film maker, teacher/ mentor, colleague, and as a person.\nIndian film critic Khalid Mohamed commented, \"As a film director, he discussed the status of women (Uski Roti, Duvidha), crafted visually seductive documentaries (Arrival, Before My Eyes, A Desert of a Thousand Lines) and went through a spell of interpreting Fyodor Dostoevsky’s masterworks. The Russian writer’s short story A Gentle Creature inspired Nazar, shot in low, chiaroscuro lighting.\"\n\n\n== Filmography ==\nUski Roti (1969)\nAshadh Ka Ek Din (1971)\nDuvidha (1973)\nPuppeteers of Rajasthan (Documentary) (1974)\nA Historical Sketch of Indian Women (Documentary) 1975\nChitrakathi (Documentary) (1977)\nGhashiram Kotwal (1979)\nArrival (Documentary) (1980)\nSatah Se Uthata Admi (1980)\nDhrupad (film) (1982)\nMati Manas (Documentary) (1984)\nA Desert of a Thousand Lines (Documentary) (1986)\nBefore My Eyes (Documentary)(1989)\nSiddheshwari (Documentary) (1989)\nNazar (1991)\nIdiot (1992)\nThe Cloud Door (1995)\nNaukar Ki Kameez (The Servant's Shirt) (1999)\nBojh (Burden)(2000)\nIk Ben Geen Ander (I Am No Other) Nederland 2002\nA Monkey's Raincoat Nederland (2005)\nSignature Film for Osian's Cinefan Festival of Asian and Arab Cinema (2006)\n\n\n== Awards ==\n\n\n=== National Film Awards ===\n1974: Best Direction: Duvidha\n1989: Best Documentary Film: Siddheshwari\n\n\n=== Filmfare Awards ===\nMani Kaul won Filmfare Critics Award for Best Movie four times.\n1971: Uski Roti (1970)\n1972: Ashad Ka Ek Din (1971)\n1974: Duvidha (1973)\n1993: Idiot (1992)\n\n\n== References ==\n\n\n== External links ==\nAvijit Ghosh, \"He was, by far, our most original filmmaker\" The Times of India.\nMani Kaul at the Internet Movie Database\nMani Kaul on Cinematography and Time at Indian Auteur\nThe Films of Mani Kaul\nAn Interview with Mani Kaul", "ns": 0, "pageid": 1122717, "title": "Mani Kaul"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}