{"batchcomplete": "", "query": {"normalized": [{"to": "Marcion of Sinope", "from": "Marcion_of_Sinope"}], "pages": {"195259": {"extract": "Marcion of Sinope (/ˈmɑːrʃən, -ʃiən, -siən/; Greek: Μαρκίων Σινώπης; c. 85 – c. 160) was an important leader in early Christianity. His theology rejected the deity described in the Hebrew Scriptures and in distinction affirmed the Father of Christ as the true God. The Church Fathers denounced Marcion, and he chose to separate himself from the proto-orthodox church. He published the earliest extant fixed collection of New Testament books, making him an important figure in the development of the New Testament canon.\n\n\n== Life ==\nEpiphanius records in the Panarion that Marcion was the son of a bishop, in Pontus. His near-contemporaries Rhodo described him as a \"mariner\" and Tertullian described him as a \"ship-master.\" Marcion made a donation of 200,000 sesterces to the church in Rome. Conflicts with the church of Rome arose and he was eventually excommunicated, his donation being returned to him. After his excommunication, he returned to Asia Minor where he continued to lead his many church congregations and teach the Christian gospel in its Marcionite version.\nAccording to anti-Marcionite sources, Marcion's teacher was the Simonian Cerdo. Irenaeus writes that \"a certain Cerdo, originating from the Simonians, came to Rome under Hyginus ... and taught that the one who was proclaimed as God by the Law and the Prophets is not the Father of our Lord Jesus Christ\" (Against Heresies, 1, 27, 1).\nIn 394, Epiphanius claimed that after beginnings as an ascetic, Marcion seduced a virgin and was accordingly excommunicated by his father, prompting him to leave his home town. This account has been doubted by many scholars, who consider it \"malicious gossip\". More recently, Bart D. Ehrman suggests that this \"seduction of a virgin\" was a metaphor for his corruption of the Christian Church, with the Church portrayed as the undefiled virgin. Similarly doubtful is Tertullian's claim in The Prescription Against Heretics (written ca. 200) that Marcion professed repentance, and agreed to the conditions granted to him—that he should receive reconciliation if he restored to the church those whom he had led astray—but that he was prevented from doing so by his death.\n\n\n== Teachings ==\n\nStudy of the Hebrew scriptures, along with received writings circulating in the nascent Church, led Marcion to conclude that many of the teachings of Jesus were incompatible with the actions of Yahweh, the God of the Hebrew Bible. Marcion responded by developing a ditheistic system of belief around the year 144. This notion of two gods—a higher transcendent one and a lower world creator and ruler—allowed Marcion to reconcile his perceived contradictions between Christian Old Covenant theology and the Gospel message proclaimed by the New Testament.\nIn contrast to other leaders of the nascent Christian church, however, Marcion declared that Christianity was in complete discontinuity with Judaism and entirely opposed to the Tanakh (Hebrew Bible). Marcion did not claim that the Jewish scriptures were false. Instead, Marcion asserted that they were to be read in an absolutely literal manner, thereby developing an understanding that Yahweh was not the same god spoken of by Jesus. For example, Marcion argued that the Genesis account of Yahweh walking through the Garden of Eden asking where Adam was, had proved Yahweh inhabited a physical body and was without universal knowledge (omniscience), attributes wholly incompatible with the Heavenly Father professed by Jesus.\nAccording to Marcion, the god of the Old Testament, whom he called the Demiurge, the creator of the material universe, is a jealous tribal deity of the Jews, whose law represents legalistic reciprocal justice and who punishes mankind for its sins through suffering and death. Contrastingly, the god that Jesus professed is an altogether different being, a universal god of compassion and love who looks upon humanity with benevolence and mercy. Marcion also produced his Antitheses contrasting the Demiurge of the Old Testament with the Heavenly Father of the New Testament.\nMarcion held Jesus to be the son of the Heavenly Father but understood the incarnation in a docetic manner, i.e. that Jesus' body was only an imitation of a material body, and consequently denied Jesus' physical and bodily birth, death, and resurrection.\nMarcion was the first to introduce an early Christian canon. His canon consisted of only eleven books grouped into two sections: the Evangelikon based on Luke with parts removed that did not agree with his views, and the Apostolikon, a selection of ten epistles of Paul the Apostle (also altered to fit his views), whom Marcion considered the correct interpreter and transmitter of Jesus' teachings. The gospel used by Marcion does not contain elements relating to Jesus' birth and childhood, although it does contain some elements of Judaism, and material challenging Marcion's ditheism.\n\n\n== Gnosticism ==\nMarcion is sometimes described as a Gnostic philosopher. In some essential respects, Marcion proposed ideas which would have aligned well with Gnostic thought. Like the Gnostics, he argued that Jesus was essentially a divine spirit appearing to human beings in the shape of a human form, and not someone in a true physical body.\nHowever, Marcionism conceptualizes God in a way which cannot be reconciled with broader Gnostic thought. For Gnostics, every human being is born with a small piece of God's soul lodged within his/her spirit (akin to the notion of a Divine Spark). God is thus intimately connected to and part of his creation. Salvation lies in turning away from the physical world (which Gnostics regard as an illusion) and embracing the God-like qualities within yourself. Marcion, by contrast, held that the Heavenly Father (the father of Jesus Christ) was an utterly alien god; he had no part in making the world, nor any connection with it.\n\n\n== Legacy ==\nIn hindsight, Marcion is seen as one of the first heresiarchs for his deviations from what would become the orthodox positions of the main authorities in the Catholic church. The suppression of the Marcionist form of Christianity is thus viewed as a catalyst for the development of the New Testament canon, the establishment of a centralised church law, and the structuring of the Church.\nThe church centred on the Marcionist interpretation of the Christian gospel expanded greatly within Marcion's lifetime, became a rival to the orthodox Christian church and retained its following for several centuries. It survived Christian controversy, and imperial disapproval, for several centuries more.\nMarcion proposed and delineated a canon (a list of officially sanctioned religious works). This prompted the orthodox part of the church to form a separate official canon of books that had been recognized as divinely inspired and authoritative. Christians began to divide texts into those that aligned with the \"measuring stick\" (Greek kanōn literally means \"measuring stick\") as being apostolic, authoritative, Christian writings (the works of the Old and New Testaments as we know them today), those that were rejected as heretical or pseudonymous, and those that were accepted but not seen as canon or read in public gatherings (the Apocrypha, e.g., The Shepherd of Hermas). Therefore, Marcion played a role in finalising the structure and contents of the collection of works now called the New Testament.\n\n\n== Notes ==\n\n\n== References ==\nBlackman, E.C. Marcion and His Influence 2004 ISBN 978-1-59244-731-2\nBruce, F. F. (1988). The Canon of Scripture. InterVarsity Press. ISBN 978-0-8308-1258-5\nClabeaux, John James. The Lost Edition of the Letters of Paul: A Reassessment of the Text of Pauline Corpus Attested by Marcion (Catholic Biblical Quarterly Monograph Series No. 21) 1989 ISBN 0-915170-20-5\nDahl, Nils Alstrup. \"The Origin of the Earliest Prologues to the Pauline Letters\", Semeia 12 (1978), 233-277\nEpiphanius of Salamis. The Panarion of Epiphanius of Salamis, Book 1 (Sects 1-46) Frank Williams translator, 1987 ISBN 90-04-07926-2\nEvans, Ernest (comments and translation): Tertullian, Against Marcion (Oxford University Press, 1972). E-text of Adversus Marcionem and Evan's introduction \"Marcion : His Doctrine and Influence\"\nGrant, Robert M. Marcion and the Critical Method Peter Richardson & John Collidge Hurd, eds., From Jesus to Paul. Studies in Honour of Francis Wright Beare. Waterloo, ON, 1984. p. 207–215.\nHarnack, Adolf von 1961. History of Dogma (Neil Buchanan, translating Harnack's Dogmengeschichte 1900), vol I, pp 267 – 313, vol II, pp 1 – 19\nHarnack, Adolf von. Marcion: The Gospel of the Alien God translation 1990 ISBN 0-939464-16-0\nHoffman, R. Joseph. Marcion, on the Restitution of Christianity: An Essay on the Development of Radical Paulist Theology in the Second Century 1984 ISBN 0-89130-638-2\nKnox, John. Marcion and the New Testament 1942 ISBN 0-404-16183-9\nFrancis Legge, Forerunners and Rivals of Christianity, From 330 B.C. to 330 A.D. (1914), reprinted in two volumes bound as one, University Books New York, 1964. LCCN 64-24125.\nLivingstone, E.A. The Oxford Dictionary of the Christian Church (3rd ed.), pp. 1033–34, 1997 ISBN 0-19-211655-X\nRiparelli, Enrico, Il volto del Cristo dualista. Da Marcione ai catari, Peter Lang, Bern 2008, 368 pp. ISBN 978-3-03911-490-0\nSproul, R.C., How Then Shall We Worship?. Colorado Springs, CO: David C Cook, 2013. ISBN 978-1-4347-0424-5 p. 16\nWilliams, David Salter. \"Reconsidering Marcion's Gospel\", Journal of Biblical Literature 108 (1989), p. 477-96\nWilson, R. S. Marcion: A Study of a Second-Century Heretic (London: Clarke) 1933\n\n\n== External links ==\nMarcion's Writings (at the Gnosis Archive): Marcion: Gospel of the Lord and Other Writings\nCatholic Encyclopedia: Marcionites\nMarcionite Research Library\nTertullian, De Carne Christi (Latin and English), 1956\nWace on Marcion\nEarlyChurch.org.uk on Marcion\nMarcion: Portrait of a Heretic by Rob Bradshaw\nThe Marcionite Prologues to the Pauline Epistles\nMarcion in the 1911 Encyclopædia Britannica\nMarcionite version of Galatians (reconstructed)\nJoseph B. Tyson, Anti-Judaism in Marcion and his Opponents\nWho was Marcion? What was Marcionism? Why was he so important in the development of the church in the Second Century?\nMarcion's Gospel of the Lord: Was it written by Marcion or not?", "ns": 0, "pageid": 195259, "title": "Marcion of Sinope"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}