{"batchcomplete": "", "query": {"normalized": [{"to": "Margaret Somerville", "from": "Margaret_Somerville"}], "pages": {"5576430": {"extract": "Margaret Anne Ganley Somerville, AM, FRSC (born April 13, 1942) is the Samuel Gale Professor of Law at McGill University, as well as professor in the university's faculty of medicine and the founding director of the law faculty's Centre for Medicine, Ethics and Law.\nSomerville was born in Adelaide, South Australia, and educated at Mercedes College (Springfield, South Australia). She received a A.u.A. (pharm.) from the University of Adelaide in 1963, a Bachelor of Law degree (Hons. I) and the University Medal from the University of Sydney in 1973, and a D.C.L. from McGill University in 1978.\nIn 1978 she was appointed assistant professor in the law faculty at McGill. She was appointed an associate professor in 1979 and an associate professor in the faculty of medicine in 1980. In 1984 she became a full professor in both faculties, and in 1989 was appointed the Samuel Gale Professor of Law. From 1986 to 1996, she was the founding director of the McGill Centre for Medicine, Ethics and Law and was appointed acting director in 1999. She currently teaches seminars on advanced torts and comparative medical law at McGill.\nIn November 2006 she gave the five annual Massey Lectures on CBC Radio in Canada. An expanded version of the lectures was published in Canada, Australia and the United States in book form as The Ethical Imagination: Journeys of the Human Spirit.\n\n\n== Honours ==\nAmong many honours and awards, in 1990, Somerville was made a Member of the Order of Australia \"for service to the law and to bioethics\". In 1991 she was made a Fellow of the Royal Society of Canada. In 2004 she was chosen by an international jury as the first recipient of UNESCO's Avicenna Prize for Ethics in Science.\nShe has received honorary degrees from University of Windsor (1992), Macquarie University (1993), St. Francis Xavier University (1996) and the University of Waterloo (2004). Her honorary degree awarded June 19, 2006 at Ryerson University in Toronto was controversial because of her objections to same sex marriage. She has since received honorary degrees from Mount Saint Vincent University in Halifax, Nova Scotia (2009), St. Mark's College, Vancouver (2010) and the Royal Military College of Canada in Kingston, Ontario (2013).\nIn 2006 Somerville was nominated for membership in the Order of Canada by Carol Finlay, a professor at the Toronto School of Theology. Finlay says Somerville was turned down for the honour because she was \"too controversial.\"\n\n\n== Involvement in same-sex marriage debate ==\nSomerville presented both a brief and an oral presentation to the Canadian House of Commons Standing Committee on Justice and Human Rights opposing the legalization of same-sex marriage in Canada in 2003. \n\n\n== Selected bibliography ==\nThe Ethical Canary: Science, Society, and the Human Spirit (2000, ISBN 0-670-89302-1)\nDeath Talk: The Case Against Euthanasia and Physician-Assisted Suicide (2001, ISBN 0-7735-2201-8)\nThe Ethical Imagination: Journeys of the Human Spirit (2006, ISBN 0-88784-747-1)\nDo We Care? (May 26, 1999) ISBN 0-7735-1878-9\n\n\n== See also ==\nAvicenna Prize\n\n\n== Footnotes ==\n\n\n== References ==\n\"Professor Somerville discusses the ethics of medical breakthroughs\". Australian Broadcasting Corporation. Retrieved May 28, 2007. \n\"Margaret A. Somerville\". McGill University. Archived from the original on June 13, 2006. Retrieved June 15, 2006. \n\"Canadian Who's Who 1997 entry\". University of Toronto Press. Retrieved June 15, 2006. \n\"The Case Against Same-Sex Marriage: A Brief Submitted to the Standing Committee on Justice and Human Rights\" (PDF). Retrieved April 29, 2003. \n\"Faculty protests award for Montreal ethicist\". CTV News. Retrieved June 19, 2006. \n\"Spineless and rude - Ryerson University shows how not to award an honorary degree\". National Post. Retrieved June 19, 2006.", "ns": 0, "pageid": 5576430, "title": "Margaret Somerville"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}