{"batchcomplete": "", "query": {"normalized": [{"to": "Mario Kopić", "from": "Mario_Kopić"}], "pages": {"20116557": {"extract": "Mario Kopić (born 13 March 1965) is a philosopher, author and translator. His main areas of interest include: History of Ideas, Philosophy of Art, Philosophy of Culture, Phenomenology and Philosophy of Religion.\nKopić is influenced by and writes extensively on Friedrich Nietzsche, Martin Heidegger, Hannah Arendt, Jacques Derrida, Gianni Vattimo, Reiner Schürmann and Dušan Pirjevec. He also translated works by Nietzsche (Thus Spoke Zarathustra, On the Genealogy of Morality), Giorgio Agamben, Gianni Vattimo, Jacques Derrida and Dušan Pirjevec into Croatian.\n\n\n== Life and work ==\nMario Kopić was born in Dubrovnik, Croatia. He studied Philosophy and Comparative Literature at the University of Zagreb; Phenomenology and Anthropology at the University of Ljubljana; History of Ideas at the Institute Friedrich Meinecke at the Free University of Berlin (under the mentorship of Ernst Nolte); and Comparative Religion and Anthropology of religion at the Sapienza University of Rome (under the mentorship of Ida Magli).\nMario Kopić's philosophical work is under the influence of the Italian philosophical approach known as pensiero debole or \"weak thought\", the political thought of Arendt, and the ethical-political thought of late Derrida.\nIn his latest works The Unhealable Wound of the World, The Challenges of the Post-metaphysics, Sextant and The Beats of the Other Kopić developed a kind of onto-politics of liberal-conservative postmodernism and the post-anthropocentric humanism. For him the world is the space of being as event, and only then the arena of national and social or political conflict. The world, or existence, is our ontological responsibility, which precedes political, judicial and moral responsibility.\nKopić appears in Igor Ivanov Izi's 1995 film N.E.P.\n\n\n== Published books ==\nArt and Philosophy: An Anthology (Filozofija i umjetnost - Antologija), Delo 11-12 /1990, Belgrade 1990.\nExperiencing the Margins of the Sense (Iskušavanje rubova smisla: pabirci iz estetike), Dubrovnik 1991.\nWith Nietzsche on Europe (S Nietzscheom o Europi), Zagreb 2001.\nNietzsche and Evola: The Thought as Destiny (Nietzsche e Evola: il pensiero come destino), Rome 2001.\nA Trial to the West (Proces Zapadu), Dubrovnik 2003. ISBN 953-7089-02-9\nThe Challenges of the Post-Metaphysics (Izazovi post-metafizike), Sremski Karlovci - Novi Sad 2007. ISBN 978-86-7543-120-6\nThe Unhealable Wound of the World (Nezacjeljiva rana svijeta), Zagreb 2007. ISBN 978-953-249-035-0\nGianni Vattimo Reader (Ed.),(Gianni Vattimo: Čitanka (Ur.)), Zagreb 2008. ISBN 978-953-249-061-9\nDušan Pirjevec, Death and Nothing (ed.), (Smrt i niština, (Ur.)) Zagreb 2009. ISBN 978-953-225-124-1\nSextant: The Outlines of the Spiritual Foundations of the World (Sekstant: Skice o duhovnim temeljima svijeta), Belgrade 2010. ISBN 978-86-519-0449-6\nThe Beats of the Other (Otkucaji drugoga), Belgrade 2013. ISBN 978-86-519-1721-2\nThe Windows: Essays on Art and Literature (Prozori: Ogledi o umjetnosti), Dubrovnik 2015. ISBN 978-953-7835-24-8\n\n\n== See also ==\nContinental philosophy\nDeconstruction-and-religion\nPostmodern Christianity\nOntotheology\nPhenomenology (philosophy)\nPhenomenology of religion\n\n\n== References ==\n\n\n== Sources ==\nInterview with Mario Kopić, Zarez, 2008 (Croatian)\nInterview with Mario Kopić, Danas, 2010 (Serbian)\nInterview with Mario Kopić, Dubrovački list, 2011 (Croatian)\nInterview with Mario Kopić, Dubrovački list, 2015 (Croatian)\nNezacjeljiva rana svijeta (Croatian)\n2011 article by Mario Kopić about Hannah Arendt (Croatian)\n2012 article by Mario Kopić about Heidegger (Croatian)\n2013 article by Mario Kopić about Derrida (Croatian)\n2015 article by Mario Kopić about Reiner Schürmann (Croatian)\n\n\n== External links ==\nComments on Jacques Derrida's Les Spectres de Marx by Mario Kopić\nKafka and Nationalism by Mario Kopić\nM. Kopić Heideggers Wiederholungsverständnis 2013. (German)\nM. Kopić Le peuple, la nation et l'(im)pouvoir 2012. (French)\nM. Kopić Paul Ricoeur – filozof čitanja 2005. (Croatian)", "ns": 0, "pageid": 20116557, "title": "Mario Kopić"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}