{"batchcomplete": "", "query": {"normalized": [{"to": "Mario Bunge", "from": "Mario_Bunge"}], "pages": {"201112": {"extract": "Mario Augusto Bunge (Spanish: [ˈbuŋxe]; born September 21, 1919) is an Argentine philosopher, philosopher of science and physicist mainly active in Canada.\n\n\n== Biography ==\nBunge began his studies at the National University of La Plata, graduating with a Ph.D. in physico-mathematical sciences in 1952. He was professor of theoretical physics and philosophy, 1956–1966, first at La Plata then at University of Buenos Aires. He was, until his recent retirement at age 90, the Frothingham Professor of Logic and Metaphysics at McGill University in Montreal, where he had been since 1966.\nMario Bunge has been distinguished with sixteen honorary doctorates and four honorary professorships by universities from both the Americas and Europe. Bunge is a fellow of the American Association for the Advancement of Science (1984– ) and of the Royal Society of Canada (1992– ). In 1982 he was awarded the Premio Príncipe de Asturias (Prince of Asturias Award), in 2009 the Guggenheim Fellowship, and in 2014 the Ludwig von Bertalanffy Award in Complexity Thinking.\n\n\n== Work ==\nBunge is a prolific intellectual, having written more than 400 papers and 80 books, notably his monumental Treatise on Basic Philosophy in 8 volumes (1974–1989), a comprehensive and rigorous study of those philosophical aspects Bunge takes to be the core of modern philosophy: semantics, ontology, epistemology, philosophy of science and ethics. Here, Bunge develops a comprehensive scientific outlook which he then applies to the various natural and social sciences.\nHis thinking embodies global systemism, emergentism, rationalism, scientific realism, materialism and consequentialism. Bunge has repeatedly and explicitly denied being a logical positivist, and has written on metaphysics. In the political arena, Bunge has defined himself as a \"left-wing liberal\" and democratic socialist, in the tradition of John Stuart Mill and José Ingenieros.\nPopularly, he is known for his remarks considering psychoanalysis as an example of pseudoscience.\n\n\n== Impact on Culture ==\nBunge is also influential in art culture. Today there are bands that pay tribute to him.\n\n\n== Publications ==\n1960. La ciencia, su método y su filosofía. Buenos Aires: Eudeba. (In French: La science, sa méthode et sa philosophie. Paris: Vigdor, 2001, ISBN 2-910243-90-7.)\n1962. Intuition and Science. Prentice-Hall. (In French: Intuition et raison. Paris: Vigdor, 2001, ISBN 2-910243-89-3.)\n1967. Scientific Research. Strategy and Philosophy. Berlin, New York: Springer-Verlag. Reprinted as Philosophy of Science (1998).\n1967. Foundations of Physics. Berlin-Heidelberg-New York: Springer-Verlag (1967), Library of Congress Catalog Card Number 67-11999\n1973. Philosophy of Physics. Dordrecht: Reidel.\n1980. The Mind-Body Problem. Oxford: Pergamon.\n1983. Demarcating Science from Pseudoscience. Fundamenta Scientiae 3: 369-388.\n1984. What is Pseudoscience. The Skeptical Inquirer. Volume 9: 36-46.\n1987. Why Parapsychology Cannot Become a Science. Behavioral and Brain Sciences 10: 576-577.\n1974–89. Treatise on Basic Philosophy: 8 volumes in 9 parts:\nI: Sense and Reference. Dordrecht: Reidel, 1974.\nII: Interpretation and Truth. Dordrecht: Reidel, 1974.\nIII: The Furniture of the World. Dordrecht: Reidel, 1977.\nIV: A World of Systems. Dordrecht: Reidel, 1979.\nV: Epistemology and Methodology I: Exploring the World. Dordrecht: Reidel, 1983.\nVI: Epistemology and Methodology II: Understanding the World. Dordrecht: Reidel, 1983.\nVII: Epistemology and Methodology III: Philosophy of Science and Technology: Part I. Formal and Physical Sciences. Dordrecht: Reidel, 1985. Part II. Life Science, Social Science and Technology. Dordrecht: Reidel, 1985.\nVIII: Ethics: the Good and the Right. Dordrecht: D. Reidel, 1989.\n\n1996. Finding Philosophy in Social Science. Yale University Press.\n1998. Dictionary of Philosophy. Prometheus Books.\n1998. Philosophy of Science, 2 Vols. New Brunswick, NJ: Transaction.\n1999. The Sociology-Philosophy Connection. New Brunswick, NJ: Transaction.\n2001. Philosophy in Crisis. Prometheus Books.\n2002. Philosophy of Psychology, with Ruben Ardila, Springer.\n2003. Emergence and Convergence: Qualitative Novelty and the Unity of Knowledge. Toronto: University of Toronto Press.\n2006. Chasing Reality: Strife over Realism. Toronto: University of Toronto Press.\n2009. Political Philosophy. Fact, Fiction, and Vision. New Brunswick, NJ, and London: Transaction.\n2010: Matter and Mind. Dordrecht-Heidelberg-London-New York, Springer.\n2012: Evaluating Philosophies. Dordrecht-Heidelberg-London-New York, Springer.\n2013: Medical Philosophy: Conceptual Issues in Medicine. World Scientific Publishing Company.\n\n\n== See also ==\nList of people from Montreal\nSociotechnology\n\n\n== References ==\n\n\n== Further reading ==\nVV.AA. (2003). Congreso-homenaxe internacional a Mario Bunge. Mos (Galicia), Grupo Aletheia. [Includes articles in Spanish by M. Bunge (Inverse problems), J. Aracil (MB and systems theory), A. Barceló (Philosophy and economics: three Bungen notions), I, Morgado (Brain, mind and philosophy), J. Mosterín (Biographical sketch of MB), M. A. Quintanilla (Instrumental rationality) y Héctor Vucetich (Quantum mechanics and realism), and in English by M. Mahner (M. Bunge's philosophy of biology)].\nAgassi, Joseph and Robert S. Cohen (eds.) (1982). Scientific Philosophy Today: Essays in Honor of Mario Bunge. Dordrecht, D. Reidel.\nDenis, Andy (2003). Methodology and policy prescription in economic thought: a response to Mario Bunge.\nDenegri, Guillermo and Gladys E. Martínez (2000). Tópicos actuales en filosofía de la ciencia. Homenaje a Mario Bunge en su 80º aniversario. Mar del Plata, Editorial Martín.\nMarone, Luis and Rafael González del Solar (2000). <<Homenaje a Mario Bunge, o por qué las preguntas en Ecología deberían comenzar con \"por qué\".>> In Denegri, Guillermo and Gladys E. Martínez (2000). Tópicos actuales en filosofía de la ciencia. Homenaje a Mario Bunge en su 80º aniversario. Mar del Plata, Editorial Martín. pp. 153–178.\nSerroni-Copello, Raúl (1989). Encuentros con Mario Bunge. Asociación de Investigaciones en Psicología.\nVacher, Laurent-Michel (1993). Entretiens avec Mario Bunge. Montreal, Liber.\nWan, Poe Yu-ze (2011). Reframing the Social: Emergentist Systemism and Social Theory. Aldershot, England: Ashgate Publishing.\nWeingartner, Paul and Georg J. W. Dorn (eds.). 1990. Studies on Mario Bunge's Treatise. Amsterdam-Atlanta, GA, Rodopi.\n\n\n== External links ==\nMario Bunge's Home Page.\nBibliography of selected publications.\nThe Philosophical Physicist.\nWen in honor Mario Bunge.", "ns": 0, "pageid": 201112, "title": "Mario Bunge"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}