{"batchcomplete": "", "query": {"normalized": [{"to": "Marilyn McCord Adams", "from": "Marilyn_McCord_Adams"}], "pages": {"2015815": {"extract": "Marilyn McCord Adams (born 1943) is an American philosopher and priest of the Episcopal Church. She specialises in philosophy of religion, philosophical theology and medieval philosophy.\n\n\n== Family ==\nAdams is the daughter of William Clark McCord and Wilmah Brown McCord. In 1966, she married the philosopher Robert Merrihew Adams.\n\n\n== Education ==\nAdams was educated at the University of Illinois (AB); Cornell University (PhD 1967); and Princeton Theological Seminary (ThM 1984, 1985); and holds the degree of Doctor of Divinity from the University of Oxford (2008).\n\n\n== Career ==\nAdams is Distinguished Research Professor of Philosophy at Rutgers University. Before that she was, in reverse chronological order, Distinguished Research Professor of Philosophy at the University of North Carolina at Chapel Hill, Regius Professor of Divinity at Oxford University, the Horace Tracy Pitkin Professor of Historical Theology at Yale University, and a Professor of Philosophy at UCLA. She is also a former President of the Society for Medieval and Renaissance Philosophy. She was elected a Fellow of the American Academy of Arts & Sciences in 2015.\nAdams was ordained a priest in the Episcopal Church in the United States of America in 1987 and from 2004 to 2009 was residentiary canon of Christ Church Cathedral, Oxford.\n\n\n== Work and writing ==\n\nAdams' work in philosophy has focused on the philosophy of religion, especially the problem of evil, philosophical theology, metaphysics and medieval philosophy. Her work on the problem of evil largely focuses on what she calls \"horrendous evils\". She is an avowed Christian universalist, believing that ultimately all will receive salvation and restoration in Christ:\n\nTraditional doctrines of hell err again by supposing either that God does not get what God wants with every human being (\"God wills all humans to be saved\" by God's antecedent will) or that God deliberately creates some for ruin. To be sure, many human beings have conducted their ante-mortem lives in such a way as to become anti-social persons. Almost none of us dies with all the virtues needed to be fit for heaven. Traditional doctrines of hell suppose that God lacks the will or the patience or the resourcefulness to civilize each and all of us, to rear each and all of us up into the household of God. They conclude that God is left with the option of merely human penal systems – viz., liquidation or quarantine!\n\n\n== Works ==\nAdams, Marilyn McCord. Christ and Horrors: The Coherence of Christology. Based on the Gifford Lectures for 1998-1999. Cambridge: Cambridge University Press, 2006. ISBN 0-521-68600-8\nAdams, Marilyn McCord. Horrendous Evils and the Goodness of God. Ithaca: Cornell University Press, 1999. ISBN 0-8014-8686-6. [2]\nAdams, Marilyn McCord. \"Is the Existence of God a 'Hard' Fact?\". The Philosophical Review Vol. LXXVI, No. 4 (October 1967) 492-503.\nAdams, Marilyn McCord, trans. Paul of Venice, On the Truth and Falsity of Propositions and On the Significatum of a Proposition, ed. Francesco del Punta. London: Oxford University Press for the British Academy, 1977.\nAdams, Marilyn McCord, and Robert Merrihew Adams, eds. The Problem of Evil. Oxford: Oxford University Press, 1990.\nAdams, Marilyn McCord and Norman Kretzman, eds. and trans. William Ockham's Predestination, God's Foreknowledge, and Future Contingents. 2nd ed. Indianapolis, Indiana: Hackett, 1983.\nAdams, Marilyn McCord. Some Later Medieval Theories of the Eucharist: Thomas Aquinas, Giles of Rome, Duns Scotus, and William Ockham. New York: Oxford University Press, 2010.\nAdams, Marilyn McCord. \"What Sort of Human Nature? Medieval Philosophy and the Systematics of Christology\" (Aquinas Lecture 1999). Milwaukee: Marquette University Press, 1999.\nAdams, Marilyn McCord. William of Ockham (2 vols.) Notre Dame, Indiana: Notre Dame University Press, 1987. ISBN 0-268-01945-2\n\n\n== See also ==\nFaculty of Theology and Religion, University of Oxford\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nMcCord Adams' faculty page at Oxford University\nSermon on issues in human sexuality (2004)\nEpisode of In Our Time (May 2007), \"Ockham's Razor\", BBC Radio 4.\nInterview with Philosophy Bites on evil and optimism\nOnn Adams' \"aesthetic\" theodicy.", "ns": 0, "pageid": 2015815, "title": "Marilyn McCord Adams"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}