{"batchcomplete": "", "query": {"normalized": [{"to": "Marquis de Sade", "from": "Marquis_de_Sade"}], "pages": {"21345243": {"extract": "Donatien Alphonse François, Marquis de Sade (2 June 1740 – 2 December 1814) (French: [maʁki də sad]), was a French aristocrat, revolutionary politician, philosopher, and writer, famous for his libertine sexuality. His works include novels, short stories, plays, dialogues, and political tracts; in his lifetime some were published under his own name, while others appeared anonymously and de Sade denied being their author. De Sade is best known for his erotic works, which combined philosophical discourse with pornography, depicting sexual fantasies with an emphasis on violence, criminality, and blasphemy against the Catholic Church. He was a proponent of extreme freedom, unrestrained by morality, religion, or law. The words sadism and sadist are derived from his name.\nDe Sade was incarcerated in various prisons and an insane asylum for about 32 years of his life: 11 years in Paris (10 of which were spent in the Bastille), a month in the Conciergerie, two years in a fortress, a year in Madelonnettes Convent, three years in Bicêtre Hospital, a year in Sainte-Pélagie Prison, and 12 years in the Charenton asylum. During the French Revolution he was an elected delegate to the National Convention. Many of his works were written in prison.\n\n\n== Life ==\n\n\n=== Early life and education ===\n\nThe Marquis de Sade was born in the Hôtel de Condé, Paris, to Jean Baptiste François Joseph, Count de Sade and Marie Eléonore de Maillé de Carman, cousin and Lady-in-waiting to the Princess of Condé on 2 June 1740. He was his parents' only surviving child. He was educated by an uncle, the Abbé de Sade. In de Sade's youth, his father abandoned the family; his mother joined a convent. He was raised with servants who indulged \"his every whim,\" which led to him becoming \"known as a rebellious and spoiled child with an ever-growing temper.\"\nLater in his childhood, de Sade was sent to the Lycée Louis-le-Grand in Paris, a Jesuit college, for four years. While at the school, he was tutored by Abbé Jacques-François Amblet, a priest. Later in life, the Abbé testified at one of de Sade's trials, saying that de Sade had a \"passionate temperament which made him eager in the pursuit of pleasure\" but had a \"good heart.\" At the Lycée Louis-le-Grand, he was subjected to \"severe corporal punishment,\" including \"flagellation,\" and he \"spent the rest of his adult life obsessed with the violent act.\" At age 14, de Sade began attending an elite military academy.\nAt age 15, he was commissioned as a sub-lieutenant on 14 December 1755 after 20 months of training, becoming a soldier. After 13 months as a sub-lieutenant, he was commissioned to the rank of cornet in the Brigade de S. André of the Comte de Provence's Carbine Regiment. He eventually became Colonel of a Dragoon regiment and fought in the Seven Years' War. In 1763, on returning from war, he courted a rich magistrate's daughter, but her father rejected his suitorship and, instead, arranged a marriage with his elder daughter, Renée-Pélagie de Montreuil; that marriage produced two sons and a daughter. In 1766, he had a private theatre built in his castle, the Château de Lacoste, in Provence. In January 1767, his father died.\n\n\n=== Title and heirs ===\nThe men of the de Sade family alternated between using the marquis and comte (count) titles. His grandfather, Gaspard François de Sade, was the first to use marquis; occasionally, he was the Marquis de Sade, but is identified in documents as the Marquis de Mazan. The de Sade family were noblesse d'épée, claiming at the time the oldest, Frank-descended nobility, so, assuming a noble title without a King's grant, was customarily de rigueur. Alternating title usage indicates that titular hierarchy (below duc et pair) was notional; theoretically, the marquis title was granted to noblemen owning several countships, but its use by men of dubious lineage caused its disrepute. At Court, precedence was by seniority and royal favor, not title. There is father-and-son correspondence, wherein father addresses son as marquis.\nFor many years, de Sade's descendants regarded his life and work as a scandal to be suppressed. This did not change until the mid-twentieth century, when the Comte Xavier de Sade reclaimed the marquis title, long fallen into disuse, on his visiting cards, and took an interest in his ancestor's writings. At that time, the \"Divine Marquis\" of legend was so unmentionable in his own family that Xavier de Sade only learned of him in the late 1940s when approached by a journalist. He subsequently discovered a store of de Sade's papers in the family château at Condé-en-Brie, and worked with scholars for decades to enable their publication. His youngest son, the Marquis Thibault de Sade, has continued the collaboration. The family have also claimed a trademark on the name. The family sold the Château de Condé in 1983. As well as the manuscripts they retain, others are held in universities and libraries. Many, however, were lost in the eighteenth and nineteenth centuries. A substantial amount were destroyed after de Sade's death at the instigation of his son, Donatien-Claude-Armand.\n\n\n=== Scandals and imprisonment ===\nDe Sade lived a scandalous libertine existence and repeatedly procured young prostitutes as well as employees of both sexes in his castle in Lacoste. He was also accused of blasphemy, a serious offense at that time. His behavior included an affair with his wife's sister, Anne-Prospère, who had come to live at the castle.\nBeginning in 1763, de Sade lived mainly in or near Paris. Several prostitutes there complained about mistreatment by him and he was put under surveillance by the police, who made detailed reports of his activities. After several short imprisonments, which included a brief incarceration in the Château de Saumur (then a prison), he was exiled to his château at Lacoste in 1768.\nThe first major scandal occurred on Easter Sunday in 1768, in which de Sade procured the sexual services of a woman, Rose Keller, a widow-beggar who approached him for alms. He told her she could make money by working for him—she understood her work to be that of a housekeeper. At his chateau at Arcueil, de Sade ripped her clothes off, threw her on a divan and tied her by the four limbs. Then he whipped her, made various incisions on her body into which he poured hot wax, and then beat her. He repeated this process seven or eight times, when she finally escaped by climbing out of a second-floor window and running away. At this time, la Présidente, de Sade's mother-in-law, obtained a lettre de cachet (a royal order of arrest and imprisonment, without stated cause or access to the courts) from the King, excluding de Sade from the jurisdiction of the courts. The lettre de cachet would later prove disastrous for the marquis.\nIn 1772, an episode in Marseille involved the non-lethal poisoning of prostitutes with the supposed aphrodisiac Spanish fly and sodomy with Latour, his manservant. That year, the two men were sentenced to death in absentia for sodomy and the poisoning. They fled to Italy, de Sade taking his wife's sister with him. De Sade and Latour were caught and imprisoned at the Fortress of Miolans in late 1772, but escaped four months later.\n\nDe Sade later hid at Lacoste, where he rejoined his wife, who became an accomplice in his subsequent endeavors. He kept a group of young employees at Lacoste, most of whom complained about sexual mistreatment and quickly left his service. De Sade was forced to flee to Italy once again. It was during this time he wrote Voyage d'Italie. In 1776, he returned to Lacoste, again hired several servant girls, most of whom fled. In 1777, the father of one of those employees went to Lacoste to claim his daughter, and attempted to shoot the Marquis at point-blank range, but the gun misfired.\nLater that year, de Sade was tricked into going to Paris to visit his supposedly ill mother, who in fact had recently died. He was arrested there and imprisoned in the Château de Vincennes. He successfully appealed his death sentence in 1778, but remained imprisoned under the lettre de cachet. He escaped but was soon recaptured. He resumed writing and met fellow prisoner Comte de Mirabeau, who also wrote erotic works. Despite this common interest, the two came to dislike each other intensely.\nIn 1784, Vincennes was closed, and de Sade was transferred to the Bastille. On 2 July 1789, he reportedly shouted out from his cell to the crowd outside, \"They are killing the prisoners here!\", and a disturbance began to foment. Two days later, he was transferred to the insane asylum at Charenton near Paris. The storming of the Bastille, a major event of the French Revolution, would occur a few days later on 14 July.\nHe had been working on his magnum opus Les 120 Journées de Sodome (The 120 Days of Sodom). To his despair, he believed that the manuscript was lost during his transfer, but he continued to write.\nIn 1790, he was released from Charenton after the new National Constituent Assembly abolished the instrument of lettre de cachet. His wife obtained a divorce soon after.\n\n\n=== Return to freedom, delegate to the National Convention, and imprisonment ===\nDuring Sade's time of freedom, beginning in 1790, he published several of his books anonymously. He met Marie-Constance Quesnet, a former actress, and mother of a six-year-old son, who had been abandoned by her husband. Constance and de Sade would stay together for the rest of his life.\nHe initially ingratiated himself with the new political situation after the revolution, supported the Republic, called himself \"Citizen de Sade\", and managed to obtain several official positions despite his aristocratic background.\nBecause of the damage done to his estate in Lacoste, which was sacked in 1789 by an angry mob, he moved to Paris. In 1790, he was elected to the National Convention, where he represented the far left. He was a member of the Piques section, notorious for its radical views. He wrote several political pamphlets, in which he called for the implementation of direct vote. However, there is much to suggest that he suffered abuse from his fellow revolutionaries due to his aristocratic background. Matters were not helped by his son's May 1792 desertion from the military, where he had been serving as a second lieutenant and the aide-de-camp to an important colonel, the Marquis de Toulengeon. De Sade was forced to disavow his son's desertion in order to save his neck. Later that year, his name was added – whether by error or wilful malice – to the list of émigrés of the Bouches-du-Rhône department.\nWhile claiming he was opposed to the Reign of Terror in 1793, he wrote an admiring eulogy for Jean-Paul Marat. At this stage, he was becoming publicly critical of Maximilien Robespierre and, on 5 December, he was removed from his posts, accused of \"moderatism\", and imprisoned for almost a year. He was released in 1794, after the overthrow and execution of Robespierre had effectively ended the Reign of Terror.\nIn 1796, now all but destitute, he had to sell his ruined castle in Lacoste.\n\n\n=== Imprisonment for his writings and death ===\n\nIn 1801, Napoleon Bonaparte ordered the arrest of the anonymous author of Justine and Juliette. De Sade was arrested at his publisher's office and imprisoned without trial; first in the Sainte-Pélagie Prison and, following allegations that he had tried to seduce young fellow prisoners there, in the harsh fortress of Bicêtre.\nAfter intervention by his family, he was declared insane in 1803 and transferred once more to the asylum at Charenton. His ex-wife and children had agreed to pay his pension there. Constance was allowed to live with him at Charenton. The benign director of the institution, Abbé de Coulmier, allowed and encouraged him to stage several of his plays, with the inmates as actors, to be viewed by the Parisian public. Coulmier's novel approaches to psychotherapy attracted much opposition. In 1809, new police orders put de Sade into solitary confinement and deprived him of pens and paper. In 1813, the government ordered Coulmier to suspend all theatrical performances.\nDe Sade began a sexual relationship with 14-year-old Madeleine LeClerc, daughter of an employee at Charenton. This affair lasted some 4 years, until his death in 1814.\nHe had left instructions in his will forbidding that his body be opened for any reason whatsoever, and that it remain untouched for 48 hours in the chamber in which he died, and then placed in a coffin and buried on his property located in Malmaison near Épernon. His skull was later removed from the grave for phrenological examination. His son had all his remaining unpublished manuscripts burned, including the immense multi-volume work Les Journées de Florbelle.\n\n\n== Appraisal and criticism ==\nNumerous writers and artists, especially those concerned with sexuality, have been both repelled and fascinated by de Sade.\nThe contemporary rival pornographer Rétif de la Bretonne published an Anti-Justine in 1798.\nGeoffrey Gorer, an English anthropologist and author (1905–1985), wrote one of the earliest books on de Sade entitled The Revolutionary Ideas of the Marquis de Sade in 1935. He pointed out that de Sade was in complete opposition to contemporary philosophers for both his \"complete and continual denial of the right to property\" and for viewing the struggle in late 18th century French society as being not between \"the Crown, the bourgeoisie, the aristocracy or the clergy, or sectional interests of any of these against one another\", but rather all of these \"more or less united against the proletariat.\" By holding these views, he cut himself off entirely from the revolutionary thinkers of his time to join those of the mid-nineteenth century. Thus, Gorer argued, \"he can with some justice be called the first reasoned socialist.\"\nSimone de Beauvoir (in her essay Must we burn Sade?, published in Les Temps modernes, December 1951 and January 1952) and other writers have attempted to locate traces of a radical philosophy of freedom in de Sade's writings, preceding modern existentialism by some 150 years. He has also been seen as a precursor of Sigmund Freud's psychoanalysis in his focus on sexuality as a motive force. The surrealists admired him as one of their forerunners, and Guillaume Apollinaire famously called him \"the freest spirit that has yet existed\".\nPierre Klossowski, in his 1947 book Sade Mon Prochain (\"Sade My Neighbour\"), analyzes de Sade's philosophy as a precursor of nihilism, negating Christian values and the materialism of the Enlightenment.\nOne of the essays in Max Horkheimer and Theodor Adorno's Dialectic of Enlightenment (1947) is titled \"Juliette, or Enlightenment and Morality\" and interprets the ruthless and calculating behavior of Juliette as the embodiment of the philosophy of enlightenment. Similarly, psychoanalyst Jacques Lacan posited in his 1966 essay \"Kant avec de Sade\" that de Sade's ethics was the complementary completion of the categorical imperative originally formulated by Immanuel Kant. However, at least one philosopher has rejected Adorno and Horkheimer’s claim that de Sade's moral skepticism is actually coherent, or that it reflects Enlightenment thought.\nIn his 1988 Political Theory and Modernity, William E. Connolly analyzes Sade's Philosophy in the Bedroom as an argument against earlier political philosophers, notably Jean-Jacques Rousseau and Thomas Hobbes, and their attempts to reconcile nature, reason, and virtue as bases of ordered society. Similarly, Camille Paglia argued that de Sade can be best understood as a satirist, responding \"point by point\" to Rousseau's claims that society inhibits and corrupts mankind's innate goodness: Paglia notes that Sade wrote in the aftermath of the French Revolution, when Rousseauist Jacobins instituted the bloody Reign of Terror and Rousseau's predictions were brutally disproved.\nIn The Sadeian Woman: And the Ideology of Pornography (1979), Angela Carter provides a feminist reading of Sade, seeing him as a \"moral pornographer\" who creates spaces for women. Similarly, Susan Sontag defended both Sade and Georges Bataille's Histoire de l'oeil (Story of the Eye) in her essay \"The Pornographic Imagination\" (1967) on the basis their works were transgressive texts, and argued that neither should be censored. By contrast, Andrea Dworkin saw Sade as the exemplary woman-hating pornographer, supporting her theory that pornography inevitably leads to violence against women. One chapter of her book Pornography: Men Possessing Women (1979) is devoted to an analysis of Sade. Susie Bright claims that Dworkin's first novel Ice and Fire, which is rife with violence and abuse, can be seen as a modern retelling of Sade's Juliette.\n\n\n== Influence ==\nVarious influential cultural figures have expressed a great interest in de Sade's work, including the French philosopher Michel Foucault, the American film maker John Waters and the Spanish filmmaker Jesús Franco. The poet Algernon Charles Swinburne is also said to have been highly influenced by de Sade. Nikos Nikolaidis' 1979 film The Wretches Are Still Singing was shot in a surreal way with a predilection for the aesthetics of the Marquis de Sade; de Sade is said to have influenced Romantic and Decadent authors such as Charles Baudelaire, Gustave Flaubert, Algernon Swinburne, and Rachilde; and to have influenced a growing popularity of nihilism in Western thought.\nThe philosopher of egoist anarchism Max Stirner is also speculated to have been influenced by de Sade's work.\nSerial killer Ian Brady, who with Myra Hindley carried out torture and murder of children known as the Moors murders in England during the 1960s, was fascinated by de Sade, and the suggestion was made at their trial and appeals that the tortures of the children (the screams and pleadings of whom they tape-recorded) were influenced by de Sade's ideas and fantasies. According to Donald Thomas, who has written a biography on de Sade, Brady and Hindley had read very little of de Sade's actual work; the only book of his they possessed was an anthology of excerpts that included none of his most extreme writings. In the two suitcases found by the police that contained books that belonged to Brady was The Life and Ideas of the Marquis de Sade. Hindley herself claimed that Brady would send her to obtain books by de Sade, and that after reading them he became sexually aroused and beat her.\nIn Philosophy in the Bedroom de Sade proposed the use of induced abortion for social reasons and population control, marking the first time the subject had been discussed in public. It has been suggested that de Sade's writing influenced the subsequent medical and social acceptance of abortion in Western society.\n\n\n== Cultural depictions ==\n\nThere have been many and varied references to the Marquis de Sade in popular culture, including fictional works and biographies. The eponym of the psychological and subcultural term sadism, his name is used variously to evoke sexual violence, licentiousness, and freedom of speech. In modern culture his works are simultaneously viewed as masterful analyses of how power and economics work, and as erotica. Sade's sexually explicit works were a medium for the articulation of the corrupt and hypocritical values of the elite in his society, which caused him to become imprisoned. He thus became a symbol of the artist's struggle with the censor. De Sade's use of pornographic devices to create provocative works that subvert the prevailing moral values of his time inspired many other artists in a variety of media. The cruelties depicted in his works gave rise to the concept of sadism. De Sade's works have to this day been kept alive by artists and intellectuals because they espouse a philosophy of extreme individualism that became reality in the economic liberalism of the following centuries.\nIn the late 20th century, there was a resurgence of interest in de Sade; leading French intellectuals like Roland Barthes, Jacques Derrida, and Michel Foucault published studies of the philosopher, and interest in de Sade among scholars and artists continued. In the realm of visual arts, many surrealist artists had interest in the Marquis. De Sade was celebrated in surrealist periodicals, and feted by figures such as Guillaume Apollinaire, Paul Éluard, and Maurice Heine; Man Ray admired Sade because he and other surrealists viewed him as an ideal of freedom. The first Manifesto of Surrealism (1924) announced that \"Sade is surrealist in sadism\", and extracts of the original draft of Justine were published in Le Surréalisme au service de la révolution. In literature, de Sade is referenced in several stories by horror and science fiction writer (and author of Psycho) Robert Bloch, while Polish science fiction author Stanisław Lem wrote an essay analyzing the game theory arguments appearing in de Sade's Justine. The writer Georges Bataille applied de Sade's methods of writing about sexual transgression to shock and provoke readers.\nDe Sade's life and works have been the subject of numerous fictional plays, films, pornographic or erotic drawings, etchings, and more. These include Peter Weiss's play Marat/Sade, a fantasia extrapolating from the fact that de Sade directed plays performed by his fellow inmates at the Charenton asylum. Yukio Mishima, Barry Yzereef, and Doug Wright also wrote plays about de Sade; Weiss's and Wright's plays have been made into films. His work is referenced on film at least as early as Luis Buñuel's L'Âge d'Or (1930), the final segment of which provides a coda to de Sade's 120 Days of Sodom, with the four debauched noblemen emerging from their mountain retreat. In 1969, American International Films released a German-made production called de Sade, with Keir Dullea in the title role. Pier Paolo Pasolini filmed Salò, or the 120 Days of Sodom (1975), updating de Sade's novel to the brief Salò Republic; Benoît Jacquot's Sade and Philip Kaufman's Quills (from the play of the same name by Doug Wright) both hit cinemas in 2000. Quills, inspired by de Sade's imprisonment and battles with the censorship in his society, portrays de Sade as a literary freedom fighter who is a martyr to the cause of free expression.\nOften de Sade himself has been depicted in American popular culture less as a revolutionary or even as a libertine and more akin to a sadistic, tyrannical villain. For example, in the final episode of the television series Friday the 13th: The Series, Micki, the female protagonist, travels back in time and ends up being imprisoned and tortured by de Sade. Similarly, in the horror film Waxwork, de Sade is among the film's wax villains to come alive.\n\n\n== Writing ==\n\n\n=== Literary criticism ===\nThe Marquis de Sade viewed Gothic fiction as a genre that relied heavily on magic and phantasmagoria. In his literary criticism de Sade sought to prevent his fiction from being labeled \"Gothic\" by emphasizing Gothic's supernatural aspects as the fundamental difference from themes in his own work. But while he sought this separation he believed the Gothic played a necessary role in society and discussed its roots and its uses. He wrote that the Gothic novel was a perfectly natural, predictable consequence of the revolutionary sentiments in Europe. He theorized that the adversity of the period had rightfully caused Gothic writers to \"look to hell for help in composing their alluring novels.\" Sade held the work of writers Matthew Lewis and Ann Radcliffe high above other Gothic authors, praising the brilliant imagination of Radcliffe and pointing to Lewis' The Monk as without question the genre’s best achievement. De Sade nevertheless believed that the genre was at odds with itself, arguing that the supernatural elements within Gothic fiction created an inescapable dilemma for both its author and its readers. He argued that an author in this genre was forced to choose between elaborate explanations of the supernatural or no explanations at all and that in either case the reader was unavoidably rendered incredulous. Despite his celebration of The Monk, de Sade believed that there was not a single Gothic novel that had been able to overcome these problems. He theorized that if these problems were successfully avoided within the genre that the resulting work would be universally regarded for its excellence in fiction.\nMany assume that de Sade's criticism of the Gothic novel is a reflection of his frustration with sweeping interpretations of works like Justine. Within his objections to the lack of verisimilitude in the Gothic may have been an attempt to present his own work as the better representation of the whole nature of man. Since de Sade professed that the ultimate goal of an author should be to deliver an accurate portrayal of man, it is believed that de Sade's attempts to separate himself from the Gothic novel highlights this conviction. For de Sade, his work was best suited for the accomplishment of this goal in part because he was not chained down by the supernatural silliness that dominated late 18th-century fiction. Moreover, it is believed that de Sade praised The Monk (which displays Ambrosio’s sacrifice of his humanity to his unrelenting sexual appetite) as the best Gothic novel chiefly because its themes were the closest to those within his own work.\n\n\n=== Libertine novels ===\nDe Sade's fiction has been tagged under many different titles, including pornography, Gothic, and baroque. Sade’s most famous books are often classified not as Gothic but as libertine novels, and include the novels Justine, or the Misfortunes of Virtue; Juliette; The 120 Days of Sodom; and Philosophy in the Bedroom. These works challenge perceptions of sexuality, religion, law, age, and gender in ways that de Sade would argue are incompatible with the supernatural. The issues of sexual violence, sadomasochism, and pedophilia stunned even those contemporaries of de Sade who were quite familiar with the dark themes of the Gothic novel during its popularity in the late 18th century. Suffering is the primary rule, as in these novels one must often decide between sympathizing with the torturer or the victim. While these works focus on the dark side of human nature, the magic and phantasmagoria that dominates the Gothic is noticeably absent and is the primary reason these works are not considered to fit the genre.\nThrough the unreleased passions of his libertines, de Sade wished to shake the world at its core. With 120 Days, for example, de Sade wished to present \"the most impure tale that has ever been written since the world exists.\"\n\n\n=== Short fiction ===\nSubtitled \"Heroic and Tragic Tales\", Sade combines romance and horror, employing several Gothic tropes for dramatic purposes. There is blood, banditti, corpses and, of course, insatiable lust. Compared to works like Justine, here Sade is relatively tame, as overt eroticism and torture is subtracted for a more psychological approach. It is the impact of sadism instead of acts of sadism itself that emerge in this work, unlike the aggressive and rapacious approach in his libertine works. The modern volume entitled Gothic Tales collects a variety of other short works of fiction intended to be included in Sade's Contes et Fabliaux d'un Troubadour Provencal du XVIII Siecle.\nAn example is \"Eugénie de Franval\", a tale of incest and retribution. In its portrayal of conventional moralities it is somewhat of a departure from the erotic cruelties and moral ironies that dominate his libertine works. It opens with a domesticated approach:\n\n\"To enlighten mankind and improve its morals is the only lesson which we offer in this story. In reading it, may the world discover how great is the peril which follows the footsteps of those who will stop at nothing to satisfy their desires.\"\n\nDescriptions in Justine seem to anticipate Radcliffe's scenery in The Mysteries of Udolpho and the vaults in The Italian, but, unlike these stories, there is no escape for Sade's virtuous heroine, Justine. Unlike the milder Gothic fiction of Radcliffe, Sade's horror ends in sodomy, rape, or torture. To have a character like Justine, who is stripped without ceremony and bound to a wheel for fondling and thrashing, would be unthinkable in the domestic Gothic fiction written for the bourgeoisie. Sade even contrives a kind of affection between Justine and her tormentors, suggesting shades of masochism in his heroine.\n\n\n=== Sadism in the Gothic novel ===\nDespite the strong adverse reaction to de Sade's work and de Sade's own disassociation from the Gothic novel, the similarities between the fiction of sadism and the Gothic novel were much closer than many of its readers or providers even realized. After the controversy surrounding Matthew Lewis' The Monk, Minerva Press released The New Monk as a supposed indictment of a wholly immoral book. It features the sadistic Mrs. Rod, whose boarding school for young women becomes a torture chamber equipped with its own \"flogging-room\". Ironically, The New Monk wound up increasing the level of cruelty, but as a parody of the genre, it illuminates the link between sadism and the Gothic novel.\n\n\n== In popular culture ==\nThe Marquis de Sade appears as a character in the Grant Morrison's graphic novel The Invisibles.\n\"Howard Roark is the Marquis de Sade of architecture.\" In the Ayn Rand novel Fountainhead (1943).\nThe Guy Endore novel Satan's Saint (1965) is a fictionalized biography of Marquis de Sade.\nThe Marquis de Sade is mentioned in the lyrics of The Stone Roses song \"Fools Gold\".\nThe 1990 song \"sadeness (Part I)\" by the group Enigma was inspired by the Marquis de Sade.\nThe 2000 film Quills is a heavily fictionalized account of the Marquis de Sade's imprisonment. It starred Geoffrey Rush as de Sade.\nThe Marquis de Sade appears in the 2011 novel \"Madame Tussaud,\" by Michelle Moran.\nThe Marquis de Sade appears as an non-player character in the 2014 video game Assassin's Creed: Unity.\nThe character of Orin in the 1986 movie musical Little Shop of Horrors is referred to as the Marquis de Sade during the \"Dentist!\" song number.\nMarquis (1989), a film by Henri Xhonneux and Roland Topor, was inspired by Sade's imprisonment. The characters wear masques of anthopomorphic animals.\n\"The Persecution and Assassination of Jean-Paul Marat as Performed by the Inmates of the Asylum of Charenton Under the Direction of the Marquis de Sade\" is a play by Peter Weisse that depicts the Marquis.\n\n\n== Bibliography ==\n\n\n== See also ==\n\nBDSM\nFetish fashion\nLeopold von Sacher-Masoch\nSadomasochism\nSexual fetishism\nSexual sadism disorder\nQuills\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nMarquis de Sade at Encyclopædia Britannica\nWorks by Marquis de Sade at Project Gutenberg\nWorks by or about Marquis de Sade at Internet Archive\nWorks by Marquis de Sade at Open Library \nNorbert Sclippa\nŒuvres du Marquis de Sade\nMarquis de Sade at the Internet Speculative Fiction Database\nMarquis de Sade at the Internet Movie Database\nBiography at Trivia Library\nCarnet du Marquis de Sade Site run by a descendant of the Marquis de Sade. Weekly publication of the article(s) around the current de Sade.\nCrime Library: The Marquis de Sade\nMcLemee, Scott. \"Sade, Marquis de (1740-1814)\". glbtq.com. Retrieved 30 January 2015.", "ns": 0, "pageid": 21345243, "title": "Marquis de Sade"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}