{"batchcomplete": "", "query": {"normalized": [{"to": "Martin Löb", "from": "Martin_Löb"}], "pages": {"7268088": {"extract": "Martin Hugo Löb (German: [løːp]; 31 March 1921 – 21 August 2006) was a German mathematician. He settled in the United Kingdom after the Second World War and specialised in mathematical logic. He moved to the Netherlands in the 1970s, where he remained in retirement. He is perhaps best known for having formulated Löb's theorem in 1955.\n\n\n== Early life and education ==\nLöb grew up in Berlin, but escaped from the Nazis, arriving in the UK just before the outbreak of the Second World War. As an enemy alien, he was deported on the Dunera to an internment camp at Hay in Australia in 1940, where the 19-year-old Löb was taught mathematics by other internees. His teacher, Felix Behrend, was later a professor at Melbourne University.\nLöb was allowed to return to the UK in 1943, and he studied at the University of London after the War. After graduating, he became a research student with Reuben Goodstein at the University of Leicester. He completed his PhD and became an assistant lecturer at the University of Leeds in 1951, where he was to remain for 20 years, becoming a Reader and ultimately Professor of Mathematical Logic from 1967 to 1970. He developed the mathematical logic group at Leeds, making it one of the leading centres in the UK. Löb did research on proof theory, modal logic and computability theory. He formulated Löb's theorem in 1955, as a formal version of Löb's paradox, that statements that assert their own provability must be true (similar to Gödel's incompleteness theorem).\nLöb's wife, Caroline, was Dutch. They had two daughters together. Löb moved to become a professor at the University of Amsterdam in the early 1970s. He remained at the University of Amsterdam until he retired. He then moved to Annen, where he later died.\n\n\n== References ==\n\nO'Connor, John J.; Robertson, Edmund F., \"Martin Löb\", MacTutor History of Mathematics archive, University of St Andrews .\nObituary, The Guardian, 3 October 2006\nObituary, Institute for Logic, Language and Computation, University of Amsterdam", "ns": 0, "pageid": 7268088, "title": "Martin Löb"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}