{"batchcomplete": "", "query": {"normalized": [{"to": "Martin Rees", "from": "Martin_Rees"}], "pages": {"527165": {"extract": "Martin John Rees, Baron Rees of Ludlow, OM, FRS, FREng, FMedSci (born 23 June 1942) is a British cosmologist and astrophysicist. He has been Astronomer Royal since 1995 and was Master of Trinity College, Cambridge from 2004 to 2012 and President of the Royal Society between 2005 and 2010. Rees currently sits on the Board of Sponsors for the Bulletin of the Atomic Scientists.\n\n\n== Early life ==\nRees was born on 23 June 1942 in York, England. After a peripatetic life during the war his parents, both teachers, settled with Rees, an only child, in a rural part of Shropshire near the border with Wales. There, his parents founded Bedstone College, a boarding school based on progressive educational concepts that continues to thrive to this day. He was educated at Bedstone College, then from the age of 13 at Shrewsbury School, Shropshire. He studied for the Mathematics tripos at Trinity College, Cambridge, graduating with first class. He then undertook post-graduate research at Cambridge and completed a PhD degree under Dennis Sciama in 1967. Rees's post-graduate work in astrophysics in the mid-1960s coincided with an explosion of new discoveries, with breakthroughs ranging from confirmation of the big bang, the discovery of neutron stars and black holes, and a host of other revelations. Martin Rees is an atheist and has criticised militant atheists for being too hostile to religion.\n\n\n== Scientific career ==\nAfter holding post-doctoral research positions in the United Kingdom and the United States, he taught at Sussex University and the University of Cambridge, where he was the Plumian Professor until 1991, and the director of the Institute of Astronomy.\nFrom 1992 to 2003, he was Royal Society Research Professor, and from 2003 Professor of Cosmology and Astrophysics. He was Professor of Astronomy at Gresham College, London, in 1975 and became a Fellow of the Royal Society in 1979. He holds Visiting Professorships at Imperial College London and at the University of Leicester and is an Honorary Fellow of Darwin College, Cambridge and Jesus College, Cambridge.\nLord Rees has received honorary degrees from a number of universities including Sussex, Uppsala, Toronto, Durham, Oxford, Yale, Melbourne and Sydney. He belongs to several foreign academies, including the US National Academy of Sciences, the Russian Academy of Sciences, the Pontifical Academy of Sciences and the Royal Netherlands Academy of Arts and Sciences.\nHe has been President of the Royal Astronomical Society (1992–94) and the British Association (1995–96), and was a Member of Council of the Royal Institution of Great Britain until 2010. Rees is the author of more than 500 research papers, and he has made important contributions to the origin of cosmic microwave background radiation, as well as to galaxy clustering and formation. His studies of the distribution of quasars led to final disproof of Steady State theory.\nHe was one of the first to propose that enormous black holes power quasars, and that superluminal astronomical observations can be explained as an optical illusion caused by an object moving partly in the direction of the observer.\nIn recent years, Lord Rees has worked on gamma-ray bursts, especially in collaboration with Peter Mészáros, and on how the \"cosmic dark ages\" ended when the first stars formed. In a more speculative vein, he has, since the 1970s, been interested in anthropic reasoning, and the possibility that our visible universe is part of a vaster \"multiverse\".\nLord Rees is an author of books on astronomy and science intended for the lay public and gives many public lectures and broadcasts. In 2010 he was chosen to deliver the Reith Lectures for the BBC, now published as From Here to Infinity: Scientific Horizons. Rees believes the Search for Extraterrestrial Intelligence is worthwhile, although the chance of success is small.\nIn 2005, Rees was elevated to a life peerage, sitting as a crossbencher in the House of Lords as Baron Rees of Ludlow, of Ludlow in the County of Shropshire. In 2005, he was awarded the Crafoord Prize.\nHe became President of the Royal Society on 1 December 2005 and continued until the end of the Society's 350th Anniversary Celebrations in 2010. In 2011, he was awarded the Templeton Prize.\nAside from expanding his scientific interests, Rees has written and spoken extensively about the problems and challenges of the 21st century, and the interfaces between science, ethics and politics. He is a member of the Board of the Institute for Advanced Study, in Princeton, the IPPR, the Oxford Martin School and the Gates Cambridge Trust. He co-founded the Centre for the Study of Existential Risk and serves on the Scientific Advisory Board for the Future of Life Institute. He has formerly been a Trustee of the British Museum and the Science Museum. He is a foreign member of Science Academy of Turkey\nIn August 2014, Lord Rees of Ludlow was one of 200 public figures who were signatories to a letter to The Guardian opposing Scottish independence in the run-up to September's referendum on that issue.\nIn 2015, he was co-author of the report that launched the Global Apollo Programme, which calls for developed nations to commit to spending 0.02% of their GDP for 10 years, to fund co-ordinated research to make carbon-free baseload electricity less costly than electricity from coal by the year 2025.\n\n\n== Honours ==\nAwards\nHeineman Prize (1984)\nGold Medal of the Royal Astronomical Society (1987)\nBalzan Prize (1989) for High Energy Astrophysics\nKnight Bachelor (1992)\nBruce Medal (1993)\nHonorary doctorate from the Faculty of Science and Technology at Uppsala University, Sweden  (1995)\nBruno Rossi Prize (2000)\nGruber Prize in Cosmology (2001)\nAlbert Einstein World Award of Science (2003)\nHenry Norris Russell Lectureship of the American Astronomical Society (2004)\nLifeboat Foundation's Guardian Award (2004)\nRoyal Society's Michael Faraday Prize for science communication (2004)\nLife Peerage (2005)\nCrafoord Prize, with James Gunn and James Peebles (2005)\nOrder of Merit – the personal gift of The Queen (2007)\nCaird Medal of the National Maritime Museum (2007)\nHonorary Fellow of the Royal Academy of Engineering (2007)\nTempleton Prize (2011)\nIsaac Newton Medal (2012)\nHonorary Doctorate, Harvard University (awarded in Cambridge, Massachusetts, on 26 May 2016).\nNamed after him\nAsteroid 4587 Rees\n\n\n== Publications ==\nCosmic Coincidences: Dark Matter, Mankind, and Anthropic Cosmology (co-author John Gribbin), 1989, Bantam; ISBN 0-553-34740-3\nNew Perspectives in Astrophysical Cosmology, 1995; ISBN 0-521-64544-1\nGravity's Fatal Attraction: Black Holes in the Universe, 1995; ISBN 0-7167-6029-0, 2nd edition 2009, ISBN 0-521-71793-0\nBefore the Beginning – Our Universe and Others, 1997; ISBN 0-7382-0033-6\nJust Six Numbers: The Deep Forces That Shape the Universe, 1999; ISBN 0-297-84297-8\nOur Cosmic Habitat, 2001; ISBN 0-691-11477-3\nOur Final Hour: A Scientist's Warning: How Terror, Error, and Environmental Disaster Threaten Humankind's Future In This Century—On Earth and Beyond (UK title: Our Final Century: Will the Human Race Survive the Twenty-first Century?), 2003; ISBN 0-465-06862-6\nWhat We Still Don't Know ISBN 978-0-7139-9821-4 yet to be published.\nFrom Here to Infinity: Scientific Horizons, 2011; ISBN 978-1-84668-5033\n\n\n== See also ==\nRees's Six Fundamental Numbers\nGresham Professor of Astronomy\n\n\n== References ==\n\n\n== External links ==\n2005 talk: Is this our final century?, ted.com; accessed 31 August 2014.\nInterviews with Charlie Rose, 2003 and 2008, charlierose.com; accessed 31 August 2014.\nNew Statesman Interviews Martin Rees, newstatesman.com, 6 April 2010; accessed 31 August 2014.\nMartin J. Rees at Library of Congress Authorities, with 23 catalogue records", "ns": 0, "pageid": 527165, "title": "Martin Rees"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}