{"batchcomplete": "", "query": {"normalized": [{"to": "Maurice Cranston", "from": "Maurice_Cranston"}], "pages": {"9528787": {"extract": "Maurice William Cranston (8 May 1920 – 5 November 1993) was an English philosopher, professor and author. He served for many years as Professor of Political Science at the London School of Economics, and was also known for his popular publications. In the late 1970s and early 1980s he was Professor of Political Theory at the European University Institute in Florence (Italy).\nHe was born at 53 Harringay Road, Harringay and educated at South Harringay School, the University of London and the St Catherine's College, Oxford. As a young man, Cranston was a friend of the painter Denton Welch. During the Second World War, Cranston was a conscientious objector, active in the Peace Pledge Union, and a \"frequent contributor\" to its newspaper Peace News.\nCranston's major works include biographies of John Locke, for which he received the 1957 James Tait Black Memorial Prize, and Rousseau, Jean-Paul Sartre and others addressing the history of liberty. He contributed to many publications in both Britain and the United States and wrote scripts for the BBC. In 1946 two of his detective novels were published by John Westhouse: Tomorrow We'll Be Sober and Philosopher's Hemlock.\nCranston's intellectual abilities were varied. His first academic book, Freedom: A New Analysis (1954), covered history (the history of liberalism), politics (a precursive discussion of what Sir Isaiah Berlin would later analyse as negative and positive liberty) and a philosophical attempt to resolve or at least elucidate freedom of the will. The philosophical section was the least successful; and Cranston never again attempted pure philosophy. His main academic strengths were as a biographer and as an intellectual historian.\nIn a controversial paper, Cranston argued that the scarcity of welfare goods and services meant that supposed welfare rights are not really rights at all.\nIn his later years, Cranston moved to the political right, and expressed admiration for Margaret Thatcher. Cranston also contributed to The American Spectator magazine.\nCranston had a keen aesthetic sensibility. This was shown not only in his clothes but also in his elegant literary style. Elegance extended also to his conversation. At a party for politics students at the London School of Economics in 1965, sherry was much in demand. Professor Kingsley Smellie pointed to a bottle and said to Cranston : 'I hope you've ordered buckets of that stuff'. 'I have', Cranston replied without malice, 'not quite in those terms'.\nHe died 5 November 1993 of a heart attack while taping a television production in London for the BBC. He was 73.\n\n\n== Publications ==\nFreedom : A New Analysis, London : Longmans, Green, 1954.\nJohn Locke : A Biography, London : Longmans, Green, 1957.\nJohn Stuart MIll, London : Longmans, Green, 1958.\nHuman Rights Today, London : Ampersand, 1962.\nJean-Jacques Rousseau : The Social Contract, tr. with intro., Harmondsworth : Penguin, 1968.\nPolitics and Ethics, Inaugural Lecture, London School of Economics, 1971, London : Weidenfeld and Nicolson, 1972.\nThe Mask of Politics, and Other Essays, London : Allen Lane, 1973.\nWhat Are Human Rights?, London : Bodley Head, 1973.\nJean-Jacques: The Early Life and Work, New York: Norton, 1982. [Vol. 1 of Rousseau biography]\nImaga Dialogo Marks/Bakunin [in Esperanto], Laroque Timbaut (France): Sennacieca Asocio Tutmonda, 1982.\nJean-Jacques Rousseau : A Discourse on Inequality, tr. with intro., Harmondsworth : Penguin, 1984.\n'Rousseau on Equality', Social Philosophy and Policy, 2(01), 1984.\nThe Noble Savage, Chicago : University of Chicago Press, 1991.[Vol. 2 of Rousseau biography]\nThe Solitary Self, Chicago: University of Chicago Press, 1997.[Vol. 3 of Rousseau biography]\n\n\n== See also ==\nA Critique of Pure Tolerance\n\n\n== External links ==\nMaurice Cranston Collection at the Harry Ransom Center at the University of Texas at Austin\n\n\n== References ==", "ns": 0, "pageid": 9528787, "title": "Maurice Cranston"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}