{"batchcomplete": "", "query": {"normalized": [{"to": "Max Stirner", "from": "Max_Stirner"}], "pages": {"112282": {"extract": "Johann Kaspar Schmidt (October 25, 1806 – June 26, 1856), better known as Max Stirner, was a German philosopher. He is often seen as one of the forerunners of nihilism, existentialism, psychoanalytic theory, postmodernism, and anarchism, especially of individualist anarchism. Stirner's main work is The Ego and Its Own, also known as The Ego and His Own (Der Einzige und sein Eigentum in German, which translates literally as The Only One and His Property). This work was first published in 1845 in Leipzig, and has since appeared in numerous editions and translations.\n\n\n== Biography ==\n\nStirner was born in Bayreuth, Bavaria. What little is known of his life is mostly due to the Scottish-born German writer John Henry Mackay, who wrote a biography of Stirner (Max Stirner – sein Leben und sein Werk), published in German in 1898 (enlarged 1910, 1914), and translated into English in 2005.\nStirner was the only child of Albert Christian Heinrich Schmidt (1769–1807) and Sophia Elenora Reinlein (1778–1839). His father died of tuberculosis on April 19, 1807 at the age of 37. In 1809 his mother remarried to Heinrich Ballerstedt, a pharmacist, and settled in West Prussian Kulm (now Chełmno, Poland).\nWhen Stirner turned 20, he attended the University of Berlin, where he studied philology, philosophy, and theology. He attended the lectures of Georg Wilhelm Friedrich Hegel, who was to become a source of inspiration for his thinking. He attended Hegel's lectures on the history of philosophy, the philosophy of religion and the subjective spirit. Stirner then moved to the University of Erlangen, which he attended at the same time as Ludwig Feuerbach.\nStirner returned to Berlin and obtained a teaching certificate, but was unable to obtain a full-time teaching post from the Prussian government.\nWhile in Berlin in 1841, Stirner participated in discussions with a group of young philosophers called \"Die Freien\" (\"The Free\"), and whom historians have subsequently categorized as the Young Hegelians. Some of the best known names in 19th century literature and philosophy were involved with this group, including Karl Marx, Friedrich Engels, Bruno Bauer, and Arnold Ruge. Contrary to popular belief, Feuerbach was not a member of Die Freien, although he was heavily involved in Young Hegelian discourse. While some of the Young Hegelians were eager subscribers to Hegel's dialectical method and attempted to apply dialectical approaches to Hegel's conclusions, the left-wing members of the group broke with Hegel. Feuerbach and Bauer led this charge.\nFrequently the debates would take place at Hippel's, a wine bar in Friedrichstraße, attended by, among others, Marx and Engels, who were both adherents of Feuerbach at the time. Stirner met with Engels many times, and Engels even recalled that they were \"great friends\", but it is still unclear whether Marx and Stirner ever met. It does not appear that Stirner contributed much to the discussions, but he was a faithful member of the club and an attentive listener.\nThe most-often reproduced portrait of Stirner is a cartoon by Engels, drawn 40 years later from memory at biographer Mackay's request. It is highly likely that this and the group sketch of Die Freien at Hippel's are the only firsthand images of Stirner.\nStirner worked as a teacher in a school for young girls owned by Madame Gropius when he wrote his major work, The Ego and Its Own, which in part is a polemic against Feuerbach and Bauer, but also against communists such as Wilhelm Weitling and the anarchist Pierre-Joseph Proudhon. He resigned from his teaching position in anticipation of controversy from this work's publication in October 1844.\nStirner married twice. His first wife was a household servant, with whom he fell in love at an early age. She died from complications with pregnancy in 1838, soon after their marriage. In 1843 he married Marie Dähnhardt, an intellectual associated with Die Freien. They divorced in 1846. The Ego and Its Own was dedicated \"to my sweetheart Marie Dähnhardt\". Marie later converted to Catholicism and died in 1902 in London.\nStirner planned and financed (with Marie's inheritance) an attempt by some Young Hegelians to own and operate a milk-shop on co-operative principles. This enterprise failed partly because the dairy farmers were suspicious of these well-dressed intellectuals. The milk shop was also so well decorated that most of the potential customers felt too poorly dressed to buy their milk there.\nAfter The Ego and Its Own, Stirner wrote Stirner's Critics and translated Adam Smith's The Wealth of Nations and Jean-Baptiste Say's Traite d'Economie Politique into German, to little financial gain. He also wrote a compilation of texts titled History of Reaction in 1852. Stirner died in 1856 in Berlin from an infected insect bite; it is said that Bruno Bauer was the only Young Hegelian present at his funeral, which was held at the Friedhof II der Sophiengemeinde Berlin.\n\n\n== Philosophy ==\n\nThe philosophy of Stirner is credited as a major influence in the development of nihilism, existentialism, post-modernism, and anarchism (especially of individualist anarchism, postanarchism, and post-left anarchy). Stirner's main philosophical work was The Ego and Its Own, also known as The Ego and His Own (Der Einzige und sein Eigentum in German, which translates literally as The Unique One and His Property).\n\n\n=== Egoism ===\nStirner argues that you and I are each something impossible to fully comprehend. All mere concepts of the self will always be inadequate to fully describe the nature of our experience. Stirner has been broadly understood as a proponent of both psychological egoism and ethical egoism, although the latter position can be disputed, as there is no claim in Stirner's writing, in which one 'ought to' pursue one's own interest, and further claiming any 'ought' could be seen as a new 'fixed idea'. However, he may be understood as a rational egoist in the sense that he considered it irrational not to act in one's self-interest. How this self-interest is defined, however, is necessarily subjective, allowing both selfish and altruistic normative claims to be included.\nIndividual self-realization rests on each individual's desire to fulfill their egoism. The difference between an unwilling and a willing egoist, is that the former will be 'possessed' by an empty idea and believe that they are fulfilling a higher cause, but usually being unaware that they are only fulfilling their own desires to be happy or secure, and the latter, in contrast, will be a person that is able to freely choose its actions, fully aware that they are only fulfilling individual desires.\n\nSacred things exist only for the egoist who does not acknowledge himself, the involuntary egoist ... in short, for the egoist who would like not to be an egoist, and abases himself (combats his egoism), but at the same time abases himself only for the sake of \"being exalted\", and therefore of gratifying his egoism. Because he would like to cease to be an egoist, he looks about in heaven and earth for higher beings to serve and sacrifice himself to; but, however much he shakes and disciplines himself, in the end he does all for his own sake... [on] this account I call him the involuntary egoist. ...As you are each instant, you are your own creature in this very 'creature' you do not wish to lose yourself, the creator. You are yourself a higher being than you are, and surpass yourself ... just this, as an involuntary egoist, you fail to recognize; and therefore the 'higher essence' is to you – an alien essence. ... Alienness is a criterion of the \"sacred\".\n\nThe contrast is also expressed in terms of the difference between the voluntary egoist being the possessor of his concepts as opposed to being possessed. Only when one realizes that all sacred truths such as law, right, morality, religion etc., are nothing other than artificial concepts, and not to be obeyed, can one act freely. For Stirner, to be free is to be both one's own \"creature\" (in the sense of 'creation') and one's own \"creator\" (dislocating the traditional role assigned to the gods). To Stirner power is the method of egoism. It is the only justified method of gaining 'Property (philosophy)'.\n\n\n=== Anarchism ===\nStirner proposes that most commonly accepted social institutions – including the notion of State, property as a right, natural rights in general, and the very notion of society – were mere illusions, \"spooks\" or ghosts in the mind.\nHe advocated egoism and a form of amoralism, in which individuals would unite in 'unions of egoists' only when it was in their self-interest to do so. For him, property simply comes about through might: \"Whoever knows how to take, to defend, the thing, to him belongs property.\" And, \"What I have in my power, that is my own. So long as I assert myself as holder, I am the proprietor of the thing.\" He says, \"I do not step shyly back from your property, but look upon it always as my property, in which I respect nothing. Pray do the like with what you call my property!\" Stirner considers the world and everything in it, including other persons, available to one's taking or use without moral constraint – that rights do not exist in regard to objects and people at all. He sees no rationality in taking the interests of others into account unless doing so furthers one's self-interest, which he believes is the only legitimate reason for acting. He denies society as being an actual entity, calling society a \"spook\" and that \"the individuals are its reality\" (The Ego and Its Own).\n\n\n==== Union of egoists ====\n\nStirner's idea of the \"Union of Egoists\", was first expounded in The Ego and Its Own. The Union is understood as a non-systematic association, which Stirner proposed in contradistinction to the state. The Union is understood as a relation between egoists which is continually renewed by all parties' support through an act of will. The Union requires that all parties participate out of a conscious egoism. If one party silently finds themselves to be suffering, but puts up and keeps the appearance, the union has degenerated into something else. This union is not seen as an authority above a person's own will.\n\n\n==== Revolution ====\nStirner criticizes conventional notions of revolution, arguing that social movements aimed at overturning the state are tacitly statist because they are implicitly aimed at the establishment of a new state thereafter.\n\n\n=== Hegel's possible influence ===\nScholars such as Karl Löwith and Lawrence Stepelevich have argued that Hegel was a major influence on The Ego and Its Own. Stepelevich argues, that while The Ego and its Own evidently has an \"un-Hegelian structure and tone to the work as a whole\", as well as being fundamentally hostile to Hegel's conclusions about the self and the world, this does not mean that Hegel had no effect on Stirner.\n\nThe main juncture leading from Hegel to Stirner is found [in The Phenomenology of the Spirit] at the termination of a phenomenological passage to absolute knowledge. Stirner's work is most clearly understood when it is taken to be the answer to the question, 'what role will consciousness play after it has traversed the series of shapes known as 'untrue' knowledge and has attained to absolute knowledge?\n\nTo go beyond and against Hegel in true dialectical fashion is in some way continuing Hegel's project, and Stepelevich argues that this effort of Stirner's is, in fact a completion of Hegel's project. Stepelevich concludes his argument referring to Jean Hyppolite, who in summing up the intention of Hegel's Phenomenology, stated: \"The history of the world is finished; all that is needed is for the specific individual to rediscover it in himself.\"\n\nStirner as an Einziger took himself directly to be that 'specific individual' and then went on as a Hegelian to propose the practical consequence which would ultimately follow upon that theoretical rediscovery, the free play of self-consciousness among the objects of its own determination: \"The idols exist through me; I need only refrain from creating them anew, then they exist no longer: 'higher powers' exist only through my exalting them and abasing myself.... My intercourse with the world consists in my enjoying it, and so consuming it for my self-enjoyment\" (Ego, 319)\n\nScholars such as Douglas Moggach and Widukind De Ridder have argued that Stirner was obviously a student of Hegel, like his contemporaries Ludwig Feuerbach and Bruno Bauer, but this does not necessarily make him an 'Hegelian'. Contrary to the Young Hegelians, Stirner scorned all attempts at an immanent critique of Hegel and the Enlightenment, and renounced Bruno Bauer and Ludwig Feuerbach's emancipatory claims as well. Contrary to Hegel, who considered the given as an inadequate embodiment of rationality, Stirner leaves the given intact by considering it a mere object, not of transformation, but of enjoyment and consumption (\"His Own\"). Stirner does not go beyond Hegel according to Douglas Moggach, but in fact leaves the domain of philosophy in its entirety:\n\nStirner refused to conceptualize the human self, and rendered it devoid of any reference to rationality or universal standards. The self was moreover considered a field of action, a ‘never-being I’. The ‘I’ had no essence to realize and life itself was a process of self-dissolution. Far from accepting, like the humanist Hegelians, a construal of subjectivity endowed with a universal and ethical mission, Stirner’s notion of ‘the Unique’ ( Der Einzige ) distances itself from any conceptualization whatsoever: ‘There is no development of the concept of the Unique. No philosophical system can be built out of it, as it can out of Being, or Thinking, or the I. Rather, with it, all development of the concept ceases. The person who views it as a principle thinks that he can treat it philosophically or theoretically and necessarily wastes his breath arguing against it’.\n\n\n== Works ==\n\n\n=== The False Principle of our Education ===\n\nIn 1842 Das unwahre Prinzip unserer Erziehung (The False Principle of our Education) was published in Rheinische Zeitung, which was edited by Marx at the time. Written as a reaction to Otto Friedrich Theodor Heinsius' treatise Humanism vs. Realism, Stirner explains that education in either the classical humanist method or the practical realist method still lacks true value. Education, therefore, is fulfilled in aiding the individual in becoming an individual.\n\n\n=== Art and Religion ===\nKunst und Religion (Art and Religion) was also published in Rheinische Zeitung, June 14, 1842. It addresses Bruno Bauer and his publication against Hegel called Hegel's doctrine of religion and art judged from the standpoint of faith. Bauer had inverted Hegel's relation between Art and Religion, by claiming that Art was much more closely related to Philosophy than Religion, based on their shared determinacy and clarity, and a common ethical root. Stirner, however, went beyond both Hegel and Bauer's criticism, by asserting that Art rather created an object for Religion and could thus by no means be related to what Stirner considered -in opposition with Hegel and Bauer- to be ‘Philosophy’:\n\nIt [philosophy] neither stands opposed to an Object, as Religion, nor makes one, as Art, but rather places its pulverizing hand upon all the business of making Objects as well as the whole of objectivity itself,and so breathes the air of freedom . Reason, the spirit of Philosophy, concerns itself only with itself, and troubles itself over no Object.\n\nStirner deliberately left Philosophy out of the dialectical triad (Art-Religion-Philosophy), by claiming that Philosophy \"doesn’t bother itself with objects\" (Religion), nor does it \"make an object\" (Art). Philosophy, in Stirner's account, was in fact indifferent towards both Art and Religion. Stirner thus mocked and radicalised Bauer's criticism of religion.\n\n\n=== The Ego and Its Own ===\n\nStirner's main work is Der Einzige und sein Eigenthum (in modern German spelling Der Einzige und sein Eigentum; engl. trans. The Ego and Its Own), which appeared in Leipzig in October 1844, with as year of publication mentioned 1845. In The Ego and Its Own, Stirner launches a radical anti-authoritarian and individualist critique of contemporary Prussian society, and modern western society as such. He offers an approach to human existence which depicts the self as a creative non-entity, beyond language and reality.\nThe book proclaims that all religions and ideologies rest on empty concepts. The same holds true for society's institutions that claim authority over the individual, be it the state, legislation, the church, or the systems of education such as Universities.\nStirner's argument explores and extends the limits of criticism, aiming his critique especially at those of his contemporaries, particularly Ludwig Feuerbach, and at popular ideologies, including religion, liberalism, and humanism (which he regarded as analogous to religion with the abstract Man or humanity as the supreme being), nationalism, statism, capitalism, socialism, and communism.\n\nIn the time of spirits thoughts grew till they overtopped my head, whose offspring they yet were; they hovered about me and convulsed me like fever-phantasies – an awful power. The thoughts had become corporeal on their own account, were ghosts, e. g. God, Emperor, Pope, Fatherland, etc. If I destroy their corporeity, then I take them back into mine, and say: \"I alone am corporeal.\" And now I take the world as what it is to me, as mine, as my property; I refer all to myself.\n\n\n=== Stirner's Critics ===\nRecensenten Stirners (Stirner's Critics) was published in September 1845 in Wigands Vierteljahrsschrift. It is a response, in which Stirner refers to himself in the third-person, to three critical reviews of The Ego and its Own by Moses Hess in Die letzten Philosophen (The Last Philosophers), by a certain \"Szeliga\" (alias of an adherent of Bruno Bauer) in an article in the journal Norddeutsche Blätter, and by Ludwig Feuerbach anonymously in an article called Über 'Das Wesen des Christentums' in Beziehung auf Stirners 'Der Einzige und sein Eigentum' (On 'The Essence of Christianity' in Relation to Stirner's 'The Ego and its Own' ) in Wigands Vierteljahrsschrift.\n\n\n=== The Philosophical Reactionaries: 'The Modern Sophists' by Kuno Fischer ===\nDie Philosophischen Reactionäre (The Philosophical Reactionaries) was published in 1847 in Die Epigonen, a journal edited by Otto Wigand from Leipzig. At the time, Wigand had already published Der Einzige und sein Eigentum, and was about to finish the publication of Stirner’s translations of Adam Smith and Jean-Baptiste Say. As the subtitle indicates, Die Philosophischen Reactionäre was written in response to an article by Kuno Fischer (1824–1907) entitled Die Moderne Sophisten (1847). The article was signed ‘G. Edward’, and its authorship has been disputed ever since John Henry Mackay ‘cautiously’ attributed it to Stirner and included it in his collection of Stirner’s lesser writings. It was first translated into English in 2011, and the introductory note explains:\n\nMackay based his attribution of this text to Stirner on Kuno Fischer’s subsequent reply to it, in which the latter, ‘with such determination’, identified G. Edward as Max Stirner. The article was entitled ‘Ein Apologet der Sophistik und “ein Philosophischer Reactionäre” ’ and was published alongside ‘Die Philosophischen Reactionäre’. Moreover, it seems rather odd that Otto Wigand would have published ‘Edward’s’ piece back- to- back with an article that falsely attributed it to one of his personal associates at the time. And, indeed, as Mackay went on to argue, Stirner never refuted this attribution. This remains, however, a slim basis on which to firmly identify Stirner as the author. This circumstantial evidence has led some scholars to cast doubts over Stirner’s authorship, based on both the style and content of ‘Die Philosophischen Reactionäre’. One should, however, bear in mind that it was written almost three years after Der Einzige und sein Eigentum, at a time when Young Hegelianism had withered away.\n\nThe majority of the text deals with Kuno Fischer’s definition of Sophism. With much wit, the self- contradictory nature of Fischer’s criticism of Sophism is exposed. Fischer had made a sharp distinction between Sophism and philosophy, while at the same time considering Sophism as the \"mirror image of philosophy\". The Sophists breathe \"philosophical air\" and were \"dialectically inspired to a formal volubility\". Stirner's answer is striking:\n\nHave you philosophers really no clue that you have been beaten with your own weapons? Only one clue. What can your common sense reply when I dissolve dialectically what you have merely posited dialectically? You have showed me with what kind of ‘volubility’ one can turn everything to nothing and nothing to everything, black into white and white into black. What do you have against me, when I return to you your pure art?\n\nLooking back on 'Der Einzige und sein Eigentum', Stirner claims:\n\nStirner himself has described his book as, in part, a clumsy expression of what he wanted to say. It is the arduous work of the best years of his life, and yet he calls it, in part, ‘clumsy’. That is how hard he struggled with a language that was ruined by philosophers, abused by state- , religious- and other believers, and enabled a boundless confusion of ideas.\n\n\n=== History of Reaction ===\nGeschichte der Reaktion (History of Reaction) was published in two volumes in 1851 by Allgemeine Deutsche Verlags-Anstalt and immediately banned in Austria. It was written in the context of the recent 1848 revolutions in German states and is mainly a collection of the works of others selected and translated by Stirner. The introduction and some additional passages were Stirner's work. Edmund Burke and Auguste Comte are quoted to show two opposing views of revolution.\n\n\n== Critical reception ==\nStirner's work did not go unnoticed among his contemporaries. Stirner's attacks on ideology – in particular Feuerbach's humanism – forced Feuerbach into print. Moses Hess (at that time close to Marx) and Szeliga (pseudonym of Franz Zychlin von Zychlinski, an adherent of Bruno Bauer) also replied to Stirner. Stirner answered the criticism in a German periodical, in the article Stirner's Critics (org. Recensenten Stirners, September 1845), which clarifies several points of interest to readers of the book – especially in relation to Feuerbach.\nWhile Marx's Sankt Max (large part of Die Deutsche Ideologie/The German Ideology), not published until 1932, so assured The Ego and Its Own a place of curious interest among Marxist readers, Marx's ridicule of Stirner has played a significant role in the subsequent marginalization of Stirner's work, in popular and academic discourse.\n\n\n== Comments by contemporaries ==\nTwenty years after the appearance of Stirner's book, the author Friedrich Albert Lange wrote the following:\n\nStirner went so far in his notorious work, 'Der Einzige und Sein Eigenthum' (1845), as to reject all moral ideas. Everything that in any way, whether it be external force, belief, or mere idea, places itself above the individual and his caprice, Stirner rejects as a hateful limitation of himself. What a pity that to this book – the extremest that we know anywhere – a second positive part was not added. It would have been easier than in the case of Schelling's philosophy; for out of the unlimited Ego I can again beget every kind of Idealism as my will and my idea. Stirner lays so much stress upon the will, in fact, that it appears as the root force of human nature. It may remind us of Schopenhauer.\n\nSome people believe that, in a sense, a \"second positive part\" was soon to be added, though not by Stirner, but by Friedrich Nietzsche. The relationship between Nietzsche and Stirner seems to be much more complicated. According to George J. Stack's Lange and Nietzsche, Nietzsche read Lange's History of Materialism \"again and again\" and was therefore very familiar with the passage regarding Stirner.\n\n\n== Influence ==\nWhile Der Einzige was a critical success and attracted much reaction from famous philosophers after publication, it was out of print and the notoriety that it had provoked had faded many years before Stirner's death. Stirner had a destructive impact on left-Hegelianism, but his philosophy was a significant influence on Marx and his magnum opus became a founding text of individualist anarchism. Edmund Husserl once warned a small audience about the \"seducing power\" of Der Einzige, but never mentioned it in his writing. As the art critic and Stirner admirer Herbert Read observed, the book has remained \"stuck in the gizzard\" of Western culture since it first appeared.\nMany thinkers have read and been affected by The Ego and Its Own in their youth including Rudolf Steiner, Gustav Landauer, Victor Serge, Carl Schmitt and Jürgen Habermas. Few openly admit any influence on their own thinking. Ernst Jünger's book Eumeswil, had the character of the \"Anarch\", based on Stirner's \"Einzige.\"  Several other authors, philosophers and artists have cited, quoted or otherwise referred to Max Stirner. They include Albert Camus in The Rebel (the section on Stirner is omitted from the majority of English editions including Penguin's), Benjamin Tucker, James Huneker, Dora Marsden, Renzo Novatore, Emma Goldman, Georg Brandes, John Cowper Powys, Martin Buber, Sidney Hook, Robert Anton Wilson, Horst Matthai, Frank Brand, Marcel Duchamp, several writers of the Situationist International including Raoul Vaneigem, and Max Ernst. Years before rising to power, Benito Mussolini was inspired by Stirner, and made several references to him in his newspaper articles. The similarities in style between The Ego and Its Own and Oscar Wilde's The Soul of Man Under Socialism have caused some historians to speculate that Wilde (who could read German) was familiar with the book.\nSince its appearance in 1844, The Ego and Its Own has seen periodic revivals of popular, political and academic interest, based around widely divergent translations and interpretations – some psychological, others political in their emphasis. Today, many ideas associated with post-left anarchy's criticism of ideology and uncompromising individualism are clearly related to Stirner's. He has also been regarded as pioneering individualist feminism, since his objection to any absolute concept also clearly counts gender roles as \"spooks\". His ideas were also adopted by post-anarchism, with Saul Newman largely in agreement with many of Stirner's criticisms of classical anarchism, including his rejection of revolution and essentialism.\n\n\n=== Marx and Engels ===\n\nEngels commented on Stirner in poetry at the time of Die Freien:\n\nLook at Stirner, look at him, the peaceful enemy of all constraint.\nFor the moment, he is still drinking beer,\nSoon he will be drinking blood as though it were water.\nWhen others cry savagely \"down with the kings\"\nStirner immediately supplements \"down with the laws also.\"\nStirner full of dignity proclaims;\nYou bend your willpower and you dare to call yourselves free.\nYou become accustomed to slavery\nDown with dogmatism, down with law.\n\nHe once even recalled at how they were \"great friends (Duzbrüder)\". In November 1844, Engels wrote a letter to Marx. He reported first on a visit to Moses Hess in Cologne and then went on to note that during this visit Hess had given him a press copy of a new book by Max Stirner, Der Einzige und Sein Eigenthum. In his letter to Marx, Engels promised to send a copy of Der Einzige to him, for it certainly deserved their attention, as Stirner: \"had obviously, among the 'Free Ones', the most talent, independence and diligence\". To begin with Engels was enthusiastic about the book, and expressed his opinions freely in letters to Marx:\n\nBut what is true in his principle, we, too, must accept. And what is true is that before we can be active in any cause we must make it our own, egoistic cause-and that in this sense, quite aside from any material expectations, we are communists in virtue of our egoism, that out of egoism we want to be human beings and not merely individuals.\"\n\nLater, Marx and Engels wrote a major criticism of Stirner's work. The number of pages Marx and Engels devote to attacking Stirner in (the unexpurgated text of) The German Ideology, in which they derided him as \"Sankt Max\" (Saint Max), exceeds the total of Stirner's written works. As Isaiah Berlin has described it, Stirner \"is pursued through five hundred pages of heavy-handed mockery and insult\". The book was written in 1845–1846, but not published until 1932. Marx's lengthy, ferocious polemic against Stirner has since been considered an important turning point in Marx's intellectual development from idealism to materialism. It has been argued that historical materialism was Marx's method of reconciling communism with a Stirnerite rejection of morality.\n\n\n=== Stirner and post-structuralism ===\n\nThe influential French poststructuralist thinker Jacques Derrida in his book Specters of Marx dealt with Stirner and his relationship with Marx while also analysing Stirner's concept of \"specters\" or \"spooks\". Gilles Deleuze, another key thinker associated with post-structuralism mentions Stirner briefly in his book The Logic of Sense. Saul Newman calls Stirner a proto-poststructuralist who on the one hand had essentially anticipated modern post-structuralists such as Foucault, Lacan, Deleuze, and Derrida, but on the other had already transcended them, thus providing what they were unable to: a ground for a non-essentialist critique of present liberal capitalist society. This is particularly evident in Stirner's identification of the self with a \"creative nothing\", a thing that cannot be bound by ideology (like leftist or marxists ideology of Frenchs postructuralists), inaccessible to representation in language.\n\n\n=== Possible influence on Nietzsche ===\n\nThe ideas of Max Stirner and Friedrich Nietzsche have often been compared, and many authors have discussed apparent similarities in their writings, sometimes raising the question of influence. In Germany, during the early years of Nietzsche's emergence as a well-known figure, the only thinker discussed in connection with his ideas more often than Stirner was Schopenhauer. It is certain that Nietzsche read about The Ego and Its Own, which was mentioned in Lange's History of Materialism and Eduard von Hartmann's Philosophy of the Unconscious, both of which Nietzsche knew well. However, there is no indication that he actually read it, as no mention of Stirner is known to exist anywhere in Nietzsche's publications, papers or correspondence. In 2002, a biographical discovery revealed it is probable that Nietzsche had encountered Stirner's ideas before he read Hartmann and Lange, in October 1865, when he met with Eduard Mushacke, an old friend of Stirner's during the 1840s.\nAnd yet as soon as Nietzsche's work began to reach a wider audience, the question of whether he owed a debt of influence to Stirner was raised. As early as 1891 (while Nietzsche was still alive, though incapacitated by mental illness), Eduard von Hartmann went so far as to suggest that he had plagiarized Stirner. By the turn of the century, the belief that Nietzsche had been influenced by Stirner was so widespread that it became something of a commonplace, at least in Germany, prompting one observer to note in 1907 \"Stirner's influence in modern Germany has assumed astonishing proportions, and moves in general parallel with that of Nietzsche. The two thinkers are regarded as exponents of essentially the same philosophy.\"\nNevertheless, from the beginning of what was characterized as \"great debate\" regarding Stirner's possible positive influence on Nietzsche, serious problems with the idea were noted. By the middle of the 20th century, if Stirner was mentioned at all in works on Nietzsche, the idea of influence was often dismissed outright or abandoned as unanswerable.\nBut the idea that Nietzsche was influenced in some way by Stirner continues to attract a significant minority, perhaps because it seems necessary to explain the oft-noted (though arguably superficial) similarities in their writings. In any case, the most significant problems with the theory of possible Stirner influence on Nietzsche are not limited to the difficulty in establishing whether the one man knew of or read the other. They also consist in establishing precisely how and why Stirner in particular might have been a meaningful influence on a man as widely read as Nietzsche.\n\n\n=== Rudolf Steiner ===\nThe individualist-anarchist orientation of Rudolf Steiner's early philosophy – before he turned to theosophy around 1900 – has strong parallels to, and was admittedly influenced by Stirner's conception of the ego, for which Steiner claimed to have provided a philosophical foundation.\n\n\n=== Anarchism ===\n\nStirner's philosophy was important in the development of modern anarchist thought, particularly individualist anarchism and egoist anarchism. Although Stirner is usually associated with individualist anarchism, he was influential to many social anarchists such as anarcha-feminists Emma Goldman and Federica Montseny. In european individualist anarchism he influenced its main proponents after him such as Emile Armand, Han Ryner, Renzo Novatore, John Henry Mackay, Miguel Giménez Igualada, and Lev Chernyi.\nIn American individualist anarchism he found adherence in Benjamin Tucker and his magazine Liberty while these abandoned natural rights positions for egoism. \"Several periodicals were undoubtedly influenced by Liberty's presentation of egoism. They included: I published by C.L. Swartz, edited by W.E. Gordak and J.W. Lloyd (all associates of Liberty); The Ego and The Egoist, both of which were edited by Edward H. Fulton. Among the egoist papers that Tucker followed were the German Der Eigene, edited by Adolf Brand, and The Eagle and The Serpent, issued from London. The latter, the most prominent English-language egoist journal, was published from 1898 to 1900 with the subtitle \"A Journal of Egoistic Philosophy and Sociology\". Other American egoist anarchists around the early 20th century include James L. Walker, George Schumm, John Beverley Robinson, Steven T. Byington, and E.H. Fulton.\nIn the United Kingdom Herbert Read was influenced by Stirner, and noted the closeness of Stirner's egoism to existentialism (see existentialist anarchism). Later in the 1960s Daniel Guérin in Anarchism: From Theory to Practice says that Stirner \"rehabilitated the individual at a time when the philosophical field was dominated by Hegelian anti-individualism and most reformers in the social field had been led by the misdeeds of bourgeois egotism to stress its opposite\" and pointed to \"the boldness and scope of his thought.\" In the seventies an American situationist collective called For Ourselves published a book called The Right To Be Greedy: Theses On The Practical Necessity Of Demanding Everything in which they advocate a \"communist egoism\" basing themselves on Stirner.\nLater in the USA emerged the tendency of post-left anarchy which was influenced profundly by Stirner in aspects such as the critique of ideology. Jason McQuinn says that \"when I (and other anti-ideological anarchists) criticize ideology, it is always from a specifically critical, anarchist perspective rooted in both the skeptical, individualist-anarchist philosophy of Max Stirner. Also Bob Black and Feral Faun/Wolfi Landstreicher strongly adhere to Stirnerist egoism. In the hybrid of post-structuralism and Anarchism called post-anarchism Saul Newman has written on Stirner and his similarities to post-structuralism. Insurrectionary anarchism also has an important relationship with Stirner as can be seen in the work of Wolfi Landstreicher and Alfredo Bonanno who has also written on him in works such as Max Stirner and \"Max Stirner und der Anarchismus\".\n\n\n=== Free love, homosexuals, and feminists ===\nThe German stirnerist Adolf Brand produced the homosexual periodical Der Eigene in 1896. This was the first ongoing homosexual publication in the world, and ran until 1931. The name was taken from the writings of Stirner, who had greatly influenced the young Brand, and refers to Stirner's concept of \"self-ownership\" of the individual. Another early homosexual activist influenced by Stirner was John Henry Mackay. Feminists influenced by Stirner include Dora Marsden who edited the journals The Freewoman and The New Freewoman and Anarchist Emma Goldman. Stirner also influenced free love and polyamory propagandist Émile Armand in the context of French individualist anarchism of the early 20th century which is known for \"The call of nudist naturism, the strong defense of birth control methods, the idea of \"unions of egoists\" with the sole justification of sexual practices\".\n\n\n== See also ==\nIndividualist anarchism in Europe\nPhilosophy of Max Stirner\nRelationship between Friedrich Nietzsche and Max Stirner\n\n\n== Notes ==\n\n\n== References ==\nStirner, Max: Der Einzige und sein Eigentum (1845 [October 1844]). Stuttgart: Reclam-Verlag, 1972ff; engl. trans. The Ego and Its Own (1907), ed. David Leopold, Cambridge/ New York: CUP 1995\nStirner, Max: \"Recensenten Stirners\" (September 1845). In: Parerga, Kritiken, Repliken, Bernd A. Laska, ed., Nürnberg: LSR-Verlag, 1986; engl. trans. Stirner's Critics (abridged), see below\nMax Stirner, Political Liberalism (1845)\n\n\n== Further reading ==\nMax Stirner's 'Der Einzige und sein Eigentum' im Spiegel der zeitgenössischen deutschen Kritik. Eine Textauswahl (1844–1856). Hg. Kurt W. Fleming. Leipzig: Verlag Max-Stirner-Archiv 2001 (Stirneriana)\nArena, Leonardo V., Note ai margini del nulla, ebook, 2013.\nArvon, Henri, Aux Sources de l'existentialisme, Paris: P.U.F. 1954\nEssbach, Wolfgang, Gegenzüge. Der Materialismus des Selbst. Eine Studie über die Kontroverse zwischen Max Stirner und Karl Marx. Frankfurt: Materialis 1982\nHelms, Hans G, Die Ideologie der anonymen Gesellschaft. Max Stirner 'Einziger' und der Fortschritt des demokratischen Selbstbewusstseins vom Vormärz bis zur Bundesrepublik, Köln: Du Mont Schauberg, 1966\nKoch, Andrew M., \"Max Stirner: The Last Hegelian or the First Poststructuralist\". In: Anarchist Studies, vol. 5 (1997) pp. 95–108\nLaska, Bernd A., Ein dauerhafter Dissident. Eine Wirkungsgeschichte des Einzigen, Nürnberg: LSR-Verlag 1996 (TOC, index)\nLaska, Bernd A., Ein heimlicher Hit. Editionsgeschichte des \"Einzigen\". Nürnberg: LSR-Verlag 1994 (abstract)\nMarshall, Peter H. \"Max Stirner\" in \"Demanding the Impossible: A History of Anarchism \"(London: HarperCollins, 1992).\nMoggach, Douglas & De Ridder, Widukind, \"Hegelianism in Restoration Prussia,1841–1848: Freedom, Humanism and ‘Anti-Humanism’ in Young Hegelian Thought\". In: Herzog, Lisa (ed.): Hegel's Thought in Europe: Currents, Crosscurrents and Undercurrents. Basingstoke and New York, Palgrave Macmillan, 2013, pp. 71–92 (Google Books)\nNewman, Saul (ed.), Max Stirner (Critical Explorations in Contemporary Political Thought), Basingstoke and New York: Palgrave Macmillan, 2011 (full book)\nNewman, Saul, Power and Politics in Poststructural Thought. London and New York: Routledge 2005\nPaterson, R.W.K., The Nihilistic Egoist: Max Stirner, Oxford: Oxford University Press 1971\nStepelevich, Lawrence S., Max Stirner As Hegelian. In: Journal of the History of Ideas, Vol. 46, nr. 4, pp. 597–614\nStepelevich, Lawrence S., Ein Menschenleben. Hegel and Stirner\". In: Moggach, Douglas (ed.): The New Hegelians. Philosophy and Politics in the Hegelian School. Cambridge, Cambridge University Press, 2006, pp. 166–176\nWelsh, John F. Max Stirner's Dialectical Egoism: A New Interpretation. Lexington Books. 2010.\nWilkinson, Will (2008). \"Stirner, Max (1806–1856)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 493–5. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \nDi Mascio, Carlo, Stirner Giuspositivista. Rileggendo l'Unico e la sua proprietà, 2 ed., Edizioni Del Faro, Trento, 2015, pp. 253, ISBN 978-88-6537-378-1\n\n\n== External links ==\n Works written by or about Max Stirner at Wikisource\n Quotations related to Max Stirner at Wikiquote\n Media related to Max Stirner at Wikimedia Commons\n\n\n=== General ===\n\"Max Stirner\". Stanford Encyclopedia of Philosophy. , an extensive introduction\nSvein Olav Nybergs website on Max Stirner, with extensive links to texts and references\nMax Stirner within the LSR project (English section)\nMax Stirner Project by H. Ibrahim Türkdogan\nArchive of texts on Stirner at the Anarchist Library\n\n\n=== Relationship with other philosophers ===\nMax Stirner, a durable dissident, 'How Marx and Nietzsche suppressed their colleague Max Stirner and why he has intellectually survived them'\nStirner Delighted in His Construction – \"loves miracles, but can only perform a logical miracle\", by Karl Marx\nNietzsche's initial crisis due to an encounter with Stirner's \"The Ego\", by Bernd A. Laska (2002)\nMax Stirner As Hegelian, By Lawrence S. Stepelevich\n\"At the End of the Path of Doubt: Max Stirner\", By Lawrence S. Stepelevich (Owl of Minerva 41:1–2 (2009–10) pp. 85–106)\n\n\n=== Texts ===\nWorks by Max Stirner at Project Gutenberg\nWorks by or about Max Stirner at Internet Archive\nWorks by Max Stirner at LibriVox (public domain audiobooks) \nOnline book Der Einzige und sein Eigentum\nThe complete original text in German of Der Einzige und sein Eigentum\nThe complete English edition of \"The Ego and his Own\", in the translation of Steven T. Byington.\nSome of Stirner's illuminating \"Shorter Essays\", translated into English\nRecensenten Stirners / Stirner's Critics bilingual: full text in German / abridged text in English (trans. Frederick M. Gordon)\nStirner's Critics by Max Stirner translated by Wolfi Landstreicher, with an introduction by Jason McQuinn (2013 revision of the only full-text English translation of both “Stirner’s Critics” and “The Philosophical Reactionaries” by Wolfi Landstreicher published by CAL Press)\nArchive of the 4 works of Stirner translated into English including a 2011 complete translation of Stirner´s Critics (translated by Wolfi Landstreicher at the Anarchist Library)", "ns": 0, "pageid": 112282, "title": "Max Stirner"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}