{"batchcomplete": "", "query": {"normalized": [{"to": "Max Baginski", "from": "Max_Baginski"}], "pages": {"3199676": {"extract": "Max Baginski (1864 – November 24, 1943) was a German-American anarchist.\nBaginski was born in 1864 in Bartenstein (now Bartoszyce), a small East Prussian town. His father was shoemaker who had been active in the 1848 revolution and was thus shunned by the conservative inhabitants of the village. Under his fathers influence, Baginski read freethinker August Specht's writings and Berliner Freie Presse, Johann Most's newspaper, in his youth. After school Baginski became his father's apprentice.\nAlready a staunch socialist, Baginski moved to Berlin in 1882. He emigrated to the U.S. in 1893. From 1894 to 1901, he was an editor of the Chicago Worker newspaper. He helped publishing the 1906-07 issues of the magazine Freedom and editorials for the anarchist magazine Mother Earth in New York City.\nThis is a quote from the first issue of Mother Earth Magazine.\n\nThe State Socialists love to assert that at present we live in the age of individualism; the truth, however, is that individuality was never valued at so low a rate as to-day. Individual thinking and feeling are incumbrances and not recommendations on the paths of life. Wherever they are found on the market they meet with the word \"adaptation.\" Adapt yourself to the demands of the reigning social powers, act the obedient servant before them, and if you produce something be sure that it does not run against the grain of your \"superiors,\" or say adieu to success, reputation and recompense. Amuse the people, be their clown, give them platitudes about which they can laugh, prejudices which they hold as righteousness and falsehoods which they hold as truths. Paint the whole, crown it with regard for good manners, for society does not like to hear the truth about itself. Praise the men in power as fathers of the people, have the devourers of the common wealth parade along as benefactors of mankind. Of course, the force which humbles humanity in this manner is far from openly declaring itself as force. It is masked, and in the course of time it has learned to step forward with the least possible noise. That diminishes the danger of being recognized. Without Government, By Max Baginski, 1906\n\nBaginski died at Bellevue Hospital in New York on November 24, 1943.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\nRocker, Rudolf (1980), \"Max Baginski\", Rudolf Rocker: Aufsatzsammlung, 2, Frankfurt: Verlag Freie Gesellschaft (published 1948), ISBN 3-88215-037-8 \n\n\n== External links ==\nMax Baginski Page from the Daily Bleed's Anarchist Encyclopedia\nA brief description of Baginski's life\nMax Baginski, The right to live", "ns": 0, "pageid": 3199676, "title": "Max Baginski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}