{"batchcomplete": "", "query": {"normalized": [{"to": "Max Black", "from": "Max_Black"}], "pages": {"302879": {"extract": "Max Black (24 February 1909 – 27 August 1988) was a British-American philosopher, who was a figure in analytic philosophy in the first half of the twentieth century. He made contributions to the philosophy of language, the philosophy of mathematics and science, and the philosophy of art, also publishing studies of the work of philosophers such as Frege. His translation (with Peter Geach) of Frege's published philosophical writing is a classic text.\n\n\n== Life and career ==\nBorn in Baku, Russian Empire (now Azerbaijan) of Jewish descent, Black grew up in London, where his family had moved in 1912. He studied mathematics at Queens' College, Cambridge where he developed an interest in the philosophy of mathematics. Russell, Wittgenstein, G. E. Moore, and Ramsey were all at Cambridge at that time, and their influence on Black may have been considerable. He graduated in 1930 and was awarded a fellowship to study at Göttingen for a year.\nFrom 1931–36, he was mathematics master at the Royal Grammar School, Newcastle.\nHis first book was The Nature of Mathematics (1933), an exposition of Principia Mathematica and of current developments in the philosophy of mathematics.\nBlack had made notable contributions to the metaphysics of identity. In his \"The Identity of Indiscernibles\", Black presents an objection to Leibniz' Law by means of a hypothetical scenario in which he conceives two distinct spheres having exactly the same properties, thereby contradicting Leibniz' second principle in his formulation of \"The Identity of Indiscernibles\". By virtue of there being two objects, albeit with identical properties, the existence of two objects, even in a void, denies their identicality.\nHe lectured in mathematics at the Institute of Education in London from 1936 to 1940. In 1940 he moved to the United States and joined the Philosophy Department at the University of Illinois at Urbana-Champaign. In 1946 he accepted a professorship in philosophy at Cornell University. In 1948, he became a naturalized citizen of the United States. Black advised the philosophy dissertation of American novelist William H. Gass. He was elected a Fellow of the American Academy of Arts and Sciences in 1963. Black died in Ithaca, New York age 79. His younger brother was the architect Sir Misha Black.\n\n\n== Selected bibliography ==\nBlack, Max (1937). \"Vagueness: An exercise in logical analysis\". Philosophy of Science 4: 427–455. Reprinted in R. Keefe, P. Smith (eds.): Vagueness: A Reader, MIT Press 1997, ISBN 978-0-262-61145-9\nBlack, Max (1949). Language and philosophy: Studies in method, Ithaca: Cornell University Press.\nBlack, Max (1954). “Metaphor,” Proceedings of the Aristotelian Society, 55, pp. 273–294.\nBlack, Max (1962). Models and metaphors: Studies in language and philosophy, Ithaca: Cornell University Press.\nBlack, Max (1979). “More about Metaphor,” in A. Ortony (ed): Metaphor & Thought.\n\n\n== References ==\n\n\n== External links ==\nO'Connor, J.J. and Robertson, E.F., \"Max Black: Biography\", School of Mathematics and Statistics, University of St Andrews, Scotland.\nBiography at the MacTutor History of Mathematics Archive\nGuide to the Max Black Papers, Cornell University Library\nThe Prevalence of Humbug, The Prevalence of Humbug and Other Essays (Cornell University Press, 1983.", "ns": 0, "pageid": 302879, "title": "Max Black"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}