{"batchcomplete": "", "query": {"normalized": [{"to": "Melvin Fitting", "from": "Melvin_Fitting"}], "pages": {"41392746": {"extract": "Melvin \"Mel\" Fitting (born January 24, 1942 in Troy, New York) is a logician with special interests in philosophical logic and tableau proof systems. From 1968 to 2013 he was a Professor at City University of New York, Lehman College and the Graduate Center. At the Graduate Center he was in the departments of Computer Science, Philosophy, and Mathematics, and at Lehman College he was in the department of Mathematics and Computer Science. He is now Professor emeritus. His undergraduate degree is from Rensselaer Polytechnic Institute, and his doctorate is from Yeshiva University, both in mathematics. His thesis advisor was Raymond Smullyan.\nIn June 2012 Melvin Fitting was given the Herbrand Award by CADE, for distinguished contributions to automated deduction.\nA loose motivation for much of Melvin Fitting's work can be formulated succinctly as follows. There are many logics. Our principles of reasoning vary with context and subject matter. Multiplicity is one of the glories of modern formal logic. The common thread tying logics together is a concern for what can be said (syntax), what that means (semantics), and relationships between the two. A philosophical position that can be embodied in a formal logic has been shown to be coherent, not correct. Logic is a tool, not a master, but it is an enjoyable tool to use.\n\n\n== Selected publications ==\nIntuitionistic Logic, Model Theory, and Forcing, North-Holland, Amsterdam, 1969.\nTableau methods of proof for modal logics, Notre Dame Journal of Formal Logic, 13 (2), 237-247 (1972).\nModel existence theorems for modal and intuitionistic logics, Journal of Symbolic Logic, 38, 613-627 (1973).\nFundamentals of Generalized Recursion Theory, North-Holland, Amsterdam, 1981.\nProof Methods for Modal and Intuitionistic Logics, D. Reidel, Dordrecht, 1983.\nA Kripke-Kleene Semantics for Logic Programs, Journal of Logic Programming, 2 (4), 295-312, (1985); North-Holland.\nFirst-Order Modal Tableaux, Journal of Automated Reasoning, 4 (2), 191-213 (1988) Springer.\nLogic Programming on a Topological Bilattice, Fundamenta Informaticae, 1988.\nBilattices and the theory of truth, Journal of Philosophical Logic, 18 (3), 225-256 (1989) Springer.\nFirst-Order Logic and Automated Theorem Proving, Springer-Verlag, 1990, second edition 1996.\nBilattices in Logic Programming, in Proc. of the IEEE Int'l Symposium on Multiple-Valued Logic, pp238–246 (1990).\nBilattices and the Semantics of Logic Programming, Journal of Logic (and Algebraic) Programming, 11 (1&2), 91-116 (1991) Elsevier.\nKleene's Logic, Generalized, Journal of Logic and Computation (LOGCOM), 1 (6), 797-810 (1991) Oxford University Press.\nMany-Valued Modal Logics (I), Fundamenta Informaticae, 15 (3-4), 235-254 (1991).\nMany-Valued Model Logics II, Fundamenta Informaticae, 17 (1-2), 55-73 (1992).\nThe Family of Stable Models, Journal of Logic (and Algebraic) Programming, 17 (2/3&4), 197-225 (1993) Elsevier.\nBasic modal logic, in Handbook of logic in artificial intelligence and logic...(cut off?), 1993.\nMetric Methods: Three Examples and a Theorem, Journal of Logic and Algebraic Programming, 21 (3), 113-127 (1994).\nKleene's Three Valued Logics and Their Children, Fundamenta Informaticae, 20 (1/2/3), 113-131 (1994) IOS Press.\nSet Theory and the Continuum Problem, with Raymond M. Smullyan, 288 pages, Oxford University Press (or Clarendon Press?), 1996. Revised edition, Dover, 2010.\nA theory of truth that prefers falsehood, Journal of Philosophical Logic, 26 (5), 477-500 (1997).\nBertrand Russell, Herbrand's Theorem, and the assignment statement, in Artificial Intelligence and Symbolic Computation, Springer Lecture Notes in Artificial Intelligence 1476, pp 14–28, 1998.\nFirst-Order Modal Logic, with Richard L. Mendelsohn, Verlag: Kluwer Academic Publishers, 1998, paperback, 1999, ISBN 9780792353355.\nHigher-order modal logic - a sketch, in 1999 volume on First-order Theorem Proving (FTP'98), pages 22–36.\nFirst order alethic modal logic, in the Blackwell Companion to Philosophical Logic, Dale Jacquette (ed.), 2000.\nDatabases and Higher Types, CL2000 Invited Speakers and Tutorials.\nTerm-Modal Logics, with Lars Thalmann and Andrei Voronkov.\nFixpoint semantics for logic programming, Theoretical Computer Science (journal), 278 (1-2), 25-51 (2002) Elsevier.\nAddOns, FLoC'02 HYLO, Invited speaker.\nTypes, Tableaus, and Gödel's God, Kluwer, 2002; also, in the 2005-12-01 Journal Studia Logica, 81 (3), 425-427 (2005).\nBeyond Two: Theory and Applications of Multiple-Valued Logic, co-edited with Ewa Orlowska, Springer, 2003.\nFirst-order intensional logic, Annals of Pure and Applied Logic, 127 (1), 171193 (2004).\nThe logic of proofs, semantically, Annals of Pure and Applied Logic, 132 (1), 1-25 (2005) Elsevier.\nBilattices are nice things, in Self-Reference, Center for the Study of Language and Information, Thomas Bolander, Vincent Hendricks, Stig Andur Pedersen editors, 55-77 (2006).\nIncompleteness in the Land of Sets, College Publications, 2007.\nModal proof theory, chapter in Handbook of Modal Logic, P. Blackburn, J. Van Benthem, F. Wolter (eds.), pp85–138 (2007) Elsevier.\nExplicit Logics of Knowledge and Conservativity, ISAIM 2008.\nPrefixed tableaus and nested sequents, Annals of Pure and Applied Logic, 163 (3), 291-313 (2012).\nESSLLI 2012. Evening lecture.\nJustification Logic, Stanford Encyclopedia of Philosophy, (Fall 2012 Edition), Edward N. Zalta (ed.), co-authored with Sergei N. Artemov.\nIntensional Logic, Stanford Encyclopedia of Philosophy, (Winter 2012 Edition), Edward N. Zalta (ed.).\n\n\n== References ==\n\n\n== Notes ==\n\n\n== External links ==\nMelvin Fitting, official homepage\nThe Graduate Center, faculty page at CUNY\nMathematical Genealogy Project", "ns": 0, "pageid": 41392746, "title": "Melvin Fitting"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}