{"batchcomplete": "", "query": {"pages": {"171860": {"extract": "Menedemus of Eretria (Greek: Μενέδημος ὁ Ἐρετριεύς; 345/4 – 261/0 BC) was a Greek philosopher and founder of the Eretrian school. He learned philosophy first in Athens, and then, with his friend Asclepiades, he subsequently studied under Stilpo and Phaedo of Elis. Nothing survives of his philosophical views apart from a few scattered remarks recorded by later writers.\n\n\n== Life ==\nMenedemus was born at Eretria. Though of noble birth, he worked as builder and tentmaker until he was sent with a military expedition to Megara, from where he travelled to the Platonic Academy in Athens and resolved to devote himself to philosophy. At Megara he formed a lifelong friendship with Asclepiades of Phlius, with whom he toiled in the night that he might study philosophy by day. He was subsequently a pupil first of Stilpo and then of Phaedo of Elis, whose school he transferred to Eretria, by which name it was afterwards known.\nIn addition to his philosophical work, he took a leading part in the political affairs of his city from the time of the Diadochi until his death, and obtained a remission of the tribute to Demetrius. His friendship with Antigonus II Gonatas seems to have roused suspicion as to his loyalty, and he sought safety first in the temple of Amphiaraus at Oropus, and later with Antigonus, at whose court he is said to have died of grief. Other accounts say that he starved himself to death on failing to induce Antigonus to free his native city.\n\n\n== Philosophy ==\nHis philosophical views are known only in part. Athenaeus quotes Epicrates as stating that he was a Platonist, but other accounts credit him with having preferred Stilpo to Plato. Diogenes Laërtius says that he declined to identify the Good with the Useful, and that he denied the value of the negative proposition on the ground that affirmation alone can express truth. In ethics we learn from Plutarch and from Cicero that he regarded Virtue as one, by whatever name it be called, and maintained that it is intellectual. Cicero's evidence is the less valuable in that he always assumed that Menedemus was a follower of the Megarian school. Diogenes says that he left no writings, and the Eretrian school disappeared after a short and unobtrusive existence.\n\n\n== Notes ==\n\n\n== References ==\nDorandi, Tiziano (1999). \"Chapter 2: Chronology\". In Algra, Keimpe; et al. The Cambridge History of Hellenistic Philosophy. Cambridge: Cambridge University Press. p. 50. ISBN 9780521250283. \n Laërtius, Diogenes (1925). \"Socrates, with predecessors and followers: Menedemus\". Lives of the Eminent Philosophers. 1:2. Translated by Hicks, Robert Drew (Two volume ed.). Loeb Classical Library. \nAttribution:\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"article name needed\". Encyclopædia Britannica (11th ed.). Cambridge University Press.", "ns": 0, "pageid": 171860, "title": "Menedemus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}