{"batchcomplete": "", "query": {"normalized": [{"to": "Michael J. Sandel", "from": "Michael_J._Sandel"}], "pages": {"581057": {"extract": "Michael J. Sandel (/sænˈdɛl/; born March 5, 1953) is an American political philosopher and a professor at Harvard University. He is best known for the Harvard course \"Justice\" and for his critique of John Rawls' A Theory of Justice in his first book, Liberalism and the Limits of Justice (1982). He was elected a Fellow of the American Academy of Arts and Sciences in 2002.\n\n\n== Education ==\nSandel was born in Minneapolis to a Jewish family, which moved to Los Angeles when he was thirteen. He was president of his senior class at Palisades High School (1971) and graduated Phi Beta Kappa from Brandeis University with a bachelor's degree in politics (1975). He received his doctorate from Balliol College, Oxford, as a Rhodes Scholar, where he studied under philosopher Charles Taylor.\n\n\n== Philosophical views ==\nSandel subscribes to a certain version of communitarianism (although he is uncomfortable with the label), and in this vein he is perhaps best known for his critique of John Rawls' A Theory of Justice. Rawls' argument depends on the assumption of the veil of ignorance, which he claims allows us to become \"unencumbered selves\".\nSandel's view is that we are by nature encumbered to an extent that makes it impossible even in the hypothetical to have such a veil. Some examples of such ties are those with our families, which we do not make by conscious choice but are born with, already attached. Because they are not consciously acquired, it is impossible to separate oneself from such ties. Sandel believes that only a less-restrictive, looser version of the veil of ignorance should be postulated. Criticism such as Sandel's inspired Rawls to subsequently argue that his theory of justice was not a \"metaphysical\" theory but a \"political\" one, a basis on which an overriding consensus could be formed among individuals and groups with many different moral and political views.\n\n\n== Teaching ==\n\n\n=== Justice ===\nSandel has taught the famous \"Justice\" course at Harvard for two decades. More than 15,000 students have taken the course, making it one of the most highly attended in Harvard's history. The fall 2007 class was the largest ever at Harvard, with a total of 1,115 students. The fall 2005 course was recorded, and is offered online for students through the Harvard Extension School.\nAn abridged form of this recording is now a 12-episode TV series, Justice: What's the Right Thing to Do?, in a co-production of WGBH and Harvard University. Episodes are available on the Justice with Michael Sandel website. There is also an accompanying book, Justice: What's the Right Thing to Do? and the sourcebook of readings Justice: A Reader.\nThe popularity of the show is attributed to the discussion-oriented format (the Socratic method)—rather than recitation and memorization of facts—and to Sandel's engaging style, incorporating context into discussion; for example, he starts one lecture with a discussion of the ethics of ticket scalping.\nThe BBC broadcast eight 30-minute segments from the series on BBC Four starting on 25 January 2011.\nIn April 2012, BBC Radio 4 broadcast a three-part series presented by Professor Sandel titled The Public Philosopher. These followed a format similar to the Justice lectures, this time recorded in front of an audience at the London School of Economics. Across three programs, Sandel debates with the audience whether universities should give preference to students from poorer backgrounds, whether a nurse should be paid more than a banker, and whether it is right to bribe people to be healthy. The programmes were made available for download via the BBC podcast Michael Sandel: The Public Philosopher.\n\n\n=== edX ===\nSandel is currently teaching his Justice course on edX. On April 29, 2013, the Philosophy Department faculty of San Jose State University addressed an open letter to Professor Sandel protesting the use of MOOC's (Massively Open Online Courses) such as his Justice course. Professor Sandel publicly responded: \"[t]he worry that the widespread use of online courses will damage departments in public universities facing budgetary pressures is a legitimate concern that deserves serious debate, at edX and throughout higher education. The last thing I want is for my online lectures to be used to undermine faculty colleagues at other institutions.\" \n\n\n=== Other teaching ===\nSandel also co-teaches, with Douglas Melton, the seminar \"Ethics and Biotechnology\", which considers the ethical implications of a variety of biotechnological procedures and possibilities.\n\n\n== Authorship ==\nSandel is the author of several publications, including Democracy's Discontent and Public Philosophy. Public Philosophy is a collection of his own previously published essays examining the role of morality and justice in American political life. He offers a commentary on the roles of moral values and civic community in the American electoral process—a much-debated aspect of the 2004 U.S. election cycle and of current political discussion.\nMichael Sandel gave the 2009 Reith Lectures on \"A New Citizenship\" on BBC Radio, addressing the 'prospect for a new politics of the common good'. The lectures were delivered in London on May 18, Oxford on May 21, Newcastle on May 26, and Washington, D.C., in early June, 2009.\nHe is also the author of the book What Money Can't Buy: The Moral Limits of Markets (2012), which argues some desirable things - such as body organs and the right to kill endangered species - should not be traded for cash.\n\n\n== Public service ==\nSandel served on the George W. Bush administration's President's Council on Bioethics.\n\n\n== 2009 immigration commentary ==\nIn 2009, Sandel criticized Nobel Prize-winning economist Gary Becker's market immigration proposal. This proposed solution entailed imposing refugee quotas on nations according to their wealth and then allowing countries to pay other, poorer countries to take refugees allotted under their quota. Sandel concludes that \"a market in refugees changes our view of who refugees are and how they should be treated. It encourages the participants — the buyers, the sellers and also those whose asylum is being haggled over — to think of refugees as burdens to be unloaded or as revenue sources rather than as human beings in peril.\"\n\n\n== Awards and honors ==\n\n2012 Financial Times and Goldman Sachs Business Book of the Year Award, shortlist, What Money Can’t Buy: The Moral Limits Of Markets \n2012 Foreign Policy magazine Top Global Thinker.\n2014 Honorary doctorate, Utrecht University.\n\n\n== Works ==\nDemocracy's Discontent : America in Search of a Public Philosophy. Cambridge, Mass: Belknap Press of Harvard University Press. 1998. ISBN 9780674197459. \n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nCommunitarianism\n\n\n== References ==\n\n\n== External links ==\nHarvard University Bio\nPodcast interview with Nigel Warburton on Philosophy Bites on What Shouldn't Be Sold\n\"The Case Against Perfection: Ethics in the Age of Genetic Engineering, by Michael J. Sandel (2007)\" by N. Antonios at the Embryo Project Encyclopedia\nPodcast interview with Nigel Warburton on Ethics Bites on the topic of Genetic Enhancement in Sports\nThe President's Council on Bioethics\nA page of links relating to the 2009 Reith Lectures\nWhat's The Right Thing To Do? on Harvard University's YouTube channel\nFairness and the Big Society Debate on BBC\nJustice: a series of lectures by Michael Sandel on BBC\n12 Questions with Michael Sandel: An Art of Theory Interview\nAppearances on C-SPAN\nBooknotes interview with Sandel on Democracy's Discontent: America in Search of a Public Philosophy, May 19, 1996.", "ns": 0, "pageid": 581057, "title": "Michael J. Sandel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}