{"batchcomplete": "", "query": {"normalized": [{"to": "Michael Otsuka", "from": "Michael_Otsuka"}], "pages": {"3818009": {"extract": "Michael Otsuka (born 1964) is a left-libertarian political philosopher and Professor in the Department of Philosophy, Logic & Scientific Method at the London School of Economics since 2013, and a member of LSE's Court of Governors.\n\n\n== Career ==\nOtsuka earned his DPhil in Politics from Balliol College, Oxford under the direction of G.A. Cohen, on a Marshall Scholarship, after graduating from Yale University with a bachelor's degree in Political Science summa cum laude in 1986.\nPrior to moving to the London School of Economics in 2013, Otsuka was Professor of Philosophy at University College London, where he had taught since 1998, and, before that taught at UCLA and the University of Colorado.\n\n\n== Philosophy ==\nOtsuka has written extensively in political philosophy on topics such as equality and left-libertarianism. Otsuka is a proponent of actual-consent forms of government, in opposition to the mainstream of political theory which has thought such systems to be unworkable. He has also published articles in normative ethics on the morality of harming and saving from harm.\nOtuska also defends what is known as \"equal share left-libertarianism,\" which interprets \"the Lockean proviso requiring that one leave enough for others to have an opportunity for well-being that is at least as good as the opportunity for well-being that one obtained in using or appropriating natural resources. Individuals who leave less than this are required to pay the full competitive value of their excess share to those deprived of their fair share.\"\nOne of Otsuka's most influential articles—cited and critiqued by Jeff McMahan in his own work The Ethics of Killing—is \"Killing the Innocent in Self-Defense\" (Philosophy & Public Affairs, 1994) In this article, Otsuka develops what he calls the Moral Equivalence Thesis, according to which Innocent Threat (e.g., the body of Falling Person is about to kill you by crushing you to death but who was thrown off the top of a building by an evil Villain) is on a moral par with Bystander, or one who is not at all responsible for whatever endangers your life. Imagine a javelin is heading toward you and will kill you unless you pull Bystander into its path so it kills Bystander instead. Because it would be morally impermissible to kill Bystander in this way, it would also be morally impermissible for you to kill Falling Person by, say, vaporizing him with a ray gun. Further, it is morally impermissible to kill an Innocent Aggressor, or someone who endangers your life because of her intention to kill you but whose actions are beyond her control. Imagine someone who has been hypnotized and whose aim is to kill you. It is wrong to kill Innocent Aggressor because he is on a moral par with Innocent Threat, who is on a par with Bystander. So, it is wrong to kill Innocent Aggressor because he is on a par, morally, with Bystander.\n\n\n== Bibliography ==\nLibertarianism without inequality (2003)\n\n\n== References ==\n\n\n== External links ==\nMichael Otsuka's homepage\nMichael Otsuka at Goodreads", "ns": 0, "pageid": 3818009, "title": "Michael Otsuka"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}