{"batchcomplete": "", "query": {"normalized": [{"to": "Michael Davis (philosopher)", "from": "Michael_Davis_(philosopher)"}], "pages": {"675453": {"extract": "Michael Davis (born 6 February 1943) is an American philosopher specializing in professional ethics. He is Professor of Philosophy at the Illinois Institute of Technology, and Senior Fellow at its Center for the Study of Ethics in the Professions.\nDavis is the author of several books, including Accountability in the Professions (1995), Profession, Code, and Ethics (2002), and Engineering Ethics (2005).\n\n\n== Background ==\nDavis received his PhD in 1972 from the University of Michigan for a dissertation entitled \"Representation and Consent: An Inquiry into the Foundations of Political Obligation.\" Before moving to the Illinois Institute of Technology in 1986, he taught at the University of Illinois at Chicago, Illinois State University, and Case Western Reserve University.\n\n\n== Research interests ==\nDavis's work in engineering ethics has won him four large grants from the National Science Foundation and an entry in Who's Who in Science and Engineering. His papers on whistleblowing and conflict of interest are often reprinted. He is the author of eight books and almost 200 articles and chapters, and editor (or co-editor) of five other books.\n\n\n== Bibliography ==\nwith Frederick Elliston, Ethics and the Legal Profession (Prometheus Books, 1986)\nTo Make the Punishment Fit the Crime (Westview Press, 1992)\nwith Elliot D. Cohen, AIDS: Crisis in Professional Ethics (Temple University Press, 1994)\nAccountability in the Professions (1995)\nJustice in the Shadow of Death: Rethinking Capital and Lesser Punishments (Rowman & Littlefield, 1996)\nThinking like an Engineer (Oxford University Press, 1998)\nEthics and the University (Routledge, 1999)\nwith Andrew Stark, Conflict of Interest in the Professions (Oxford University Press, 2001)\nProfession, Code, and Ethics (Ashgate, 2002)\nActual Social Contract and Political Obligation (Edwin Mellen Press, 2002)\nEngineering Ethics (Ashgate, 2005)\nCode Writing: How Software Engineering Became a Profession (Center for the Study of Ethics in the Professions, 2007)\nwith Elliot D. Cohen and Frederick Elliston, Ethics and the Legal Profession, 2nd ed (Prometheus Book, 2009)\nThinking like an Engineer: Studies in the Ethics of a Profession (Zhejiang University Press, 2012)\nThe Architect’s Professional Ethics: Readings and Problems (forthcoming)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== Notes ==\n\n\n== External links ==\nIIT faculty page", "ns": 0, "pageid": 675453, "title": "Michael Davis (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}