{"batchcomplete": "", "query": {"normalized": [{"to": "Michael Fourman", "from": "Michael_Fourman"}], "pages": {"5356861": {"extract": "Michael Paul Fourman FBCS (born 12 September 1950) is Professor of Computer Systems at the University of Edinburgh in Scotland, UK, and was Head of the School of Informatics from 2001–2009.\nFourman is interested in applications of logic in computer science, artificial intelligence, and cognitive science – more specifically, formal models of digital systems, system design tools, proof assistants, categorical semantics and propositional planning.\n\n\n== Qualifications ==\nFourman received a BSc in Mathematics with other subjects (Philosophy and Computer Science) from the University of Bristol in 1971, then his MSc in Mathematical Logic from the University of Oxford in 1972. He wrote his DPhil thesis Connections between Category Theory and Logic under the supervision of Dana Scott at Oxford, defending his thesis in 1974.\n\n\n== Career ==\nHe continued to work with Scott as an SRC postdoctoral Research Fellow and Junior Research Fellow of Wolfson College, in Oxford, until 1976, when he moved to the USA, first as a Visiting Assistant Professor of Mathematics at Clark University in Worcester, Massachusetts, then, from 1977–1982, as JF Ritt Assistant Professor of Mathematics at Columbia University in New York.\nIn 1983 he moved, with a Science and Engineering Research Council Fellowship, to the Department of Electronic and Electrical Engineering at Brunel University. He was appointed to a Readership, and then to the Chair of Formal Systems, at Brunel in 1986.\nFourman was co-founder and Technical Director of Abstract Hardware Limited (AHL), a company formed in 1986. He was central in the development of the LAMBDA system (Logic And Mathematics Behind Design Automation) to aid hardware design, a tool implemented in the SML programming language and marketed by AHL. He left the company in 1997.\nIn 1988 he joined the Laboratory for Foundations of Computer Science at the University of Edinburgh, and was appointed to the Chair of Computer Systems in the Department of Computer Science. In 1998 he was founding Head of the Division of Informatics, which became the current School of Informatics, incorporating the former Department of Artificial Intelligence, the Artificial Intelligence Applications Institute, the Centre for Cognitive Science, the Human Communication Research Centre, and the Department of Computer Science.\nHe has again been Head of the School of Informatics since August 2002.\nHe has held visiting positions at universities in Paris (1975), Utrecht (1977, 1980), Cambridge (1979–80), Sydney (1982), Montreal (1983), and Perth (1994).\n\n\n== Bibliography ==\nFourman, Michael P. (1977), \"The logic of topoi\", in Jon Barwise, Handbook of Mathematical Logic (Stud. Logic Found. Math. 90), Elsevier Science Publishers B.V., North-Holland, pp. 1053–1090, ISBN 978-0-444-86388-1, ISBN 0-444-86388-5 \nFourman, Michael P.; Scott, Dana S. (1979), \"Notes on sheaves and logic'\", in M. P. Fourman; C. J. Mulvey; Dana S. Scott, Applications of Sheaves: Proceedings of the Research Symposium on Applications of Sheaf Theory to Logic, Algebra, and Analysis, Durham, July 9–21, 1977 (Lecture Notes in Mathematics Vol 753), Springer-Verlag, pp. 302–401, ISBN 978-0-387-09564-6 \nFourman, Michael P. (1982), \"Notions of choice sequence\", in D. van Dalen; A. Troelstra, L.E.J. Brouwer Centenary Symposium: Proceedings of the conference held in Noordwijkerhout, 8–13 June 1981 (Stud. Logic Found. Math. 110), Elsevier Science Publishers B.V., North-Holland, pp. 91–105, ISBN 0-444-86494-6 \nFourman, Michael P.; Scedrov, Andre (1982), \"The world's simplest axiom of choice fails\" (PDF), Manuscripta Mathematica, 38 (3): 325–332, doi:10.1007/BF01170929 \nFourman, Michael P. (1984), \"Continuous truth I, non-constructive objects\", in G. Lolli; G. Longo; A. Marcja, Proc. Logic Colloquium '82, Proceedings of the Colloquium, Florence, 23–28 August 1982, (Stud. Logic Found. Math. 112), Elsevier Science Publishers B.V., North-Holland, pp. 161–180, ISBN 0-444-86876-3 \n\n\n== External links ==\nFull Bibliography\nOfficial home page\nPersonal home page\nExtracurricular home page\nBlogger user profile", "ns": 0, "pageid": 5356861, "title": "Michael Fourman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}