{"batchcomplete": "", "query": {"normalized": [{"to": "Michael Novak", "from": "Michael_Novak"}], "pages": {"204745": {"extract": "Michael Novak (born September 9, 1933) is an American Catholic philosopher, journalist, novelist, and diplomat. The author of more than twenty-five books on the philosophy and theology of culture, Novak is most widely known for his book The Spirit of Democratic Capitalism (1982). In 1993 Novak was honored with an honorary doctorate degree at Universidad Francisco Marroquín due to his commitment to the idea of liberty. In 1994 he was awarded the Templeton Prize for Progress in Religion, which included a million-dollar purse awarded at Buckingham Palace. He writes books and articles focused on capitalism, religion, and the politics of democratization.\nNovak served as United States Ambassador to the United Nations Commission on Human Rights in 1981 and 1982 and led the U.S. delegation to the Conference on Security and Cooperation in Europe in 1986. Additionally, Novak served on the board of directors of the now-defunct Coalition for a Democratic Majority, a faction of the Democratic Party, which sought to influence Democratic Party policies in the same direction that the Committee on the Present Danger later did. Novak is currently George Frederick Jewett Scholar in Religion, Philosophy, and Public Policy at the American Enterprise Institute. As of 2004, he has claimed to be a lifelong Democrat, but he has supported many Republican candidates in recent years.\n\n\n== Early life, education, and family ==\nNovak was born in 1933 in Johnstown, Pennsylvania, to a Slovak-American family, the son of Irene Sakmar and Michael J. Novak. He was married to Karen Laub-Novak, a professional artist and illustrator, who died of cancer in August 2009. They have three children (Richard, Tanya, and Jana) and four grandchildren.\nNovak earned a B.A. summa cum laude in philosophy and English from Stonehill College in 1956, a Sacrae Theologiae Baccalaureus (a degree in theology), from the Pontifical Gregorian University in Rome in 1958 and an M.A. in history and philosophy of religion from Harvard University in 1966. Novak attended Harvard University to study philosophy and religion, intending to obtain a doctorate in philosophy of religion. Novak stated that he thought the philosophy department was too focused on analytic philosophy, neglecting religion. He left Harvard after receiving his M.A., and began work as a writer.\n\n\n== Early writings ==\n\n\n=== Second Vatican Council ===\nNovak worked as a correspondent for the National Catholic Reporter during the second session of the Second Vatican Council in Rome, where he also got the opportunity to fulfill a book contract for a fellow reporter who was not able to complete the project. The result was Novak's second book, The Open Church, a journalistic account of the events of the second session of the Council.\nHis writings at the time were criticized by the more Conservative factions in the Church, and apostolic delegate Egidio Vagnozzi advised US Churchmen to silence him.\n\n\n== Early books ==\nEarly in his career, Novak published two novels: The Tiber Was Silver (1961) and Naked I Leave (1970). At the time, he considered the modest $600 advance to be \"a fortune.\"\n\n\n== Stanford years ==\nNovak's friendship with the Presbyterian theologian Robert McAfee Brown during the Second Vatican Council led to a teaching post at Stanford University, where he became the first Roman Catholic to teach in the Humanities program. Novak taught at Stanford University from 1965 to 1968, during the key years of student revolt throughout California. During this period, he wrote A Time to Build (1967), discussing problems of belief and unbelief, ecumenism, sexuality, and war. In 1968, he signed the “Writers and Editors War Tax Protest” pledge, vowing to refuse tax payments in protest against the Vietnam War. In A Theology for Radical Politics (1969), Novak makes theological arguments in support of the New Left student movement, which he urged to advance the renewal of the human spirit rather than merely to reform social institutions. His book Politics: Realism and Imagination includes accounts of visiting American Vietnam War deserters in France (\"Desertion\"), the birth and development of the student movement at Stanford (\"Green Shoots of Counter-Culture\") and philosophical essays on nihilism and Marxism.\n\n\n== SUNY Old Westbury ==\nNovak left Stanford for a post as dean of a new \"experimental\" school at the newly founded State University of New York at Old Westbury, Long Island.\nNovak's writings during this period included the philosophical essay The Experience of Nothingness (1970, republished in 1998), in which he cautioned the New Left that utopianism could lead to alienation and rootlessness. Novak's novel Naked I Leave (1970) chronicles his experiences in California and in the Second Vatican Council and his journey from seminarian to reporter.\n\n\n== Later career ==\nAfter serving at Old Westbury/SUNY from 1969 to 1972, Novak launched the humanities program at the Rockefeller Foundation in 1973–1974. In 1976, he accepted a tenured position at Syracuse University as University Professor and Ledden-Watson Distinguished Professor of Religion. In the fall semesters of 1987 and 1988, Novak held the W. Harold and Martha Welch chair as Professor of American Studies at the University of Notre Dame.\nIn the spring of 1978, Novak joined the American Enterprise Institute for Social Policy Research as a Resident Scholar, a position he still holds as of 2008. He remains at the American Enterprise Institute as the George Frederick Jewett Chair of Religion, Philosophy, and Public Policy, and as the Institute’s Director of Social and Political Studies.\nNovak is a frequent contributor to magazines and journals including First Things and National Review. In 1994, he was a signer of the document Evangelicals and Catholics Together.\nIn 2012, he authored an article entitled 'The Moral Imperative of a Free Economy' in The 4% Solution: Unleashing the Economic Growth America Needs, published by the George W. Bush Presidential Center.\nNovak is a founding board member of the Institute on Religion and Democracy. He is also a founding member of the Board of Trustees of Ave Maria University and is a member of the Catholic Advisory Board for the Ave Maria Mutual Funds. A portrait of Novak by Igor Babailov hangs in the Canizaro Library on campus.\nIn 2016 he joined the Tim and Steph Busch School of Business and Economics of the Catholic University of America as a distinguished visiting fellow.\n\n\n== Opinions ==\nNovak believes that Utopian beliefs can lead to the weakening of social bonds. He wrote that \"the family is the human race's natural defense against utopianism.\" (The Spirit of Democratic Capitalism)\nHe states that religion can 'thrive only in a personal universe' and not universities or companies, and that Western Humanism, which he states is the leading belief system of most of academia, does not ask \"the fundamental questions about the meaning and limits of personal experience\" and that \"they leave aside the mysteries of contingency and transitoriness, for the certainties of research, production, consumption.\" (\"God in the Colleges,\" A New Generation: American and Catholic (1964))\nNovak states that the Holy Trinity and God are often thought of in abstract and impersonal terms in philosophy, and that they should be \"thought of as a Communion of Divine Persons—radiating his presence throughout creation, calling unworthy human beings to be his friends, and infusing into them his love so that they might love with it.\" (From “The Love That Moves the Sun,” in A Free Society Reader)\nOn December 12, 2007 Novak declared his support for the presidential candidacy of Republican Mitt Romney.\n\n\n== Bibliography ==\nSocial Justice Isn't What You Think It Is (2015)\nWriting from Left to Right: My Journey From Liberal to Conservative (2013)\nThe Myth of Romantic Love and Other Essays (with Elizabeth Shaw) (2012)\nLiving the Call: An Introduction to the Lay Vocation (with William E. Simon) (2011)\nAll Nature is a Sacramental Fire: Moments of Beauty, Sorrow, and Joy (2011)\nNo One Sees God: The Dark Night of Atheists and Believers (2008)\nWashington's God: Religion, Liberty, and the Father of Our Country (with Jana Novak) (2006)\nUniversal Hunger for Liberty: Why the Clash of Civilizations is Not Inevitable (2004)\nOn Two Wings: Humble Faith and Common Sense at the American Founding (2001)\nBusiness as a Calling (1996)\nThe Catholic Ethic and the Spirit of Capitalism (1993).\nFree Persons and the Common Good (1988)\nTell Me Why (1998)\nThe Open Church (1964, 2002)\nJoy of Sports (1976, 1994)\nCatholic Social Thought and Liberal Institutions (1984, 1989)\nThis Hemisphere of Liberty (1990, 1992)\nWill it Liberate (1986)\nToward the Future\nMoral Clarity in a Nuclear Age (1983)\nAscent of the Mountain, Flight of the Dove\nCharacter and Crime\nOn Cultivating Liberty\nThe Fire of Invention\nThe Guns of Lattimer\nChoosing Presidents\nA Free Society Reader\nThree in One\nThe New Consensus on Family and Welfare: A Community of Self-Reliance (Novak et al.) (1987).\nThe Spirit of Democratic Capitalism (1982). ISBN 0-8191-7823-3.\nRise of the Unmeltable Ethnics (1972).\nThe Experience of Nothingness (1970; revised and expanded 1998).\nNaked I Leave (novel, 1970).\nBelief and Unbelief, a Philosophy of Self-Knowledge (1965; 3rd ed. 1994).\nThe Tiber was Silver (novel, 1962).\n\n\n== See also ==\nAmerican philosophy\nDemocratic capitalism\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nGraduation speech at Universidad Francisco Marroquín in 1993.\nNovak's website\nAppearances on C-SPAN\nBooknotes interview with Novak on On Two Wings: Humble Faith and Common Sense at the American Founding, March 17, 2002.", "ns": 0, "pageid": 204745, "title": "Michael Novak"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}