{"batchcomplete": "", "query": {"normalized": [{"to": "Michel Onfray", "from": "Michel_Onfray"}], "pages": {"1917730": {"extract": "Michel Onfray (French: [miʃɛl ɔ̃fʁɛ]; born 1 January 1959) is a contemporary French writer and philosopher who promotes hedonism, atheism, and anarchism. He is a highly prolific author on philosophy, having written more than 80 books.\nHe has gained notoriety for writing such works as Traité d'athéologie: Physique de la métaphysique (translated into English as Atheist Manifesto: The Case Against Christianity, Judaism, and Islam), Politique du rebelle: traité de résistance et d'insoumission, Physiologie de Georges Palante, portrait d'un nietzchéen de gauche, La puissance d'exister and La sculpture de soi for which he won the annual Prix Médicis in 1993.\nHis philosophy is mainly influenced by such thinkers as Nietzsche, Epicurus, the cynic and cyrenaic schools, French materialism, and individualist anarchism.\n\n\n== Life ==\n\nBorn to a family of Norman farmers, Onfray was abandoned by his parents to a Catholic boarding from age 10 to 14 (his mother had been placed into the same boarding in her own youth). Overcoming these early hardships, Onfray graduated with a PhD in philosophy. He taught this subject to senior students at a technical high school in Caen between 1983 and 2002, before establishing what he and his supporters call the Université populaire de Caen, proclaiming its foundation on a free-of-charge basis and on the manifesto written by Onfray in 2004 (La communauté philosophique).\nOnfray's Traité d'Athéologie \"became the number one best-selling nonfiction book in France for months when it was published in the Spring of 2005 (the word 'atheologie' Onfray borrowed from Georges Bataille). This book repeated its popular French success in Italy, where it was published in September 2005 and quickly soared to number one on Italy's bestseller lists.\"\nIn the 2002 election, Onfray endorsed the French Revolutionary Communist League and its candidate for the French presidency, Olivier Besancenot. In 2007, he endorsed José Bové, but eventually voted for Olivier Besancenot, and conducted an interview with the future French President Nicolas Sarkozy, whom he declared was an \"ideological enemy\" for Philosophie Magazine.\nOnfray himself attributes the birth of philosophic communities such as the université populaire to the results of the French presidential election, 2002.\nHis book Le crépuscule d'une idole : L'affabulation freudienne (The Twilight of an Idol: The Freudian Confabulation), published in 2010, has been the subject of considerable controversy in France because of its criticism of Freud. He recognizes Freud as a philosopher, but he brings attention to the considerable cost of Freud's treatments and casts doubts on the effectiveness of his methods. He is an atheist and author of Atheist Manifesto.\nIn 2015, he published \"Cosmos\", the first book of a trilogy. Onfray considers ironically that it constitutes his \"very first book\".\n\n\n== Philosophy ==\nOnfray writes that there is no philosophy without self-psychoanalysis. He describes himself as an atheist and considers theist religion to be indefensible. He regards himself as being part of the tradition of individualist anarchism, a tradition that he claims is at work throughout the entire history of philosophy and that he is seeking to revive amidst modern schools of philosophy that he regards as cynical.\n\n\n=== View on the history of Western philosophy and philosophical project ===\nOnfray has published 9 books under a project of history of philosophy called Counter-history of Philosophy. In each of these books Onfray deals with a particular historical period in western philosophy. The series of books are composed by the titles I. Les Sagesses Antiques (2006) (on western antiquity), II. Le Christianisme hédoniste (2006) (on Christian hedonism from the Renaissance period), III. Les libertins baroques (2007) (on libertine thought from the Baroque era), IV. Les Ultras des Lumières (2007) (on radical enlightenment thought), V. L'Eudémonisme social (2008) (on radical utilitarian and eudomonistic thought), VI. Les Radicalités existentielles (2009) (on 19th and 20th century radical existentialist thinkers) and VII.La construction du surhomme: Jean-Marie Guyau, Friedrich Nietzsche (on Guyau´s and Nietzsche´s philosophy in relation to the concept of the Übermensch). VIII Les Freudiens hérétiques (2013). IX Les Consciences réfractaires (2013).\nIn an interview he establishes his view on the history of philosophy. For him:\n\nThere is in fact a multitude of ways to practice philosophy, but out of this multitude, the dominant historiography picks one tradition among others and makes it the truth of philosophy: that is to say the idealist, spiritualist lineage compatible with the Judeo-Christian world view. From that point on, anything that crosses this partial – in both senses of the word – view of things finds itself dismissed. This applies to nearly all non-Western philosophies, Oriental wisdom in particular, but also sensualist, empirical, materialist, nominalist, hedonistic currents and everything that can be put under the heading of \"anti-Platonic philosophy\". Philosophy that comes down from the heavens is the kind that – from Plato to Levinas by way of Kant and Christianity – needs a world behind the scenes to understand, explain and justify this world. The other line of force rises from the earth because it is satisfied with the given world, which is already so much.\n\n\"His mission is to rehabilitate materialist and sensualist thinking and use it to re-examine our relationship to the world. Approaching philosophy as a reflection of each individual's personal experience, Onfray inquires into the capabilities of the body and its senses and calls on us to celebrate them through music, painting, and fine cuisine.\"\n\n\n=== Hedonism ===\nHe defines hedonism \"as an introspective attitude to life based on taking pleasure yourself and pleasuring others, without harming yourself or anyone else.\" \"Onfray's philosophical project is to define an ethical hedonism, a joyous utilitarianism, and a generalized aesthetic of sensual materialism that explores how to use the brain's and the body's capacities to their fullest extent – while restoring philosophy to a useful role in art, politics, and everyday life and decisions.\"\nOnfray's works \"have explored the philosophical resonances and components of (and challenges to) science, painting, gastronomy, sex and sensuality, bioethics, wine, and writing. His most ambitious project is his projected six-volume Counter-history of Philosophy\", of which three have been published.\nFor Onfray:\n\nIn opposition to the ascetic ideal advocated by the dominant school of thought, hedonism suggests identifying the highest good with your own pleasure and that of others; the one must never be indulged at the expense of sacrificing the other. Obtaining this balance – my pleasure at the same time as the pleasure of others – presumes that we approach the subject from different angles – political, ethical, aesthetic, erotic, bioethical, pedagogical, historiographical....\n\nHis philosophy aims for \"micro-revolutions\", or \"revolutions of the individual and small groups of like-minded people who live by his hedonistic, libertarian values.\"\n\n\n=== Anarchism ===\nRecently Michel Onfray has embraced the term postanarchism to describe his approach to politics and ethics. He advocates for an anarchism in line with such intellectuals as \"Orwell, la philosophe Simone Weil, Jean Grenier, la French Theory avec Foucault, Deleuze, Bourdieu, Guattari, Lyotard, le Derrida de Politiques de l'amitié et du Droit à la philosophie, mais aussi Mai 68\" which for him was \"a Nietzschean revolt in order to put an end to the \"One\" truth, revealed, and to put in evidence the diversity of truths, in order to make disappear ascetic Christian ideas and to help arise new possibilities of existence\".\n\n\n==== Relation to hedonism ====\nIn La puissance d'exister: Manifeste hédoniste, Onfray claims that the political dimension of hedonism runs from Epicurus to John Stuart Mill through Jeremy Bentham and Claude Adrien Helvétius. What political hedonism aims for is to create the greatest happiness for the greatest numbers.\n\n\n=== Atheism ===\nBlogger J. M. Cornwell praised Onfray's Atheist Manifesto: The Case Against Christianity, Judaism, and Islam, claiming it \"is a religious and historical time capsule\" containing what he sees as \"the true deceptions of theological philosophy\".\nRecently he has been involved in promoting the work of Jean Meslier, an 18th-century French Catholic priest who was discovered, upon his death, to have written a book-length philosophical essay promoting atheism.\nIn the atheist manifesto, Onfray has said that among the \"incalculable number of contradictions and improbabilities in the body of the text of the synoptic Gospels\" two claims are made: crucifixion victims were not laid to rest in tombs, and in any case Jews were not crucified in this period. Ancient Historian John Dickson, of Macquarie University, has said that Philo of Alexandria, writing about the time of Jesus, says that sometimes the Romans handed the bodies of crucifixion victims over to family members for proper burial. The Roman Jewish historian Flavius Josephus even remarks: \"the Jews are so careful about funeral rites that even malefactors who have been sentenced to crucifixion are taken down and buried before sunset\". Regarding the second claim, Dickson calls this a \"clear historical blunder\".\n\n\n== The Université Populaire ==\nOnfray was a high school philosophy teacher for two decades until he resigned in 2002 to establish a tuition-free Université Populaire (People's University) at Caen, at which he and several colleagues teach philosophy and other subjects.\n\n\"The Université Populaire, which is open to all who cannot access the state university system, and on principle does not accept any money from the State -- Onfray uses the profits from his books to help finance it -- has had enormous success. Based on Onfray's book La Communauté Philosophique: Manifeste pour l'Université Populaire (2004), the original UP now has imitators in Picardy, Arras, Lyon, Narbonne, and Le Mans, with five more in preparation.\"\n\n\"The national public radio network France Culture annually broadcasts his course of lectures to the Université Populaire on philosophical themes.\"\n\n\n== Works ==\nLe ventre des philosophes, critique de la raison diététique (1989)\nPhysiologie de Georges Palante, portrait d'un nietzchéen de gauche (1989)\nCynismes, portrait du philosophe en chien (1990)\nL'art de jouir : pour un matérialisme hédoniste (1991)\nLa sculpture de soi : la morale esthétique (1991)\nL'œil nomade : la peinture de Jacques Pasquier (1992)\nLa raison gourmande, philosophie du goût (1995)\nArs moriendi : cent petits tableaux sur les avantages et les inconvénients de la mort (1995)\nMétaphysique des ruines : la peinture de Monsu Désidério (1995)\nLes formes du temps : théorie du Sauternes (1996)\nPolitique du rebelle : traité de résistance et d'insoumission (1997)\nÀ côté du désir d'éternité : fragments d'Égypte (1998)\nThéorie du corps amoureux : pour une érotique solaire (2000)\nPrêter un livre n'est pas voler son auteur (2000)\nAntimanuel de philosophie : leçons socratiques et alternatives (2001)\nCélébration du génie colérique : tombeau de Pierre Bourdieu (2002)\nL'invention du plaisir : fragments cyréaniques (2002)\nEsthétique du Pôle nord : stèles hyperborréennes (2002)\nSplendeur de la catastrophe : la peinture de Vladimir Velickovic (2002)\nLes icônes païennes : variations sur Ernest Pignon-Ernest (2003)\nArchéologie du présent, manifeste pour l'art contemporain (2003)\nFéeries anatomiques (2003)\nLa philosophie féroce : exercices anarchistes (2004)\nLa communauté philosophique (2004)\nTraité d'athéologie : Physique de la métaphysique, Paris, Grasset, (2005); English translation by Jeremy Leggatt as Atheist Manifesto: The Case Against Christianity, Judaism, and Islam (New York: Arcade Publishing, 2007)\nThéorie du voyage : poétique de la géographie, Paris, Galilée, 2005\nLa puissance d'exister, (2006) Grasset, ISBN 2-246-71691-8\nNietzsche: Se créer Liberté. (2010) Les Éditions du Lombard ISBN 978-2-8036-2650-2\nLe Crépuscule d'une idole. L'Affabulation freudienne. (2010) Grasset (ISBN 2-246-76931-0)\nApostille au Crépuscule. Pour une psychanalyse non freudienne, (2010) Grasset (ISBN 2-246-75781-9)\nL'Ordre libertaire. La vie philosophique d'Albert Camus, Flammarion, ISBN 978-2-08-126441-0, J'ai lu, ISBN 978-2-290-05980-7\nVies & mort d'un dandy. Construction d'un mythe, Galilée, ISBN 978-2-7186-0871-6\nJournal hédoniste :\nI. Le désir d'être un volcan (1996)\nII. Les vertus de la foudre (1998)\nIII. L'archipel des comètes (2001)\nIV. La lueur des orages désirés (2007)\n\nLa contre histoire de la philosophie:\nI. Les Sagesses Antiques (2006)\nII. Le Christianisme hédoniste (2006)\nIII. Les libertins baroques (2007)\nIV. Les Ultras des Lumières (2007), Grasset, (ISBN 978-2-246-68921-8)\nV. L'Eudémonisme social (2008), Grasset, (ISBN 978-2-246-68931-7)\nVI. Les Radicalités existentielles (2009), Grasset, (ISBN 978-2-246-68941-6)\nVII.La construction du surhomme: Jean-Marie Guyau, Friedrich Nietzsche\n\n\n== References ==\n\n\n== Further reading ==\nKovacevic, Filip (2013), Onfre u Podgorici: Ciklus predavanja o Mišelu Onfreu, Podgorica, Montenegro: Centar za građansko obrazovanje, ISBN 978-86-85591-22-8 \n\n\n== External links ==\nOfficial website (French)\nBlog about Onfray (French)\nProfile of Michel Onfray in New Humanist magazine, July/August 2007", "ns": 0, "pageid": 1917730, "title": "Michel Onfray"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}