{"batchcomplete": "", "query": {"normalized": [{"to": "Miguel A. De La Torre", "from": "Miguel_A._De_La_Torre"}], "pages": {"22939063": {"extract": "Miguel A. De La Torre (born October 6, 1958) is a professor of Social Ethics and Latinx Studies at Iliff School of Theology, a scholar-activist, author, and an ordained Southern Baptist minister.\n\n\n== Biography ==\nBorn in Cuba months before the Castro Revolution, De La Torre and his family migrated to the United States as refugees when he was an infant. For a while the U.S. government considered him and his family as \"illegal aliens\". On June 6, 1960, De La Torre received an order from Immigration and Naturalization Service to \"self-deport.\" He attended Blessed Sacrament School in Queens, New York and was baptized and confirmed by the Catholic Church. Simultaneously, his parents were priest/priestess of the religion Santería. He refers to himself as a Southern Baptist, Roman Catholic child of Ellegúa. He left Queens, moving to Miami, Florida in his teens.\nAt nineteen years of age he began a real estate company in Miami called Championship Realty, Century 21; becoming at the time the youngest real estate broker in the State of Florida. The office grew to over 100 sales agents. During this time he obtained a Masters in Public Administration from American University in Washington, DC. Eventually he was elected president of the Miami Board of Realtors. He was also active in local politics, becoming the founding president of the West Dade Young Republicans. In 1988 he was a candidate for the Florida House of Representatives, District 115, but lost to Mario Diaz-Balart.\nIn his early twenties he became a \"born-again\" Christian, joining University Baptist Church in Coral Gables, Florida. De La Torre dissolved the thirteen-year-old real estate company in 1992 to attend Southern Baptist Theological Seminary in order to obtain a Masters in Divinity and enter the ministry. During his seminary training he served as pastor at a rural congregation, Goshen Baptist Church in Glen Dean, Kentucky.\n\n\n== Scholarship ==\nDe La Torre continued his theological training and obtained a doctorate from Temple University in social ethics in 1999. According to the books he published, he focuses on ethics within contemporary U.S. thought, specifically how religion affects race, class, and gender oppression. His works 1) applies a social scientific approach to Latino/a religiosity within this country; 2) studies Liberation theologies in the Caribbean and Latin America (specifically in Cuba); and 3) engages in postmodern/postcolonial social theory. De La Torre is considered to be the most published Latinx in the field of religious studies with over thirty books and hundreds of articles.\nIn 1999 he was hired to teach Christian Ethics at Hope College in Holland, MI. In 2005 he wrote a column for the local newspaper, The Holland Sentinel, titled \"When the Bible is Used for Hatred.\" The article was a satirical piece commenting on Focus on the Family's James Dobson outing of SpongeBob SquarePants. Dobson responded to the article.\nA controversy over these articles ensued. A few months afterwards, De La Torre was forced to resign his tenure and took the position of associate professor for social ethics at Iliff School of Theology in Denver, Colorado. He became a full professor in 2010.\nSince obtaining his doctorate in 1999, De La Torre has authored numerous articles and books, including several books that have won national awards, specifically: Reading the Bible from the Margins, (Orbis, 2002); Santería: The Beliefs and Rituals of a Growing Religion in America (Wm. B. Eerdmans, 2004); Doing Christian Ethics from the Margins, (Orbis, 2004); and Encyclopedia on Hispanic American Religious Culture, Volume 1 & 2, (ABC-CLIO, 2009). Within the academy he has served as a director to the Society of Christian Ethics and the American Academy of Religion. Additionally, he has been co-chair of the Ethics Section at the American Academy of Religion.\nHe is the founder and editor of the Journal of Race, Ethnicity, and Religion, and co-founder of the Society of Race, Ethnicity, and Religion which held its first meeting in Chicago in 2013,\nDe La Torre has been an expert commentator concerning ethical issues (mainly Hispanic religiosity, LGBT civil rights, and immigration rights) on several local, national, and international media outlets. He also writes monthly articles for Ethics Daily and Associated Baptist Press which create controversies within Christian circles.\nDuring the January, 2011 gathering of the Society of Christian Ethics, De La Torre was elected Vice-President of the organization and President-elect for 2012.\nIn 2016, De La Torre released a documentary for which he wrote the screenplay and coproduced based on his immigration book. The film, Trails of Hope and Terror, has been shown at academic settings and houses of worship.\n\n\n== Works ==\nBooks\nThe Immigration Crises: Toward an Ethics of Place, 2016.\nLiberating Sex, 2016.\nThe Politics of Jesús: Toward a Hispanic Political Theology, 2015.\nDoing Christian Ethics from the Margins, 2nd Edition, 2014.\nLiberation Theologies for Arm Chair Theologians, 2013.\nGenesis: A Theological Commentary on the Bible, 2011.\nA La Familia: A Conversation about Our Families, the Bible Sexual Orientation and Gender, 2011.\nLatina/o Social Ethics: Moving Beyond Eurocentric Thinking, 2010.\nTrails of Hope and Terror: Testimonies on Immigration, 2009.\nLiberating Jonah: Toward a Biblical Ethics of Reconciliation, 2007.\nA Lily Among the Thorns: Imagining a New Christian Sexuality, 2007.\nLeer la Biblia desde los Marginados, 2005.\nDoing Christian Ethics from the Margins, 2004.\nSantería: The Beliefs and Rituals of a Growing Religion in America, 2004.\nLa Lucha for Cuba: Religion and Politics on the Streets of Miami, 2003.\nThe Quest for the Cuban Christ: A Historical Search, 2002.\nReading the Bible from the Margins, 2002.\nAjiaco Christianity: Toward an Exilic Cuban Ethic of Reconciliation, Ph.D. diss., 1999.\nMulti-authored book publications\nThe Quest for the Historical Satan, co-authored with Albert Hernandez, 2011.\nIntroducing Latino/a Theologies, co-authored with Edwin David Aponte, 2001.\nEdited books\nIntroducing Liberative Theologies, 2015.\nEthics: A Liberative Approach, 2013.\nBeyond the Pale: Reading Christian Theology from the Margins, co-edited with Stacey Floyd-Thomas, 2011.\nBeyond the Pale: Reading Christian Ethics from the Margins, co-edited with Stacey Floyd-Thomas, 2011.\nOut of the Shadows, Into the Light: Christianity and Homosexuality, 2009.\nThe Hope of Liberation within World Religions, 2008.\nAAR Career Guide for Racial and Ethnic Minorities in the Profession, 2007.\nRethinking Latino/a Religion and Ethnicity, co-edited with Gaston Espinosa, 2006.\nHandbook on Latino/a Theologies, co-edited with Edwin David Aponte, 2006.\nHandbook on U.S. Theologies of Liberation, 2004.\nEncyclopedia editor\nEncyclopedia on Hispanic American Religious Culture, Volume 1 & 2, 2009.\n\n\n== References ==\n\n\n== External links ==\nDe La Torre's Official Website\nDe La Torre's Official Faculty Page", "ns": 0, "pageid": 22939063, "title": "Miguel A. De La Torre"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}