{"batchcomplete": "", "query": {"normalized": [{"to": "Morris Weitz", "from": "Morris_Weitz"}], "pages": {"5493165": {"extract": "Morris Weitz (/ˈwiːts/; July 24, 1916 – February 1, 1981) was an American aesthetician. He received his doctorate from the University of Michigan. During the course of his career he taught at Vassar College, Ohio State University, and Brandeis University. He married Margaret Weitz, a notable academic on French issues. Their son, Richard Weitz, is a senior fellow at the Hudson Institute.\nWeitz' groundbreaking publication is titled \"The Role of Theory in Aesthetics.\" This work perhaps spurred much debate within the philosophy of art and is part of a larger movement known as anti-essentialism. This movement was popular in the 1950s and is similarly defended by W. B. Gallie, W. E. Kennick, and Paul Ziff. Weitz's piece, however, is arguably the most popular anti-essentialist pieces, as well as one of the most debated pieces in twentieth century aesthetics. Weitz argued against the traditional essentialist methodology and proposed using Wittgenstein's family resemblance argument as an alternate method for identifying art objects. Weitz proposed that in asking \"what is art?\" aestheticians were really asking the wrong question altogether. The question he believed needed to be fundamentally addressed instead was \"what kind of concept is 'art'?\" Weitz used this question to propel both his defense of Wittgensteinian family resemblances, as well as his defense of art as an \"open concept.\" Weitz is widely considered to have renewed interest within the analytical philosophy for aesthetics, where his claims have been challenged for over fifty years, most famously by Maurice Mandelbaum in the 1965 article \"Family Resemblances and Generalizations Concerning the Arts.\" Weitz later developed a philosophy of criticism, in which the critic must describe, interpret, evaluate, and finally theorize about the work in question.\n\n\n== Works ==\nPhilosophy of the Arts, 1950\n\"The Role of Theory in Aesthetics\". Journal of Aesthetics and Art Criticism. 15: 27–35. 1956.  reprinted in P. Lamarque and S. H. Olsen (eds), Aesthetics and the Philosophy of Art: The Analytic Tradition, (Oxford: Blackwell, 2004), pp. 12–18.\nPhilosophy in literature (1963)\nPhilosophy of the arts (1964)\nHamlet and the philosophy of literary criticism (1964) ISBN 978-0226892399\neditor of \"Problems in aesthetics\" (1959, 21970)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== External links ==\n\"Obituary:Dr. Morris Weitz, 64, a Professor Who Wrote Books on Philosophy\". The New York Times. February 4, 1981. Retrieved 2014-12-20.", "ns": 0, "pageid": 5493165, "title": "Morris Weitz"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}