{"batchcomplete": "", "query": {"normalized": [{"to": "Moshe Chaim Luzzatto", "from": "Moshe_Chaim_Luzzatto"}], "pages": {"350128": {"extract": "Moshe Chaim Luzzatto (Hebrew: משה חיים לוצאטו, also Moses Chaim, Moses Hayyim, also Luzzato) (1707 in Padua – 16 May 1746 in Acre (26 Iyar 5506)), also known by the Hebrew acronym RaMCHaL (or RaMHaL, רמח\"ל), was a prominent Italian Jewish rabbi, kabbalist, and philosopher.\n\n\n== Biography ==\nBorn in Padua, he received classical Jewish and Italian education, showing a predilection for literature at a very early age. He may have attended the University of Padua and certainly associated with a group of students there, known to dabble in mysticism and alchemy. With his vast knowledge in religious lore, the arts, and science, he quickly became the dominant figure in that group. His writings demonstrate mastery of the Tanakh, the Talmud, and the rabbinical commentaries and codes of Jewish law.\nThe turning point in Luzzatto's life came at the age of twenty, when he received direct instruction from an angel (known as a maggid). While stories of such encounters with celestial entities were not unknown in kabbalistic circles, it was unheard of for someone of such a young age. His peers were enthralled by his written accounts of these \"Divine lessons\", but the leading Italian rabbinical authorities were highly suspicious and threatened to excommunicate him. Just one hundred years earlier another young mystic, Shabbatai Zvi (1626–1676), had rocked the Jewish world by claiming to be the Messiah. Although, at one point, Zvi had convinced many European and Middle Eastern rabbis of his claim, the episode ended with him recanting and converting to Islam. The global Jewish community was still reeling from that, and the similarities between Luzzatto's writings and Zvi's were perceived as being particularly dangerous and heretical.\nThese writings, only some of which have survived, are often misunderstood to describe a belief that the Ramchal and his followers were key figures in a messianic drama that was about to take place. In this contentious interpretation, he identified one of his followers as the Messiah, son of David, and assumed for himself the role of Moses, claiming that he was that biblical figure's reincarnation.\nAfter threats of excommunication and many arguments, Luzzatto finally came to an understanding with many of the Rabbanim (prominent rabbis), including his decision not to write the maggid's lessons or teach mysticism. In 1735, Luzzatto left Italy for Amsterdam, believing that in the more liberal environment there, he would be able to pursue his mystical interests. Passing through Germany, he appealed to the local rabbinical authorities to protect him from the threats of the Italian rabbis. They refused and forced him to sign a document stating that all the teachings of the maggid were false.\nMost of his writings were burned, though some did survive. From the Zoharic writings, the 70 Tikkunim Hadashim re-appeared in 1958 against all odds, in the main library of Oxford. \"Arrangements\" of thoughts, these Tikkunim expose 70 different essential uses of the last verse of the Humash (the five books of Moses).\nSupposedly taught word-by-word in Aramaic by Luzzatto's \"Maggid,\" they parallel the Tikunei haZohar (\"Rectifications of the Zohar\") of Rabbi Simeon bar Yochai, the Rashbi, which expose the 70 fundamental understandings of the first verse of the `Houmash (Books of Moses).\n\n\n=== Amsterdam ===\nWhen Luzzatto finally reached Amsterdam, he was able to pursue his studies of the Kabbalah relatively unhindered. Earning a living as a diamond cutter, he continued writing but refused to teach. It was in this period that he wrote his magnum opus the Mesillat Yesharim (1740), essentially an ethical treatise but with certain mystical underpinnings. The book presents a step-by-step process by which every person can overcome the inclination to sin and might eventually experience a divine inspiration similar to prophecy. Another prominent work, Derekh Hashem (The Way of God) is a philosophical text about God's purpose in Creation, justice, and ethics. The same concepts are discussed in a shorter book called Maamar HaIkarim (the English translation of this book is now available on the Web with the title \"Essay on Fundamentals\"). Da'at Tevunot (\"The Knowing Heart\") also found its existence in the Dutch city as the missing link between rationality and Kabbalah, a dialogue between the intellect and the soul. On the other hand, Derech Tevunot (\"The Way of Understanding\") introduces the logic which structures Talmudic debates as a means to understanding the world.\nOne major rabbinic contemporary who praised Luzzatto's writing was Rabbi Eliyahu of Vilna, the Vilna Gaon (1720–1797), who was considered to be the most authoritative Torah sage of the modern era as well as a great kabbalist himself. He was reputed to have said after reading the Mesillat Yesharim, that were Luzzatto still alive, he would have walked from Vilna to learn at Luzzatto's feet; He stated that having read the work, the first eight chapters contained not a superfluous word. Among some Jewish intellectuals of that time this was considered to be one of the highest praises that one sage could grant another.\nLuzzatto also wrote poetry and drama. Although most of it is seemingly secular, some scholars claim to have identified mystical undertones in this body of work as well. His writing is strongly influenced by the Jewish poets of Spain and by contemporary Italian authors.\nThe cantor of the Sephardic synagogue in Amsterdam, Abraham Caceres, worked with Luzzatto to set several of his poems to music.\n\n\n=== Akko ===\nFrustrated by his inability to teach kabbalah, Luzzatto left Amsterdam for the Holy Land in 1743, settling in Acre. Three years later, he and his family died in a plague.\n\n\n== Legacy ==\n\nBurial site\n\nThough it is accepted by scholars that his tomb is in Kafr Yasif, where some assume to have identified it, his burial place is traditionally said to be near the Talmudic sage Rabbi Akiva in Tiberias, northern Israel. Probably also because Kafr Yasif is now an Arab town while Tiberias is Jewish, the Tiberias tomb is the destination of almost all of the pilgrims seeking his final resting place.\n\nSynagogue in Acre\n\nLuzzato's original synagogue in Akko was razed by the city's Bedouin ruler Zahir al-Umar in 1758, who built a mosque on top of it. In its place, the Jews of Akko received a small building north of the mosque which still functions as a synagogue and bears the name of the Ramchal.\n\nReligious writings\n\nA century after his death, Luzzatto was rediscovered by the Mussar Movement, which adopted his ethical works. It was the great Torah ethicist, Rabbi Yisrael Salanter (1810–1883) who placed the Messilat Yesharim at the heart of the Mussar (ethics) curriculum of the major yeshivot of Eastern Europe.\n\nSecular literary legacy\n\nThe Hebrew writers of the Haskalah, the Jewish expression of the Enlightenment, greatly admired Luzatto's secular writings and deemed him the founder of modern Hebrew literature. His cousin, the poet Ephraim Luzzatto (1729–1792), also exerted genuine influence on the first stirrings of modern Hebrew poetry.\n\n\n== Bibliography ==\nThese are some of the other books that RaMChaL wrote:\nMa'aseh Shimshon (\"The Story of Samson\")\nLashon Limudim (\"A Tongue for Teaching\")\nMigdal Oz (\"A Tower of Strength\")\nZohar Kohelet (\"The Zohar to the Book of Ecclesiastes\")\nShivim Tikkunim (\"Seventy Tikkunim\") which parallels the seventy Tikkunei Zohar\nZohar Tinyanah (\"A Second Zohar\") no longer exists\nKlallot Haillan or Klalut Hailan (\"The Principle Elements of The Tree [of Life]\") a synopsis of the ARI's basic work of Kabbalah\nMa'amar Hashem (\"A Discourse on God\")\nMa'amar HaMerkava (\"A Discourse on The Chariot\")\nMa'amer Shem Mem-Bet (\"A Discourse on the 42 letter Name [of God]\")\nMa'amar HaDin (\"A Discourse on [Divine] Judgment\")\nMa'amar HaChochma or Maamar Ha'hokhma (\"A Discourse on Wisdom\") focuses on Rosh Hashanna, Yom Kippur, and Passover from a Kabbalistic perspective\nMa'amar HaGeulah (\"A Discourse on The Redemption\" or \"The Great Redemption\")\nMa'amar HaNevuah (\"A Discourse on Prophecy\")\nMishkanei Elyon or Mishkane 'Elyon (\"Exalted Towers\") a Kabbalistic understanding of the Holy Temple with a depiction of the third Temple's dimensions\nAin Yisrael (\"The Well of Israel\")\nAin Yaakov (\"The Well of Jacob\")\nMilchamot Hashem (\"The Wars of God\") which defends Kabbalah against its detractors\nKinnaot Hashem Tzivakot or Kinat H' Tsevaot (\"Ardent [Defenses] for The L-rd of Hosts\") offers details about the redemption and the Messiah.\nAdir Bamarom (\"[God is] Mighty on High\") a commentary on the Iddrah Rabbah (\"The Great Threshing Room\") section of the Zohar\nIggrot Pitchei Chochma v'Da'at or Klale Pit'he 'Hokhma Veda'at (\"Letters [to Serve] as an Opening to Wisdom and Knowledge\") spells out and explains certain erudite principles of the Jewish faith according to the Kabbalah\nSefer Daniel (\"The Book of Daniel\"), an esoteric commentary to this Biblical work\nTiktu Tephilot (\"515 Prayers\") focuses on prayers for the revelation of God's sovereignty\nKitzur Kavvanot (\"Abbreviated Intentions\") allows the reader an overview of the ARI's recorded prayer-intentions\nMa'amar HaVechuach (\"A Discourse [that serves as] The Argument \") pits a Kabbalist against a rationalist as each tries to defend his way of thinking\nKlach Pitchei Chochma or Kala'h Pitkhe 'Hokhma (\"138 Openings to Wisdom\") one of Ramchal's most important works in that it lays out his thinking about the symbolic nature of the Ari's writings and Ramchal's own explanations of those symbols\nAreichat Klallot HaEilan (\"A Dictionary of The Principle Elements to The Tree [of Life]\")\nKlallim (\"Principle Elements\") a series of short and pithy presentations of the main principles of the Kabbalistic system said outright\nDa'at Tevunot or Da'ath Tevunoth (\"The Knowing Heart\" or \"Knowing the Reasons\"), a work that explains the duality of positive and negative that exists on all levels of reality, that this is the basis of God's \"showing his face/hiding his face\" to and from humanity, and the dual existence of good and evil\nPeirush al Midrash Rabbah (\"A Commentary on Midrash Rabbah\") that isn't Kabbalistic so much as symbolic\nDerech Hashem or Derekh Hashem (\"The Way of God\") one of his best known works: a succinct laying-out of the fundamentals of the Jewish faith touching upon mankind's obligations in this world and its relations to God\nMa'amar al HaAggadot (\"A Discourse on Aggadah\") which is an explanation that Aggadic literature is not literal but metaphoric\nMa'amar HaIkkurim or Maamar Ha'ikarim (\"A Discourse on the Fundamentals\") a short and succinct laying-out of the fundamentals of the Jewish religion like \"The Way of God\" that touches upon certain other themes\nDerech Chochma or Sepher Derekh 'Hokhma (\"The Way of Wisdom\"), which serves as a dialogue between a young person and a sage with the latter setting out a lifetime course of Torah study culminating in the study of Kabbalah\nVichuach HaChocham V'HaChassid (\"The Argument between the Sage and the Pious Man\") which is actually a first draft of Messilat Yesharim that only resurfaced recently\nMessilat Yesharim or Mesilat Yesharim (\"The Path of the Just\"), his most famous work that enables its readers to grow in piety step by step, was written when he was 33 (in 1740)\nSefer HaDikduk (\"The Book of Grammar\")\nSefer HaHigayon (\"The Book of Logic\") lays out the correct way to think and analyze\nMa'amar al HaDrasha (\"A Discourse on Homilies\") encourages the study of Kabbalah and Mussar\nSefer Hamalitza (\"The Book of Style\") offers the art of accurate writing and expression\nDerech Tevunot (\"The Way of Understanding\") explains the Talmudic way of thinking.\nLaYesharim Tehilla (\"Praise be to the Upright\") is a dramatic work.\n\n\n== See also ==\nHistory of the Jews in Italy\nItalian Jews\nList of Italian Jews\nMusar literature\nMussar movement\n\n\n== References ==\n\n\n== External links ==\nThe official Ramchal site texts - Videos\nRamchal books\nAbout Luzzatto\nBiography of Luzzatto\nCurrent classes on RAMCHAL on the Internet\nHis teachings\nBeit Ramhal, continuing his legacy\nThe Kabbalah of the Ari za\"l according to the Ram`hal\nExcerpt of Derech Etz Chaim by the Ramchal\nThe purpose of life - based on the RAMCHAL\nMP3s of a class that is reading Derech HaShem (\"The Way of God\")\nVideo of Lecture on Ramhal by Dr. Henry Abramson", "ns": 0, "pageid": 350128, "title": "Moshe Chaim Luzzatto"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}