{"batchcomplete": "", "query": {"normalized": [{"to": "Muhammad Asad", "from": "Muhammad_Asad"}], "pages": {"4435095": {"extract": "Muhammad Asad (pronounced [ˈmoʊ̯hämæd ˈæsæd], Arabic: محمد أسد‎‎, Urdu: محمد أسد‎, born Leopold Weiss; 12 July 1900 – 20 February 1992) was a Jewish-born Austro-Hungarian journalist, traveler, writer, linguist, thinker, political theorist, diplomat and Islamic scholar. Asad was one of the most influential European Muslims of the 20th century.\nBy the age of thirteen, young Weiss had acquired a passing fluency in Hebrew and Aramaic, other than his native languages German and Polish. By his mid-twenties, he could read and write in English, French, Persian and Arabic. In Mandatory Palestine, Weiss engaged in arguments with Zionist leaders like Chaim Weizmann, voicing his reservations about some aspects of the Zionist Movement. After traveling across the Arab World as a journalist, he converted to Islam in 1926 and chose for himself the Muslim name \"Muhammad Asad\"—Asad being the Arabic rendition of his root name Leo (Lion).\nDuring his stay in Saudi Arabia, he spent time with Bedouins and enjoyed close company of Ibn Saud—the founder of modern Saudi Arabia. He also carried out a secret mission for Ibn Saud to trace the sources of funding for the Ikhwan Revolt. Due to these activities, he was dubbed in a Haaretz article as \"Leopold of Arabia\"—hinting similarity of his activities to those of Lawrence of Arabia.\nOn his visit to India, Asad became friends with Muslim poet-philosopher Muhammad Iqbal, who persuaded him to abandon his eastward travels and \"help elucidate the intellectual premises of the future Islamic state\". He also spent five years in internment by the British Government at the outbreak of World War II. On 14 August 1947, Asad received Pakistani citizenship and later served at several bureaucratic and diplomatic positions including the Director of Department of Islamic Reconstruction, Deputy Secretary (Middle East Division) in the Foreign Ministry of Pakistan and Pakistan's Envoy to the United Nations.\nIn the West, Asad rose to prominence as a writer with his best-selling autobiography, The Road to Mecca. Later, after seventeen years of scholarly research, he published his magnum opus: The Message of the Qur'an—an English translation and commentary of the Quran. The book, along with the translations of Pickthall and Yusuf Ali, is regarded as one of the most influential translations of the modern era. An ardent proponent of Ijtihad and rationality in interpreting religious texts, he dedicates his works \"to People who Think\". In 2008, the entrance square to the UN Office in Vienna was named Muhammad Asad Platz in commemoration of his work as a \"religious bridge-builder\". Asad has been described by his biographers as \"Europe's gift to Islam\" and \"A Mediator between Islam and the West\".\n\n\n== Personal life ==\n\n\n=== Background ===\nLeopold Weiss was born on 2 July 1900 to a Jewish family in Lemberg, Galicia, then part of the Austro-Hungarian Empire (which is currently the city of Lviv, Ukraine). Weiss was a descendant of a long line of Jewish rabbis; however, his father, Akiva Weiss, broke from tradition and became a lawyer. Leopold received a religious education and was proficient in Hebrew from an early age, as well as familiar with Aramaic. He studied the Jewish Bible or Tanakh, the text and commentaries of the Talmud, the Mishna and Gemara, also delving into the intricacies of Biblical exegesis and the Targum.\nAt the age of fourteen he made an escape from school and joined the Austrian army under a false name. After a week or so, his father traced him with the help of the police, and he was escorted back to Vienna.\n\n\n=== Years in wilderness (1920–1922) ===\nAfter abandoning university in Vienna, Weiss drifted aimlessly around 1920s Germany, working briefly for the expressionist film director Fritz Lang (F. W. Murnau, according to The Road to Mecca). By his own account, after selling a jointly written film script, he splurged the windfall on a wild party at an expensive Berlin restaurant, in the spirit of the times. While working as a telephone operator for an American news agency in Berlin, Weiss obtained a coveted interview with Russian author Maxim Gorky's wife, his first published piece of journalism, after simply ringing up her hotel room.\n\n\n== Stay in Middle East (1922–1926) ==\nIn 1922 Weiss moved to the British Mandate of Palestine, staying in Jerusalem at the house of his maternal uncle Dorian Feigenbaum at his invitation. Feigenbaum was a psychoanalyst, and a disciple of Freud and later founded the Psychoanalytic Quarterly.\n\n\n=== Foreign correspondent for Frankfurter Zeitung ===\nHe picked up work as a stringer for the German newspaper Frankfurter Zeitung, one of the most prestigious newspapers of Germany and Europe, selling articles on a freelance basis. His pieces were noteworthy for their understanding of Arab fears and grievances against the Zionist project. He published a small book on the subject in 1924, and this so inspired the confidence of the Frankfurter Zeitung that it commissioned him to travel more widely still, to collect information for a full-scale book. Weiss made the trip, which lasted two years.\n\n\n== Conversion to Islam (1926) ==\nTo allow Weiss to gain closer assignments in the Arabic world he developed an ever-deepening engagement with Islam, which led to his religious conversion in 1926 in Berlin and adopting an Arabic name, Muhammad Asad.\nAsad spoke of Islam thus:\n\n\"Islam appears to me like a perfect work of architecture. All its parts are harmoniously conceived to complement and support each other; nothing is superfluous and nothing lacking; and the result is a structure of absolute balance and solid composure.\"\n\nMagazine Saudi Aramco World in a 2002 essay described his journey to conversion in these words: \"Two roads diverged in Berlin in the 1920's: a well-worn one to the West, the other, rarely traveled, to the East. Leopold Weiss, a gifted young writer, traveler and linguist with a thorough knowledge of the Bible and the Talmud and with deep roots in European culture, took the road eastward to Makkah.\"\n\n\n== Years in Arabia (1927–1931) ==\nAfter his conversion to Islam, Asad moved to Saudi Arabia making a journey by camel across the Arabian Desert, from Tayma to Mecca. He stayed there for nearly six years during which he made five pilgrimages. Alongside, he started writing essays for Swiss newspaper Neue Zürcher Zeitung, and continued to do so till 1934.\n\n\n=== Ibn Saud's confidant and Bolshevik allegations ===\nAfter the sudden death of his wife Elsa, Asad stayed on in Mecca where, in a chance encounter in the Grand Mosque's library, he met Prince Faysal. On Faysal's invitation, Asad met King Abdulaziz (founder of modern Saudi Arabia); the meeting led to almost daily audiences with the King, who quickly came to appreciate Asad's knowledge, keen mind and spiritual depth. Ibn Saud allowed Asad to visit the Najd region (in the King's company), which was forbidden to foreigners at that time.\nIn late 1928, an Iraqi named Abdallah Damluji, who had been an adviser to Ibn Saud, submitted a report to the British on \"Bolshevik and Soviet penetration\" of the Hijaz. In this report, after highlighting Asad's activities in Arabia, Damluji alleged Asad of having connections with Bolsheviks: \"What is the real mission which makes him endure the greatest discomforts and the worst conditions of life? On what basis rests the close intimacy between him and Shaykh Yusuf Yasin (secretary to the King and editor of the official newspaper Umm al-Qura)? Is there some connection between von Weiss and the Bolshevik consulate in Jidda?\"\n\n\n=== Ikhwan Rebellion ===\nAccording to Asad, he did finally become a secret agent of sorts. Ibn Saud sent him on a secret mission to Kuwait in 1929, to trace the sources of financial and military assistance being provided to Faysal al-Dawish – an Ikhwan leader-turned-rebel against Ibn Saud's rule. Asad, after traveling day and night through the desert without lighting fire, reached Kuwait to collect first-hand evidence. He concluded that the British were providing arms and money to Ad-Dawish to weaken Ibn Saud for the purpose of securing a 'land route to India' – a railroad from Haifa to Basra ultimately connecting the Mediterranean Sea with the Indian subcontinent. \n\n\n== Years in British India and Pakistan (1932–1952) ==\n\n\n=== Meeting Iqbal and visiting Kashmir ===\nAsad left Arabia and came to British India in 1932 where he met South Asia's premier Muslim poet, philosopher and thinker Muhammad Iqbal, who had proposed the idea of an independent Muslim state in India, which later became Pakistan. Iqbal persuaded Asad to stay on in British India and help the Muslims of India establish their separate Muslim state. Iqbal introduced Asad to Chaudhry Niaz Ali Khan, a philanthropist and agriculturalist, who, on the advice of Muhammad Iqbal, established the Dar-ul-Islam Trust Institutes in Pathankot, India and Jauharabad, Pakistan. Asad stayed on in British India and worked with both Muhammad Iqbal and Chaudhry Niaz Ali Khan. Allama Iqbal encouraged Asad to translate Sahih Al-Bukhari in English for the first time in history. Asad responded positively and started making the arrangements for his translation. In order find a place serene enough to stimulate his intellectual and spiritual cerebration, he arrived in Kashmir during the summer of 1934. There, he met Mirwaiz Mouli Yusuf who became his close friend. While working enthusiastically on his translation, he also set up his own printing press in Srinagar. The first two chapters of his translation were printed in Srinagar. Asad mentions in his book entitled as \"Home-coming of the Heart\" that he had a special relationship with Kashmir and that he felt very sad when he left it.\n\n\n=== Internment as enemy alien (1939–1945) ===\nWhen the Second World War broke out in 1939, Asad's parents were arrested and, subsequently, murdered by the Nazis during the Holocaust. Asad himself was arrested in Lahore in 1939, a day after the war broke out, by the British as an enemy alien. This was despite the fact that Asad had refused German nationality after the annexation of Austria in 1938 and had insisted on retaining his Austrian citizenship. Asad spent three years incarcerated in a prison, while his family consisting of his wife, Munira, and son, Talal, after being released from detention earlier, lived under the protection of Chaudhry Niaz Ali Khan at the latter's vast 1,000-acre (4.0 km2) estate in Jamalpur, 5 km west of Pathankot. Asad was finally released and reunited with his family in Jamalpur when the Second World War ended in 1945.\n\n\n=== Role in Pakistan Movement ===\nAsad supported the idea of a separate Muslim state in India and after the independence of Pakistan on 14 August 1947, in recognition for his support for Pakistan, Asad was conferred full citizenship by Pakistan and appointed the Director of the Department of Islamic Reconstruction by the Government of Pakistan, where he made recommendations on the drafting of Pakistan's first Constitution. In 1949, Asad joined Pakistan's Ministry of Foreign Affairs as head of the Middle East Division and made efforts to strengthen Pakistan's ties with the Muslim states of the Middle East. In 1952, Asad was appointed as Pakistan's Minister Plenipotentiary to the United Nations in New York – a position that he relinquished in 1952 to write his autobiography (up to the age of 32), The Road to Mecca.\nAsad loved Pakistan, his conception of Pakistan, even when it turned its back on him, and he never felt resentment at the treatment he had received from it. He remained a citizen– the first citizen of Pakistan– until the end, although he had been strongly tempted to accept the generous, spontaneous gestures of many heads of Islamic states to have their citizenship and passport, which would have made his life so much easier.\n\n\n=== Career as a diplomat ===\nAsad contributed so much to Pakistan's early political and cultural life but was unfortunately shunted from the corridors of power. He served this country as the head of the Directorate of Islamic Reconstruction, Joint Secretary of the Middle East Division in Foreign Office, Minister Plenipotentiary to the United Nations and organizer of the International Islamic Colloquium. If one delve into the archival material of these government departments, the role played by Asad for his beloved Pakistan can be dealt with in detail.\n\n\n=== Marriage controversy and resignation ===\nBy chance, at a reception Asad met Pola, an American of Polish origin who was destined to become his third wife (d. 2007). She was a young, beautiful and intelligent woman. He fell in love with her and when he came to know that she had already embraced Islam he decided to marry her, despite the difference of age and temperament. But under the rules of the Foreign Office, he was bound to get prior permission to marry a non-Pakistani national. He applied through the proper channels but the Governor-General rejected his application. So, he submitted his resignation from the Foreign Service, divorced his Arabian wife (Munira, d. 1978) and in the inspiring company of his new wife, he sat down and wrote his extraordinary book entitled The Road to Mecca.\nDuring his stay in Switzerland, Asad received a letter from the President of Pakistan, General Ayub Khan, who was a great admirer of his book named The Principles of State and Government in Islam (1961). In a subsequent exchange of letters, he proposed to Asad to come to Pakistan and have the membership of a seven-man group of Muslim scholars – who both supposedly knew the world and were experts on Islam – to advise him with regard to everyday matters as well as the drawing up of a new Islamic constitution for the country. At that time, Asad was immersed in his cherished work on the Qur'an, and so he regretfully declined.\nAfter many years, Asad was again invited by another President of Pakistan, General Zia ul-Haq, in 1983 and that was his last visit to this country. When he arrived at Islamabad, which he had not yet seen, he was received at the plane with great honour and escorted to the Presidency. During his sojourn in Islamabad, there was a series of meetings with members of the Ansari Commission in order to prepare a kind of programme for the President for the future. Asad agreed with some, and as usual disagreed with others, which he found retrograde. On one point he was firm and insistent that Muslim women should have exactly the same rights in the political sphere as had men, to the extent of becoming Prime Minister. Asad also spared some time to meet with his surviving friends in Lahore and Islamabad and at the request of the President made several radio and television appearances, as always spontaneous. On his return, he was besieged by letters from literally hundreds of admirers in Pakistan, offering him land, a house, everything but he refused politely, as his concept of Pakistan was beyond all these worldly trivialities.\n\n\n== Later years and death ==\nTowards the end of his life, Asad moved to Spain and lived there with his third wife, Pola Hamida Asad, an American national of Polish Catholic descent who had also converted to Islam, until his death on 20 February 1992 at the age of 91. He was buried in the Muslim cemetery of Granada in the former Moorish province of Andalusia, Spain.\n\n\n== Family ==\nAsad had a son, Talal Asad, from his second Saudi Arabian wife, Munira. Talal Asad is now an anthropologist specializing in religious studies and postcolonialism. Asad also had a step-son named Heinrich (converted name Ahmad) with his first wife Else (converted name Aziza).\n\n\n== Honors and recognition ==\n\n\n=== Muhammad Asad Platz ===\nIn April 2008, a space in front of the UNO City in the 22nd District of Vienna was named Muhammad-Asad-Platz in honor of Muhammad Asad. The step was taken as part of a two-day program on the European Year of Intercultural Dialogue focusing on Islam and its relationship with Europe. The program commemorated the life and work of Asad, described as a great Austrian visionary, who earned international recognition by building bridges between the religions. The honoree's son Talal Asad, the President of the Islamic Community of Austria Anas Schakfeh and Vienna's cultural adviser Andreas Mailath-Pokorny were present at the unveiling of the square. Mailath-Pokorny, while talking to the media said:\n\n\"There is probably no more appropriate place to honor Muhammad Asad than that in front of the UN-City. Muhammad Asad was a citizen of the world, who was at home, and left his mark, everywhere in the world, especially in the Orient.\"\n\n\n=== Honorary postage stamp ===\nOn 23 March 2013, Pakistan Post issued a stamp with denomination of Rs. 15 under the \"Men of Letters\" Series in honor of Allamah Muhammad Asad.\n\n\n== Bibliography ==\n\n\n=== Portrayals of Asad ===\nIn movie documentaries:\nA Road to Mecca - The Journey of Muhammad Asad\nIn articles:\nGoldman, Shalom. \"Leopold Weiss, the Jew Who Helped Invent the Modern Islamic State\", Tablet on-line magazine, July 1, 2016.\nIn books:\nHasan, Pipip Ahmad Rifai (1998). The Political Thought of Muhammad Asad. Concordia University. \nWindhager, Günther (2002). Leopold Weiss alias Muhammad Asad : Von Galizien nach Arabien 1900–1927 (German). ISBN 978-3-20599-393-3. \nButler-Bowdon, Tom (2005). 50 spiritual classics : Timeless Wisdom from 50 Great Books on Inner Discovery, Enlightenment and Purpose. London: Nicholas Brealey. ISBN 1857883497. \nHalilović, Safvet (2006). Islam i Zapad u perspektivi Asadovog mišljenja (in Bosnian). ISBN 978-9-95892-292-3. \nChaghatai, M. Ikram (2006). Muhammad Asad : Europe's gift to Islam. ISBN 978-9-69351-852-8. \nAndrabi, Abroo Aman (2007). Muhammad Asad : His Contribution to Islamic Learning. ISBN 978-8-17898-589-3. \nWolfe, Michael (2007). One Thousand Roads to Mecca: Ten Centuries of Travelers Writing about the Muslim Pilgrimage. New York: Grove Press. ISBN 978-0-80213-599-5. \nSherif, M. A. (2009). Why An Islamic State: The Life Projects of Two Great European Muslims. ISBN 978-9-67506-239-1. \nHoenger, Tobias (2010). Muhammad Asad: A Mediator Between the Islamic and the Western World. ISBN 978-3-64078-219-2. \nSchlosser, Dominik (2015). Lebensgesetz und Vergemeinschaftungsform: Muhammad Asad (1900-1992) und sein Islamverständnis (German). ISBN 978-3-86893-182-2. \nIn journal entries:\nElma Ruth, Harder (1998). \"Muhammad Asad and 'The Road To Mecca': Text of Muhammad Asad's Interview with Karl Günter Simon\". Islamic Studies. 37 (4). ISSN 0578-8072. \nNawwab, Ismail Ibrahim (2000). \"A Matter of Love: Muhammad Asad and Islam\". Islamic Studies. 39 (2): 155–231. ISSN 0578-8072. \nHofmann, Murad (2000). \"Muhammad Asad: Europ's Gift to Islam\". Islamic Studies. 39 (2): 233–247. ISSN 0578-8072. \n\n\n=== Literary works by Asad ===\n\n\n==== Books ====\nUnromantisches Morgenland: Aus dem Tagebuch einer Reise (1924), German, published under his former name Leopold Weiss. The book is a description of the middle-East, written before his conversion to Islam, for a German-speaking readership - The Unromantic Orient (2004), English translation by Elma Ruth Harder\nIslam at the Crossroads (1934), a call for Muslims to avoid imitating Western society and instead return to the original Islamic heritage, written in English\nThe Road to Mecca (1954), autobiography covering his life from 1900–1932\nThe Principles of State and Government in Islam (1961), description of a democratic political system grounded in Islamic principles\nThe Message of The Qur'an (1980), an influential translation and interpretation of the Qur'an\nSahih Al-Bukhari: The Early Years of Islam (1981), translation and explanation of an important collection of hadith (reports of pronouncements by the prophet Muhammad)\nThis Law of Ours and Other Essays (1987), collection of essays about Islamic law.\nHome-Coming Of The Heart (1932-1992). Part II of the Road to Mecca (2016), Al Abbas International, ISBN 969-8460-41-1.\nMeditations (Unpublished), intended to clarify ambiguities arising from his translation The Message of The Qur'an (1980), stands unpublished as of 2013.\nThe Spirit of Islam is not a separate book but a republication of the first chapter of his 1934 book Islam at the Crossroads.\n\n\n==== Journals ====\nArafat: A Monthly Critique of Muslim Thought (1946–47)\n\n\n==== Video interviews ====\nMuhammad Asad and Dr. Hathout on Ijtihad\nMuhammad Asad – God Man Relationship\n\n\n==== Other publications ====\n\n\n== See also ==\n\nTimeline of Muhammad Asad's life\nList of converts to Islam\nContemporary Islamic philosophy\nIslamic revival\nThis Law of Ours and Other Essays\nThe Principles of State and Government in Islam\nPakistan Movement\n\n\n== References ==\n\n\n== Sources ==\n\n\n== External links ==", "ns": 0, "pageid": 4435095, "title": "Muhammad Asad"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}