{"batchcomplete": "", "query": {"normalized": [{"to": "Muhammad Iqbal", "from": "Muhammad_Iqbal"}], "pages": {"34348533": {"extract": "Sir Muhammad Iqbal (Urdu: محمد اقبال ‎) (November 9, 1877 – April 21, 1938), widely known as Allama Iqbal (علامہ اقبال), was a poet, philosopher, and politician, as well as an academic, barrister and scholar in British India who is widely regarded as having inspired the Pakistan Movement. He is called the \"Spiritual father of Pakistan\". He is considered one of the most important figures in Urdu literature, with literary work in both the Urdu and Persian languages.\nIqbal is admired as a prominent poet by Pakistanis, Iranians, Indians, Bangladeshis, Sri Lankans and other international scholars of literature. Though Iqbal is best known as an eminent poet, he is also a highly acclaimed \"Muslim philosophical thinker of modern times\". His first poetry book, Asrar-e-Khudi, appeared in the Persian language in 1915, and other books of poetry include Rumuz-i-Bekhudi, Payam-i-Mashriq and Zabur-i-Ajam. Amongst these, his best known Urdu works are Bang-i-Dara, Bal-i-Jibril, Zarb-i Kalim and a part of Armughan-e-Hijaz. Along with his Urdu and Persian poetry, his Urdu and English lectures and letters have been very influential in cultural, social, religious and political disputes.\nIn 1922, he was knighted by King George V, granting him the title \"Sir\". While studying law and philosophy in England, Iqbal became a member of the London branch of the All-India Muslim League. Later, during the League's December 1930 session, he delivered his most famous presidential speech known as the Allahabad Address in which he pushed for the creation of a Muslim state in Northwest India.\nIn much of South Asia and the Urdu speaking world, Iqbal is regarded as the Shair-e-Mashriq (Urdu: شاعر مشرق‎, \"Poet of the East\"). He is also called Mufakkir-e-Pakistan (Urdu: مفکر پاکستان‎, \"The Thinker of Pakistan\"), Musawar-e-Pakistan (Urdu: مصور پاکستان‎, \"Artist of Pakistan\") and Hakeem-ul-Ummat (Urdu: حکیم الامت‎, \"The Sage of the Ummah\"). The Pakistan government officially named him a \"national poet\". His birthday Yōm-e Welādat-e Muḥammad Iqbāl (Urdu: یوم ولادت محمد اقبال‎), or Iqbal Day, is a public holiday in Pakistan. In India he is also remembered as the author of the popular song Saare Jahaan Se Achcha.\n\n\n== Personal life ==\n\n\n=== Background ===\nIqbal was born on 9 November 1877 in Sialkot within the Punjab Province of British India (now in Pakistan). His grandparents were Kashmiri Pandits, the Brahmins of the Sapru clan from Kashmir who converted to Islam. In the 19th century, when the Sikh Empire was conquering Kashmir, his grandfather's family migrated to Punjab. Iqbal often mentioned and commemorated his Kashmiri Pandit Brahmin lineage in his writings.\n\nIqbal's father, Sheikh Noor Muhammad (died 1930), was a tailor, not formally educated but a religious man. Iqbal's mother Imam Bibi was a polite and humble woman who helped the poor and solved the problems of neighbours. She died on 9 November 1914 in Sialkot. Iqbal loved his mother, and on her death he expressed his feelings of pathos in a poetic form elegy.\n\nWho would wait for me anxiously in my native place?\nWho would display restlessness if my letter fails to arrive?\nI will visit thy grave with this complaint:\nWho will now think of me in midnight prayers?\nAll thy life thy love served me with devotion—\nWhen I became fit to serve thee, thou hast departed.\n\nIqbal was four years old when he was admitted to the masjid to learn the Qur'an. He learned the Arabic language from his teacher Syed Mir Hassan, the head of the madrassa and professor of Arabic language at Scotch Mission College in Sialkot, where he matriculated in 1893. He received Intermediate with the Faculty of Arts diploma from Murray College Sialkot in 1895. The same year he enrolled at the Government College Lahore where he obtained his Bachelor of Arts in philosophy, English literature and Arabic in 1897, and won the Khan Bahadurddin F.S. Jalaluddin medal as he took higher numbers in Arabic class. In 1899, he received his Masters of Arts degree from the same college and had the first place in Punjab University, Lahore.\nIqbal married three times, in 1895 while studying Bachelor of Arts he had his first marriage with Karim Bibi, the daughter of physician Khan Bahadur Ata Muhammad Khan (the maternal grandfather of director and music composer Khwaja Khurshid Anwar), through an arranged marriage. They had daughter Miraj Begum and son Aftab Iqbal. Later Iqbal's second marriage was with Sardar Begum mother of Javid Iqbal, and his third marriage was with Mukhtar Begum in December 1914.\n\n\n=== Higher education in Europe ===\nIqbal was influenced by the teachings of Sir Thomas Arnold, his philosophy teacher at Government college Lahore. Arnold's teachings determined Iqbal to pursue higher education in the West, and in 1905, he travelled to England for that purpose. Iqbal qualified for a scholarship from Trinity College, University of Cambridge and obtained Bachelor of Arts in 1906, and in the same year he was called to the bar as a barrister from Lincoln's Inn. In 1907, Iqbal moved to Germany to pursue his doctoral studies, and earned a Doctor of Philosophy degree from the Ludwig Maximilian University of Munich in 1908. Working under the guidance of Friedrich Hommel, Iqbal's doctoral thesis entitled The Development of Metaphysics in Persia was published.\nDuring Iqbal's stay in Heidelberg in 1907 his German teacher Emma Wegenast taught him about Goethe's Faust, Heine and Nietzsche. During his study in Europe, Iqbal began to write poetry in Persian. He prioritised it because he believed he had found an easy way to express his thoughts. He would write continuously in Persian throughout his life.\n\n\n=== Academic ===\n\nIqbal, after completing his Master of Arts degree in 1899, began his career as a reader of Arabic at Oriental College and shortly afterwards was selected as a junior professor of philosophy at Government College Lahore, where he had also been a student in the past. He worked there until he left for England in 1905. In 1908, he returned from England and joined the same college again as a professor of philosophy and English literature. In the same period Iqbal began practising law at Chief Court Lahore, but he soon quit law practice and devoted himself in literary works, becoming an active member of Anjuman-e-Himayat-e-Islam. In 1919, he became the general secretary of the same organisation. Iqbal's thoughts in his work primarily focus on the spiritual direction and development of human society, centred around experiences from his travels and stays in Western Europe and the Middle East. He was profoundly influenced by Western philosophers such as Friedrich Nietzsche, Henri Bergson and Goethe.\nThe poetry and philosophy of Mawlana Rumi bore the deepest influence on Iqbal's mind. Deeply grounded in religion since childhood, Iqbal began concentrating intensely on the study of Islam, the culture and history of Islamic civilisation and its political future, while embracing Rumi as \"his guide\". Iqbal would feature Rumi in the role of guide in many of his poems. Iqbal's works focus on reminding his readers of the past glories of Islamic civilisation, and delivering the message of a pure, spiritual focus on Islam as a source for sociopolitical liberation and greatness. Iqbal denounced political divisions within and amongst Muslim nations, and frequently alluded to and spoke in terms of the global Muslim community or the Ummah.\nIqbal's poetry has been translated into many European languages, at the time when his work was famous during the early part of the 20th century. Iqbal's Asrar-i-Khudi and Javed Nama were translated into English by R. A. Nicholson and A. J. Arberry respectively.\n\n\n=== Final years and death ===\n\nIn 1933, after returning from a trip to Spain and Afghanistan, Iqbal suffered from a mysterious throat illness. He spent his final years helping Chaudhry Niaz Ali Khan to establish the Dar ul Islam Trust Institute at Jamalpur estate near Pathankot, where there were plans to subsidise studies in classical Islam and contemporary social science. He also advocated for an independent Muslim state.\n\nIqbal ceased practising law in 1934 and was granted a pension by the Nawab of Bhopal. In his final years, he frequently visited the Dargah of famous Sufi Hazrat Ali Hujwiri in Lahore for spiritual guidance. After suffering for months from his illness, Iqbal died in Lahore on 21 April 1938. His tomb is located in Hazuri Bagh, the enclosed garden between the entrance of the Badshahi Mosque and the Lahore Fort, and official guards are provided by the Government of Pakistan.\n\nIqbal is commemorated widely in Pakistan, where he is regarded as the ideological founder of the state. His Tarana-e-Hind is a song that is widely used in India as a patriotic song speaking of communal harmony. His birthday is annually commemorated in Pakistan as Iqbal Day, a national holiday. Iqbal is the namesake of many public institutions, including the Allama Iqbal Campus Punjab University in Lahore, the Allama Iqbal Medical College in Lahore, Iqbal Stadium in Faisalabad, Allama Iqbal Open University in Pakistan, the Allama Iqbal International Airport in Lahore, the Allama Iqbal hall in Nishtar Medical College in Multan, Gulshan-e-Iqbal Town in Karachi, Allama Iqbal Town in Lahore, and Allama Iqbal Hall at Aligarh Muslim University in India.\nThe government and public organisations have sponsored the establishment of educational institutions, colleges and schools dedicated to Iqbal, and have established the Iqbal Academy Pakistan to research, teach and preserve his works, literature and philosophy. Allama Iqbal Stamps Society was established for the promotion of Iqbaliyat in philately and in other hobbies. His son Javid Iqbal has served as a justice on the Supreme Court of Pakistan. Javaid Manzil was Iqbal's last residence.\n\n\n== Efforts and influences ==\n\n\n=== Political ===\n\nWhile dividing his time between law practice and poetry, Iqbal had remained active in the Muslim League. He did not support Indian involvement in World War I and remained in close touch with Muslim political leaders such as Mohammad Ali Jouhar and Muhammad Ali Jinnah. He was a critic of the mainstream Indian National Congress, which he regarded as dominated by Hindus, and was disappointed with the League when during the 1920s, it was absorbed in factional divides between the pro-British group led by Sir Muhammad Shafi and the centrist group led by Jinnah.\n\nIn November 1926, with the encouragement of friends and supporters, Iqbal contested the election for a seat in the Punjab Legislative Assembly from the Muslim district of Lahore, and defeated his opponent by a margin of 3,177 votes. He supported the constitutional proposals presented by Jinnah with the aim of guaranteeing Muslim political rights and influence in a coalition with the Congress, and worked with the Aga Khan and other Muslim leaders to mend the factional divisions and achieve unity in the Muslim League. While in Lahore he was a friend of Abdul Sattar Ranjoor.\n\n\n=== Iqbal, Jinnah and concept of Pakistan ===\nIdeologically separated from Congress Muslim leaders, Iqbal had also been disillusioned with the politicians of the Muslim League owing to the factional conflict that plagued the League in the 1920s. Discontent with factional leaders like Muhammad Shafi and Fazl-ur-Rahman, Iqbal came to believe that only Jinnah was a political leader capable of preserving unity and fulfilling the League's objectives of Muslim political empowerment. Building a strong, personal correspondence with Jinnah, Iqbal was an influential force in convincing Jinnah to end his self-imposed exile in London, return to India and take charge of the League. Iqbal firmly believed that Jinnah was the only leader capable of drawing Indian Muslims to the League and maintaining party unity before the British and the Congress:\n\nI know you are a busy man but I do hope you won't mind my writing to you often, as you are the only Muslim in India today to whom the community has right to look up for safe guidance through the storm which is coming to North-West India and, perhaps, to the whole of India.\n\nWhile Iqbal espoused the idea of Muslim-majority provinces in 1930, Jinnah would continue to hold talks with the Congress through the decade and only officially embraced the goal of Pakistan in 1940. Some historians postulate that Jinnah always remained hopeful for an agreement with the Congress and never fully desired the partition of India. Iqbal's close correspondence with Jinnah is speculated by some historians as having been responsible for Jinnah's embrace of the idea of Pakistan. Iqbal elucidated to Jinnah his vision of a separate Muslim state in a letter sent on 21 June 1937:\n\nA separate federation of Muslim Provinces, reformed on the lines I have suggested above, is the only course by which we can secure a peaceful India and save Muslims from the domination of Non-Muslims. Why should not the Muslims of North-West India and Bengal be considered as nations entitled to self-determination just as other nations in India and outside India are.\n\nIqbal, serving as president of the Punjab Muslim League, criticised Jinnah's political actions, including a political agreement with Punjabi leader Sir Sikandar Hyat Khan, whom Iqbal saw as a representative of feudal classes and not committed to Islam as the core political philosophy. Nevertheless, Iqbal worked constantly to encourage Muslim leaders and masses to support Jinnah and the League. Speaking about the political future of Muslims in India, Iqbal said:\n\nThere is only one way out. Muslims should strengthen Jinnah's hands. They should join the Muslim League. Indian question, as is now being solved, can be countered by our united front against both the Hindus and the English. Without it, our demands are not going to be accepted. People say our demands smack of communalism. This is sheer propaganda. These demands relate to the defense of our national existence.... The united front can be formed under the leadership of the Muslim League. And the Muslim League can succeed only on account of Jinnah. Now none but Jinnah is capable of leading the Muslims.\n\n\n== Revival of Islamic polity ==\n\nIqbal's six English lectures were published in Lahore in 1930, and then by the Oxford University Press in 1934 in a book titled The Reconstruction of Religious Thought in Islam. The lectures had been delivered at Madras, Hyderabad and Aligarh. These lectures dwell on the role of Islam as a religion as well as a political and legal philosophy in the modern age. In these lectures Iqbal firmly rejects the political attitudes and conduct of Muslim politicians, whom he saw as morally misguided, attached to power and without any standing with the Muslim masses.\nIqbal expressed fears that not only would secularism weaken the spiritual foundations of Islam and Muslim society, but that India's Hindu-majority population would crowd out Muslim heritage, culture and political influence. In his travels to Egypt, Afghanistan, Iran and Turkey, he promoted ideas of greater Islamic political co-operation and unity, calling for the shedding of nationalist differences. He also speculated on different political arrangements to guarantee Muslim political power; in a dialogue with Dr. B. R. Ambedkar, Iqbal expressed his desire to see Indian provinces as autonomous units under the direct control of the British government and with no central Indian government. He envisaged autonomous Muslim provinces in India. Under a single Indian union he feared for Muslims, who would suffer in many respects especially with regard to their existentially separate entity as Muslims.\nIqbal was elected president of the Muslim League in 1930 at its session in Allahabad in the United Provinces, as well as for the session in Lahore in 1932. In his presidential address on 29 December 1930 he outlined a vision of an independent state for Muslim-majority provinces in northwestern India:\n\nI would like to see the Punjab, North-West Frontier Province, Sind and Baluchistan amalgamated into a single state. Self-government within the British Empire, or without the British Empire, the formation of a consolidated Northwest Indian Muslim state appears to me to be the final destiny of the Muslims, at least of Northwest India.\n\nIn his speech, Iqbal emphasised that unlike Christianity, Islam came with \"legal concepts\" with \"civic significance,\" with its \"religious ideals\" considered as inseparable from social order: \"therefore, the construction of a policy on national lines, if it means a displacement of the Islamic principle of solidarity, is simply unthinkable to a Muslim.\" Iqbal thus stressed not only the need for the political unity of Muslim communities but the undesirability of blending the Muslim population into a wider society not based on Islamic principles.\nHe thus became the first politician to articulate what would become known as the Two-nation theory—that Muslims are a distinct nation and thus deserve political independence from other regions and communities of India. However, he would not elucidate or specify if his ideal Islamic state would construe a theocracy, even as he rejected secularism and nationalism. The latter part of Iqbal's life was concentrated on political activity. He travelled across Europe and West Asia to garner political and financial support for the League, he reiterated the ideas of his 1932 address, and, during the Third round-Table Conference, he opposed the Congress and proposals for transfer of power without considerable autonomy or independence for Muslim provinces.\nHe would serve as president of the Punjab Muslim League, and would deliver speeches and publish articles in an attempt to rally Muslims across India as a single political entity. Iqbal consistently criticised feudal classes in Punjab as well as Muslim politicians averse to the League. Many unnoticed accounts of Iqbal's frustration toward Congress leadership were also pivotal in providing a vision for the two nation theory.\n\n\n=== Patron of the Journal Tolu-e-Islam ===\n\nIqbal was the first patron of Tolu-e-Islam, a historical, political, religious and cultural journal of the Muslims of British India. In 1935, according to his instructions, Syed Nazeer Niazi initiated and edited the journal, named after the famous poem of Iqbal, Tulu'i Islam. Niazi also dedicated the first edition of this journal to Iqbal. For a long time, Iqbal wanted a journal to propagate his ideas and the aims and objectives of the All India Muslim League. The journal played an important role in the Pakistan movement.\nLater, the journal was continued by Ghulam Ahmed Pervez, who had already contributed many articles in its early editions.\n\n\n== Literary work ==\n\n\n=== Persian ===\nIqbal's poetic works are written primarily in Persian rather than Urdu. Among his 12,000 verses of poetry, about 7,000 verses are in Persian. In 1915, he published his first collection of poetry, the Asrar-e-Khudi (Secrets of the Self) in Persian. The poems emphasise the spirit and self from a religious, spiritual perspective. Many critics have called this Iqbal's finest poetic work In Asrar-e-Khudi, Iqbal explains his philosophy of \"Khudi,\" or \"Self.\" Iqbal's use of the term \"Khudi\" is synonymous with the word \"Rooh\" mentioned in the Quran. \"Rooh\" is that divine spark which is present in every human being, and was present in Adam, for which God ordered all of the angels to prostrate in front of Adam. One has to make a great journey of transformation to realise that divine spirit.\nThe same concept was used by Farid ud Din Attar in his \"Mantaq-ul-Tair\". He proves by various means that the whole universe obeys the will of the \"Self.\" Iqbal condemns self-destruction. For him, the aim of life is self-realization and self-knowledge. He charts the stages through which the \"Self\" has to pass before finally arriving at its point of perfection, enabling the knower of the \"Self\" to become a vice-regent of God.\nIn his Rumuz-e-Bekhudi (Hints of Selflessness), Iqbal seeks to prove the Islamic way of life is the best code of conduct for a nation's viability. A person must keep his individual characteristics intact, but once this is achieved he should sacrifice his personal ambitions for the needs of the nation. Man cannot realise the \"Self\" outside of society. Also in Persian and published in 1917, this group of poems has as its main themes the ideal community, Islamic ethical and social principles, and the relationship between the individual and society. Although he is true throughout to Islam, Iqbal also recognises the positive analogous aspects of other religions. The Rumuz-e-Bekhudi complements the emphasis on the self in the Asrar-e-Khudi and the two collections are often put in the same volume under the title Asrar-e-Rumuz (Hinting Secrets). It is addressed to the world's Muslims.\nIqbal's 1924 publication, the Payam-e-Mashriq (The Message of the East) is closely connected to the West-östlicher Diwan by the German poet Goethe. Goethe bemoans the West having become too materialistic in outlook, and expects the East will provide a message of hope to resuscitate spiritual values. Iqbal styles his work as a reminder to the West of the importance of morality, religion and civilisation by underlining the need for cultivating feeling, ardour and dynamism. He explains that an individual can never aspire to higher dimensions unless he learns of the nature of spirituality. In his first visit to Afghanistan, he presented his book \"Payam-e Mashreq\" to King Amanullah Khan in which he admired the liberal movements of Afghanistan against the British Empire. In 1933, he was officially invited to Afghanistan to join the meetings regarding the establishment of Kabul University.\nThe Zabur-e-Ajam (Persian Psalms), published in 1927, includes the poems Gulshan-e-Raz-e-Jadeed (Garden of New Secrets) and Bandagi Nama (Book of Slavery). In Gulshan-e-Raz-e-Jadeed, Iqbal first poses questions, then answers them with the help of ancient and modern insight, showing how it affects and concerns the world of action. Bandagi Nama denounces slavery by attempting to explain the spirit behind the fine arts of enslaved societies. Here as in other books, Iqbal insists on remembering the past, doing well in the present and preparing for the future, while emphasising love, enthusiasm and energy to fulfill the ideal life.\nIqbal's 1932 work, the Javed Nama (Book of Javed) is named after and in a manner addressed to his son, who is featured in the poems. It follows the examples of the works of Ibn Arabi and Dante's The Divine Comedy, through mystical and exaggerated depictions across time. Iqbal depicts himself as Zinda Rud (\"A stream full of life\") guided by Rumi, \"the master,\" through various heavens and spheres, and has the honour of approaching divinity and coming in contact with divine illuminations. In a passage re-living a historical period, Iqbal condemns the Muslim who were instrumental in the defeat and death of Nawab Siraj-ud-Daula of Bengal and Tipu Sultan of Mysore respectively by betraying them for the benefit of the British colonists, and thus delivering their country to the shackles of slavery. At the end, by addressing his son Javid, he speaks to the young people at large, and provides guidance to the \"new generation.\"\nHis love of the Persian language is evident in his works and poetry. He says in one of his poems:\n\nگرچہ ہندی در عذوبت شکر است\ngarche Hindi dar uzūbat shekkar ast\nطرز گفتار دري شيرين تر است\ntarz-e goftar-e Dari shirin tar ast\n\nTranslation: Even though in sweetness Hindi* is sugar – (but) speech method in Dari (Persian dialect) is sweeter *\n\n\n=== Urdu ===\nIqbal's Bang-e-Dara (The Call of the Marching Bell), his first collection of Urdu poetry, was published in 1924. It was written in three distinct phases of his life. The poems he wrote up to 1905—the year he left for England—reflect patriotism and imagery of nature, including the Tarana-e-Hind (The song of India), and Tarana-e-Milli (The song of the Community). The second set of poems date from 1905-1908, when Iqbal studied in Europe, and dwell upon the nature of European society, which he emphasised had lost spiritual and religious values. This inspired Iqbal to write poems on the historical and cultural heritage of Islam and the Muslim community, with a global perspective. Iqbal urges the entire Muslim community, addressed as the Ummah, to define personal, social and political existence by the values and teachings of Islam.\nIqbal's works were in Persian for most of his career, but after 1930 his works were mainly in Urdu. His works in this period were often specifically directed at the Muslim masses of India, with an even stronger emphasis on Islam and Muslim spiritual and political reawakening. Published in 1935, the Bal-e-Jibril (Wings of Gabriel) is considered by many critics as his finest Urdu poetry, and was inspired by his visit to Spain, where he visited the monuments and legacy of the kingdom of the Moors. It consists of ghazals, poems, quatrains, epigrams and carries a strong sense of religious passion.\nThe Pas Cheh Bayed Kard ai Aqwam-e-Sharq (What are we to do, O Nations of the East?) includes the poem Musafir (Traveler). Again, Iqbal depicts Rumi as a character and an exposition of the mysteries of Islamic laws and Sufi perceptions is given. Iqbal laments the dissension and disunity among the Indian Muslims as well as Muslim nations. Musafir is an account of one of Iqbal's journeys to Afghanistan, in which the Pashtun people are counselled to learn the \"secret of Islam\" and to \"build up the self\" within themselves. Iqbal's final work was the Armughan-e-Hijaz (The Gift of Hijaz), published posthumously in 1938. The first part contains quatrains in Persian, and the second part contains some poems and epigrams in Urdu. The Persian quatrains convey the impression that the poet is travelling through the Hijaz in his imagination. Profundity of ideas and intensity of passion are the salient features of these short poems.\n\nIqbal's vision of mystical experience is clear in one of his Urdu ghazals which was written in London during his days of studying there. Some verses of that ghazal are:\n\nAt last the silent tongue of Hijaz has\nannounced to the ardent ear the tiding\nThat the covenant which had been given to the\ndesert-[dwellers] is going to be renewed\nvigorously:\nThe lion who had emerged from the desert and\nhad toppled the Roman Empire is\nAs I am told by the angels, about to get up\nagain (from his slumbers.)\nYou the [dwellers] of the West, should know that\nthe world of God is not a shop (of yours).\nYour imagined pure gold is about to lose it\nstandard value (as fixed by you).\nYour civilization will commit suicide with its own daggers.\nFor a house built on a fragile bark of wood is not longlasting\n\n\n=== English ===\nIqbal also wrote two books on the topic of The Development of Metaphysics in Persia and The Reconstruction of Religious Thought in Islam and many letters in the English language. In these, he revealed his thoughts regarding Persian ideology and Islamic Sufism – in particular, his beliefs that Islamic Sufism activates the searching soul to a superior perception of life. He also discussed philosophy, God and the meaning of prayer, human spirit and Muslim culture, as well as other political, social and religious problems.\nIqbal was invited to Cambridge to participate in a conference in 1931, where he expressed his views, including that on Separation of church and state to participants which included the students of that university :\n\nI would like to offer a few pieces of advice to the youngmen who are at present studying at Cambridge. ... I advise you to guard against atheism and materialism. The biggest blunder made by Europe was the separation of Church and State. This deprived their culture of moral soul and diverted it to the atheistic materialism. I had twenty-five years ago seen through the drawbacks of this civilization and therefore, had made some prophecies. They had been delivered by my tongue although I did not quite understand them. This happened in 1907. ... After six or seven years, my prophecies came true, word by word. The European war of 1914 was an outcome of the aforesaid mistakes made by the European nations in the separation of the Church and the State.\n\n\n== Iqbal known in subcontinent ==\n\n\n=== As Poet of the East ===\n\nIqbal has been recognised and quoted as \"Poet of the East\" by academics and institutions and media.\nThe Vice-Chancellor, Quaid-e-Azam University, Dr. Masoom Yasinzai described in a seminar as chief guest addressing to distinguished gathering of educationists and intellectuals, that Iqbal is not a poet of the East only, actually he is a universal poet. Moreover, Iqbal is not restricted to any specific segment of the world community but he is for the entire humanity.\n\nYet it should also be born in mind that whilst dedicating his Eastern Divan to Goethe, the cultural icon par excellence, Iqbal's Payam-i-Mashriq constituted both a reply as well as a corrective to the Western Divan of Goethe. For by stylising himself as the representative of the East, Iqbal's endeavour was to talk on equal terms to Goethe as the representative of West.\"\n\nIqbal's revolutionary works through his poetry awakened the Muslims of the subcontinent. Iqbal was confident that the Muslims had long been suppressed by the colonial enlargement and growth of the West. In this concept Iqbal is recognised as the \"Poet of the East\".\n\nSo to conclude, let me cite Annemarie Schimmel in Gabriel's Wing who lauds Iqbal's 'unique way of weaving a grand tapestry of thought from eastern and western yarns' (p. xv), a creative activity which, to cite my own volume Revisioning Iqbal, endows Muhammad Iqbal with the stature of a \"universalist poet\" and thinker whose principal aim was to explore mitigating alternative discourses with a view to constructing a bridge between the 'East' and the 'West'.\n\nUrdu world is very familiar Iqbal as the \"Poet of the East\". Iqbal is also called Muffakir-e-Pakistan , \"The Thinker of Pakistan\") and Hakeem-ul-Ummat \"The Sage of the Ummah\"). The Pakistan government officially named him a \"national poet\".\n\n\n== Iqbal in Iran ==\nIn Iran, he is famous as Iqbāl-e Lāhorī. (Iqbal of Lahore) Iqbal's \"Asrare-i-Khudi\" and \"Bal-i-Jibreel\" are known in Iran, while many scholars in Iran have recognised the importance of Iqbal's poetry in inspiring and sustaining the Iranian Revolution of 1979. During the early phases of the revolutionary movement, it was a common thing to see people gathering in a park or corner to listen to someone reciting Iqbal's blood-warming Persian poetry, that is why people of all ages in Iran today are familiar with at least some of his poetry, notably \"Az-zabur-e-Ajam\".\nAfter the death of Iqbal in 1938, by the early 1950s, Iqbal became known among the intelligentsia of the academic circles of Iran. Iran poet laureate Muhammad Taqi Bahar universalize Iqbal in Iran. He highly praised the work of Iqbal in Persian.\nIn 1952, the Iranian Prime Minister Mohammad Mossadeq, the national hero because of his oil nationalization policy broadcast a special radio message on Iqbal Day and praised his role in the struggle of the Indian Muslims against British imperialism. At the end of the 1950s, Iranians published the complete works of Persian. In the 1960s, Iqbal thesis on Persian philosophy was translated from English to Persian. Ali Shariati, a Sorbonne-educated sociologist, supported Iqbal as his role model as Iqbal had Rumi. It is the best example of admiration and appreciation of Iran that they gave him the place of honour in the pantheon of the Persian elegy writers.\nIn 1970, Iran realized Iqbal. Iqbal verses appeared on the banners and poetry recited at meetings of the intellectuals. Iqbal inspired many intellectuals, including famous names, Ali Shariati, Mehdi Bazargan, Sayyed Ali Khamenei and Dr. Abdulkarim Soroush.\nKey Iranian thinkers and leaders who were influenced by Iqbal's poetry during the rise of the Iranian revolution include Ayatollah Ali Khamenei, Ali Shariati, and Abdolkarim Soroush; although much of the revolutionary guard was intimately familiar with numerous verses of Iqbal's body of poetry. In fact, at the inauguration of the First Iqbal Summit in Tehran (1986), The Supreme Leader of the Iranian Revolution, Ayatollah Khamenei stated that in its 'conviction that the Quran and Islam are to be made the basis of all revolutions and movements', Iran was 'exactly following the path that was shown to us by Iqbal'. Ali Shariati, who has been described as a core ideologue for the Iranian Revolution, described Iqbal as a figure who brought a message of \"rejuvination\", \"awakening\" and \"power\" to the Muslim World.\n\n\n== International influence ==\n\n\n=== Iqbal and the West ===\n\nIqbal's views on the Western world were applauded by men including United States Supreme Court Associate Justice William O. Douglas, who said that Iqbal's beliefs had \"universal appeal\". In his Soviet biography N. P. Anikoy wrote:\n\n[Iqbal is] great for his passionate condemnation of weak will and passiveness, his angry protest against inequality, discrimination and oppression in all forms i.e., economic, social, political, national, racial, religious, etc., his preaching of optimism, an active attitude towards life and man's high purpose in the world, in a word, he is great for his assertion of the noble ideals and principles of humanism, democracy, peace and friendship among peoples.\n\nOthers, including Wilfred Cantwell Smith, stated that with Iqbal's anti-capitalist holdings he was 'anti-intellect', because \"capitalism fosters intellect\". Professor Freeland Abbot objected to Iqbal's views saying that Iqbal's view of the West was based on the role of imperialism and Iqbal was not immersed enough in Western culture to learn about the various benefits of the modern democracies, economic practices and science. Critics of Abbot's viewpoint note that Iqbal was raised and educated in the European way of life, and spent enough time there to grasp the general concepts of Western civilisation.\n\n\n== Bibliography ==\n\nProse book\nIlm ul Iqtisad (1903)\nPoetic books in Persian\nAsrar-i-Khudi (1915)\nRumuz-i-Bekhudi (1917)\nPayam-i-Mashriq (1923)\nZabur-i-Ajam (1927)\nJavid Nama (1932)\nPas Cheh Bayed Kard ai Aqwam-e-Sharq (1936)\nArmughan-e-Hijaz (1938) (in Persian and Urdu)\nPoetic books in Urdu\nBang-i-Dara (1924)\nBal-i-Jibril (1935)\nZarb-i Kalim (1936)\nBooks in English\nThe Development of Metaphysics in Persia (1908)\nThe Reconstruction of Religious Thought in Islam (1930)\n\n\n== Gallery ==\n\n\n== See also ==\n\nIblees Ki Majlis-e-Shura, a poem by Iqbal\nList of Pakistani poets\nList of Urdu language poets\nList of Muslim philosophers\nIqbal Academy Pakistan\n\n\n== References ==\n\n\n== Further reading ==\nShafique, Khurram Ali (2014). Iqbal: His Life and Our Times. ECO Cultural Institute & Iqbal Academy Pakistan. ISBN 978-0-9571416-6-7. \nRam Nath, Kak (1995). Autumn Leaves: Kashmiri Reminiscences. India: Vitasta. ISBN 81-86588-00-0. \nMustansir, Mir (2006), Iqbal, I.B. Tauris, ISBN 1-84511-094-3 \nMuhammad, Munawwar. Iqbal-Poet Philosopher of Islam. ISBN 969-416-061-8. \nSailen, Debnath. Secularism: Western and Indian. New Delhi: Atlantic Publishers. ISBN 978-81-269-1366-4. \nV.S., Naipaul (1998). Beyond Belief: Islamic Excursions Among the Converted Peoples. USA: Random House. ISBN 0-375-50118-5. \nAnnemarie, Schimmel (1963), Gabriel's Wing: a study of the religious ideas of Sir Muhammad Iqbal, Leiden, Netherlands: E. J. Brill \n\n\n== External links ==\nOfficial Website for Muhammad Iqbal\nInternational Iqbal Society (Formerly DISNA)\nIqbal Cyber Library\nThe collection of Urdu poems: Columbia University\nEncyclopedia Britannica.\nWorks by or about Allama Iqbal at Internet Archive", "ns": 0, "pageid": 34348533, "title": "Muhammad Iqbal"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}