{"batchcomplete": "", "query": {"normalized": [{"to": "Nancy Cartwright (philosopher)", "from": "Nancy_Cartwright_(philosopher)"}], "pages": {"1677762": {"extract": "Nancy Cartwright, Lady Hampshire, FBA (born 1944) is a philosopher of science and is professor of philosophy at the University of California at San Diego and the University of Durham.\n\n\n== Biography ==\nCartwright earned her BSc from the University of Pittsburgh in mathematics and her Ph.D. in philosophy at the University of Illinois at Chicago Circle. Her thesis was on the concept of mixture in quantum mechanics. Before taking her current appointments, she taught at the University of Maryland, Stanford University and the London School of Economics. She has held visiting appointments at the University of Oslo, Princeton University, Caltech, the University of Pittsburgh, the University of Cambridge and UCLA. She is currently Tsing Hua Honorary Distinguished Chair Professor at the National Tsing Hua University in Taiwan and Visiting Research Fellow at Ca' Foscari University in Venice. She co-founded the Centre for Philosophy of Natural and Social Science (CPNSS) at the LSE and the Centre for Humanities Engaging Science and Society (CHESS) at the University of Durham.\nCartwright has mentored several students in England and the United States who have gone on to become professional philosophers of science, including Naomi Oreskes, Carl Hoefer, Mauricio Suarez, Andrew Hamilton, Julian Reiss, Roman Frigg, Gabriele Contessa, Anna Alexandrova, Leah McClimans, Jacob Stegenga, Jeremy Howick, Marta Halina, Joyce Havstad, Sindhuja Bhakthavatsalam, Peter Menzies, Martin Thomson-Jones, Matt Brown, Hasok Chang, Jordi Cat, Sophia Efstathiou, Sang Wook Yi, Towfic Shomar and Szu-Ting Chen. She was also a supervisor of Saif al-Islam Gaddafi.\nCartwright was married to the philosopher Stuart Hampshire until his death in 2004. She was also previously married to Ian Hacking. She has two daughters, Emily and Sophie Hampshire Cartwright, and a granddaughter, Lucy Charlton.\n\n\n== Main contributions ==\nCartwright's approach to the philosophy of science is associated with the \"Stanford School\" of Patrick Suppes, John Dupré, Peter Galison and Ian Hacking. It is characterized by an emphasis on scientific practice as opposed to abstract scientific theories. Cartwright has made important contributions to debates on laws of nature, causation and causal inference, scientific models in the natural and social sciences, objectivity and the unity of science. Her recent work focuses on evidence and its use in informing policy decisions.\nCarl Hoefer describes Cartwright's philosophy in the following terms:\n\nNancy Cartwright’s philosophy of science is, in her view, a form of empiricism but empiricism in the style of Neurath and Mill, rather than of Hume or Carnap. Her concerns are not with the problems of skepticism, induction, or demarcation; she is concerned with how actual science achieves the successes it does, and what sort of metaphysical and epistemological presuppositions are needed to understand that success.\nCartwright, like many working scientists themselves, takes a rather pragmatic/realist stance toward observations and interventions made by scientists and engineers and particularly toward their connections to causality: Scientists see impurities causing signal loss in a cable, and they stimulate an inverted population, causing it to lase. Given these starting points, there can be no question of a skeptical attitude toward causation, in either singular or generic form. The fundamental role (or better, roles) played by causation in scientific practice is undeniable; what Cartwright does, then, is reconfigure empiricism from the ground up based on this insight. In the reconfiguration process, many mainstays of the received view of science take a beating; especially [...] the fundamentality of laws of nature.\n\n\n== Honors and awards ==\nCartwright served as the president of the Philosophy of Science Association (2009–10) and as vice-president (2007–8) and president (2008–9) of the Pacific Division of the American Philosophical Association. She is Professor Emeritus at the London School of Economics. She is also Fellow of the British Academy and member of the American Academy of Arts and Sciences and of the German Academy of Sciences Leopoldina. She has received honorary degrees from Southern Methodist University and the University of St Andrews as well as a MacArthur Fellowship. See Cartwright's CV for a full list of honors and awards.\n\n\n== Selected works ==\n\n\n=== Books ===\nHow the Laws of Physics Lie, Oxford University Press (August 1983) ISBN 0-19-824704-4. Translated to Chinese.\nNature's Capacities and Their Measurement, Oxford University Press (October 1989) ISBN 0-19-824477-0\nThe Dappled World: A Study of the Boundaries of Science, Cambridge University Press (September 1999) ISBN 0-521-64411-9\nHunting Causes and Using Them: Approaches in Philosophy and Economics, Cambridge University Press (June 2007) ISBN 0-521-86081-4. Translated to Chinese.\nEvidence Based Policy: A Practical Guide to Doing It Better, with Jeremy Hardie, Oxford University Press (2012)\nPhilosophy of Social Science: a new introduction\", with Eleonora Montuschi, Oxford University Press (2014)\n\n\n=== Articles ===\n'Causal Laws and Effective Strategies', Noûs (1979).\n'Fundamentalism vs. the Patchwork of Laws', Proceedings of the Aristotelian Society (1994).\n'What is Wrong with Bayes Nets?', The Monist (2001).\n'Causation: One Word, Many Things', Philosophy of Science (2004).\n'A philosopher's view of the long road from RCTs to effectiveness', The Lancet (2011).\n\n\n== References ==\n\n\n== External links ==\nHome page at Durham University website", "ns": 0, "pageid": 1677762, "title": "Nancy Cartwright (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}