{"batchcomplete": "", "query": {"normalized": [{"to": "Nassim Nicholas Taleb", "from": "Nassim_Nicholas_Taleb"}], "pages": {"1093496": {"extract": "Nassim Nicholas Taleb (Arabic: نسيم نيقولا طالب‎‎, alternatively Nessim or Nissim, born 1960) is a Lebanese-American essayist, scholar, statistician, former trader, and risk analyst, whose work focuses on problems of randomness, probability, and uncertainty. His 2007 book The Black Swan was described in a review by the Sunday Times as one of the twelve most influential books since World War II.\nTaleb is a bestselling author, has been a professor at several universities, serving as Distinguished Professor of Risk Engineering at the New York University Tandon School of Engineering since September 2008, and as co-editor in chief of the academic journal, Risk and Decision Analysis since September 2014. He has also been a practitioner of mathematical finance, a hedge fund manager, a derivatives trader and is currently listed as a scientific adviser at Universa Investments.\nHe criticized the risk management methods used by the finance industry and warned about financial crises, subsequently profiting from the late-2000s financial crisis. He advocates what he calls a \"black swan robust\" society, meaning a society that can withstand difficult-to-predict events. He proposes antifragility in systems, that is, an ability to benefit and grow from a certain class of random events, errors, and volatility as well as \"convex tinkering\" as a method of scientific discovery, by which he means that decentralized experimentation outperforms directed research.\n\n\n== Early life and family background ==\n\nTaleb was born in Amioun, Lebanon to Minerva Ghosn and Najib Taleb, a physician/oncologist and a researcher in anthropology. His parents were Greek Orthodox Lebanese with French citizenship, and he attended a French school there, the Grand Lycée Franco-Libanais. His family saw its political prominence and wealth reduced by the Lebanese Civil War, which began in 1975.\n\n\n== Education ==\nTaleb received his bachelor and master of science degrees from the University of Paris. He holds an MBA from the Wharton School at the University of Pennsylvania (1983), and a PhD in Management Science from the University of Paris (Dauphine) (1998), under the direction of Hélyette Geman, his dissertation focused on the mathematics of derivatives pricing.\n\n\n=== Finance view ===\nTaleb has been a practitioner of mathematical finance, a hedge fund manager, and a derivatives trader, He is currently a scientific adviser at Universa Investments.\nTaleb considers himself less a businessman than an epistemologist of randomness, and says that he used trading to attain independence and freedom from authority. Taleb was a pioneer of tail risk hedging (now sometimes called \"black swan protection\"), which is intended to mitigate investors' exposure to extreme market moves. His business model has been to safeguard investors against crises while reaping rewards from rare events, and thus his investment management career has included several jackpots followed by lengthy dry spells.\nHe has also held the following positions: Managing director and proprietary trader at Credit Suisse UBS, Worldwide chief proprietary arbitrage derivatives trader for currencies, commodities and non-dollar fixed income at First Boston, Chief currency derivatives trader for Banque Indosuez, Managing director and worldwide head of financial option arbitrage at CIBC Wood Gundy, Derivatives arbitrage trader at Bankers Trust (now Deutsche Bank), Proprietary trader at BNP Paribas, Independent option market maker on the Chicago Mercantile Exchange and founder of Empirica Capital.\nTaleb reportedly became financially independent after the crash of 1987 and was successful during the Nasdaq dive in 2000 as well as the financial crisis that began in 2007, a development which he attributed to the mismatch between statistical distributions used in finance and reality. Following this crisis, Taleb became an activist for what he called a \"black swan robust society\". Since 2007 Taleb has been a Principal/Senior Scientific Adviser at Universa Investments in Santa Monica, California, a fund which is based on the \"black swan\" idea, owned and managed by former Empirica partner Mark Spitznagel. Some of its separate funds made returns of 65% to 115% in October 2008. In a 2007 Wall Street Journal article, Taleb claimed he retired from trading in 2004, became a full-time author. However, Taleb describes the nature of his involvement as 'totally passive' from 2010 on.\n\n\n=== Academic career ===\nTaleb changed careers and became a mathematical researcher, scholar and philosophical essayist in 2006, and has held positions at NYU's Courant Institute of Mathematical Sciences, at University of Massachusetts Amherst [34], at London Business School [35], and at Oxford University. He has been Distinguished Professor of Risk Engineering at New York University Polytechnic School of Engineering, since 2008. He was Distinguished Research Scholar at the Said Business School BT Center, University of Oxford (2009-2013).\nHe is co-Editor in Chief of the academic journal, Risk and Decision Analysis (since September 2014), jointly teaches regular courses with Paul Wilmott in London (19th time, March 2015), and occasionally participates in teaching courses toward the Certificate in Quantitative Finance. He is also co-faculty at the New England Complex Systems Institute.\n\n\n=== Writing career ===\nTaleb's four volume philosophical essay on uncertainty, titled the Incerto, covers the following books: Fooled by Randomness (2001), The Black Swan (2007–2010), The Bed of Procrustes (2010), and Antifragile (2012).\nHis first non-technical book, Fooled by Randomness, about the underestimation of the role of randomness in life, published in 2001, was selected by Fortune as one of the smartest 75 books known.\nHis second non-technical book, The Black Swan, about unpredictable events, was published in 2007, selling close to 3 million copies (as of February 2011). It spent 36 weeks on the New York Times Bestseller list, 17 as hardcover and 19 weeks as paperback,  and was translated into 31 languages. The book has been credited with predicting the banking and economic crisis of 2008. A book of aphorisms, The Bed of Procrustes: Philosophical and Practical Aphorisms, was released in December 2010.\nThe fourth book of his Incerto series—Antifragile: Things That Gain from Disorder—was published in November 2012. In the introduction of the book, Taleb describes it as follows: \"Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. Yet, in spite of the ubiquity of the phenomenon, there is no word for the exact opposite of fragile. Let us call it antifragile. Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets better.\" (A mathematical parallel version of the Incerto Quadrilogy is available on Taleb's website.)\nTaleb's non-technical writing style has been described as mixing a narrative, often semi-autobiographical style with short philosophical tales and historical and scientific commentary. The sales of Taleb's first two books garnered an advance of $4 million for a follow-up book on anti-fragility.\n\n\n== Ideas and theories ==\nTaleb's book The Bed of Procrustes summarizes the central problem: \"we humans, facing limits of knowledge, and things we do not observe, the unseen and the unknown, resolve the tension by squeezing life and the world into crisp commoditized ideas\". Taleb disagrees with Platonic (i.e., theoretical) approaches to reality to the extent that they lead people to have the wrong map of reality rather than no map at all. He opposes most economic and grand social science theorizing, which in his view suffer acutely from the problem of overuse of Plato's Theory of Forms. Based on these and other constructions, he advocates for what he calls a \"black swan robust\" society, meaning a society that can withstand difficult-to-predict events.\nHe has also proposed that biological, economic, and other systems exhibit an ability to benefit and grow from volatility—including particular types of random errors and events—a characteristic of these systems that he terms antifragility. Relatedly, he also believes that universities are better at public relations and claiming credit than generating knowledge. He argues that knowledge and technology are usually generated by what he calls \"stochastic tinkering\" rather than by top-down directed research, and has proposed option-like experimentation as a way to outperform directed research as a method of scientific discovery, an approach he terms convex tinkering.\nTaleb has called for cancellation of the Nobel Prize in Economics, saying that the damage from economic theories can be devastating. He opposes top-down knowledge as an academic illusion and believes that price formation obeys an organic process. Together with Espen Gaarder Haug, Taleb asserts that option pricing is determined in a \"heuristic way\" by operators, not by a model, and that models are \"lecturing birds on how to fly\". Pablo Triana has explored this topic with reference to Haug and Taleb, and says that perhaps Taleb is correct to urge that banks be treated as utilities forbidden to take potentially lethal risks, while hedge funds and other unregulated entities should be able to do what they want.\nTaleb's writings discuss the error of comparing real-world randomness with the \"structured randomness\" in quantum physics where probabilities are remarkably computable and games of chance like casinos where probabilities are artificially built. Taleb calls this the \"Ludic fallacy\". His argument centers on the idea that predictive models are based on Plato's Theory of Forms, gravitating towards mathematical purity and failing to take some key ideas into account, such as: the impossibility of possessing all relevant information, that small unknown variations in the data can have a huge impact, and flawed theories/models that are based on empirical data and that fail to consider events that have not taken place but could have taken place. Discussing the Ludic fallacy in The Black Swan, he writes, \"The dark side of the moon is harder to see; beaming light on it costs energy. In the same way, beaming light on the unseen is costly in both computational and mental effort.\"\nIn the second edition of The Black Swan, he posited that the foundations of quantitative economics are faulty and highly self-referential. He states that statistics is fundamentally incomplete as a field as it cannot predict the risk of rare events, a problem that is acute in proportion to the rarity of these events. With the mathematician Raphael Douady, he called the problem statistical undecidability (Douady and Taleb, 2010).\nTaleb sees his main challenge as mapping his ideas of \"robustification\" and \"anti-fragility\", that is, how to live and act in a world we do not understand and build robustness to black swan events. Taleb introduced the idea of the \"fourth quadrant\" in the exposure domain. One of its applications is in his definition of the most effective (that is, least fragile) risk management approach: what he calls the 'barbell' strategy which is based on avoiding the middle in favor of linear combination of extremes, across all domains from politics to economics to one's personal life. These are deemed by Taleb to be more robust to estimation errors. For instance, he suggests that investing money in 'medium risk' investments is pointless because risk is difficult if not impossible to compute. His preferred strategy is to be both hyper-conservative and hyper-aggressive at the same time. For example, an investor might put 80 to 90% of their money in extremely safe instruments, such as treasury bills, with the remainder going into highly risky and diversified speculative bets. An alternative suggestion is to engage in highly speculative bets with a limited downside.\nTaleb asserts that by adopting these strategies a portfolio can be \"robust\", that is, gain a positive exposure to black swan events while limiting losses suffered by such random events. Together with Donald Geman and Hélyette Geman, he modeled the \"maximum entropy barbell\" which consists in \"to constrain only what can be constrained (in a robust manner) and to maximize entropy elsewhere\", based on an insight by E.T. Jaynes that economic life increases in entropy under regulatory and other constraints. Taleb also applies a similar barbell-style approach to health and exercise. Instead of doing steady and moderate exercise daily, he suggests that it is better to do a low-effort exercise such as walking slowly most of the time, while occasionally expending extreme effort. He avers that the human body evolved to live in a random environment, with various unexpected but intense efforts and much rest.\n\n\n== Praise and criticism ==\nIn a 2008 article in The Times, the journalist Bryan Appleyard described Taleb as \"now the hottest thinker in the world\". The Nobel Laureate Daniel Kahneman proposed the inclusion of Taleb's name among the world's top intellectuals, saying \"Taleb has changed the way many people think about uncertainty, particularly in the financial markets. His book, The Black Swan, is an original and audacious analysis of the ways in which humans try to make sense of unexpected events.\" Taleb was treated as a \"rock star\" at the World Economic Forum annual meeting in Davos in 2009; at that event he had harsh words for bankers.\nTaleb contends that statisticians can be pseudoscientists when it comes to risks of rare events and risks of blowups, and mask their incompetence with complicated equations. This stance has attracted criticism: the American Statistical Association devoted the August 2007 issue of The American Statistician to The Black Swan. The magazine offered a mixture of praise and criticism for Taleb's main points, with a focus on Taleb's writing style and his representation of the statistical literature. Robert Lund, a mathematics professor at Clemson University, writes that in Black Swan, Taleb is \"reckless at times and subject to grandiose overstatements; the professional statistician will find the book ubiquitously naive.\"\nAaron Brown, an author, quant and finance professor at Yeshiva and Fordham Universities, said that \"the book reads as if Taleb has never heard of nonparametric methods, data analysis, visualization tools or robust estimation.\" Nonetheless, he calls the book \"essential reading\" and urges statisticians to overlook the insults to get the \"important philosophic and mathematical truths.\" Taleb replied in the second edition of The Black Swan that \"One of the most common (but useless) comments I hear is that some solutions can come from 'robust statistics.' I wonder how using these techniques can create information where there is none\". While praising the book, Westfall and Hilbe in 2007 complained that Taleb's criticism is \"often unfounded and sometimes outrageous.\" Taleb, writes John Kay, \"describes writers and professionals as knaves or fools, mostly fools. His writing is full of irrelevances, asides and colloquialisms, reading like the conversation of a raconteur rather than a tightly argued thesis. But it is hugely enjoyable – compelling but easy to dip into. Yet beneath his rage and mockery are serious issues. The risk management models in use today exclude the very events against which they claim to protect the businesses that employ them. These models import a veneer of technical sophistication... Quantitative analysts have lulled corporate executives and regulators into an illusory sense of security.\" Taleb felt that academics showed \"bad faith\" by criticizing a literary book that claimed to be a literary book and by ignoring the empirical evidence provided in his appendix and more technical works. However, Berkeley statistician David Freedman said that efforts by statisticians to refute Taleb's stance have been unconvincing.\nTaleb and Nobel laureate Myron Scholes have traded personal attacks, particularly after Taleb's paper with Espen Haug on why nobody used the Black–Scholes–Merton formula. Taleb said that Scholes was responsible for the financial crises of 2008, and suggested that \"this guy should be in a retirement home doing Sudoku. His funds have blown up twice. He shouldn't be allowed in Washington to lecture anyone on risk.\" Scholes retorted that Taleb simply \"popularises ideas and is making money selling books\". Scholes claimed that Taleb does not cite previous literature, and for this reason Taleb is not taken seriously in academia. Haug and Taleb (2011) listed hundreds of research documents showing the Black–Scholes formula was not Scholes' at all, and argued that the economics establishment ignored literature by practitioners and mathematicians (such as Ed Thorp), who had developed a more sophisticated version of the formula.\nCiting his academic works on the same topics covered in The Black Swan, Taleb said that \"Academics should comment on data there, not make technical comments on a literary book\". He has said that no direct published criticism has been directed at his ideas, but rather at his person and style. He wrote, \"you never win an argument until they attack your person.\" In an interview on Charlie Rose, Taleb said that he was pleased that none of the criticism he received for The Black Swan had any substance, as it was either unintelligent, ad hominem, or style over substance, which convinced him to \"go for the jugular\" with a huge financial bet on the breakdown of statistical methods in finance.\nTaleb's aggressive and clearly directed commentary against parts of the finance industry—e.g., stating at Davos in 2009 that he was \"happy\" that Lehman Brothers collapsed—has led to reports of personal attacks and possible threats.\nTaleb received an honorary doctorate from the American University of Beirut in 2016 and also gave a memorable commencement address to the graduating class in which describing his life stated:\n\nI hesitate to give advice because every major single piece of advice I was given turned out to be wrong and I am glad I didn’t follow them. I was told to focus and I never did. I was told to never procrastinate and I waited 20 years for the Black Swan and it sold 3 million copies. I was told to avoid putting fictional characters in my books and I did put in Nero Tulip and Fat Tony because I got bored otherwise. I was told to not insult the New York Times and the Wall Street Journal, the more I insulted them the nicer they were to me and solicit Op-Eds. I was told to avoid lifting weights for a back pain and became a weightlifter: never had a back problem since.\nIf I had to relive my life I would be even more stubborn and uncompromising than I have been. One should never do anything without skin in the game. If you give advice, you need to be exposed to losses from it.\n\n\n== Major works ==\n\n\n=== Books ===\nIncerto (4 Volumes)\nTaleb, Nassim Nicholas (2001). Fooled by Randomness: The Hidden Role of Chance in Life and in the Markets. New York: Random House.  Second ed., 2005.\nThe Black Swan: The Impact of the Highly Improbable. New York: Random House and Penguin. 2007. ISBN 978-1-4000-6351-2.  expanded 2nd ed, 2010\nThe Bed of Procrustes: Philosophical and Practical Aphorisms. New York: Random House. 2010. ISBN 978-1-4000-6997-2. \nAntifragile: Things That Gain from Disorder. New York: Random House. 2012. ISBN 978-1-4000-6782-4. \nOther\nDynamic Hedging: Managing Vanilla and Exotic Options. New York: John Wiley & Sons. 1997. ISBN 0-471-15280-3. \n\n\n=== Key papers ===\nCirillo, P.; Taleb, N. N. (2016). \"On the tail risk of violent conflict and its underestimation\". Physica A: Statistical Mechanics and Applications. 452: 29–45. doi:10.1016/j.physa.2016.01.050. \nTaleb, N. N.; Douady, R. (2015). \"On the Super-Additivity and Estimation Biases of Quantile Contributions\". Physica A: Statistical Mechanics and Applications. 429: 252–260. doi:10.1016/j.physa.2015.02.038. \nGeman, D.; Geman, H.; Taleb, N. N. (2015). \"Tail Risk Constraints and Maximum Entropy\". Entropy. 17: 1–14. \nTaleb, N. N. (2015). \"Unique Option Pricing Measure with neither Dynamic Hedging nor Complete Markets\". European Financial Management. 21 (2): 228–235. doi:10.1111/eufm.12055. \nTaleb, N. N.; Douady, R. (2013). \"Mathematical definition, mapping, and detection of (anti)fragility\". Quantitative Finance. 13 (11): 1677–1689. doi:10.1080/14697688.2013.800219. \n\n\n== Honors ==\n2001: Inducted into the Derivatives Hall of Fame in February '01.\n2007: Selected for the Power 30 in Business by SmartMoney in October '07.\n2007: getAbstract International Book Award.\n2008: Frost & Sullivan Visionary of the Year Award.\n2009: Made the Forbes magazine list of \"Most Influential Management Gurus\".\n2011: He made the Bloomberg 50 most influential people in global finance.\n2013, 2014, 2015: The most influential 100 thought leaders in the world by the GDI Institute\n2014: The 25 most successful Wharton Business School graduates.\n\n\n== See also ==\nTaleb distribution\nApplications of randomness\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nNassim Taleb's home page\nNassim Nicholas Taleb at the Internet Movie Database", "ns": 0, "pageid": 1093496, "title": "Nassim Nicholas Taleb"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}