{"batchcomplete": "", "query": {"normalized": [{"to": "Nathan Salmon", "from": "Nathan_Salmon"}], "pages": {"2083364": {"extract": "Nathan U. Salmon (né Nathan Salmon Ucuzoglu in 1951) is an American philosopher in the Analytic tradition, specializing in metaphysics, philosophy of language, and philosophy of logic.\n\n\n== Biography ==\nSalmon was born January 2, 1951 in Los Angeles to a working-class family of Sephardi Jews of Spanish-Turkish heritage. He is the grandson of archivist Emily Sene (née Emily Perez) and oud player Isaac Sene. Salmon attended Lincoln Elementary School in Torrance, California through eighth grade, where he was a classmate and friend of the child prodigy, James Newton Howard. Salmon graduated from North High School (Torrance) in 1969.\nThe first person in his family to go to college, Salmon graduated from El Camino College (1971) and from the University of California, Los Angeles (B.A. 1973, M.A. 1974, Ph.D. 1979). At UCLA he studied with Tyler Burge, Alonzo Church, Keith Donnellan, Donald Kalish, David Kaplan, Saul Kripke, and Yiannis Moschovakis. Salmon was assistant professor of philosophy at Princeton University from 1978 to 1982. In 1984, the Council of Graduate Schools awarded him the Gustave O. Arlt Award in the Humanities, for his book, Reference and Essence (1981), which was based on his UCLA doctoral dissertation. His second book, Frege's Puzzle (1986), was selected by Scott Soames for a literary website as one of the best five books on the philosophy of language.\nSalmon is currently Distinguished Professor of philosophy at the University of California, Santa Barbara, and has been teaching there since 1984. He has also taught at UCLA, the University of California, Riverside, the University of Southern California, and was a regular visiting distinguished professor at the City University of New York Graduate Center from 2009 to 2012.\n\n\n== Work ==\n\n\n=== Direct reference theory ===\nSalmon is a proponent of the theory of direct reference. Salmon has provided accounts both of propositional attitudes and of Frege's puzzle about true identifications, i.e., truths of the form \"a = b\". Salmon maintains that co-designative proper names are inter-substitutable with preservation of semantic content. Thus, on his view the sentence \"Samuel Clemens was witty\" expresses exactly the same content as \"Mark Twain was witty\", whether or not the competent user of these sentences recognizes it. Therefore a person who believes that Mark Twain was witty ipso facto believes that Samuel Clemens was witty, even if he or she also believes, inconsistently, that Clemens was not witty. Salmon argues that this is made palatable by recognizing that to believe a proposition is to be cognitively disposed in a particular manner toward that proposition when taking it by means of some proposition-guise or other, and that one may be so disposed relative to one proposition-guise while not being so disposed relative to another. Salmon applies this apparatus to solve a variety of famous philosophical puzzles, including Frege's puzzle, Kripke's puzzle about so-called de dicto belief, and W. V. O. Quine's puzzle about de re belief. For example, Quine describes a scenario in which Ralph believes that Ortcutt is no spy, yet Ralph also believes that the man in the brown hat is a spy, when unbeknownst to Ralph the man in the hat is none other than Ortcutt. Under these circumstances, is Ortcutt believed by Ralph to be a spy? The grounds for an affirmative or negative judgment seem equally balanced. On Salmon's account Ortcutt is believed by Ralph to be a spy, since Ralph is appropriately cognitively disposed toward the proposition about Ortcutt that he is a spy when taking that proposition by means of one proposition-guise, even though Ralph is not so disposed relative to an alternative, equally relevant proposition-guise.\n\n\n=== Existence ===\nSalmon provided direct-reference accounts of problems of nonexistence and of names from fiction. Salmon argues, directly contrary to Immanuel Kant, that existence is a property, one that particular individuals have and other individuals lack. According to Salmon, the English verb \"exist\" is (along with its literal tranlsations into other languages), among other things, a term for this alleged property, and a sentence of the form \"a exists\" is true if and only if the subject term designates something with the property, and is false (and \"a does not exist\" is true) if and only if the subject term designates something with the complementary property of nonexistence. Thus Russell's example, \"The present king of France exists\", is neither true nor false, since France is not presently a monarchy, and therefore \"the present king of France\" does not designate; whereas \"Napoleon exists\" is simply false, since although Napoleon once existed, the moment he died he took on the property of nonexistence.\nBy contrast, Salmon maintains that \"Sherlock Holmes exists\" is literally true, whereas \"Sherlock Holmes was a detective\" is literally false. According to Salmon, Sherlock Holmes is an abstract entity created by author Arthur Conan Doyle, and the fiction is a story, or a collection of stories, which are about that very character but are literally false. Holmes really exists, but is only depicted as a detective in the fiction. In the fiction, Holmes is a detective; in reality, Holmes is merely a fictional detective.\nSalmon extends this view to what he calls mythical objects, like the hypothetical planet, Vulcan. Vulcan really exists, but it is not a real planet. It is an abstract entity that is only depicted as a planet in the myth. Salmon's account of fiction and myth thus has direct application to the philosophy of religion. Salmon has also applied his account of mythical objects to Peter Geach's famous problem of uncovering the logical form of the particular sentence, \"Hob thinks a witch has blighted Bob's mare, and Nob wonders whether she (the same witch) killed Cob's sow\". Salmon's account shows how the problematic sentence can be true even though there are no witches, and even if Hob and Nob do not know about each other, and there is no one whom they think is a witch.\nSalmon thinks, again contrary to Kant, that it is perfectly legitimate to invoke existence in a term's definition. Thus \"God\" might be legitimately defined as the conceivable individual that is divine and also exists. According to Salmon, the ontological argument for God's existence fallaciously assumes that \"The F is F\" is a truth of logic, or an analytic truth. What is true by logic is a significantly weaker variant: \"If anything is uniquely F, then the F is F\". The strongest conclusion that validly follows from the proposed definition is that if any conceivable individual actually is uniquely both divine and existent, then God actually exists. This same conclusion is also a trivial logical consequence of the atheist's contention that no conceivable individual actually is uniquely both divine and existent. According to Salmon's critique, the ontological argument thus shows nothing.\n\n\n=== Semantics and pragmatics ===\nSalmon argues that natural-language sentences that are representable as λ-converts of one another (in the sense of Church's lambda-calculus) are, although logically equivalent by λ-conversion, typically not strictly synonymous, i.e., they typically differ in semantic content—as for example \"a is large and also a is seaworthy\" and \"a is a thing that is both large and seaworthy\".\nSalmon maintains a sharp division between semantics and pragmatics (speech acts). He argues that in uttering a sentence, a speaker typically asserts a good deal more than the words' semantic content, and that, consequently, it is a mistake to identify the semantic content of a sentence with what is said by its speaker. Salmon maintains that such an identification is an instance of a mistaken form of argument in the philosophy of language, \"the pragmatic fallacy.\"\n\n\n=== Essentialism ===\nSalmon is also known in metaphysics for, among other things, his analysis of arguments for essentialism—the doctrine that some properties of things are properties that those things could not fail to have (except perhaps by not existing). In particular, Salmon is known for his development and defense of a reductio ad absurdum argument, using a sorites-like problem (slippery slope), against nearly universally accepted modal logic systems S4 and S5, which he argues commit \"the fallacy of necessity iteration,\" sanctioning the invalid inference from the observation that a proposition p is a necessary truth to the conclusion that it is a necessary truth that p is a necessary truth. He defends his view by exposing a mistake in a standard argument favoring S5, while arguing that there are not only possible worlds—thought of as maximal scenarios that might have obtained—but in addition classically consistent impossible worlds: maximal scenarios that could not obtain.\n\n\n=== Identity ===\nSalmon also provided a controversial reductio ad absurdum \"disproof\" of indeterminate identity, i.e., the philosophically popular idea that for some pairs of things there is no fact of the matter concerning whether those things are one and the very same. Salmon argues that if there were such a pair of things, x and y, then this pair would have to be different from the reflexive pair of x with itself, since there is a fact concerning whether x and x are the same. It would then follow by set theory that x and y are not the same, and in that case there would be a fact of the matter after all concerning whether x and y are the same: they are not. Therefore, there cannot be a pair of things for which there is no fact concerning their identity. On the other hand, Salmon maintains that not all vagueness is due to language and some indeterminacy results from how things themselves are, i.e., that for some things and some attributes, independently of language, there is no fact of the matter concerning whether those things have those attributes. Critics of Salmon's alleged proof acknowledge that the highlighted difference between <x, y> and <x, x>—that there is a fact whether the elements of the latter, but not of the former, are the same thing—is genuine, but respond that it does not validly support the conclusion that those pairs are not the same. on the other hand, there is no argument for the criticism of Salmon on Frege' identity.\n\n\n=== Publications ===\n\n\n==== Books ====\nContent, Cognition, and Communication (2007). Oxford University Clarendon Press. ISBN 0-19-928272-2\nFrege's Puzzle (Second Edition) (1986). Ridgeview, Atacadero, California. ISBN 0-924922-05-2\nMetaphysics, Mathematics, and Meaning (2005). Oxford University Clarendon Press. ISBN 0-19-928471-7\nPropositions and Attitudes (1988), (co-edited with Scott Soames). Oxford University Press, New York. ISBN 0-19-875091-9\nReference and Essence (Second Edition) (1981). Prometheus Books, Amherst, New York. ISBN 1-59102-215-0\n\n\n==== Selected articles ====\n\"Analyticity and Apriority\" (1993) in Philosophical Perspectives, 7: Language and Logic, James Tomberlin, (ed). Ridgeview, Atascadero.\n\"Assertion and Incomplete Definite Descriptions\" (1982) Philosophical Studies 42: 37-46.\n\"Being of Two Minds: Belief with Doubt\" (1995) Noûs 29 (1): 1-20.\n\"Demonstrating and Necessity\" (2002) Philosophical Review 111 (4): 497-537\n\"Existence\" (1987) in Philosophical Perspectives, James Tomberlin (ed). Ridgeview, Atascadero.\n\"The Fact That x = y\" (1987) Philosophia 17: 517-518.\n\"How Not to Become a Millian Heir\" (1991) Philosophical Studies 165-177.\n\"How Not to Derive Essentialism From the Theory of Reference\" (1979) Journal of Philosophy 76: 703-725.\n\"How to Become a Millian Heir\" (1989) Noûs 23: 211-220.\n\"How to Measure the Standard Metre\" (1988) Proceedings of the Aristotelian Society 88: 193-217.\n\"Identity Facts\" (2002) Philosophical Topics 30: 237-267.\n\"Illogical Belief\" (1989) in Philosophical Perspectives, 3: Philosophy of Mind and Action Theory. Ridgeview, Atascadero.\n\"Impossible Worlds\" (1984) in Analysis 44: 114-117.\n\"The Limits of Human Mathematics\" (2001) Noûs 15: 93-117.\n\"The Logic of What Might Have Been\" (1989) Philosophical Review 98: 3-34.\n\"Modal Paradox: Parts and Counterparts, Points and Counterpoints\" (1986) Midwest Studies in Philosophy 11: 75-120.\n\"Mythical Objects\" (2002) in Campbell, O'Rourke, and Shier, Meaning and Truth.\n\"Naming, Necessity, and Beyond\" (2003) Mind 112 (447): 475-492.\n\"Nonexistence\" (1998) Noûs 32 (3): 277-319.\n\"On Content\" (1992) Mind 101 (404): 733-751.\n\"On Designating\" (2005) Mind 114 (456): 1069-1133.\n\"The Pragmatic Fallacy\" (1991) Philosophical Studies 83-97.\n\"A Problem in the Frege-Church Theory of Sense and Denotation\" (1993) Noûs 27(2): 158-166.\n\"Reference and Information Content: Names and Descriptions\" (1989) in Handbook of Philosophical Logic, D. Gabbay (ed). Kluwer, Dordrecht.\n\"Reflections on Reflexivity\" (1992) Linguistics and Philosophy 15(1): 53-63.\n\"Reflexivity\" (1986) Notre Dame Journal of Formal Logic 27: 401-429.\n\"Relational Belief\" (1995) in On Quine: New Essays, Paolo Leonardi (ed). Cambridge University Press, New York.\n\"Relative and Absolute Apriority\" (1993) Philosophical Studies 69(1): 83-100.\n\"Review of Beyond Rigidity: The Unfinished Semantic Agenda of Naming and Necessity by Scott Soames\" (2003) Mind 112(447): 475-492.\n\"Tense and Intension\" (2003) in Time, Tense, and Reference, Aleksander Jokic and Quentin Smith (eds). MIT Press, Cambridge.\n\"Tense and Singular Propositions\" (1989) in Themes From Kaplan. Oxford University Press, New York.\n\"A Theory of Bondage\" (2006) The Philosophical Review 115 (4): 415-448.\n\"Trans-World Identification and Stipulation\" (1996) Philosophical Studies 84(2-3): 203-223.\n\"Wholes, Parts, and Numbers\" (1997) in Philosophical Perspectives, 11, Mind, Causation, and World, James Tomberlin (ed). Blackwell, Boston.\n\n\n== See also ==\nDescriptivist theory of names\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nNathan Salmon's web page at UCSB", "ns": 0, "pageid": 2083364, "title": "Nathan Salmon"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}