{"batchcomplete": "", "query": {"normalized": [{"to": "Nick Bostrom", "from": "Nick_Bostrom"}], "pages": {"408292": {"extract": "Nick Bostrom (English /ˈbɒstrəm/; Swedish: Niklas Boström, IPA: [ˈbuːˈstrœm]; born 10 March 1973) is a Swedish philosopher at the University of Oxford known for his work on existential risk, the anthropic principle, human enhancement ethics, superintelligence risks, the reversal test, and consequentialism. In 2011, he founded the Oxford Martin Programme on the Impacts of Future Technology, and he is currently the founding director of the Future of Humanity Institute at Oxford University.\nHe is the author of over 200 publications, including Superintelligence: Paths, Dangers, Strategies (2014), a New York Times bestseller and Anthropic Bias: Observation Selection Effects in Science and Philosophy (2002). In 2009 and 2015, he was included in Foreign Policy' Top 100 Global Thinkers list. Bostrom's work on superintelligence – and his concern for its existential risk to humanity over the coming century – has brought both Elon Musk and Bill Gates to similar thinking.\n\n\n== Biography ==\nBostrom was born in 1973 in Helsingborg, Sweden. At a young age, he disliked school, and he ended up spending his last year of high school learning from home. He sought to educate himself in a wide variety of disciplines, including anthropology, art, literature, and science. Despite what has been called a \"serious mien\", he once did some turns on London's stand-up comedy circuit.\nHe holds a B.A. in philosophy, mathematics, logic and artificial intelligence from the University of Gothenburg and master's degrees in philosophy and physics, and computational neuroscience from Stockholm University and King's College London, respectively. During his time at Stockholm University, he researched the relationship between language and reality by studying the analytic philosopher W. V. Quine. In 2000, he was awarded a PhD in philosophy from the London School of Economics. He held a teaching position at Yale University (2000–2002), and he was a British Academy Postdoctoral Fellow at the University of Oxford (2002–2005).\n\n\n== Philosophy ==\n\n\n=== Existential risk ===\nAn important aspect of Bostrom's research concerns the future of humanity and long-term outcomes. He introduced the concept of an existential risk, which he defines as one in which an \"adverse outcome would either annihilate Earth-originating intelligent life or permanently and drastically curtail its potential.\" In the 2008 volume Global Catastrophic Risks, editors Bostrom and Milan Ćirković characterize the relation between existential risk and the broader class of global catastrophic risks, and link existential risk to observer selection effects and the Fermi paradox. In a 2013 paper in the journal Global Policy, Bostrom offers a taxonomy of existential risk and proposes a reconceptualization of sustainability in dynamic terms, as a developmental trajectory that minimizes existential risk.\nThe philosopher Derek Parfit argued for the importance of ensuring the survival of humanity, due to the value of a potentially large number of future generations. Similarly, Bostrom has said that, from a consequentialist perspective, even small reductions in the cumulative amount of existential risk that humanity will face are extremely valuable, to the point where the traditional utilitarian imperative—to maximize expected utility—can be simplified to the Maxipok principle: maximize the probability of an OK outcome (where an OK outcome is any that avoids existential catastrophe).\nIn 2005, Bostrom founded the Future of Humanity Institute, which researches the far future of human civilization. He is also an adviser to the Centre for the Study of Existential Risk.\n\n\n=== Superintelligence ===\nIn his 2014 book Superintelligence: Paths, Dangers, Strategies, Bostrom reasons that with \"cognitive performance greatly [exceeding] that of humans in virtually all domains of interest\", superintelligent agents could promise substantial societal benefits and pose a significant artificial intelligence (AI)-related existential risk. Therefore, it is crucial, he says, that we approach this area with caution, and take active steps to mitigate the risks we face. In January 2015, Bostrom joined Stephen Hawking, Max Tegmark, Elon Musk, Martin Rees, Jaan Tallinn among others, in signing the Future of Life Institute's open letter warning of the potential dangers of AI. The signatories \"...believe that research on how to make AI systems robust and beneficial is both important and timely, and that concrete research should be pursued today.\"\n\n\n=== Anthropic reasoning ===\nBostrom has published numerous articles on anthropic reasoning, as well as the book Anthropic Bias: Observation Selection Effects in Science and Philosophy. In the book, he criticizes previous formulations of the anthropic principle, including those of Brandon Carter, John Leslie, John Barrow, and Frank Tipler.\nBostrom believes that the mishandling of indexical information is a common flaw in many areas of inquiry (including cosmology, philosophy, evolution theory, game theory, and quantum physics). He argues that a theory of anthropics is needed to deal with these. He introduced the Self-Sampling Assumption (SSA) and the Self-Indication Assumption (SIA) and showed how they lead to different conclusions in a number of cases. He pointed out that each is affected by paradoxes or counterintuitive implications in certain thought experiments (the SSA in e.g. the Doomsday argument; the SIA in the Presumptuous Philosopher thought experiment). He suggested that a way forward may involve extending SSA into the Strong Self-Sampling Assumption (SSSA), which replaces \"observers\" in the SSA definition by \"observer-moments\". This could allow for the reference class to be relativized (and he derived an expression for this in the \"observation equation\").\nIn later work, he has described the phenomenon of anthropic shadow, an observation selection effect that prevents observers from observing certain kinds of catastrophes in their recent geological and evolutionary past. Catastrophe types that lie in the anthropic shadow are likely to be underestimated unless statistical corrections are made.\n\n\n=== Ethics of human enhancement ===\nBostrom is favorable towards \"human enhancement\", or \"self-improvement and human perfectibility through the ethical application of science\", as well as a critic of bio-conservative views. With philosopher Toby Ord, he proposed the reversal test. Given humans' irrational status quo bias, how can one distinguish between valid criticisms of proposed changes in a human trait and criticisms merely motivated by resistance to change? The reversal test attempts to do this by asking whether it would be a good thing if the trait was altered in the opposite direction.\nIn 1998, Bostrom co-founded (with David Pearce) the World Transhumanist Association (which has since changed its name to Humanity+). In 2004, he co-founded (with James Hughes) the Institute for Ethics and Emerging Technologies, although he is no longer involved in either of these organisations. Bostrom was named in Foreign Policy's 2009 list of top global thinkers \"for accepting no limits on human potential.\"\n\n\n=== Technology strategy ===\nHe has suggested that technology policy aimed at reducing existential risk should seek to influence the order in which various technological capabilities are attained, proposing the principle of differential technological development. This principle states that we ought to retard the development of dangerous technologies, particularly ones that raise the level of existential risk, and accelerate the development of beneficial technologies, particularly those that protect against the existential risks posed by nature or by other technologies.\n\n\n=== Simulation argument ===\n\nBostrom's simulation argument posits that at least one of the following statements is very likely to be true:\nThe fraction of human-level civilizations that reach a posthuman stage is very close to zero;\nThe fraction of posthuman civilizations that are interested in running ancestor-simulations is very close to zero;\nThe fraction of all people with our kind of experiences that are living in a simulation is very close to one.\nTo estimate the probability of at least one of those propositions holding, he offers the following equation:\n\n  \n    \n      \n        \n          f\n          \n            \n              sim\n            \n          \n        \n        =\n        \n          \n            \n              \n                f\n                \n                  \n                    p\n                  \n                \n              \n              N\n              H\n            \n            \n              (\n              \n                f\n                \n                  \n                    p\n                  \n                \n              \n              N\n              H\n              )\n              +\n              H\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {sim}}={\\frac {f_{\\textrm {p}}NH}{(f_{\\textrm {p}}NH)+H}}}\n  \nwhere:\n\n  \n    \n      \n        \n          f\n          \n            \n              p\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {p}}}\n   is the fraction of all human civilizations that will reach a technological capability to program reality simulators.\n\n  \n    \n      \n        N\n      \n    \n    {\\displaystyle N}\n   is the average number of ancestor-simulations run by the civilizations mentioned by \n  \n    \n      \n        \n          f\n          \n            \n              p\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {p}}}\n  .\n\n  \n    \n      \n        H\n      \n    \n    {\\displaystyle H}\n   is the average number of individuals who have lived in a civilization before it was able to perform reality simulation.\n\n  \n    \n      \n        \n          f\n          \n            \n              sim\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {sim}}}\n   is the fraction of all humans who live in virtual realities.\nN can be calculated by multiplying the fraction of civilizations interested in performing such simulations (\n  \n    \n      \n        \n          f\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {1}}}\n  ) by the number of simulations run by such civilizations (\n  \n    \n      \n        \n          N\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle N_{\\textrm {1}}}\n  ):\n\n  \n    \n      \n        N\n        =\n        \n          f\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle N=f_{\\textrm {1}}}\n  \n  \n    \n      \n        \n          N\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle N_{\\textrm {1}}}\n  \nThus the formula becomes:\n\n  \n    \n      \n        \n          f\n          \n            \n              sim\n            \n          \n        \n        =\n        \n          \n            \n              \n                f\n                \n                  \n                    p\n                  \n                \n              \n              \n                f\n                \n                  \n                    1\n                  \n                \n              \n              \n                N\n                \n                  \n                    1\n                  \n                \n              \n            \n            \n              (\n              \n                f\n                \n                  \n                    p\n                  \n                \n              \n              \n                f\n                \n                  \n                    1\n                  \n                \n              \n              \n                N\n                \n                  \n                    1\n                  \n                \n              \n              )\n              +\n              1\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {sim}}={\\frac {f_{\\textrm {p}}f_{\\textrm {1}}N_{\\textrm {1}}}{(f_{\\textrm {p}}f_{\\textrm {1}}N_{\\textrm {1}})+1}}}\n  \nBecause post-human computing power \n  \n    \n      \n        \n          N\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle N_{\\textrm {1}}}\n   will be such a large value, at least one of the following three approximations will be true:\n\n  \n    \n      \n        \n          f\n          \n            \n              p\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {p}}}\n   ≈ 0\n\n  \n    \n      \n        \n          f\n          \n            \n              1\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {1}}}\n   ≈ 0\n\n  \n    \n      \n        \n          f\n          \n            \n              sim\n            \n          \n        \n      \n    \n    {\\displaystyle f_{\\textrm {sim}}}\n   ≈ 1\n\n\n== Policy and consultations ==\nBostrom has provided policy advice and consulted for an extensive range of governments and organisations. He gave evidence to the House of Lords, Select Committee on Digital Skills, with Anders Sandberg, he was a consultant to the UK Government Office for Science (GOSE) and Foresight for \"The Future of Human Identity\" report and an Expert Member for World Economic Forum's Agenda Council for Catastrophic Risks. He is an advisory board member for the Machine Intelligence Research Institute, Future of Life Institute, Foundational Questions Institute In Physics and Cosmology and an external advisor for the Cambridge Centre for the Study of Existential Risk.\n\n\n== Bibliography ==\n\n\n=== Books ===\n2002 – Anthropic Bias: Observation Selection Effects in Science and Philosophy, ISBN 0-415-93858-9\n2009 – Human Enhancement, edited by Bostrom and Julian Savulescu, ISBN 0-19-929972-2\n2011 – Global Catastrophic Risks, edited by Bostrom and Milan M. Ćirković, ISBN 978-0-19-857050-9\n2014 – Superintelligence: Paths, Dangers, Strategies, ISBN 978-0-19-967811-2\n\n\n=== Journal articles (selected) ===\nBostrom, Nick (1999). \"The Doomsday Argument is Alive and Kicking\". Mind. 108 (431): 539–550. doi:10.1093/mind/108.431.539. JSTOR 2660095. \nBostrom, Nick (January 2000). \"Observer-relative chances in anthropic reasoning?\". Erkenntnis. 52 (1): 93–108. doi:10.1023/A:1005551304409. JSTOR 20012969. \nBostrom, Nick (June 2001). \"The Doomsday Argument, Adam & Eve, UN++, and Quantum Joe\". Synthese. 127 (3): 359–387. doi:10.1023/A:1010350925053. JSTOR 20141195. \nBostrom, Nick (October 2001). \"The Meta-Newcomb Problem\". Analysis. 61 (4): 309–310. doi:10.1111/1467-8284.00310. JSTOR 3329010. \nBostrom, Nick (March 2002). \"Existential Risks: Analyzing Human Extinction Scenarios and Related Hazards\". Journal of Evolution and Technology. 9 (1). \nBostrom, Nick (December 2002). \"Self-Locating Belief in Big Worlds: Cosmology's Missing Link to Observation\". Journal of Philosophy. 99 (12): 607–623. JSTOR 3655771. \nBostrom, Nick (April 2003). \"Are You Living in a Computer Simulation?\" (PDF). Philosophical Quarterly. 53 (211): 243–255. doi:10.1111/1467-9213.00309. JSTOR 3542867. \nBostrom, Nick (2003). \"The Mysteries of Self-Locating Belief and Anthropic Reasoning\" (PDF). Harvard Review of Philosophy. 11 (Spring): 59–74. \nBostrom, Nick (November 2003). \"Astronomical Waste: The Opportunity Cost of Delayed Technological Development\". Utilitas. 15 (3): 308–314. doi:10.1017/S0953820800004076. \nBostrom, Nick (May 2005). \"The Fable of the Dragon-Tyrant\". J Med Ethics. 31 (5): 273–277. doi:10.1136/jme.2004.009035. JSTOR 27719395. PMC 1734155. PMID 15863685. \nBostrom, Nick (June 2005). \"In Defense of Posthuman Dignity\". Bioethics. 19 (3): 202–214. doi:10.1111/j.1467-8519.2005.00437.x. PMID 16167401. \nBostrom, Nick; Tegmark, Max (December 2005). \"How Unlikely is a Doomsday Catastrophe?\". Nature. 438 (7069): 754. doi:10.1038/438754a. PMID 16341005. \nBostrom, Nick (2006). \"What is a Singleton?\". Linguistic and Philosophical Investigations. 5 (2): 48–54. \nBostrom, Nick (May 2006). \"Quantity of Experience: Brain-Duplication and Degrees of Consciousness\" (PDF). Minds and Machines. 16 (2): 185–200. doi:10.1007/s11023-006-9036-0. \nBostrom, Nick; Ord, Toby (July 2006). \"The Reversal Test: Eliminating Status Quo Bias in Applied Ethics\" (PDF). Ethics. 116 (4): 656–680. doi:10.1086/505233. \nBostrom, Nick; Sandberg, Anders (December 2006). \"Converging Cognitive Enhancements\" (PDF). Annals of the New York Academy of Sciences. 1093 (1): 201–207. doi:10.1196/annals.1382.015. \nBostrom, Nick (July 2007). \"Sleeping beauty and self-location: A hybrid model\" (PDF). Synthese. 157 (1): 59–78. doi:10.1007/s11229-006-9010-7. JSTOR 27653543. \nBostrom, Nick (January 2008). \"Drugs can be used to treat more than disease\" (PDF). Nature. 452 (7178): 520. doi:10.1038/451520b. \nBostrom, Nick (2008). \"The doomsday argument\". Think. 6 (17–18): 23–28. doi:10.1017/S1477175600002943. \nBostrom, Nick (2008). \"Where Are They? Why I hope the search for extraterrestrial life finds nothing\" (PDF). Technology Review (May/June): 72–77. \nBostrom, Nick; Sandberg, Anders (September 2009). \"Cognitive Enhancement: Methods, Ethics, Regulatory Challenges\" (PDF). Science and Engineering Ethics. 15 (3): 311–341. doi:10.1007/s11948-009-9142-5. PMID 19543814. \nBostrom, Nick (2009). \"Pascal's Mugging\" (PDF). Analysis. 69 (3): 443–445. doi:10.1093/analys/anp062. JSTOR 40607655. \nBostrom, Nick; Ćirković, Milan; Sandberg, Anders (2010). \"Anthropic Shadow: Observation Selection Effects and Human Extinction Risks\" (PDF). Risk Analysis. 30 (10): 1495–1506. doi:10.1111/j.1539-6924.2010.01460.x. \nBostrom, Nick (2011). \"Information Hazards: A Typology of Potential Harms from Knowledge\" (PDF). Review of Contemporary Philosophy. 10: 44–79. \nBostrom, Nick (2011). \"Infinite Ethics\" (PDF). Analysis and Metaphysics. 10: 9–59. \nBostrom, Nick (May 2012). \"The Superintelligent Will: Motivation and Instrumental Rationality in Advanced Artificial Agents\" (PDF). Minds and Machines. 22 (2): 71–84. doi:10.1007/s11023-012-9281-3. \nBostrom, Nick; Shulman, Carl (2012). \"How Hard is AI? Evolutionary Arguments and Selection Effects\" (PDF). J. Consciousness Studies. 19 (7–8): 103–130. \nBostrom, Nick; Armstrong, Stuart; Sandberg, Anders (November 2012). \"Thinking Inside the Box: Controlling and Using Oracle AI\" (PDF). Minds and Machines. 22 (4): 299–324. doi:10.1007/s11023-012-9282-2. \nBostrom, Nick (February 2013). \"Existential Risk Reduction as Global Priority\". Global Policy. 4 (3): 15–31. doi:10.1111/1758-5899.12002. \nBostrom, Nick; Shulman, Carl (February 2014). \"Embryo Selection for Cognitive Enhancement: Curiosity or Game-changer?\" (PDF). Global Policy. 5 (1): 85–92. doi:10.1111/1758-5899.12123. \nBostrom, Nick; Muehlhauser, Luke (2014). \"Why we need friendly AI\" (PDF). Think. 13 (36): 41–47. doi:10.1017/S1477175613000316. \n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nNick Bostrom home page\nSuperintelligence: Paths, Dangers, Strategies\nBostrom's Anthropic Principle website, containing information about the anthropic principle and the Doomsday argument.\nOnline copy of book, \"Anthropic Bias: Observation Selection Effects in Science and Philosophy\" (HTML, PDF)\nBostrom's Simulation Argument website\nBostrom's Existential Risk website\nNick Bostrom at the Internet Movie Database\nNick Bostrom interviewed on the TV show Triangulation on the TWiT.tv network\nNick Bostrom at TED \nThe 10 gatekeepers of humanity against the risks of AI, Hot Topics 2015\nThe A.I. anxiety The Washington Post, December 27, 2015.", "ns": 0, "pageid": 408292, "title": "Nick Bostrom"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}