{"batchcomplete": "", "query": {"normalized": [{"to": "Nicolai Hartmann", "from": "Nicolai_Hartmann"}], "pages": {"504020": {"extract": "Nicolai Hartmann (German: [ˈhaɐ̯tman]; 20 February 1882 – 9 October 1950) was a Baltic German philosopher. He is regarded as a key representative of critical realism and as one of the most important twentieth century metaphysicians.\n\n\n== Biography ==\nHartmann was born of German descent in Riga, which was then the capital of the Governorate of Livonia in the Russian Empire, and which is now in Latvia. He was the son of the engineer Carl August Hartmann and his wife Helene, born Hackmann. He attended from 1897, the German-language high school in Saint Petersburg. In the years 1902–1903 he studied Medicine at the University of Tartu (then Jurjev), and 1903–1905 classical philology and philosophy at the Saint Petersburg Imperial University with his friend Vasily Sesemann. In 1905 he went to the University of Marburg, where he studied with the neo-Kantians Hermann Cohen and Paul Natorp. In Marburg began a lifelong friendship with Heinz Heimsoeth. In 1907 he received his doctorate with the thesis Das Seinsproblem in der griechischen Philosophie vor Plato (The Problem of Being in Greek Philosophy Before Plato). In 1909 he published the book Platos Logik des Seins (The Logic of Being in Plato). The same year he completed his habilitation on Proclus: Des Proklus Diadochus philosophische Anfangsgründe der Mathematik (Proclus Diadochus' Philosophical Elements of Mathematics).\nIn 1911, Hartmann married Alice Stepanitz, with whom he had a daughter, Dagmar, in 1912. In 1912 he published Die philosophischen Grundlagen der Biologie (The Philosophical Foundations of Biologie). From 1914 to 1918 he did military service as an interpreter, letter censor, and intelligence officer. In 1919, i.e., after the war, he received a position as Privatdozent in Marburg. Around this time he met Martin Heidegger. In 1920 he became Associate Professor (außerordentlicher Professor) and in 1921 appeared the work that established him as an independent philosophical thinker, Grundzüge einer Metaphysik der Erkenntnis (Foundation of a Metaphysics of Knowledge). The following year he became Full Professor (ordentlicher Professor) as successor of the Chair held by Natorp. In 1925, he moved to Cologne, where he came into contact with Max Scheler. In 1926 he published his second major work—Ethik—in which he develops a material value ethics akin to that of Scheler. The same year he divorced from his wife.\nIn 1929 Hartmann married Frida Rosenfeld, with whom he had a son, Olaf (1930), and a daughter, Lise (1932). In 1931 he became Professor of Theoretical Philosophy in Berlin. He held the Chair until 1945. During this time he successively published many pieces of his ontology: Das Problem des geistigen Seins (The Problem of Spiritual Being) (1933), Zur Grundlegung der Ontologie (On the Foundation of Ontology) (1935), Möglichkeit und Wirklichkeit (Possibility and Actuality) (1938) and Der Aufbau der realen Welt. Grundriß der allgemeinen Kategorienlehre (The Structure of the Real World. Outline of the General Theory of Categories) (1940). The unrests of the National Socialist period seems to have left Hartmann relatively undisturbed in his task of developing a new ontology. In the \"SD-Dossiers über Philosophie-Professoren\" (i.e. SD-files concerning philosophy professors) that were set up by the SS Security Service (SD) Nicolai Hartmann was classified from an SS-point of view in the following way: \"has always been a nationalist. Loyal to National Socialism, too, without political activity, but a social attitude has to be acknowledged. (cf. donations to the NSV and caring for vacation host children)\".\nIn 1942, Hartmann edited a volume entitled Systematische Philosophie, in which he contributed the essay Neue Wege der Ontologie (New Ways of Ontology), which summarizes his work in ontology.\nBetween 1945 and 1950, Hartmann taught in Göttingen. He died of a stroke in 1950. In the year of his death, there appeared his Philosophie der Natur (Philosophy of Nature). His works Teleologisches Denken (Teleological Thinking) (1951) and Ästhetik (Aesthetics) (1953) were published posthumously.\nHe is regarded as an important representative of critical realism and as one of the major metaphysicians of the twentieth century. Among Hartmann's many students were Boris Pasternak, Hans-Georg Gadamer, Emil Cioran, Jakob Klein, Delfim Santos and Max Wehrli. He is the modern discoverer of emergence — originally called by him categorial novum. His encyclopedic work is basically forgotten today, although famous during his lifetime. His early work in the philosophy of biology has been cited in modern discussions of genomics and cloning, and his views on consciousness and free will are currently in vogue among contributors to the Journal of Consciousness Studies.\n\n\n== Ontological theory ==\nIn Hartmann's ontological theory, the levels of reality are: (1) the inorganic level (German: anorganische Schicht), (2) the organic level (organische Schicht), (3) the psychical/emotional level (seelische Schicht) and (4) the intellectual/cultural level (geistige Schicht). In the Structure of the Real World (Der Aufbau der realen Welt), Hartmann postulates four laws that apply to the levels of reality.\nThe law of recurrence: Lower categories recur in the higher levels as a subaspect of higher categories, but never vice versa.\nThe law of modification: The categorial elements modify in their recurrence in the higher levels (they are shaped by the characteristics of the higher levels).\nThe law of the novum: The higher category is composed of a diversity of lower elements, but it is a specific novum that is not included in the lower levels.\nThe law of distance between levels: Since the different levels do not develop continuously but in leaps, they can be clearly distinguished.\n\n\n== Quotations ==\n\"The tragedy of man is that of somebody who is starving and sitting at a richly laden table but does not reach out with his hand, because he cannot see what is right in front of him. For the real world has inexhaustible splendour, the real life is full of meaning and abundance, where we grasp it, it is full of miracles and glory.\"\n\n\n== Works ==\n\n\n=== Works in German ===\nBooks\n1912, Philosophische Grundfragen der Biologie, Vandenhoeck & Ruprecht, Göttingen.\n1921, Grundzüge einer Metaphysik der Erkenntnis, Vereinigung wissenschaftlichen. Verleger, Berlin.\n1923, Die Philosophie des deutschen Idealismus 1: Fichte, Schelling und die Romantik, de Gruyter, Berlin.\n1926, Ethik, de Gruyter, Berlin-Leipzig.\n1929, Die Philosophie des deutschen Idealismus 2: Hegel, de Gruyter, Berlin.\n1931, Zum Problem der Realitätsgegebenheit, Pan-Verlagsgesellschaft, Berlin.\n1933, Das Problem des geistigen Seins. Untersuchungen zur Grundlegung der Geschichtsphilosophie und der Geisteswissenschaften, de Gruyter, Berlin-Leipzig.\n1935, Ontologie, (4 Volumes) I: Zur Grundlegung der Ontologie, de Gruyter, Berlin-Leipzig.\n1938, II: Möglichkeit und Wirklichkeit, de Gruyter, Berlin.\n1940, III: Der Aufbau der realen Welt: Grundriß d. allg. Kategorienlehre , de Gruyter, Berlin.\n1949, Einführung in die Philosophie, Luise Hanckel Verlag, Hannover.\n1950, IV: Philosophie der Natur : Abriss der speziellen Kategorienlehre, de Gruyter, Berlin.\n1942, Systematische Philosophie, Kohlhammer, Stuttgart & Berlin.\n1943, Neue Wege der Ontologie, Kohlhammer, Stuttgart.\n1951, Teleologisches Denken, de Gruyter, Berlin.\n1953, Asthetik, de Gruyter, Berlin.\n1954, Philosophische Gespräche, Vandenhoeck & Ruprecht, Göttingen.\n1955, Der philosophische Gedanke und seine Geschichte, Zeitlichkeit und Substantialität, Sinngebung und Sinnerfüllung, de Gruyter, Berlin.\n1955, Kleinere Schriften ; *Bd. 1* Abhandlungen zur systematischen Philosophie, de Gruyter, Berlin.\n1957, Kleinere Schriften ; *Bd. 2* Abhandlungen zur Philosophie-Geschichte, de Gruyter, Berlin.\n1958, Kleinere Schriften ; *Bd. 3* Vom Neukantianismus zur Ontologie, de Gruyter, Berlin.\nArticles\n1924, Diesseits von Idealismus und Realismus : Ein Beitrag zur Scheidg d. Geschichtl. u. Übergeschichtl. in d. Kantischen Philosophie in: Sonderdrucke der Kantischen Studien, Pan Verlag R. Heise Berlin, pp. 160–206.\n1926, Aristoteles und Hegel, Beitrage zur Philosophie des Deutschen Idealismus, 3 (1923), pp. 1–36.\n1927, \"Über die Stellung der ästhetischen Werte im Reich der Werte überhaupt\", in Proceedings of the Sixth International Congress of Philosophy, Edgar Sheffield Brightman (ed.), New York: Longmans, Green, and Co, pp. 428–436.\n1933, Systematische Selbstdarstellung in: Deutsche systematische Philosophie nach ihren Gestaltern, Ebda, Berlin : Junker & Dünnhaupt, pp. 283–340.\n1935, Das Problem des Apriorismus in der Platonischen Philosophie in: Sitzungsberichte d. Preuss. Akad. d. Wiss. Phil.-hist. Kl. 1935, 15, de Gruyter, Berlin.\n1936, Der philosophische Gedanke und seine Geschichte, in: Abhandlungen d. Preuss. Akad. d. Wissenschaften. Phil.-hist. Kl. 1936, Nr 5, de Gruyter, Berlin.\n1937, Der megarische und der Aristotelische Möglichkeitsbegriff : Ein Beitr. zur Geschichte d. ontolog. Modalitätsproblems, in; Sitzungsberichte d. Preuss. Akad. d. Wiss. Phil.-hist. Kl. 1937, 10, de Gruyter, Berlin.\n1938, Heinrich Maiers Beitrag zum Problem der Kategorien, in: Sitzungsberichte d. Preuss. Akad. d. Wiss. Phil.-hist. Kl. 1938, de Gruyter, Berlin.\n1939, Aristoteles und das Problem des Begriffs, in: Abhandlungen der Preussischen Akademie der Wissenschaften : Philosophisch-historische Klasse ; Jg. 1939, Nr 5, de Gruyter, Berlin.\n1941, “Zur Lehre vom Eidos bei Platon und Aristoteles”, in: Abhandlungen d. Preuss. Akad. d. Wiss. Phil.-hist. Kl. Jg. 1941, Nr 8, de Gruyter, Berlin.\n1942, Neue Wege der Ontologie, in: Systematische Philosophie, N. Hartmann, editor, Stuttgart.\n1943, Die Anfänge des Schichtungsgedankens in der alten Philosophie, in: Abhandlungen der Preußischen Akademie der Wissenschaften : Philosophisch-historische Klasse ; Jg. 1943, Nr 3, de Gruyter, Berlin.\n1946, Leibniz als Metaphysiker, de Gruyter, Berlin.\n\n\n=== Translations in English ===\nNicolai Hartmann, Ethics, London: George Allen & Unwin 1932. Reprinted with a new introduction by Andreas A.M. Kinneging - New Brunswick, Transaction Publishers, 2002-2004 in three volumes: I. Moral phenomena (2002); II. Moral values (2004); III. Moral freedom (2004).\nNicolai Hartmann, \"German Philosophy in the Last Ten Years\", translated by John Ladd, Mind: A Quarterly Review of Psychology and Philosophy, vol. 58, no. 232, 1949, pp. 413–433.\nNicolai Hartmann, New Ways of Ontology, Westport: Greenwood Press, 1952 (Reprinted with a new introduction by P.Cicovacki, Transaction Publishers, 2012).\nNicolai Hartmann, Possibility and Actuality. Berlin: Walter de Gruyter, 2013 (Translation of Möglichkeit und Wircklichkeit (1938).\n\n\n== See also ==\nSupervenience\n\n\n== References ==\n\n\n== Further reading ==\nBooks\n1952, H. Heimsoeth and others, N. Hartmann, der Denker und seine Werk.\n1957, Jitendra Nath Mohanty, Nicolai Hartmann and Alfred North Whitehead: A Study in Recent Platonism, Calcutta: Progressive Publishers.\n1959, H. Hulsmann, Die Methode in der Philosophie N. Hartmanns.\n1962, K. Kanthack, N. Hartmann und das Ende der Ontologie.\n1965, I. Wirth, Realismus und Apriorismus in N. Hartmanns Erkenntnistheorie.\n1965, J. B. Forsche, Zur Philosohie Nicolai Hartmann\".\n1971, E. Hammer-Kraft, Freiheit und Dependenz im Schichtdenken Nicolai Hartmanns.\n1973, R. Gamp, Die interkategoriale Relation und die dialektische Methode in der Philosophie N. Hartmanns.\n1974, S. U. Kang, Nächstenliebe und Fernstenliebe Eine kritische Auseinandersetzung mit Nicolai Hartmann.\n1982, Herbert Spiegelberg, The Phenomenological Movement: A Historical Introduction, The Hague: Martinus Nijhoff. (Chapter VI: Phenomenology in the Critical Ontology of Nicolai Hartmann).\n1984, Eva Hauel Cadwallader, Searchlight on Values: Nicolai Hartmann's Twentieth-Century Value Platonism, Washington: University press of America.\n1987, Dong-Hyun Son, Die Seinsweise des objektivierten Geistes: Eine Untersuchung im Anschluss an Nicolai Hartmanns Problematik des \"geistigen Seins\", Peter Lang\n1989, Arnd. Grötz, Nicolai Hartmanns Lehre vom Menschen, Frankfurt am Main, Lang.\n1990, William H. Werkmeister, Nicolai Hartmann's New Ontology, Tallahassee, Florida State University Press.\n1992, Roland H. Feucht, Die Neoontologie Nicolai Hartmanns im Licht der evolutionären Erkenntnistheorie, Regensburg, Roderer.\n1994, Abolghassem Sakersadeh, Immanenz und Transzendenz als ungelöste Problematik in der Philosophie Nicolai Hartmanns, Münster, Lit.\n1996, João Maurício Adeodato, Filosofia do direito: uma crítica à verdade na ética e na ciência (através de um exame da ontologia de Nicolai Hartmann), São Paulo, Saraiva.\n1997, Martin Morgenstern,Nicolai Hartmann zur Einführung, Hamburg, Junius.\n2000, Wolfgang, Harich, Nicolai Hartmann - Größe und Grenzen, edited by Martin Morgenstern, Wurzburg: Königshausen und Neumann.\n2001, Axiomathes (Springer), 12:3-4, special issue on N. Hartmann (Includes papers by Albertazzi, Cicovacki, Da Re, Johansson, Peruzzi, Poli, Tegtmeier, van der Schaar, Wildgen)\n2001, Nebil Reyhani, Hermann Weins Auseinandersetzung mit Nicolai Hartmann als sein Weg von der Ontologie zu einer philosophischen Kosmologie, PhD dissertation, Johannes Gutenberg-Universität, Mainz.\n2003, Gerhard Ehrl, Nicolai Hartmanns philosophische Anthropologie in systematischer Perspektive, Cuxhave, Junghans.\n2004, Alessandro Gamba, In principio era il fine. Ontologia e teleologia in Nicolai Hartmann, Milano, Vita e Pensiero.\n2007, Leszek Kopciuch, \"Człowiek i historia u Nicolaia Hartmanna\", Lublin, Wydawnictwo Uniwersytetu Marii Curie-Skłodowskiej.\n2009 Giuseppe D'Anna \"Nicolai Hartmann. Dal conoscere all'essere\", Brescia, Morcelliana\n2010, Leszek Kopciuch, \"Wolnośc a wartości. Max Scheler - Nicolai Hartmann - Dietrich von Hildebrand - Hans Reiner\", Lublin, Wydawnictwo Uniwersytetu Marii Curie-Skłodowskiej.\n2011, Roberto Poli, Carlo Scognamiglio and Frederic Tremblay (eds.), The Philosophy of Nicolai Hartmann, Berlin, Walter de Gruyter.\n2011, Eugene Kelly, Material Ethics of Value: Max Scheler and Nicolai Hartmann, Dordrecht: Springer.\nArticles\n1935, Hilda Oakeley, \"Professor Nicolai Hartmann's Concept of Objective Spirit,\" Mind, vol. 44, pp. 39–57.\n1942, Lewis White Beck, \"Nicolai Hartmann's Criticism of Kant's Theory of Knowledge,\" Philosophy and Phenomenological Research, vol. 2, pp. 472–500.\n1943, Michael Landmann, \"Nicolai Hartmann and Phenomenology,\" Philosophy and Phenomenological Research, vol. 3 pp. 393–423.\n1951, Helmut Kuhn, \"Nicolai Hartmann's Ontology,\" Philosophical Quarterly, vol. 1, pp. 289–318.\n1953, Jacob Taubes, \"The Development of the Ontological Question in Recent German Philosophy,\" Review of Metaphysics, vol. 6, pp. 651–664.\n1954, John E. Smith, \"Hartmann's New Ontology,\" Review of Metaphysics, vol. 7, pp. 583–601.\n1956, Eva Schaper, \"The Aesthetics of Hartmann and Bense,\" Review of Metaphysics, vol. 10, pp. 289–307.\n1960, Helen James, \"Nicolai Hartmann's Study of Human Personality,\" New Scholasticism, vol. 34, pp. 204–233.\n1961, Robert Hein, \"Nicolai Hartmann: A Personal Sketch,\" Personalist, vol 42, pp. 469–486.\n1963, Stanislas Breton, \"Ontology and Ontologies: The Contemporary Situation,\" International Philosophical Quarterly, vol. 3, pp. 339–369.\n1963, Paul K. Feyerabend, \"Professor Hartmann's Philosophy of Nature,\" Ratio, vol. 5, pp. 91–106.\n1963, Jitendra Nath Mohanty, \"Remarks on Nicolai Hartmann's Modal Doctrine,\" Kant Studien, vol. 54, pp. 181–187.\n1966, Caroline Schuetzinger, \"The Gnoseological Transcendence in Nicolai Hartmann's Metaphysics of Cognition (First Part),\" Thomist, vol. 30, pp. 1–37.\n1966, Caroline Schuetzinger, \"The Gnoseological Transcendence in Nicolai Hartmann's Metaphysics of Cognition (Second Part),\" Thomist, vol. 30, pp. 136–196.\n1984, Richard Bodeus, \"The Problem of Freedom According to Nicolai Hartmann,\" International Philosophical Quarterly, vol. 24, pp. 55–60.\n1984, Eva Hauel Cadwallader, \"The Continuing Relevance of Nicolai Hartmann's Theory of Value\", Journal of Value Inquiry, vol. 18, pp. 113–121.\n1984, Frederick Kraenzel, \"Nicolai Hartmann's Doctrine of Ideal Values: An Examination,\" Journal of Value Inquiry, vol. 18, pp. 299–306.\n1986, Janina Makota, \"Nicolai Hartmann's and Roman Ingarden's Philosophy of Man,\" Reports on Philosophy, vol. 10, pp. 69–79.\n1994, Wolfgang Drechsler and Rainer Kattel, \"Nicolai Hartmann\", Akademia, vol. 6, pp. 1579–1592.\n1997, Robert Welsh Jordan, \"Nicolai Hartmann.\" Encyclopedia of Phenomenology, eds Lester Embree, Elizabeth A. Behnke, Thomas Seebohm, Jitendra Nath Mohanty, Joseph J. Kockelmans, et al. Contributions to Phenomenology, vol. 18, Dordrecht; Boston: Kluwer Academic Publishers; 288-292.\n1998, Roberto Poli, \"Levels,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 9, pp. 197–211.\n2001, Predrag Cicovacki, \"New Ways of Ontology - The Ways of Interaction\", Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 159–170.\n2001, Gabor Csepregi, \"The Relevance of Nicolai Hartmann's Musical Aesthetics,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 339–354.\n2001, Antonio Da Re, \"Objective Spirit and Personal Spirit in Hartmann's Philosophy,\" Axiomathes, vol. 12, pp. 317–326.\n2001, Ingvar Johansson, \"Hartmann's Nondeductive Materialism, Superimposition, and Supervenience,\" Axiomathes, vol. 12, pp. 195–215.\n2001, Leszek Kopciuch, \"Metafizyka historii u Nicolaia Hartmanna. Granice rozumu historycznego\", in: Z. J. Czarnecji (ed.), \"Dylematy racjonalności. Między rozumem teoretycznym a praktycznym, Lublin: Wydawnictwo Uniwersytetu Marii Curie-Sklodowoskiej, pp. 133-152.\n2001, Erwin Tegtmeier, \"Hartmann's General Ontology,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 217–225.\n2001, Maria Van der Schaar, \"Hartmann's Rejection of the Notion of Evidence,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 285–297.\n2001, Robert Welsh Jordan, \"Hartmann, Schutz, and the Hermeneutics of Action,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 327–338.\n2001, Roberto Poli, \"The Basic Problem of the Theory of Levels of Reality,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 261–283.\n2001, Alberto Peruzzi, \"Hartmann's Stratified Reality,\" Axiomathes: An International Journal in Ontology and Cognitive Systems, vol. 12, pp. 227–260.\n2002, Robert Welsh Jordan, \"Nicolai Hartmann: Proper Ethics is Atheistic, Phenomenological Approaches to Moral Philosophy. a Handbook, edited by John J. Drummond and Lester Embree, Dordrecht; Boston; London: Kluwer Academic Publishers, 175-196.\n2005, Leszek Kopciuch, \"Aprioryzm w czuciu wartości u N. Hartmanna\", in: H. Jakuszko (ed.), \"Racjonalność teoretyczna i praktyczna\", „Annales UMCS”, vol. XXX, Sect. I, pp. 153–173.\n2006, Leszek Kopciuch, \"Krytyka relatywizmu aksjologicznego u N. Hartmanna\", „Edukacja Filozoficzna” vol. 41, pp. 157–170.\n2007, Leszek Kopciuch, \"O sile i bezsile wartości u Nicolaia Hartmanna\", in: K. łojek (red.), \"Człowiek w kulturze\", Warszawa: Wydawnictwo WSFiZ, pp. 233–244.\n2007, Leszek Kopciuch, \"Przedmiot czucia wartości w etyce N. Hartmanna\", „Etyka”, No.40, pp. 49–61.\n2007, Leszek Kopciuch, \"O trudnościach w poznawaniu wartości etycznych u N. Hartmanna\", in: M. Hetmański (ed.), \"Epistemologia współcześnie\", Kraków: Universitas, pp. 445–453.\n2008, Leszek Kopciuch, \"O różnicy w budowie dzieła sztuki u R. Ingardena i N. Hartmanna (w sprawie zarzutów Ingardena względem N. Hartmanna)\", „Kwartalnik Filozoficzny”, vol. XXXVI, issue 2, pp. 101–114.\n2008, Leszek Kopciuch, \"Zum Problem der Geschichtsphilosophie bei N. Hartmann\", in: D. Pater (ed.)\"Eine Philosophie – eine Welt – ein Mensch\", Hannover: Europäische Akademie der Naturwissenschaften, pp. 13–28.\n2009, Leszek Kopciuch, \"Wolna wola – G. W. Leibniz i N. Hartmann\", in: H. Jakuszko, L. Kopciuch (ed.), \"W kręgu zagadnień filozofii XVII wieku\", Lublin: Lubelskie Towarzystwo Naukowe, Wydawnictwo Olech, pp. 213–222.\n2009, Leszek Kopciuch, \"Nicolaia Hartmanna prawa bytu realnego\", „Acta Universitatis Lodziensis”, Folia Philosophica, vol. 22, pp. 105–115\n2010, Leszek Kopciuch, \"Kilka uwag o stosunku Hartmanna do etyki Kanta, „Studia Philosophica Wratislaviensia”, vol. V, fasc. 2, pp. 167–170.\n2010, Leszek Kopciuch, \"O stosunku N. Hartmanna do A. Schopenhauera, „Idea. Studia nad strukturą i rozwojem pojęć filozoficznych”, vol. XXII, pp. 51–61.\n2011, Frederic Tremblay, \"Nicolai Hartmann's Definition of Biological Species,\" in R. Poli, C. Scognamiglio, F. Tremblay (eds.), The Philosophy of Nicolai Hartmann, Berlin: Walter de Gruyter, pp. 125–139.\n2011, Leszek Kopciuch, \"Nicolaia Hartmanna krytyka podmiotu transcendentalnego w etyce\", in: P. Parszutowicz, M. Soin (ed.), \"Idea transcendentalizmu. Od Kanta do Wittgensteina\", Warszawa: Wydawnictwo IFiS PAN, pp. 279–294.\n2013, Frederic Tremblay, \"Nicolai Hartmann and the Metaphysical Foundation of Phylogenetic Systematics,\" Biological Theory, vol. 7, n. 1, pp. 56–68.\n\n\n== External links ==\nPoli, Roberto. \"Nicolai Hartmann\". Stanford Encyclopedia of Philosophy. \nNicolai Hartmann Society\nLevels of Reality in the Ontology of Nicolai Hartmann\nMartin Morgenstern, Vom Idealismus zur realistischen Ontologie. Das Frühwerk Nicolai Hartmanns, in: Philosophia: E-Journal of Philosophy and Culture, 5/2013.", "ns": 0, "pageid": 504020, "title": "Nicolai Hartmann"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}