{"batchcomplete": "", "query": {"normalized": [{"to": "Nigel Warburton", "from": "Nigel_Warburton"}], "pages": {"11276543": {"extract": "Nigel Warburton (/ˈwɔːrbərtən/; born 1962) is a British philosopher. He is best known as a populariser of philosophy, having written a number of books in the genre, but he has also written academic works in aesthetics and applied ethics.\n\n\n== Education ==\nWarburton received a BA from the University of Bristol and a PhD from Darwin College, Cambridge, and was a lecturer at the University of Nottingham before joining the Department of Philosophy at the Open University in 1994. In May 2013, he resigned from the position of Senior Lecturer at the Open University.\n\n\n== Career ==\nHe is the author of a number of introductory Philosophy books, including the bestselling Philosophy: The Basics (4th ed.), Philosophy: The Classics (4th ed.), and Thinking from A to Z (3rd ed.); he also edited Philosophy: Basic Readings (2nd ed.) and was the co-author of Reading Political Philosophy: Machiavelli to Mill. He has written extensively about photography, particularly about Bill Brandt, and wrote a biography of the modernist architect Ernő Goldfinger. He regularly teaches courses on philosophy and art at Tate Modern and writes a monthly column \"Everyday Philosophy\" for Prospect magazine.\nHe runs a philosophy weblog Virtual Philosopher and with David Edmonds regularly podcasts interviews with top philosophers on a range of subjects at Philosophy Bites. He also podcasts chapters from his book Philosophy: The Classics.\n\n\n== Partial bibliography ==\nPhilosophy: The Basics (4th ed.) ISBN 978-0-415-32773-2\nPhilosophy: The Classics (4th ed.) ISBN 978-0-415-53466-6\nThinking from A to Z (3rd ed.) ISBN 978-0-415-43371-6\nThe Art Question\nErnö Goldfinger: The Life of An Architect\nFree Speech: A Very Short Introduction ISBN 978-0-19-923235-2\nPhilosophy Bites (co-edited with David Edmonds) ISBN 978-0-19-957632-6; Philosophy Bites. 25 Philosophen sprechen über 25 große Themen (translated by Holger Hanowell), Reclam 2013\nPhilosophy Bites Back (co-edited with David Edmonds) ISBN 978-0-19-969300-9; Auf den Schultern von Riesen. 27 Philosophen sprechen über ihre Lieblingsphilosophen (translated by Holger Hanowell), Reclam 2015\nA Little History of Philosophy ISBN 978-0-300-15208-1\n\n\n== References ==\n\n\n== External links ==", "ns": 0, "pageid": 11276543, "title": "Nigel Warburton"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}