{"batchcomplete": "", "query": {"normalized": [{"to": "Nomy Arpaly", "from": "Nomy_Arpaly"}], "pages": {"42309779": {"extract": "Nomy Arpaly is a Professor of Philosophy at Brown University. Her main research interests include ethics, moral psychology, action theory, and free will; she has written two books on moral agency (Unprincipled Virtue: an Inquiry into Human Agency and In Praise of Desire,) and one (Merit, Meaning, and Human Bondage – an Essay on Free Will) on free will.\n\n\n== Education and career ==\nArpaly received a dual bachelor's from Tel Aviv University in 1992 in philosophy and linguistics, and a doctorate in philosophy from Stanford University in 1998. She accepted a position as a Visiting Assistant Professor at the University of Michigan, Ann Arbor for the 1998–9 term, before accepting an Assistant Professorship at Rice University where she stayed in 2003. In 2003, she accepted an Assistant Professorship at Brown University, where she was promoted to Associate Professor in 2006, and then to Professor of Philosophy in 2014.\n\n\n== Research areas and publications ==\nArpaly has authored three volumes – one focused on moral agency – Unprincipled Virtue: an Inquiry into Human Agency (2002) – and one focused on free will – Merit, Meaning, and Human Bondage – an Essay on Free Will (2006.) and one dealing with human agency – In Praise of Desire (2014.) Additionally, she's written a number of peer-reviewed papers dealing with topics such as ethics, moral psychology, and action theory.\nIn Unprincipled Virtue: an Inquiry into Human Agency, Arpaly sets out to develop a systematic way to determine whether an individual is blameworthy or praiseworthy. Arpaly engages with (and attempts to refute) a number of prominent philosophers who have dealt with the issue previously (including Kant and Aristotle,) but focuses foremost on developing her own theory of praiseworthiness, one in which people are praise (or blame)worthy for their acts in a way that varies with their moral motivations, and (in the case of blameworthiness) with the amount of their moral indifference – a concept she sums up as – Praiseworthiness as Responsiveness to Moral Reasons. Arpaly articulates a skeptical and deflationary view of the whole idea of autonomy, pointing out that at least eight separate notions of the idea of autonomy can be found in modern philosophical literature, and doubting that autonomy of any sort is needed for an action to be praiseworthy. One of the most significant contributions of Arpaly's book is simply that it lays out the flaws present in most former philosophical debate on the subject – the use of overly simple and unnuanced models in previous discussions of praiseworthiness. One of the central claims of Unprincipled Virtue is that the assistance that Huckleberry Finn renders to Jim is morally worthy even though Huck actively believes that he is doing something wrong, and that akrasia can sometimes be a more rational state than individual autonomy.\n\n\n== References ==", "ns": 0, "pageid": 42309779, "title": "Nomy Arpaly"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}