{"batchcomplete": "", "query": {"normalized": [{"to": "Norman Daniels", "from": "Norman_Daniels"}], "pages": {"24644429": {"extract": "Norman Daniels, born in 1942, is an American political philosopher and philosopher of science, political theorist, ethicist, and bioethicist at Harvard University. Before his career at Harvard, Daniels had built his career as a medical ethicist at Tufts University School of Medicine, also in Boston.\n\n\n== Teaching positions ==\nDaniels is Mary B. Saltonstall Professor of Population Ethics and Professor of Ethics and Population Health in the Department of Global Health and Population at the Harvard School of Public Health in Boston.\nPreviously, and for 33 years, he had taught political philosophy at Tufts University in Medford, Massachusetts. At Tufts University, he was Goldthwaite Professor and Chair of the Philosophy Department, and at Tufts University School of Medicine, he was Professor of Medical Ethics (1969–2002).\n\n\n== Education ==\n1970 - Harvard University, Ph.D. (Philosophy), awarded the Plympton Dissertation Prize, 1971\n1966 - Balliol College, Oxford, B.A. (equivalent to M.A. in USA) (Philosophy and Psychology, First Honors)\n1964 - Wesleyan University, B.A. (English, Summa cum Laude)\n\n\n== Personal ==\nDaniels is married to neuro-psychologist Anne Lacy Daniels (Ed.D.). They have one son, Noah M. Daniels, a postdoctoral research associate at MIT.\nWith Jared Israel, Daniels co-chaired the Harvard chapter of the Students for a Democratic Society in 1969.\nIn a public letter to his fraternity brothers at Wesleyan, Daniels wrote: \"At Harvard, I ended up co-chair of SDS and gave the speech on the steps of University Hall April 9, 1969, that began the take-over of that administration building and thus led to the Harvard Strike. I would have been fired as a teaching fellow, so I followed my advisors advice and quit that position to take a part-time job at Tufts, teaching philosophy of science and political philosophy. I stayed 33 years.\"\n\n\n== Professional affiliations ==\nFormerly Goldthwaite Professor and Chair of the Philosophy Department at Tufts University and Professor of Medical Ethics at Tufts Medical School, 1969–2002\nFellow, Hastings Center\nMember, Institute of Medicine\nFounding Member of the National Academy of Social Insurance\nMember, International Society for Equity in Health\nMember, Medicare Coverage Advisory Commission (Bill Clinton administration)\nMember, Ethics Working Group of the Clinton White House Health Care Task Force (Spring 1993)\nMember, Advisory Board of the CIHR-Institute of Population and Public Health (Fall 2009)\nMember, Ethics Advisory Board of the Centers for Disease Control (Fall 2009 - Fall 2012)\nMember, Public Health Service Expert Panel on Cost Effectiveness and Clinical Preventive Medicine\nMember, National Academy of Social Insurance study panel on the social role of Medicare\nMember, Century Fund task force on Medicare reform\nConsulting\nHe has consulted with organizations, commissions, and governments in the U.S. and abroad on issues of justice and health policy\nConsultant, United Nations\nConsultant, World Health Organization\nPresident's Commission for the Study of Ethical Problems in Medicine\n\n\n== Books ==\nThomas Reid's`Inquiry': the Geometry of Visibles and the Case for Realism (1974; Stanford, 1989)\nReading Rawls (1975; Stanford, 1989)\nJust Health Care (Cambridge, 1985)\nAm I My Parents' Keeper? An Essay on Justice Between the Young and the Old (Oxford, 1988)\nSeeking Fair Treatment: From the AIDS Epidemic to National Health Care Reform Oxford, 1995)\nJustice and Justification: Reflective Equilibrium in Theory and Practice (Cambridge University Press, 1996)\n(with Donald Light and Ronald Caplan) Benchmarks of Fairness for Health Care Reform (Oxford, 1996)\n(with Allen Buchanan, Dan Brock, and Dan Wikler) From Chance to Choice: Genetics and Justice. Cambridge University Press. ISBN 0-521-66977-4. (Cambridge, 2000)\n(with Bruce Kennedy and Ichiro Kawachi) Is Inequality Bad for Our Health? (Beacon Press, 2000)\n(with James Sabin) Setting Limits Fairly: Can We Learn to Share Medical Resources? (Oxford, 2002;2nd ed., 2008)\nJust Health: Meeting Health Needs Fairly (Cambridge, 2008).\n[Source: Bibliography of books, from personal webpage, which also includes peer-reviewed journal articles and book chapters published since 1965]\n\n\n== Awards ==\nMember, Institute of Medicine\nFellow, The Hastings Center\nFounding Member, National Academy of Social Insurance\nFounding Member, International Society for Equity in Health\nFounding Member, National Cancer Policy Board, established by the Institute of Medicine and the Commission on the Life Sciences (served He served four years)\nFounding Member, Advisory Board of the Open Society Foundation project on Medicine as a Profession, and on the International Bioethics Advisory Board of PAHO. He served recently on an IOM Committee on the use of Cost Effectiveness Analysis in regulatory contexts.\n\n\n== Fellowships and grants ==\nGreenwall Foundation\nNational Endowment for the Humanities\nNational Institutes of Health\nNational Library of Medicine\nNational Science Foundation\nRetirement Research Foundation\nRobert Wood Johnson Foundation\nInvestigator Award in Health Policy Research, Robert Wood Johnson Foundation, 1997 (for the period 1998-2001)\n\"Limit-Setting in Managed Care and Other Health Delivery Systems: Legitimacy, Fair Process, and the Goals of Health Care Reform\"\nRockefeller Foundation grant, international adaptation of the benchmarks\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nList of Jewish American philosophers\n\n\n== References ==\n\n\n== External links ==\nHSPH Faculty Site for Prof. Norm Daniels\nPublications of Prof. Norm Daniels\n'Norman Daniels Symposium' lectures/papers presented published in the Journal of Medical Ethics (January 2009, Volume 35, Number 1), published by British Medical Journal and the Institute of Medical Ethics\nHSPH-sponsored personal Faculty website for Prof. Norman O. Daniels, PhD", "ns": 0, "pageid": 24644429, "title": "Norman Daniels"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}