{"batchcomplete": "", "query": {"normalized": [{"to": "Norman Malcolm", "from": "Norman_Malcolm"}], "pages": {"685623": {"extract": "Norman Malcolm (/ˈmælkəm/; 11 June 1911 – 4 August 1990) was an American philosopher.\n\n\n== Life ==\nMalcolm was born in Selden, Kansas. He studied philosophy with O.K. Bouwsma at the University of Nebraska, then enrolled as a graduate student at Harvard University in 1933.\nAt Cambridge University in 1938-9, he met G. E. Moore and Ludwig Wittgenstein. Malcolm attended Wittgenstein's lectures on the philosophical foundations of mathematics throughout 1939 and remained one of Wittgenstein's closest friends. Malcolm's memoir of his time with Wittgenstein, published in 1958, is widely acclaimed as one of the most captivating and most accurate portraits of Wittgenstein's remarkable personality.\nAfter serving in the United States Navy from 1942 to 1945, Malcolm, with his wife, Leonida, and their son, Raymond Charles Malcolm, resided in Cambridge again in 1946-47. He saw a good deal of Wittgenstein during that time, and they continued to correspond frequently thereafter. In 1947, Malcolm joined the faculty at Cornell University, where he taught until his retirement. In 1949, Wittgenstein was a guest of the Malcolms in Ithaca, New York. In that year Malcolm introduced O.K. Bouwsma to Wittgenstein. Bouwsma remained close to Wittgenstein until Wittgenstein's death in 1951.\nIn 1959, his book Dreaming was published, in which he elaborated on Wittgenstein's question as to whether it really mattered if people who tell dreams \"really had these images while they slept, or whether it merely seems so to them on waking\". This work was also a response to Descartes' Meditations.[1]\nOther than that he is known for propagating the view that common sense philosophy and ordinary language philosophy are the same. He was generally supportive of Moore's theory of knowledge and certitude, though he found Moore's style and method of arguing to be ineffective. His critique of Moore's articles on skepticism (and also on Moore's 'Here is a hand' argument) lay the foundation for the renewed interest in common sense philosophy and ordinary language philosophy.\nMalcolm was also a defender of a modal version of the ontological argument. In 1960 he argued that the argument originally presented by Anselm of Canterbury in the second chapter of his Proslogion was just an inferior version of the argument propounded in chapter three. His argument is similar to those produced by Charles Hartshorne and Alvin Plantinga. Malcolm argued that a God cannot simply exist as a matter of contingency but rather must exist in necessity if at all. He argued that if God exists in contingency then his existence is subject to a series of conditions that would then be greater than God and this would be a contradiction (referring to Anselm's definition of God as That than which Nothing Greater can be Conceived).\n\n\n== Publications ==\nHis works include:\nLudwig Wittgenstein: A Memoir\nMoore and Ordinary Language\nWittgenstein: A Religious Point Of View?\nNothing Is Hidden: Wittgenstein's criticism of his early thought\nProblems of Mind: Descartes to Wittgenstein\nKnowledge and Certainty\nConsciousness and Causality (with D. M. Armstrong)\nMemory and Mind\nDreaming and Skepticism\nWittgenstein: The Relation of Language to Instinctive Behaviour (J.R.Jones Memorial Lecture) Publisher: University of Wales, Swansea (Dec 1981) ISBN 0860760243\nThought and knowledge\nWittgensteinian themes (edited by Georg Henrik von Wright) and Dreaming.\n\n\n== See also ==\n\"Norman Malcolm: A Memoir,\" Anthony Serafini, in the journal PHILOSOPHY, published by the Royal Institute of Philosophy, 68:265265, 309-324, Cambridge University Press, 1993.\n\n\n== References ==", "ns": 0, "pageid": 685623, "title": "Norman Malcolm"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}