{"batchcomplete": "", "query": {"normalized": [{"to": "Nyāya Sūtras", "from": "Nyāya_Sūtras"}], "pages": {"1884117": {"extract": "The Nyāya Sūtras is an ancient Indian Sanskrit text composed by Akṣapāda Gautama, and the foundational text of the Nyaya school of Hindu philosophy. The date when the text was composed, and the biography of its author is unknown, but variously estimated between 6th-century BCE and 2nd-century CE. The text may have been composed by more than one author, over a period of time. The text consists of five books, with two chapters in each book, with a cumulative total of 528 aphoristic sutras, about rules of reason, logic, epistemology and metaphysics.\nThe Nyāya Sūtras is a Hindu text, notable for focusing on knowledge and logic, and making no mention of Vedic rituals. The first book is structured as a general introduction and table of contents of sixteen categories of knowledge. Book two is about pramana (epistemology), book three is about prameya or the objects of knowledge, and the text discusses the nature of knowledge in remaining books. It set the foundation for Nyaya tradition of the empirical theory of validity and truth, opposing uncritical appeals to intuition or scriptural authority.\nThe Nyaya sutras cover a wide range of topics, including Tarka-Vidyā, the science of debate or Vāda-Vidyā, the science of discussion. The Nyāya Sutras are related to but extend the Vaiśeṣika epistemological and metaphysical system. Later commentaries expanded, expounded and discussed Nyaya sutras, the earlier surviving commentaries being by Vātsyāyana (c.450–500 CE), followed by the Nyāyavārttika of Uddyotakāra (c. 6th–7th century), Vācaspati Miśra's Tātparyatīkā (9th century), Udayana's Tātparyapariśuddhi (10th century), and Jayanta's Nyāyamañjarī (10th century).\n\n\n== Author and chronology ==\nThe Nyaya-sutras is attributed to Gautama, who was at least the principal author. According to Karl Potter, this name has been very common Indian name, and the author is also reverentially referred to as Gotama, Dirghatapas and Aksapada Gautama. Little is known about Gautama, or which century he lived in. Scholarly estimates, based on textual analysis, vary from the 6th century BCE, making him a contemporary of Buddha and Mahavira, to as late as the 2nd century CE. Some scholars favor the theory that the cryptic text Nyaya-sutras was expanded over time by multiple authors, with the earliest layer from about mid-first millennium BCE that was composed by Gautama. The earliest layer is likely to be Book 1 and 5 of the text, while Book 3 and 4 may have been added last, but this is not certain.\n\nOne may sum up the situation pretty safely by saying that we have not the vaguest idea who wrote the Nyayasutras or when he lived.\n\nIt is likely, states Jeaneane Fowler, that Nyaya and the science of reason stretch back into the Vedic era; it developed in the ancient Indian tradition that involved \"dialectical tournaments, in the halls of kings and schools of Vedic philosophers\", and Gautama was the one who distilled and systematized this pre-existing knowledge into sutras, or aphoristic compilations called nyayasutras.\nThe Nyaya school of Hinduism influenced all other schools of Hindu philosophy, as well as Buddhism. Despite their differences, these scholars studied with each other and debated ideas, with Tibetan records suggesting that Buddhist scholars spent years residing with Hindu Nyaya scholars to master the art of reasoning and logic. This cooperation has enabled scholars to place the currently surviving version of the Nyayasutras, to a terminus ante quem (completed before) date of about the 2nd century CE, because one of the most famous and established Buddhist scholars of that era, Nagarjuna, explicitly states, \"sutra 4.2.25 is addressed against the Madhyamika system\" of Buddhism. Other ancient Buddhist texts confirm that Nyayasutras existed before them, and the text is considered the primary text of old Nyaya school of Hinduism.\n\n\n== Structure ==\n\nThe text is written in sutra genre. A sutra is a Sanskrit word that means \"string, thread\", and represents a condensed manual of knowledge of a specific field or school. Each sutra is any short rule, like a theorem distilled into few words or syllables, around which \"teachings of ritual, philosophy, grammar or any field of knowledge\" can be woven. Sutras were compiled to be remembered, used as reference and to help teach and transmit ideas from one generation to the next.\nThe Nyayasutra is divided into five books, each book subdivided into two chapters each. The structure of the text is, states Potter, a layout of ahnikas or lessons served into daily portions, with portion consisting of a number of sutras or aphorisms. The architecture of the text is also split and collated into prakaranas or topics, which later commentators such as Vatsyayana and Vacaspati Misra utilized to compose their bhasya, ancient texts that have survived into the modern era. There are several surviving manuscripts of the Nyayasutras, with a slight difference in number of sutras, of which the Chowkhamba edition is often studied.\n\n\n== Content ==\nThe first sutra 1.1.1 of the text asserts its scope and the following sixteen categories of knowledge as a means to gain competence in any field of interest:\n\nPerfection is attained by the correct knowledge about true nature of sixteen categories: means of right knowledge (pramāṇa); object of right knowledge (prameya); doubt (samsaya); purpose (prayojana); familiar instance (dṛṣṭānta); established tenet (siddhānta); members of an inference (avayava); reasoning (tarka); ascertainment or results (nirṇaya); discussion (vāda); sophistic disputations (jalpa); cavil (vitaṇḍa); fallacies (hetvābhāsa); quibbles (chala); futile rejoinders (jāti); and methods of losing an argument (nigrahasthāna).\n\nThese sixteen categories cover many sections of the text. The verse 1.1.2 of the Nyāya Sūtra declares the text's goal is to study and describe the attainment of liberation of soul from wrong knowledge, faults and sorrow, through the application of above sixteen categories of perfecting knowledge.\n\n\n=== Means of attaining valid knowledge ===\nThe Nyaya-sutras assert the premise that \"all knowledge is not intrinsically valid\", that \"most knowledge is not valid unless proven\" and \"truth exists whether we human beings know it or not\". However, states Fowler, the text accepts the foundation that \"some knowledge is self evident\" and axiomatic in every field of knowledge, which can neither be proven nor needs proof, such as \"I am conscious\", \"I think\" and \"soul exists\". Furthermore, the text presents its thesis that knowledge is not self-revealing, man must make effort to gain knowledge and this is a systematic process that empowers one to learn correct knowledge, and abandon incorrect knowledge.\nThe Nyāya sutras asserts and then discusses four reliable means of obtaining knowledge (pramāṇa), viz., Perception, Inference, Comparison and Reliable Testimony.\n\n\n==== Pratyaksha: Perception ====\nThe Nyayasutras assert that perception is the primary proper means of gaining true knowledge. All other epistemic methods are directly or indirectly based on perception, according to the text, and anything that is claimed to be \"true knowledge\" must be confirmed or confirmable by perception. This it terms as the doctrine of convergence, and this doctrine includes direct or implied perception. Gautama defines perception as the knowledge that arises by the contact of one or more senses with an object or phenomenon. Gautama dedicates many sutras to discuss both the object and subject in the process of perception, and when senses may be unreliable. Erratic eyesight or other senses (Avyabhicara) can be a source of doubt or false knowledge, as can prejudgmental or prejudicial state of mind, states the Nyayasutras.\nThe text asserts Pratyaksa leads to Laukika or ordinary knowledge, where the five senses directly and clearly apprehend a reality, and this is true definite knowledge according to the text. It defines indefinite knowledge as one where there is doubt, and the text gives an example of seeing a distant stationary object in the evening and wondering whether it is a post or a man standing in the distance. In some of these cases, states Nyayasutras, correct knowledge is formulated by the principle of cumulative evidence. Manas (mind) is considered an internal sense, in the text, and it can either lead to correct or incorrect knowledge depending on how it includes, excludes or integrates information. These ideas are compiled, in later chapters of the text, into its treatise on Aprama (Theory on Errors).\n\n\n==== Anumana: Inference ====\n\nThe epistemic rationale for inference as a reliable source of knowledge, and Nyaya's theory has been a major contribution to the diverse schools of Hinduism, and other schools looked up to Nyaya scholars for insights on correct knowledge and incorrect knowledge through inference. The sections in Nyayasutras on inference blossomed into a treatise on syllogism over time.\nNyayasutras defines inference as the knowledge that follows or derives from other knowledge. It always follows perception, states the text, is a universal relation or essential principle. One form of inference is a Purvavat, or translates Fowler, \"from cause to effect or a priori\". Thus, if a path or road is wet or river is swollen, states the text, then \"it has rained\" is a valid knowledge. The sutras assert that the \"universal relationship\" between the two is necessary for correct reliable knowledge, that is \"if in all cases of A, B is true then one may correctly infer B whenever A is perceived\". Further, there is a causal relation between the two, whether one knows or not of that cause, but inferred knowledge does not require one to know the cause, for it to be valid knowledge, states Nyayasutra. The text states one must not confuse coexistence as universal relation, that while deduction and induction both are useful and valid means for gaining true knowledge, it lists rules when this method can lead to false knowledge.\n\n\n==== Upamana: Comparison and analogy ====\nThe word upamana, states Fowler, is a compound of upa (similarity) and mana (knowledge). It is a means of gaining knowledge based on \"similarity, comparison, analogy\", and considered reliable in Nyaya and many schools of Hinduism (but not in Vaisheshika and Charvaka, or Buddhism).\nThe Nyayasutras define upamana as the knowledge of a thing based on \"its likeness to another thing which is familiar\". It differs from Anumana (inference) in lacking a direct or immediate causal relation. It differs from Pratyaksha (perception), states the text, in using a linguistic referent and the foundation of pre-existing knowledge within the individual and what he learnt from his teachers, friends, family and past knowledge inherited from the wise, through a process of social cooperation. The Upamana method is secondary, it relies on perception, combined with linguistic referent and context. Comparison is not isolated pramana means, and sometimes works together with the Anumana and Sabda epistemic methods. Comparison is, in Nyayasutras, the process of permeating or infusing hypothesis, examples and tests, thus leading to objectivity and correct knowledge about something new and what one already presumes to know.\n\n\n==== Shabda: Testimony and reliable sources ====\nŚabda (Sanskrit: शब्द, Word), in Nyayasutras, means relying on word, testimony of a reliable source. Sabda-pramana has been an accepted and reliable method to knowledge by all orthodox schools of Hinduism including Nyaya, asserting that a human being needs to know numerous facts, and with the limited time and energy available, he can learn only a fraction of those facts and truths directly. He must rely on others, his parents, family, friends, teachers, ancestors and kindred members of society to rapidly acquire and share knowledge and thereby enrich each other's lives. This means of gaining correct knowledge is either spoken or written, but it is through Sabda (words). In addition to words, state the Nyayasutras, Shabda as a means of true knowledge depends on an agreed convention on what words mean, the structure of sentences, establishing context and their import. The source must be reliable and comprehensible, and the receiver of knowledge must be able to understand the knowledge therefrom.\nThe reliability of the source is important, and legitimate knowledge can only come from the Sabda of reliable sources. The schools of Hindu philosophy have debated if, how and when reliability of source can be objectively established. Gautama, in the Nyayasutras, offers a description for a reliable source. Some schools, such as Charvaka, state that this is never possible, and therefore Sabda in the Vedas or anyone else, can never be a proper pramana. Other schools debate means to establish reliability.\n\n\n=== Theory of proper Argument ===\nThe text, in sutras 1.1.32 and 1.1.39 presents its theory of proper Argument, stating that it must include five members:\nPratijna – the proposition or hypothesis (that which needs to be proved or decided)\nHetu – the reason (can be positive or negative)\nUdaharana – the example(s) (that which is independently confirmed or confirmable)\nUpanaya – the application (validity test, or example to the instance)\nNigamana – the conclusion (either hypothesis is true or false or in doubt)\nThe text defines and aphoristically discusses each of these.\n\n\n=== Theory of Doubt as incomplete knowledge ===\nThe Nyayasutras define and discuss Samsaya (Sanskrit: संशय, doubt) in sutras 1.1.23, 2.1.1 to 2.1.7, 3.2.1, 4.2.4 among others. This discussion is similar to those found in other schools of Hindu philosophy, expands on the theory of doubt presented by Kanada in the Vaisheshika school, but disagrees with the Charvaka school's theory of doubt and consequent \"there is no empirical knowledge ever\".\nThe theory of doubt, according to the Nyayasutras, starts with the premise that doubt is part of human learning process, occurs when conflicting possibilities exist with regard to cognized object. Doubt is neither error nor absence of knowledge, but a form of uncertainty and human struggle with probability when it faces incomplete or inconsistent information. It is a knowledge that is possibly partially valid and partially invalid, but doubt is a form of knowledge that has positive value. Doubt is an invitation to \"proceed to further investigation\", asserts the text. All four means of knowledge (perception, inference, comparison and testimony) discovery may be useful in this investigation, but doubt is both a psychological state and a means to knowledge, not in itself a valid knowledge state the sutras.\n\n\n=== Hetvabhasa, theory of errors ===\nThe Nyayasutra defines error as the knowledge, opinion or conclusion about something that is different than what it really is. Gautama states in the text that the error is always in the process of cognition itself, or the \"subjective self\", and not in the object. It is the duty of the knowledge seeker to \"test the validity of his knowledge\", both in assumptions or through practice (experience), but neither the object of knowledge nor the knowledge itself is responsible for errors, only the knowledge seeker and his process of cognition is. The Nyaya theory shares ideas found in the theory of errors found in Advaita Vedanta, Buddhism and Mimamsa schools of Indian philosophies, states Rao, and these schools likely influenced each other.\nThe text identifies and cautions against five kinds of fallacious reasoning (hetvabhasa) in sutra 1.2.4, discussing each in the sutras that follow, stating that these lead to false knowledge, in contrast to proper reasoning (hetu) which leads to true knowledge. The five fallacies or errors, according to Nyayasutras, are to be avoided, in addition to watching for debating tricks (chala) used by those whose aim isn't true knowledge. The five forms of bogus reason identified by the text, states Ganeri, are:\nthe wandering or erratic (Nyayasutra 1.2.5)\nthe contradictory (Nyayasutra 1.2.6)\nthe unproven (Nyayasutra 1.2.8)\nthe counterbalanced (Nyayasutra 1.2.7)\nthe untimely (overgeneralization across time, or sublated, Nyayasutra 1.2.9)\n\n\n=== Theory of causality ===\nThe Nyayasutras dedicate many sections on causality and casual relations (Karana, Sanskrit: कारण), particularly Book 4. Causes, in Nyaya view states Fowler, are \"antecedents of their effects invariably and unconditionally\". A specific effect is produced by a specific cause (plurality in causes accepted), and in Nyayasutras view a specific cause produces a specific effect and no other (plurality in effect, or contradictory effect is not accepted). The sutras assert that there cannot be reciprocity to a cause, either we misunderstand the cause or misapprehend the effect. The text rejects remote or supernatural causes, and rejects that qualities are causes. The text asserts that causes are immediately antecedent, causes exist before an effect in time, and to know something is to understand the effect and the specific cause(s).\nThe text identifies three types of causes – inherent or material cause (Samavayi-karana), non-inherent cause (Asamavayi-karana), and efficient cause (Nimitta-karana). These, it states, arise from Dravya (substance), Guna (quality) and Karma (action).\n\n\n=== Theory of negatives ===\nThe text seeds the theory of negative entities, where both being and non-being, presence and absence of something is considered correct and useful knowledge. Absence of book on a table or absence of particular color in a painting has a place in its epistemic process, in addition to positively verifiable characteristics of the table or a painting.\n\n\n=== Atheism in Nyayasutras ===\nEarly Nyaya school scholars considered the hypothesis of Ishvara as a creator God with the power to grant blessings, boons and fruits. However, the Nyayasutras and early Nyaya scholars rejected this hypothesis, and were non-theistic or atheists.\nIn Nyayasutra's Book 4, Chapter 1 examines what causes production and destruction of entities (life, matter) in universe. It considers many hypotheses, including Ishvara. Verses 19–21, postulates Ishvara exists and is the cause, states a consequence of postulate, then presents contrary evidence, and from contradiction concludes that the postulate must be invalid.\n\nLater scholars of Nyaya school reconsidered this question and offered counter arguments for what is God (Ishvara) and various arguments to prove the existence of Ishvara. The 5th century CE Nyaya school scholar Prastapada, for example, revisited the premise of God. He was followed by Udayana, who in his text Nyayakusumanjali, interpreted \"it\" in verse 4.1.21 of Nyaya Sutra above, as \"human action\" and \"him\" as \"Ishvara\", then he developed counter arguments to prove the existence of Ishvara, a reasoning that fueled the debate and disagreements on God in Neo-Nyaya and other Hindu traditions of 2nd millennium CE.\n\n\n=== Soul, self exists, inner freedom ===\n\nA large part of the third book of the Nyayasutras is dedicated to the premise and the nature of a Self (soul, atman) and its relation to knowledge, liberation from sorrow and inner freedom (moksha).\n\n\n=== Philosophy: a form of Yoga ===\nThe sutras 4.2.42 to 4.2.48 of Nyayasutras, states Stephen Phillips, state that \"philosophy is a form of yoga\".\nThe text recommends yogic meditation in quite places such as a forest, cave or sandy beach in sutra 4.2.42, that the knowledge seeker should purify one's soul by Yamas, Niyamas and spiritualism of yoga in sutra 4.2.46. Meditation is a treasured and recommended practice in the text, and extensively discussed by Nyaya scholars that followed Aksyapada Gautama. Vatsyayana wrote in his commentary on Nyayasutras, for example, that meditation is that which enables the mind to contact one's soul, which is accompanied by a conscious eagerness to get at the truth, and such meditation is an essential practice to gain true knowledge.\nThe Nyayasutras state that one must study the means of correct knowledge and hold discussions with the learned, sincere and unenvious fellow seekers of knowledge state sutras 4.2.47 and 4.2.48. One must, translates Phillips, take into account \"consideration of personal character as well as the nature of beliefs held by the opponent\", in deciding the nature of one's discussions, according to Nyayasutras. In some cases, asserts the text, it is better to avoid arguing with hostile opponents and use methods of knowledge like \"a fence is used to safeguard the growth of seeds\".\n\n\n== Commentaries ==\nThe earliest surviving complete bhasya (review and commentary) on Nyaya Sutras is by Vatsyayana. This commentary itself inspired many secondary and tertiary bhasya. Vatsyayana's commentary has been variously dated to be from the 5th century CE, or much earlier around 2nd century BCE. Another often studied surviving commentary on the text is credited to Vacaspati Mishra from about 9th century CE.\n\nOther historical Indian commentaries and works inspired by Nyayasutras and which have survived into the modern era, include Nyaya-varttika by 6th-century Uddyotakara, Nyaya-bhasyatika by 6th-century Bhavivikta, another Nyaya-bhasyatika by 7th-century Aviddhakarna, Nyaya-bhusana by 9th-century Bhasarvajana, Nyaya-manjari by 9th-century Kashmir scholar Jayanta Bhatta, Nyaya-prakirnaka by 10th-century Karnata scholar Trilocana, and Nyaya-kandali by 10th-century Bengal scholar Sridhara.\nNumerous other commentaries are referenced in other Indian historical texts, but these manuscripts are either lost or yet to be found. Starting around 11th- to 12-th century CE, Udayana wrote a primary work, that built upon and expanded the theories on reason found in Nyayasutras. Udayana's work created the foundation for Navya-Nyaya (new Nyaya) school. The Hindu scholar Gangesa of 13th- or 14th-century, integrated the Gautama's Nyayasutras and Udayana's Navya-Nyaya work, to create the influential Tattvacintamani text considered a masterpiece by scholars.\n\n\n== Influence ==\n\n\n=== On Hinduism's soul, Buddhism's no-soul debate ===\nThe Nyaya-sutras have been one of the foundations for the historic debate between Hinduism's premise that ultimate reality and atman (soul) exists, and Buddhism's premise that there is voidness and anatta (no-soul). In Nyaya-sutra, the Buddhist premises and arguments to refute those premise are found in many chapters, such as sutras of chapters 3.2, 4.1 and 4.2. The text has been influential in this debate, with the 2nd century Buddhist scholar Nagarjuna states that the Nyaya school and Buddhism differ on their conception of Self (Atman) and their views on the Vedas, and the sutra 4.2.25 of Nyayasutra is addressed against the Madhyamika system of Buddhism.\nNagarjuna's Madhyamika-karika targets Nyaya-sutra, among other Hindu texts, for his critique and in order to establish his doctrine of no self and voidness. In this text, and Vigrahavya-vartani, he presents his proof of voidness by challenging the Pramanas at the foundation of Nyaya-sutras. In his work Pramana-vihetana, Nagarjuna, takes up each of the sixteen categories of knowledge in Gautama's Nyaya-sutras at the foundation of Nyaya's discussion of \"soul exists and the nature of soul in liberation process\", and critiques them using the argument that these categories are relational and therefore unreal. The Nagarjuna's texts, along with Gautama's Nyaya-sutras states Sanjit Sadhukhan, influenced Vatsyayana's work who called Nagarjuna's doctrine of voidness as flawed, and presented his arguments refuting Nagarjuna's theory on \"objects of knowledge are unreal, like a dream or a form of jugglery and a mirage\", but by first presenting his demonstration that the theory of reason and knowledge in the Nyaya-sutras are valid.\nThe Buddhist thesis that all things are negative in nature (inasmuch as a thing's nature is constituted by its differences from others) is rejected, as is the view that all things are eternal or that all things are noneternal. Both these latter views are untrue to experience.\n\n\n=== On Vedanta traditions ===\nThe Nyayasutras were influential to the Vedanta schools of Hindu philosophy, and provided the epistemological foundations. The terms Nyaya and Mimamsa were synonymous, states Hajime Nakamura, in the earliest Dharmasutras of 1st millennium BCE. Over time, Nyaya, Mimamsa and Vedanta became three distinct and related schools.\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Translations ===\nNandalal Sinha, Mahamahopadhyaya Satisa Chandra Vidyabhusana, The Nyaya Sutras of Gotama, The sacred books of the Hindus, 1930; Motilal Banarsidass, 1990 reprint, ISBN 978-81-208-0748-8; Munshiram Manoharlal reprint, 2003, ISBN 978-81-215-1096-7.\nGanganatha Jha, Nyaya- Sutras of Gautama (4 vols.), Motilal Banarsidass, 1999 reprint, ISBN 978-81-208-1264-2.\n\n\n== Further reading ==\nJ Ganeri (2001), Indian Logic: A Reader, Routledge, ISBN 978-0700713066\nSue Hamilton, Indian Philosophy: A Very Short Introduction (Oxford University Press, 2001) ISBN 0-19-285374-0\nB.K. Matilal, Epistemology, Logic, and Grammar in Indian Philosophical Analysis (Oxford University Press, 2005) ISBN 0-19-566658-5\nJ.N. Mohanty, Classical Indian Philosophy (Rowman & Littlefield, 2000) ISBN 0-8476-8933-6\n\n\n== External links ==\nThe Nyâya Sutras of Gotama, SC Vidyabhushana (1913), English Translation\nGautama's Nyayasutra without any commentary, GRETIL version of Sanskrit text, University of Goettingen, Germany\nGautama's Nyayasutra with Vacaspatimisra's commentary Nyayavarttikatatparyatika, GRETIL version of Sanskrit text, University of Goettingen, Germany\nGautama: Nyayasutra with Vatsyayana's commentary Nyayabhasya, GRETIL version of Sanskrit text, University of Goettingen, Germany", "ns": 0, "pageid": 1884117, "title": "Nyāya Sūtras"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}