{"batchcomplete": "", "query": {"normalized": [{"to": "Octave Mirbeau", "from": "Octave_Mirbeau"}], "pages": {"153994": {"extract": "Octave Mirbeau (16 February 1848 – 16 February 1917) was a French journalist, art critic, travel writer, pamphleteer, novelist, and playwright, who achieved celebrity in Europe and great success among the public, while still appealing to the literary and artistic avant-garde. His work has been translated into thirty languages.\n\n\n== Biography ==\n\n\n=== Aesthetic and political struggles ===\n\nMirbeau spent his childhood in a village in Normandy, Rémalard, pursuing secondary studies at a Jesuit college in Vannes, which expelled him at the age of fifteen. Two years after the traumatic experience of the 1870 war, he was tempted by a call from the Bonapartist leader Dugué de la Fauconnerie, who hired him as private secretary and introduced him to L'Ordre de Paris.\nAfter his debut in journalism in the service of the Bonapartists, and his debut in literature when he worked as a ghostwriter, Mirbeau began to publish under his own name. Thereafter, he wrote in order to express his own ethical principles and aesthetic values. A supporter of the anarchist cause (cf. La Grève des électeurs) and fervent supporter of Alfred Dreyfus, Mirbeau embodied the intellectual who involved himself in civic issues. Independent of all parties, Mirbeau believed that one's primary duty was to remain lucid.\nAs an art critic, he campaigned on behalf of the “great gods nearest to his heart”: he sang the praises of Auguste Rodin, Claude Monet, Camille Pissarro, Paul Cézanne, Paul Gauguin, Auguste Renoir, Félix Vallotton, and Pierre Bonnard, and was an early advocate of Vincent van Gogh, Camille Claudel, Aristide Maillol, and Maurice Utrillo (cf. his Combats esthétiques, 1993).\nAs a literary critic and early member of Académie Goncourt, he 'discovered' Maurice Maeterlinck and Marguerite Audoux and admired Remy de Gourmont, Marcel Schwob, Léon Bloy, Georges Rodenbach, Alfred Jarry, Charles-Louis Philippe, Émile Guillaumin, Valery Larbaud and Léon Werth (cf. his Combats littéraires, 2006).\n\n\n=== Mirbeau's novels ===\n\n\n==== Autobiographical novels ====\n\nAfter authoring ten ghostwritten novels, he made his own literary debut with Le Calvaire (Calvary, 1886), in which writing allowed him to overcome the traumatic effects of his devastating liaison with the ill-reputed Judith Vinmer, renamed Juliette Roux in the novel.\nIn 1888, Mirbeau published L'Abbé Jules (Abbé Jules), the first pre-Freudian novel written under the influence of Dostoyevsky to appear in French literature; the text featured two main characters: l'abbé Jules and Father Pamphile. In Sébastien Roch (1890) (English translation: Sébastien Roch, 2000), Mirbeau purged the traumatic effects of his experience as a student at a Jesuits school in Vannes. In the novel, the 13-year-old Sébastien is sexually abused by a priest at the school and the abuse destroys his life.\n\n\n==== Crisis of the novel ====\n\nMirbeau then underwent a grave existential and literary crisis, yet during this time, he still published in serial form a pre-existentialist novel about the artist’s fate, Dans le ciel (In the Sky), introducing the figure of a painter (Lucien), directly modeled on Van Gogh. In the aftermath of the Dreyfus Affair — which exacerbated Mirbeau's pessimism — he published two novels judged to be scandalous by self-styled paragons of virtue: Le Jardin des supplices (Torture Garden (1899) and Le Journal d'une femme de chambre (Diary of a Chambermaid) (1900), then Les Vingt et un Jours d'un neurasthénique (The twenty one days of a neurasthenic person) (1901). In these works, Mirbeau unsettled traditional novelistic conventions, practicing the technique of collage, transgressing the code of verisimilitude and fictional credibility, and defying the hypocritical rules of propriety.\n\n\n==== Death of the novel ====\nIn his last two novels, La 628-E8 (1907) – including La Mort de Balzac – and Dingo (1913), he strayed ever further from realism, giving free rein to fantasy elements and casting his cat and his own dog as heroes. These last Mirbeau stories show a complete break with the conventions of realist fiction.\n\n\n=== Mirbeau's theatre ===\nIn the theatre, Mirbeau made his first steps with a proletarian drama and modern tragedy, Les Mauvais bergers (The Bad Shepherds, 1897). Then he experienced worldwide acclaim with Les affaires sont les affaires (Business is business, 1903) — his classical comedy of manners and characters in the tradition of Molière. Here Mirbeau featured the character of Isidore Lechat, predecessor of the modern master of business intrigue, a product of the new world, a figure who makes money from everything and spreads his tentacles out over the world.\nIn 1908 — at the end of a long legal and media battle — Mirbeau saw his play Le Foyer (Home) performed by the Comédie-Française. In this work, he broached a new taboo subject, the economic and sexual exploitation of adolescents in a home that pretended to be a charitable one.\n\nHe also wrote six one act plays, published under the title of Farces et moralités (1904), among them being L'Épidémie (Epidemics, 1898). Here, Mirbeau can be seen as anticipating the theatre of Bertolt Brecht, Marcel Aymé, Harold Pinter, and Eugène Ionesco. He calls language itself into question, demystifying law, ridiculing the discourse of politicians, and making fun of the language of love (Les Amants, The Lovers, 1901).\n\n\n=== Posthumous fame ===\nMirbeau has never been forgotten, and there has been no interruption in the publication of his works. Yet his immense literary production has largely been known through only three works, and he was considered as literarily and politically incorrect.\nBut, more recently, Mirbeau has been rediscovered and presented in a new light. A fuller appreciation of the role he played in the political, literary, and artistic world of la Belle Époque is emerging.\nMirbeau lies buried in the Passy Cemetery, in the 16th arrondissement of Paris.\n\n\n== References ==\n\n\n== Works ==\n\n\n=== Novels ===\nLe Calvaire (1886) (Calvary, New York, 1922).\nL'Abbé Jules (1888) (Abbé Jules, Sawtry, Dedalus, 1996).\nSébastien Roch (1890) (Sébastien Roch, Sawtry, Dedalus, 2000).\nDans le ciel (1893–1989) (In the sky, translation to be published).\nLe Jardin des supplices (1899) (Torture Garden, New York, 1931; The Garden of Tortures, London, 1938) .\nLe Journal d'une femme de chambre (1900) (A Chambermaid's diary, New York, 1900 ; The Diary of a Lady's Maid, London, 1903 ; Célestine, being the diary of a chambermaid, New York, 1930 ; Diary of a chambermaid, New York, 1945).\nLes Vingt et un Jours d'un neurasthénique (1901).\nDingo (novel) (1913).\nUn gentilhomme (1919).\nLes Mémoires de mon ami (1920).\nŒuvre romanesque, 3 volumes, Buchet/Chastel – Société Octave Mirbeau, 2000–2001, 4 000 pages. Website of Éditions du Boucher, 2003-2004.\n\n\n=== Théâtre ===\nLes Mauvais bergers (The Bad Shepherds) (1897).\nLes affaires sont les affaires (1903) (Business is business, New York, 1904).\nFarces et moralités, six morality plays (1904) (Scruples, New York, 1923 ; The Epidemic, Bloomington, 1949 ; The Lovers, translation coming soon).\nLe Foyer (1908) (Charity).\nDialogues tristes, Eurédit, 2005.\n\n\n=== Short stories ===\nDans l'antichambre (Histoire d'une Minute) (1905).\nLa Mort de Balzac (1989).\nContes cruels, 2 volumes (1990 and 2000).\nContes drôles (1995).\nMémoire pour un avocat (2007).\n\n\n=== Art chronicles ===\nCombats esthétiques, 2 volumes (1993).\nPremières chroniques esthétiques (1995).\nCombats littéraires (2006).\n\n\n=== Travelogues ===\nLa 628-E8 (1907) (Sketches of a journey, London, 1989).\n\n\n=== Political and social chronicles ===\nLa Grève des électeurs (1888-1902) (Voters strike).\nCombats politiques (1990).\nL'Affaire Dreyfus (1991).\nLettres de l'Inde (1991).\nL'Amour de la femme vénale (1994).\nChroniques du Diable (1995).\nInterpellations (2011).\n\n\n=== Correspondence ===\nLettres à Alfred Bansard des Bois (1989)\nCorrespondance avec Rodin (1988), avec Monet (1990), avec Pissarro (1990), avec Jean Grave (1994), avec Jules Huret (2009).\nCorrespondance générale, 3 volumes already published (2003-2005-2009).\n\n\n== Bibliography ==\nReginald Carr, Anarchism in France - The Case Octave Mirbeau, Manchester, 1977.\nPierre Michel and Jean-François Nivet, Octave Mirbeau, l'imprécateur au cœur fidèle, Séguier, 1990, 1020 pages.\nPierre Michel, Les Combats d'Octave Mirbeau, Annales littéraires de l'université de Besançon, 1995, 386 pages.\nChristopher Lloyd, Mirbeau's fictions, Durham, 1996.\nEnda McCaffrey, Octave Mirbeau’s literary intellectual evolution as a french writer (1880-1914), Edwin Mellen Press, 2000, 246 pages.\nPierre Michel, Lucidité, désespoir et écriture, Presses de l'Université d'Angers (2001).\nSamuel Lair, Mirbeau et le mythe de la nature, Presses universitaires de Rennes, 2004, 361 pages.\nPierre Michel Octave Mirbeau et le roman, Société Octave Mirbeau, 2005, 276 pages.\nPierre Michel Bibliographie d'Octave Mirbeau, Société Octave Mirbeau, 2009, 713 pages.\nPierre Michel Albert Camus et Octave Mirbeau, Société Octave Mirbeau, Angers, 2005, 68 pages.\nPierre Michel Jean-Paul Sartre et Octave Mirbeau, Société Octave Mirbeau, Angers, 2005, 67 pages.\nPierre Michel, Octave Mirbeau, Henri Barbusse et l'enfer, 51 pages.\nRobert Ziegler, The Nothing Machine : The Fiction of Octave Mirbeau, Rodopi, Amsterdam – Kenilworth, September 2007.\nSamuel Lair, Octave Mirbeau l'iconoclaste, L'Harmattan, 2008.\nYannick Lemarié - Pierre Michel, Dictionnaire Octave Mirbeau, L'Age d'Homme, 2011, 1200 p.\nAnita Staron, L'Art romanesque d'Octave Mirbeau - Thèmes et techniques, Wydawnictwo Uniwersytetu Lodzkiego, 2014, 298 p.\nCahiers Octave Mirbeau, n° 1 to n° 21, 1994–2014, 7 700 pages.\n\n\n== External links ==\nWorks by Octave Mirbeau at Project Gutenberg\nWorks by or about Octave Mirbeau at Internet Archive\n(French) Website of Société Octave Mirbeau. More than 800 essays about Mirbeau, in twenty-three different languages.\n(French) Other website of Société Octave Mirbeau.\n(French) Dictionnaire Octave Mirbeau.\n(French) Université McGill: le roman selon les romanciers Inventory and analysis of Octave Mirbeau non-novelistic writings\n(French) Pierre Michel's blog... and Octave Mirbeau's.\n(French) Website of Éditions du Boucher, Fifteen of Mirbeau's novels\n(French) Pierre Michel’s website. 10 books about Mirbeau are in line, and more than 300 essays.\n(French) Website of Fonds Mirbeau, in Angers University Library.\nOctave Mirbeau, \"lover of Justice\".\nMirbeau, Octave, The love of a venal woman.\nTranslation and commentary of the rat torture scene in Le Jardin des supplices by Octave Mirbeau.\nMirbeau's page on anarchist website.\nLibcom.org/history: Octave Mirbeau political biography, focusing on his anarchism.\nPhotographs of Mirbeau's grave at Findagrave", "ns": 0, "pageid": 153994, "title": "Octave Mirbeau"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}