{"batchcomplete": "", "query": {"normalized": [{"to": "Onora O'Neill", "from": "Onora_O'Neill"}], "pages": {"470897": {"extract": "Onora Sylvia O'Neill, Baroness O'Neill of Bengarve CH CBE FRS FBA FMedSci (born 23 August 1941) is a philosopher and a crossbench member of the House of Lords.\nThe daughter of Sir Con Douglas Walter O'Neill, she was educated partly in Germany and at St Paul's Girls' School, London before studying philosophy, psychology and physiology at Oxford University. She went on to complete a doctorate at Harvard University, with John Rawls as supervisor. During the 1970s she taught at Barnard College, the women's college in Columbia University, New York City. In 1977 she returned to Britain and took up a post at the University of Essex; she was Professor of Philosophy there when she became Principal of Newnham College, Cambridge in 1992.\nShe is an Emeritus Professor of Philosophy at the University of Cambridge, a former President of the British Academy 1988–1989 and chaired the Nuffield Foundation 1998–2010. In 2003, she was the founding President of the British Philosophical Association (BPA). In 2013 she held the Spinoza Chair of Philosophy at the University of Amsterdam. Until October 2006, she was the Principal of Newnham College, Cambridge, and she was chair the Equality and Human Rights Commission until April 2016.\n\n\n== Philosophy ==\nO'Neill has written widely on political philosophy and ethics, international justice, bioethics and the philosophy of Immanuel Kant.\nAcross various works, O'Neill has defended and applied a constructivist interpretation of Kantian ethics heavily influenced by, and critical of, the work of John Rawls, emphasising the importance of trust, consent and respect for autonomy in a just society. She has written extensively about trust, noting \"that people often choose to rely on the very people whom they claimed not to trust\" and suggesting that we \"need to free professionals and the public service to serve the public...to work towards more intelligent forms of accountability...[and] to rethink a media culture in which spreading suspicion has become a routine activity\".\n\n\n== Honours and distinctions ==\nO'Neill has been President of the Aristotelian Society (1988 to 1989), a member of the Animal Procedures Committee (1990 to 1994), chair of Nuffield Council on Bioethics (1996 to 1998), a member and then acting chair of the Human Genetics Advisory Commission (1996 to 1999) and a member of the select committee on BBC Charter Review. She is presently chair of the Nuffield Foundation (since 1997), a trustee of Sense About Science (since 2002), a trustee of the Ditchley Foundation, and a trustee of the Gates Cambridge Trust. She also served as President of the British Academy between 2005 and 2009. She is on the Advisory Board of Incentives for Global Health, the NGO formed to develop the Health Impact Fund proposal.\nIn 1999, she was created a life peer as Baroness O'Neill of Bengarve, of The Braid in the County of Antrim, and in 2007 was elected an Honorary FRS. She is also a Foreign Honorary Member of the American Academy of Arts and Sciences (1993) and the Austrian Academy of Sciences (2002), a Foreign Member of the American Philosophical Society (2003), and Hon. Member Royal Irish Academy (2003), a Foreign Member of the Leopoldina (2004) and the Norwegian Academy of Sciences (2006) and a Fellow of the Academy of Medical Sciences. She is an elected fellow of the Hastings Center, an independent bioethics research institution. In 2004 she was awarded an Honorary Degree (Doctor of Letters) from the University of Bath. She is a Distinguished Senior Fellow of the School of Advanced Study, University of London, an honour awarded in 2009.\nO'Neill also received an Honorary Doctorate from Heriot-Watt University in 2007 \nIn October 2012, she was nominated as the next Chair of the Equality and Human Rights Commission, and confirmed as such in January 2013.\nO'Neill was appointed a Member of the Order of the Companions of Honour (CH) in the 2014 New Year Honours for services to philosophy and public policy.\nIn 2014 O'Neill was elected to the German order Pour le mérite für Wissenschaften und Künste.\nIn February 2016 she was awarded the Knight Commander’s Cross of the Order of Merit of the Federal Republic of Germany for her outstanding contribution to moral and ethical questions of trust, accountability in civic life, justice and virtue.\nCurrently, she is the president of the Society for Applied Philosophy, a society founded in 1982 with the aim of promoting philosophical study and research that has a direct bearing on areas of practical concern.\n\n\n== Bibliography ==\n\n\n=== Books ===\nO'Neill, Onora (1975). Acting on principle : an essay on Kantian ethics. New York: Columbia University Press. \nBetween Consenting Adults (1985)\nFaces of Hunger: An Essay on Poverty, Development and Justice (1986)\nConstructions of Reason: Exploration of Kant's Practical Philosophy (1989)\nTowards Justice and Virtue (1996)\nBounds of Justice (2000)\nAutonomy and Trust in Bioethics (2002) (The 2001 Gifford Lectures)\nA Question of Trust: The BBC Reith Lectures 2002 (Cambridge University Press, 2002)\nRethinking Informed Consent in Bioethics (2007) (with Neil Manson)\n\n\n=== Essays ===\nO'Neill, Onora (Summer 1985). \"Between consenting adults\". Philosophy & Public Affairs. Wiley. 14 (3): 252–277. JSTOR 2265350. \nO'Neill, Onora (June 1998). \"Kant on duties regarding nonrational nature\". Proceedings of the Aristotelian Society, Supplementary Volumes. Wiley. 72 (1): 211–228. doi:10.1111/1467-8349.00043. JSTOR 4107017. \nO'Neill, Onora (December 2003). \"Constructivism vs. contractualism\". Ratio. Wiley. 16 (4): 319–331. doi:10.1046/j.1467-9329.2003.00226.x. \n\nSee also: Scanlon, T.M. (December 2003). \"Replies\". Ratio. Wiley. 16 (4): 424–439. doi:10.1046/j.1467-9329.2003.00231.x. \n\nO'Neill, Onora (March–April 2013). \"Interpreting the world, changing the world\". Philosophy Now. 95: 8–9. \n\n\n== Notes and references ==\n\n\n== See also ==\nList of Northern Ireland Members of the House of Lords\n\n\n== External links ==\n\"On the Side of the Angels\" Video of Onora O'Neill debating Ken Livingstone and Peter Lilley at HowTheLightGetsIn Festival, 2 June 2013\nWhat Should Press Regulation Regulate? Podcast of Baroness O'Neill speaking at a conference by the Foundation for Law, Justice & Society, Oxford, 2012\nMedia Freedoms and Media Standards, Centre for Ethics & Law Annual Lecture, University College London, 28 November 2012 Pdf.\nReith Lectures 2002 on A Question of Trust by O'Neill\nAnnouncement of her introduction at the House of Lords House of Lords minutes of proceedings, 3 March 1999\nList of O'Neill's published books and papers in academic journals", "ns": 0, "pageid": 470897, "title": "Onora O'Neill"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}