{"batchcomplete": "", "query": {"normalized": [{"to": "Partha Dasgupta", "from": "Partha_Dasgupta"}], "pages": {"2075439": {"extract": "Sir Partha Sarathi Dasgupta, FRS, FBA (born 17 November 1942), is the Frank Ramsey Professor Emeritus of Economics at the University of Cambridge, United Kingdom; Fellow of St John's College, Cambridge, and Visiting Professor at the New College of the Humanities, London. He was born in Dhaka, present-day Bangladesh, then moved to present-day India, and is the son of the noted economist Amiya Kumar Dasgupta. He is married to Carol Dasgupta, who is a psychotherapist. His father-in-law was the Nobel Laureate James Meade. Partha and Carol Dasgupta have three children, Zubeida Dasgupta-Clark (an educational psychologist), Shamik (a philosophy professor at Berkeley) and Aisha (who works on reproductive health in poor countries).\n\n\n== Education ==\nDasgupta was educated in Rajghat Besant School in Varanasi, India, obtaining his Matriculation Degree in 1958, and pursued undergraduate studies in Physics at the Hans Raj College, India, graduating in 1962 and in Mathematics at Trinity College Cambridge, graduating in 1965. He obtained a PhD in Economics at Cambridge in 1968 with thesis titled Population, growth and non-transferable capital (investigations in the theory of optimum economic growth). His PhD supervisor was Sir James Mirrlees. At Cambridge he was a member of the Cambridge Apostles, a distinguished intellectual society.\n\n\n== Career ==\n\n\n=== Research ===\nResearch interests have covered welfare and development economics; the economics of technological change; population, environmental, and resource economics; social capital; the theory of games; the economics of global warming, and the economics of malnutrition.\n\n\n=== Appointments ===\nDasgupta taught at the London School of Economics (Lecturer 1971–1975; Reader 1975–1978; Professor 1978–1985) and moved to the University of Cambridge in January 1985 as Professor of Economics (and Professorial Fellow of St John's College), where he served as Chairman of the Faculty of Economics in 1997–2001. During 1989–92 he was on leave from the University of Cambridge and served as Professor of Economics, Professor of Philosophy, and Director of the Program in Ethics in Society at Stanford University. In October 1991 he returned to Cambridge, on leave from Stanford University, to re-assume his Chair at Cambridge. He resigned from Stanford in 1992 and has remained in Cambridge since then.\nAcademic Activities\nDuring 1991–97 Dasgupta was Chairman of the (Scientific Advisory) Board of the Beijer International Institute of Ecological Economics of the Royal Swedish Academy of Sciences, Stockholm. During 1999–2009 he served as a Founder Member of the Management and Advisory Committee of the South Asian Network for Development and Environmental Economics (SANDEE), based in Kathmandu. In 1996 he helped to establish the journal Environment and Development Economics,[1] published by Cambridge University Press, whose purpose has been not only to publish original research at the interface of poverty and the environmental-resource base, but also to provide an opportunity to scholars in poor countries to publish their findings in an international journal.\nDuring 2008-2013 he was a Professorial Research Fellow at the University of Manchester's Sustainable Consumption Institute (SCI). He was also an Andrew D. White Professor-at-Large (2007–2013) at Cornell University and was (2010–2011) President of the European Association of Environmental and Resource Economists (EAERE)European Association of Environmental and Resource Economists (EAERE). He is a patron of population concern charity Population Matters (formerly the Optimum Population Trust) (2008–). During 2011-2014 he was Chairman of the Scientific Advisory Board of the International Human Dimensions Programme (IHDP) on Global Environmental Change, Bonn. Since 2011 he has been Chairman of the Advisory Board of the Wittgenstein Centre, Vienna. He served as Chairman of the Central Government Expert Group on Green National Accounting for India which submitted its Report in 2013. He is a cofounder of the Centre for the Study of Existential Risk at the University of Cambridge.\n\n\n== Honours ==\nDasgupta has been honoured by elections as: Fellow of the Econometric Society (1975); Fellow of the British Academy (1989); Fellow of the Royal Society (2004); Fellow of the Society for the Advancement of Economic Theory, 2013; Member of the Pontifical Academy of Social Sciences (1997); Fellow of The World Academy of Sciences (formally the Academy of Science for the Developing World), 2001; Member of Academia Europaea (2009); Foreign Member of the Royal Swedish Academy of Sciences (1991); Foreign Honorary Member of the American Academy of Arts and Sciences (1991); Foreign Associate of the US National Academy of Sciences (2001); Foreign Member of the American Philosophical Society (2005); Foreign Member of Istituto Veneto di Scienze, Lettere ed Arti (2009); Honorary Fellow of the London School of Economics (1995); Honorary Fellow of Trinity College, Cambridge (2010); Honorary Member of the American Economic Association (1997); Distinguished Fellow, CES, University of Munich, 2011; and President of the Royal Economic Society (1998–2001), the European Economic Association (1999), Section F (Economics) of the BA (British Association for the Advancement of Science) Festival of Science (2006), and the European Association of Environmental and Resource Economists (2010–2011).\nPrizes and Awards\nDasgupta was named Knight Bachelor by Her Majesty Queen Elizabeth II in 2002 in her Birthday Honours List for services to economics; was co-recipient (with Karl Goran Maler) of the 2002 Volvo Environment Prize; co-recipient (with Geoffrey Heal) of the Association of Environmental and Resource Economists' \"Publication of Enduring Quality Award 2003\" for their book, Economic Theory and Exhaustible Resources; recipient of the PEN/John Kenneth Galbraith Award, 2007, of the American Agricultural Economics Association; recipient of the Zayed International Environment Prize (II: scientific and technological achievements) in 2010; and recipient of the European Lifetime Achievement Award (in Environmental and Resource Economics) from the European Association of Environmental and Resource Economists, 2014. In 2007, together with Erik Maskin he was awarded the Erik Kempe Award in Environmental and Resource Economics, a joint prize of the Kempe Foundation and the European Association of Environmental and Resource Economists (EAERE). He was awarded the 2015 Blue Planet Prize for Environmental Research, and the 2016 Tyler Prize.\nHe was awarded a Doctorate (Honoris Causa) by Wageningen University, 2000; Catholic University of Louvain, 2007; Faculte Université Saint-Louis, 2009; University of Bologna, 2010; Tilburg University, 2012; and Harvard University, 2013.\n\n\n== Selected publications ==\n\"Guidelines for Project Evaluation\" (with S.A. Marglin and A.K. Sen), United Nations, 1972.\n\"Economic Theory and Exhaustible Resources\" (with G.M. Heal), Cambridge University Press, 1979.\n\"Utilitarianism, information and rights\" in Sen, Amartya; Williams, Bernard, eds. (1982). Utilitarianism and beyond. Cambridge: Cambridge University Press. pp. 199–218. ISBN 9780511611964. \nThe Control of Resources, Harvard University Press, 1982.\nAn Inquiry into Well-Being and Destitution. Oxford: Clarendon, 1993. (Pub. description)\nSocial Capital: A Multifaceted Perspective (co-editor with Ismail Serageldin). Washington, D.C.: World Bank, 2000. * (book preview except pp. 217–401, 403–25)\nHuman Well-Being and the Natural Environment. Oxford: Oxford University Press, 2001, Rev. ed. 2004.\nEconomics: A Very Short Introduction. Oxford: Oxford University Press, 2007. (OUP Website)\n\"Selected Papers of Partha Dasgupta: Vol.1, Institutions, Innovations, and Human Values; Vol. 2, Poverty, Population, and Natural Resources\". Oxford: Oxford University Press, 2010.\n\n\n== References ==\n\n\n== External links ==\nProfessor Partha Dasgupta's Home Page\nDasgupta's page at the Pontifical Academy of Social Sciences\nPartha Dasgupta interviewed by Alan Macfarlane 6 April 2010 (film)\nPartha Dasgupta at the Mathematics Genealogy Project", "ns": 0, "pageid": 2075439, "title": "Partha Dasgupta"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}