{"batchcomplete": "", "query": {"normalized": [{"to": "Paul Grice", "from": "Paul_Grice"}], "pages": {"335570": {"extract": "Herbert Paul Grice (March 13, 1913 – August 28, 1988), usually publishing under the name H. P. Grice, H. Paul Grice, or Paul Grice, was a British philosopher of language, who spent the final two decades of his career in the United States.\nGrice's work on the nature of meaning has influenced the philosophical study of semantics. He is known for his theory of implicature.\n\n\n== Life ==\nBorn and raised in Harborne (now a suburb of Birmingham), in the United Kingdom, he was educated at Clifton College and then at Corpus Christi College, Oxford. After a brief period teaching at Rossall School, he went back to Oxford where he taught at St John's College until 1967. In that year, he moved to the United States to take up a professorship at the University of California, Berkeley, where he taught until his death in 1988. He returned to the UK in 1979 to give the John Locke lectures on Aspects of Reason. He reprinted many of his essays and papers in his valedictory book, Studies in the Way of Words (1989).\nHe was married and had two children. He and his wife lived in an old Spanish style house in the Berkeley Hills.\n\n\n== Grice on meaning ==\nOne of Grice's two most influential contributions to the study of language and communication is his theory of meaning, which he began to develop in his article ‘Meaning', written in 1948 but published only in 1957 at the prodding of his colleague, P.F. Strawson. Grice further developed his theory of meaning in the fifth and sixth of his William James lectures on \"Logic and Conversation\", delivered at Harvard in 1967. These two lectures were initially published as ‘Utterer's Meaning and Intentions' in 1969 and ‘Utterer's Meaning, Sentence Meaning, and Word Meaning' in 1968, and were later collected with the other lectures as the first section of Studies in the Way of Words in 1989.\n\n\n=== Natural vs. non-natural meaning ===\nGrice begins ‘Meaning' by using the techniques of ordinary language philosophy to distinguish what he calls \"natural meaning\" (as in \"Those spots mean (meant) measles.\") from what he calls \"non-natural meaning\" (as in \"John means that he'll be late\" or \"‘Schnee' means ‘snow'\"). Grice does not attempt to give definitions of these two senses of the verb ‘to mean', nor does he offer an explicit theory that distinguishes the respective concepts they're used to express. Instead, he relies on five differences in ordinary language usage to show that we use the word in (at least) two different ways.\n\n\n=== Intention-based semantics ===\nFor the rest of ‘Meaning', and in his discussions of meaning in ‘Logic and Conversation', Grice deals exclusively with non-natural meaning. His overall approach to the study of non-natural meaning later came to be called \"intention-based semantics\", because it attempts to explain non-natural meaning in terms of the notion of a speakers' intentions. To do this, Grice distinguishes between two kinds of non-natural meaning:\nUtterer's Meaning: What a speaker means by an utterance. (Grice wouldn't introduce this label until Logic and Conversation. The more common label in contemporary work is \"speaker meaning\", although Grice didn't use that term.)\nTimeless Meaning: The kind of meaning that can be possessed by a type of utterance, such as a word or a sentence. (This is often called \"conventional meaning\", although Grice didn't call it that.)\nThe two steps in intention-based semantics are (1) to define utterer's meaning in terms of speakers' overt audience-directed intentions, and then (2) to define timeless meaning in terms of utterer's meaning. The net effect is to define all linguistic notions of meaning in purely mental terms, and to thus shed psychological light on the semantic realm.\nGrice tries to accomplish the first step by means of the following definition:\n\n\"A meantNN something by x\" is roughly equivalent to \"A uttered x with the intention of inducing a belief by means of the recognition of this intention\".\n\n(In this definition, ‘A' is a variable ranging over speakers and ‘x' is a variable ranging over utterances.) Grice generalizes this definition of speaker meaning later in ‘Meaning' so that it applies to commands and questions, which, he argues, differ from assertions in that the speaker intends to induce an intention rather than a belief. Grice's initial definition was controversial, and seemingly gives rise to a variety of counterexamples, and so later adherents of intention-based semantics—including Grice himself, Stephen Schiffer, Jonathan Bennett, Dan Sperber and Deirdre Wilson, and Stephen Neale—have attempted to improve on it in various ways while keeping the basic idea intact.\nGrice next turns to the second step in his program: explaining the notion of timeless meaning in terms of the notion of utterer's meaning. He does so very tentatively with the following definition:\n\n\"x meansNN (timeless) that so-and-so\" might as a first shot be equated with some statement or disjunction of statements about what \"people\" (vague) intend (with qualifications about \"recognition\") to effect by x.\n\nThe basic idea here is that the meaning of a word or sentence results from a regularity in what speakers use the word or sentence to mean. Grice would give a much more detailed theory of timeless meaning in his sixth Logic and Conversation lecture. A more influential attempt to expand on this component of intention-based semantics has been given by Stephen Schiffer.\n\n\n== Grice's theory of implicature ==\nGrice's most influential contribution to philosophy and linguistics is his theory of implicature, which he first began developing in his 1961 article, ‘The Causal Theory of Perception', but which is most fully explored in his 1967 William James Lectures on \"Logic and Conversation\".\n\n\n=== The saying/implicating distinction ===\nAccording to Grice, what a speaker means by an utterance can be divided into what the speaker \"says\" and what the speaker thereby \"implicates\".\nGrice makes it clear that the notion of saying he has in mind, though related to a colloquial sense of the word, is somewhat technical, referring to it as \"a favored notion of ‘saying' that must be further elucidated\". Nonetheless, Grice never settled on a full elucidation or definition of his favored notion of saying, and the interpretation of this notion has become a contentious issue in the philosophy of language.\nOne point of controversy surrounding Grice's favored notion of saying is the connection between it and his concept of utterer's meaning. Grice makes it clear that he takes saying to be a kind of meaning, in the sense that doing the former entails doing the latter: \"I want to say that (1) \"U (utterer) said that p\" entails (2) \"U did something x by which U meant that p\" (87). This condition is controversial, but Grice argues that apparent counterexamples—cases in which a speaker apparently says something without meaning it—are actually examples of what he calls \"making as if to say\", which can be thought of as a kind of \"mock saying\" or \"play saying\".\nAnother point of controversy surrounding Grice's notion of saying is the relationship between what a speaker says with an expression and the expression's timeless meaning. Although he attempts to spell out the connection in detail several times, the most precise statement that he endorses is the following one:\n\nIn the sense in which I am using the word say, I intend what someone has said to be closely related to the conventional meaning of the words (the sentence) he has uttered.\n\nUnfortunately, Grice never spelled out what he meant by the phrase \"closely related\" in this passage, and philosophers of language continue to debate over its best interpretation.\nIn ‘The Causal Theory of Perception', Grice contrasts saying (which he there also calls \"stating\") with \"implying\", but in Logic and Conversation he introduces the technical term \"implicature\" and its cognates \"to implicate\" and \"implicatum\" (i.e., that which is implicated). Grice justifies this neologism by saying that \"‘Implicature' is a blanket word to avoid having to make choices between words like ‘imply', ‘suggest', ‘indicate', and ‘mean'\".\nGrice sums up these notions by suggesting that to implicate is to perform a \"non-central\" speech act, whereas to say is to perform a \"central\" speech act. As others have more commonly put the same distinction, saying is a kind of \"direct\" speech act whereas implicating is an \"indirect\" speech act. This latter way of drawing the distinction is an important part of John Searle's influential theory of speech acts.\n\n\n=== Conventional vs. conversational implicature ===\nAlthough Grice is best known for his theory of conversational implicature, he also introduced the notion of conventional implicature. The difference between the two lies in the fact that what a speaker conventionally implicates by uttering a sentence is tied in some way to the timeless meaning of part of the sentence, whereas what a speaker conversationally implicates is not directly connected with timeless meaning. Grice's best-known example of conventional implicature involves the word ‘but', which, he argues, differs in meaning from the word ‘and' only in that we typically conventionally implicate something over and above what we say with the former but not with the latter. In uttering the sentence ‘She was poor but she was honest', for example, we say merely that she was poor and she was honest, but we implicate that poverty contrasts with honesty (or that her poverty contrasts with her honesty).\nGrice makes it clear that what a speaker conventionally implicates by uttering a sentence is part of what the speaker means in uttering it, and that it is also closely connected to what the sentence means. Nonetheless, what a speaker conventionally implicates is not a part of what the speaker says.\n\nU's doing x might be his uttering the sentence \"She was poor but she was honest\". What U meant, and what the sentence means, will both contain something contributed by the word \"but\", and I do not want this contribution to appear in an account of what (in my favored sense) U said (but rather as a conventional implicature).\n\nGrice did not elaborate much on the notion of conventional implicature, but many other authors have tried to give more extensive theories of it, including Lauri Karttunen and Stanley Peters, Kent Bach, Stephen Neale, and Christopher Potts.\n\n\n=== Conversational implicature ===\nTo conversationally implicate something in speaking, according to Grice, is to mean something that goes beyond what one says in such a way that it must be inferred from non-linguistic features of a conversational situation together with general principles of communication and cooperation.\nThe general principles Grice proposed are what he called the Cooperative principle and the Maxims of Conversation. According to Grice, the cooperative principle is a norm governing all cooperative interactions among humans.\nCooperative Principle: \"Make your contribution such as it is required, at the stage at which it occurs, by the accepted purpose or direction of the talk exchange in which you are engaged.\" (Grice 1989: 26).\nThe conversational maxims can be thought of as precisifications of the cooperative principle that deal specifically with communication.\nMaxim of Quantity: Information\nMake your contribution as informative as is required for the current purposes of the exchange.\nDo not make your contribution more informative than is required.\nMaxim of Quality: Truth\nDo not say what you believe to be false.\nDo not say that for which you lack adequate evidence.\nMaxim of Relation: Relevance\nBe relevant.\nMaxim of Manner: Clarity (\"be perspicuous\")\nAvoid obscurity of expression.\nAvoid ambiguity.\nBe brief (avoid unnecessary prolixity).\nBe orderly.\nGrice follows his summary of the maxims by suggesting that \"one might need others\", and goes on to say that \"There are, of course, all sorts of other maxims (aesthetic, social, or moral in character), such as \"Be polite\", that are also normally observed by participants in exchanges, and these may also generate nonconventional implicatures.\"\nConversational implicatures are made possible, according to Grice, by the fact that the participants in a conversation always assume each other to behave according to the maxims. So, when a speaker appears to have violated a maxim by saying or making as if to say something that is false, uninformative or too informative, irrelevant, or unclear, the assumption that the speaker is in fact obeying the maxims causes the interpreter to infer a hypothesis about what the speaker really meant. That an interpreter will reliably do this allows speakers to intentionally \"flout\" the maxims—i.e., create the appearance of breaking the maxims in a way that is obvious to both speaker and interpreter—in order to get their implicatures across.\nPerhaps Grice's best-known example of conversational implicature is the case of the reference letter, a \"quantity implicature\" (i.e., because it involves flouting the first maxim of Quantity):\n\nA is writing a testimonial about a pupil who is a candidate for a philosophy job, and his letter reads as follows: \"Dear Sir, Mr. X's command of English is excellent, and his attendance at tutorials has been regular. Yours, etc.\" (Gloss: A cannot be opting out, since if he wished to be uncooperative, why write at all? He cannot be unable, through ignorance, to say more, since the man is his pupil; moreover, he knows that more information than this is wanted. He must, therefore, be wishing to impart information that he is reluctant to write down. This supposition is tenable only if he thinks Mr. X is no good at philosophy. This, then, is what he is implicating.)\n\nGiven that a speaker means a given proposition p by a given utterance, Grice suggests several features which p must possess in order to count as a conversational implicature.\nNondetachability: \"The implicature is nondetachable insofar as it is not possible to find another way of saying the same thing (or approximately the same thing) which simply lacks the implicature.\"\nCancelability: \"...a putative conversational implicature is explicitly cancelable if, to the form of words the utterance of which putatively implicates that p, it is admissible to add but not p, or I do not mean to imply that p, and it is contextually cancelable if one can find situations in which the utterance of the form of words would simply not carry the implicature.\"\nNon-Conventionality: \"...conversational implicata are not part of the meaning of the expressions to the employment of which they attach.\"\nCalculability: \"The presence of a conversational implicature must be capable of being worked out; for even if it can in fact be intuitively grasped, unless the intuition is replaceable by an argument, the implicature (if present at all) will not count as a conversational implicature; it will be a conventional implicature.\"\n\n\n=== Generalized vs. particularlized conversational implicature ===\nGrice also distinguishes between generalized and particularized conversational implicature. Grice says that particularized conversational implicatures (such as in the reference letter case quoted above) arise in \"cases in which an implicature is carried by saying that p on a particular occasion in virtue of special features about the context, cases in which there is no room for the idea that an implicature of this sort is normally carried by saying that p.\" Generalized implicature, by contrast, arise in cases in which \"one can say that the use of a certain form of words in an utterance would normally (in the absence of special circumstances) carry such-and-such an implicature or type of implicature.\" Grice does not offer a full theory of generalized conversational implicatures that distinguishes them from particularlized conversational implicatures, on one hand, and from conventional implicatures, on the other hand, but later philosophers and linguists have attempted to expand on the idea of generalized conversational implicatures.\n\n\n== Grice's paradox ==\nIn his book Studies in the Way of Words, he presents what he calls \"Grice's Paradox\". In it, he supposes that two chess players, Yog and Zog, play 100 games under the following conditions:\n(1) Yog is white nine of ten times.\n(2) There are no draws.\nAnd the results are:\n(1) Yog, when white, won 80 of 90 games.\n(2) Yog, when black, won zero of ten games.\nThis implies that:\n(i) 8/9 times, if Yog was white, Yog won.\n(ii) 1/2 of the time, if Yog lost, Yog was black.\n(iii) 9/10 that either Yog wasn't white or he won.\nFrom these statements, it might appear one could make these deductions by contraposition and conditional disjunction:\n([a] from [ii]) If Yog was white, then 1/2 of the time Yog won.\n([b] from [iii]) 9/10 times, if Yog was white, then he won.\nBut both (a) and (b) are untrue—they contradict (i). In fact, (ii) and (iii) don't provide enough information to use Bayesian reasoning to reach those conclusions. That might be clearer if (i)-(iii) had instead been stated like so:\n(i) When Yog was white, Yog won 8/9 times. (No information is given about when Yog was black.)\n(ii) When Yog lost, Yog was black 1/2 the time. (No information is given about when Yog won.)\n(iii) 9/10 times, either Yog was black and won, Yog was black and lost, or Yog was white and won. (No information is provided on how the 9/10 is divided among those three situations.)\nGrice's paradox shows that the exact meaning of statements involving conditionals and probabilities is more complicated than may be obvious on casual examination.\n\n\n== Criticisms and examinations ==\nThe relevance theory of Dan Sperber and Deirdre Wilson builds on and also challenges Grice's theory of meaning and his account of pragmatic inference. See Relevance: Communication and Cognition (Oxford: Blackwell, 1986). Grice's work is examined in detail by Stephen Neale, \"Paul Grice and the Philosophy of Language\", Linguistics and Philosophy 15: 5 (Oct. 1992).\n\n\n== Notes ==\n\n\n== References ==\nBach, Kent (1999). \"The Myth of Conventional Implicature,\" Linguistics and Philosophy, 22, pp. 327–366.\nBennett, Jonathan (1976). Linguistic Behaviour. Cambridge University Press.\nBorg, Emma (2006). \"Intention-Based Semantics,\" The Oxford Handbook of Philosophy of Language, edited by Ernest Lepore and Barry C. Smith. Oxford University Press, 2006, pp. 250–266.\nGrice (1941). \"Personal Identity\", Mind 50, 330-350; reprinted in J. Perry (ed.), Personal Identity, University of California Press, Berkeley, 1975, pp. 73–95.\nGrice, H.P. (1957). \"Meaning\", Philosophical Review, 66(3). Reprinted as ch.14 of Grice 1989, pp. 213–223.\nGrice (1961). \"The Causal Theory of Perception\", Proceedings of the Aristotelian Society 35 (suppl.), 121-52. Partially reprinted as Chapter 15 of Grice 1989, pp. 224–247.\nGrice, H.P. (1968). \"Utterer's Meaning, Sentence Meaning, and Word Meaning,\" Foundations of Language, 4. Reprinted as ch.6 of Grice 1989, pp. 117–137.\nGrice (1969). \"Vacuous Names\", in D. Davidson and J. Hintikka (eds.), Words and Objections, D. Reidel, Dordrecht, pp. 118–145.\nGrice, H.P. (1969). \"Utterer's Meaning and Intentions\", The Philosophical Review, 78. Reprinted as ch.5 of Grice 1989, pp. 86–116.\nGrice, H.P. (1971). \"Intention and Uncertainty\", Proceedings of the British Academy, pp. 263–279.\nGrice, H.P. (1975). \"Method in Philosophical Psychology: From the Banal to the Bizarre\", Proceedings and Addresses of the American Philosophical Association (1975), pp. 23–53.\nGrice, H.P. (1975). \"Logic and Conversation,\" Syntax and Semantics, vol.3 edited by P. Cole and J. Morgan, Academic Press. Reprinted as ch.2 of Grice 1989, 22–40.\nGrice, H.P. (1978). \"Further Notes on Logic and Conversation,\" Syntax and Semantics, vol.9 edited by P. Cole, Academic Press. Reprinted as ch.3 of Grice 1989, 41–57.\nGrice (1981). \"Presupposition and Conversational Implicature\", in P. Cole (ed.), Radical Pragmatics, Academic Press, New York, pp. 183–198. Reprinted as ch.17 of Grice 1989, 269–282.\nGrice, H.P. (1989). Studies in the Way of Words. Harvard University Press.\nGrice, H.P. (1991). The Conception of Value. Oxford University Press. (His 1983 Carus Lectures.)\nGrice, H.P., (2001). Aspects of Reason (Richard Warner, ed.). Oxford University Press. (His 1979 John Locke Lectures, mostly the same as his 1977 Immanuel Kant Lectures.)\nKarttunen, Lauri and Stanley Peters (1978). \"Conventional Implicature,\" Syntax and Semantics, vol.11 edited by P. Cole, Academic Press. pp. 1–56.\nKordić, Snježana (1991). \"Konverzacijske implikature\" [Conversational implicatures] (PDF). Suvremena lingvistika (in Serbo-Croatian). 17 (31-32): 87–96. ISSN 0586-0296. OCLC 440780341. Archived from the original on 2 September 2012. Retrieved 6 March 2015. \nLevinson, Stephen (2000). Presumptive Meanings: The Theory of Generalized Conversational Implicature. MIT Press.\nNeale, Stephen (1992). \"Paul Grice and the Philosophy of Language,\" Linguistics and Philosophy, 15, pp. 509–559.\nNeale, Stephen (1999). \"Colouring and Composition,\" Philosophy and Linguistics, edited by Rob Stainton. Westview Press, 1999. pp. 35–82.\nPotts, Christopher (2005). The Logic of Conventional Implicature. Oxford University Press.\nSearle, John (1975). \"Indirect Speech Acts,\" Syntax and Semantics, vol.3 edited by P. Cole and J. Morgan, Academic Press.\nSchiffer, Stephen (1972). Meaning. Oxford University Press.\nSchiffer, Stephen (1982). \"Intention-Based Semantics,\" Notre Dame Journal of Formal Logic, 23(2), pp. 119–156.\nSperber, Dan and Dierdre Wilson (1986). Relevance: Communication and Cognition. Blackwell. Second edition 1995.\n\n\n== Further reading ==\nSiobhan Chapman, Paul Grice: Philosopher and Linguist, Houndmills: Palgrave Macmillan, 2005. ISBN 1-4039-0297-6.\n\n\n== External links ==\nStanford Encyclopedia of Philosophy: \"Paul Grice\"—by Richard E. Grandy & Richard Warner.\nMIT Encyclopedia of the Cognitive Sciences: \"Grice, H. Paul\"—by Kent Bach.\nDictionary of Philosophy of Mind: \"Paul Grice\"—by Christopher Gauker.\nList of Grice links at meaning.ch dead link\nLa comunicación según Grice (Spanish)", "ns": 0, "pageid": 335570, "title": "Paul Grice"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}