{"batchcomplete": "", "query": {"normalized": [{"to": "Paul Hawken", "from": "Paul_Hawken"}], "pages": {"1230468": {"extract": "Paul Hawken (/ˈhɔːkən/; born February 8, 1946, California) is an environmentalist, entrepreneur, author, and activist.\n\n\n== Biography ==\nHawken grew up in the San Francisco Bay Area, where his father worked at UC Berkeley in Library Sciences. He attended UC Berkeley and San Francisco State University. Hawken's work includes founding ecological businesses, writing about impacts of commerce on living systems, and consulting with corporations and governments on economic development, industrial ecology, and environmental policy.\nHawken is the Co-founder and Executive Director of Project Drawdown, a non-profit that describes when and how global warming can be reversed.\nHawken was active in the Civil Rights Movement. He currently lives in the San Francisco Bay Area.\n\n\n== Writing ==\nHawken has authored articles, op-eds, and peer-reviewed papers, and has written seven books, including: The Next Economy (Ballantine 1983), Growing a Business (Simon and Schuster 1987), The Ecology of Commerce (HarperCollins 1993), and Blessed Unrest (Viking 2007).\nThe Ecology of Commerce was voted the #1 college text on business and the environment by professors in 67 business schools. The businessman and environmentalist Ray Anderson of Interface, Inc. credited The Ecology of Commerce with his environmental awakening. He described reading it as a “spear in the chest experience,” after which Anderson started crisscrossing the country with a near-evangelical fervor, telling fellow executives about the need to reduce waste and carbon emissions.\nNatural Capitalism: Creating the Next Industrial Revolution (Little Brown, September 1999), co-authored with Amory Lovins, popularized the now standard idea of natural capital and direct accounting for ecosystem services. It has been read and referred to by several heads of state including President Bill Clinton who called it one of the five most important books in the world today, stating \"Natural Capitalism basically proves beyond any argument that there are presently available technologies, and those just on the horizon, which will permit us to get richer by cleaning, not by spoiling, the environment.\" Natural Capitalism has been translated into 14 other languages. Together with The Ecology of Commerce these books have been described as being \"among the first to point the way towards a sustainable global economy\".\nBlessed Unrest, How the Largest Movement in the World Came into Being and Why No One Saw It Coming, published in May 2007, argues that a vast “movement with no name” is forming involving environmental, social justice, and indigenous rights organizations. He conceives of this \"movement\" as developing not by ideology but rather through the identification of what is and is not humane, and has compared it to humanity's collective immune system.\nGrowing a Business became the basis of a 17-part PBS series, which Hawken hosted and produced. The program, which explored the challenges and pitfalls of starting and operating socially responsible companies, appeared on television in 115 countries and reached more than 100 million people.\nA complete list of Paul Hawken's published books:\n- Blessed Unrest: How the Largest Social Movement in History Is Restoring Grace, Justice, and Beauty to the World (2007)\n- Natural Capitalism: Creating the Next Industrial Revolution (1999, Co-authored with Amory Lovins and L. Hunter Lovins)\n- The Ecology of Commerce: A Declaration of Sustainability (1993) \n- Growing a Business (1987) \n- The Next Economy (1983)\n- Seven Tomorrows (1980, Co-authored with Peter Schwartz and James Olgivy)\n\nHawken's books have been published in more than 50 countries in 30 languages.\n\n\n== Business ==\nHawken founded several companies, starting when he took over a small retail store in Boston in 1966 called Erewhon (after Samuel Butler's 1872 utopian novel) and turned it into the Erewhon Trading Company, a natural-foods wholesaler, and one of the first in the US that relied solely on sustainable agricultural methods. When he left the company in the 1970s, it had over 30,000 acres of organically grown food under contract. He co-founded the Smith & Hawken garden supply company in 1979, a retail and catalog business. In 2009, Hawken founded OneSun, an energy company focused on ultra low-cost solar based on green chemistry and biomimicry.\nFrom 1994 up until 1998 Hawken founded and headed up The Natural Step USA. From 1996 to 1998, Hawken was Co-chairman of The Natural Step International. The Natural Step was founded in 1989 by Swedish scientist and medical doctor, Karl-Henrik Robèrt in order to create shared frameworks for understanding sustainable development. Its purpose is to teach and support environmental systems thinking in corporations, cities, governments, unions, and academic institutions through a dialogue process rooted in basic science.\nIn 1998, Hawken created the Natural Capital Institute (NCI) located in Sausalito, California. Its main focus was wiser.org, an open-source database of activists and civil society organizations focused on environmental and social justice.\nHawken is currently the Executive Director of Project Drawdown (climate).\n\n\n== Activism ==\nIn 1965, Hawken worked with Martin Luther King, Jr.'s staff in Selma, Alabama prior to the historic March on Montgomery. As press coordinator, he registered members of the press, issued credentials, gave dozens of updates and interviews on national radio, and acted as marshal for the final march. That same year, he worked in New Orleans as a staff photographer for the Congress of Racial Equality, focusing on voter registration drives in Bogalusa, Louisiana and the panhandle of Florida, and photographing the Klan in Meridian Mississippi after three civil rights workers were tortured and killed. In Meridian, he was assaulted and seized by Ku Klux Klan members, but escaped due to FBI surveillance and intervention.\n\n\n== Recognition ==\nPaul Hawken has been awarded six honorary doctorates, and has received the following awards and recognitions:\nGreen Cross Millennium Award for Individual Environmental Leadership presented by Mikhail Gorbachev in 2003\n\n\n== Speaking ==\nAs a speaker, Hawken has given several hundred talks, including keynote addresses to major associations, companies, government agencies. His University commencement addresses have included:\nUniversity of California, Berkeley Commencement \nUniversity of Portland 2009 commencement speech (\"You Are Brilliant and the Earth Is Hiring\") \nUrban Land Institute\nYale University and Yale University Commencement \n\n\n== References ==\n\n\n== External links ==\nProject Drawdown official website\nOfficial Paul Hawken website\nNatural Capital Institute NCI\nInterview on Sea Change Radio 2014", "ns": 0, "pageid": 1230468, "title": "Paul Hawken"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}