{"batchcomplete": "", "query": {"normalized": [{"to": "Paul Bernays", "from": "Paul_Bernays"}], "pages": {"2556580": {"extract": "Paul Isaac Bernays (17 October 1888 – 18 September 1977) was a Swiss mathematician, who made significant contributions to mathematical logic, axiomatic set theory, and the philosophy of mathematics. He was an assistant and close collaborator of David Hilbert.\n\n\n== Biography ==\nBernays spent his childhood in Berlin, and attended the Köllner Gymnasium, 1895-1907. At the University of Berlin, he studied mathematics under Issai Schur, Edmund Landau, Ferdinand Georg Frobenius, and Friedrich Schottky; philosophy under Alois Riehl, Carl Stumpf and Ernst Cassirer; and physics under Max Planck. At the University of Göttingen, he studied mathematics under David Hilbert, Edmund Landau, Hermann Weyl, and Felix Klein; physics under Voigt and Max Born; and philosophy under Leonard Nelson.\nIn 1912, the University of Berlin awarded him a Ph.D. in mathematics, for a thesis, supervised by Landau, on the analytic number theory of binary quadratic forms. That same year, the University of Zurich awarded him the Habilitation for a thesis on complex analysis and Picard's theorem. The examiner was Ernst Zermelo. Bernays was Privatdozent at the University of Zurich, 1912–17, where he came to know George Pólya.\nStarting in 1917, David Hilbert employed Bernays to assist him with his investigations of the foundations of arithmetic. Bernays also lectured on other areas of mathematics at the University of Göttingen. In 1918, that university awarded him a second Habilitation, for a thesis on the axiomatics of the propositional calculus of Principia Mathematica.\nIn 1922, Göttingen appointed Bernays extraordinary professor without tenure. His most successful student there was Gerhard Gentzen. In 1933, he was dismissed from this post because of his Jewish ancestry. After working privately for Hilbert for six months, Bernays and his family moved to Switzerland, whose nationality he had inherited from his father, and where the ETH employed him on occasion. He also visited the University of Pennsylvania and was a visiting scholar at the Institute for Advanced Study in 1935-36 and again in 1959-60.\n\n\n== Mathematical work ==\nBernays's collaboration with Hilbert culminated in the two volume work Grundlagen der Mathematik by Hilbert and Bernays (1934, 1939), discussed in Sieg and Ravaglia (2005). In seven papers, published between 1937 and 1954 in the Journal of Symbolic Logic, republished in (Müller 1976), Bernays set out an axiomatic set theory whose starting point was a related theory John von Neumann had set out in the 1920s. Von Neumann's theory took the notion of function as primitive; Bernays recast Von Neumann's theory so that sets and proper classes were primitive. Bernays's theory, with some modifications by Kurt Gödel, is now known as the Von Neumann–Bernays–Gödel set theory. A proof from the Grundlagen der Mathematik that a sufficiently strong consistent theory cannot contain its own reference functor is now known as the Hilbert–Bernays paradox.\n\n\n== Publications ==\nHilbert, David; Bernays, Paul (1934), Grundlagen der Mathematik. I, Die Grundlehren der mathematischen Wissenschaften, 40, Berlin, New York: Springer-Verlag, ISBN 978-3-540-04134-4, JFM 60.0017.02, MR 0237246 \nHilbert, David; Bernays, Paul (1939), Grundlagen der Mathematik. II, Die Grundlehren der mathematischen Wissenschaften, 50, Berlin, New York: Springer-Verlag, ISBN 978-3-540-05110-7, JFM 65.0021.02, MR 0272596 \nBernays, Paul (1958), Axiomatic set theory, Studies in Logic and the Foundations of Mathematics, Amsterdam: North-Holland, ISBN 978-0-486-66637-2, MR 0106178 \nBernays, Paul (1976), Abhandlungen zur Philosophie der Mathematik (in German), Darmstadt: Wissenschaftliche Buchgesellschaft, ISBN 978-3-534-06706-0, MR 0444417 \n\n\n== Notes ==\n\n\n== References ==\nKneebone, Geoffrey, 1963. Mathematical Logic and the Foundation of Mathematics. Van Nostrand. Dover reprint, 2001. A gentle introduction to some of the ideas in the Grundlagen der Mathematic.\nMüller, Gert H., ed. (1976), Sets and classes. On the work by Paul Bernays, Studies in Logic and the Foundations of Mathematics, 84, Amsterdam: North-Holland, ISBN 978-0-444-10907-1, MR 0414355 \nLauener, Henri (1978), \"Paul Bernays (1888--1977)\", Zeitschrift für Allgemeine Wissenschaftstheorie, 9 (1): 13–20, doi:10.1007/BF01801939, ISSN 0044-2216, MR 546580 \nSieg, Wilfried; Ravaglia, Mark (2005), \"Chapter 77. David Hilbert and Paul Bernays, Grundlagen der Mathematik\", in Grattan-Guinness, Ivor, Landmark writings in western mathematics 1640--1940, Elsevier B. V., Amsterdam, pp. 981–99, doi:10.1016/B978-044450871-3/50158-3, ISBN 978-0-444-50871-3, MR 2169816 \nBernays and Set Theory, Akihiro Kanamori, The Bulletin of Symbolic Logic, Vol. 15, No. 1 (Mar., 2009), pp. 43–69.\n\n\n== External links ==\nHilbert Bernays Project\nO'Connor, John J.; Robertson, Edmund F., \"Paul Bernays\", MacTutor History of Mathematics archive, University of St Andrews .\nPaul Bernays: A Short Biography (1976)", "ns": 0, "pageid": 2556580, "title": "Paul Bernays"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}