{"batchcomplete": "", "query": {"normalized": [{"to": "Pekka Himanen", "from": "Pekka_Himanen"}], "pages": {"291202": {"extract": "Pekka Himanen (born October 19, 1973) is a Finnish philosopher.\n\n\n== Biography ==\nPekka Himanen defines himself as a philosopher and a public intellectual. He studied philosophy (and computer science as a minor) at the University of Helsinki. In 1994, with his thesis on the philosophy of religion, The challenge of Bertrand Russell, he received his Ph.D. in philosophy from the same university, thus becoming the youngest Ph.D. in Finland.\nHe has done research work in Finland (University of Helsinki), the United Kingdom, and the United States (Stanford University, University of California, Berkeley) and has done field work in India, China and Japan. At UC Berkeley, Himanen directed the Berkeley Center for the Information Society, a research group under Berkeley's International Computer Science Institute. The Center was active from September 2002 until 2005 [3].\nHimanen has also been a counselor to the president of Finland, Finnish government (including the Ministry of Education) and Finnish parliament, in the field of information society.\nHe has been a Visiting Professor at the Oxford Internet Institute (based at Oxford University) from September 2005 to July 2006.\nIn his book HimEros written as a dialogue, Socrates’ wife Xanthippe relates to the Helsinkian what happened to Socrates in Hades, how Socrates decided to escape from Hades and go to study philosophy at the University of Helsinki, and how he was arrested, sentenced to death and executed as a result of a three-day conversation with the philosophers of the University. Xanthippe also transmits Socrates’ dialogue with the university teachers of philosophy Cyborg (Stephen Hawking), Pope (John Paul II), Unabomber (Theodore Kaczynski) and Madonna (Madonna Ciccone).\nIn The Hacker Ethic and the Spirit of the Information Age, Himanen is trying to understand the core of informationalism, the post-industrialist paradigm, extending the ideas of Manuel Castells' Information Age. As an alternative to the industrial-capitalist protestant work ethic he proposes a hacker ethic as something like a cyber communitarianism. The structure of the information society is a web, which in contemporary business world manifests itself, for instance, in dynamic outsourcing and even cooperation with one's competitors. The \"knots\" of such a web get activated according to the needs and opportunities.\nAccording to Himanen, the three main features of hacker ethic are:\nenthusiastic, passionate attitude to the work that is enjoyed\ncreativity, wish to realise oneself and one's ability, often in teams that are formed spontaneously (project orientation)\nwish to share one's skills with a community having common goals, along with the need to acquire recognition from one's \"tribe\"; one is motivated by inner zeal rather than external awards: the fruits of one's work are donated to everybody for their advances and further developments\nAccording to Himanen, the social hackerism begins from such things as vegetarianism, whereas the opposite of it is represented by Microsoft and the licensing of computer programs. Himanen thinks that in the information society we need a radical lack of prejudice, such as he has met in philosophy lessons to children. A critical challenge of the Internet era is the ability to meet the other human being.\n\n\n== Global Dignity ==\nIn 2006, he established Global Dignity with Haakon, Crown Prince of Norway and John Hope Bryant. Global Dignity is an independent, non-political organization that promotes the universal right of every human being to lead a dignified life.\n\n\n== Criticism and negative publicity ==\nTwo Finnish journalists, Anu Silfverberg and Johanna Vehkoo, published a critical investigation of Himanen's research funding from public sources, the outcomes of his research, as well as his use of the title of \"professor\" without holding a professorship. The investigation followed the critical reception of Himanen's recent research reports on information society done under contract with the Finnish government, and reports of disorderly conduct in public places while intoxicated.\n\n\n== Books ==\nHimEros (1996)\nFilosofian oikeudenkäynti (The trial of philosophy, 1998)\nThe Hacker Ethic and the Spirit of the Information Age (foreword by Linus Torvalds, afterword by Manuel Castells, 2001)\nManuel Castells and Pekka Himanen. The Information Society and the Welfare State: The Finnish Model (2002)\nChallenges of the Global Information Society, report for the Committee for the Future in Parliament of Finland (2004). http://www.eduskunta.fi/efakta/vk/tuv/challenges_of_the_globalinformationsociety.pdf\nRakkaus (Love) to appear (2004).\n\n\n== Awards ==\n1994 Finnish State Award for Popular Science (for the talk series Joulukalenteri (Christmas Calendar))\n1998 European multimedia award Europrix for the CD Sokrates (Socrates)\n\n\n== References ==\n\n\n== External links ==\nPekka Himanen's homepage", "ns": 0, "pageid": 291202, "title": "Pekka Himanen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}