{"batchcomplete": "", "query": {"normalized": [{"to": "Per Bauhn", "from": "Per_Bauhn"}], "pages": {"13334155": {"extract": "Per Roald Bauhn (born 23 July 1960 in Markaryd, Kronoberg County) is a Swedish philosopher and a professor of practical philosophy at the University of Kalmar since 2004, and at Linnaeus University from 2010 His main subjects include the study of ethics and political philosophy. He has authored several books on topics such as nationalism, political terrorism and courage. He has lectured at the Florence Academy of Art.Per Bauhn's philosophical work is inspired by the agency-based ethical theory of Alan Gewirth.\n\n\n== Writings ==\n(1990) Världens terrorism (in Swedish), Stockholm: Utrikespolitiska institutet, ISBN 91-7182-739-0.\n(1989) Ethical aspects of political terrorism : the sacrificing of the innocent, Lund: Lund University Press (ISBN 91-7966-064-9); Bromley: Chartwell-Bratt (ISBN 0-86238-207-6).\n(1995) Nationalism and morality, Lund: Lund University Press (ISBN 91-7966-317-6); Bromley: Chartwell-Bratt (ISBN 0-86238-392-7).\n(1995) Multiculturalism and nationhood in Canada : the cases of First Nations and Quebec (co-authors: Christer Lindberg & Svante Lundberg), Lund: Lund University Press (ISBN 91-7966-342-7); Bromley: Chartwell-Bratt (ISBN 0-86238-411-7).\n(2003) The value of courage, Lund: Nordic Academic Press, ISBN 91-89116-62-3 (hardback).\n(2006) Mänskliga rättigheter och filosofi (in Swedish), Malmö: Liber, ISBN 91-47-07668-2.\n(2016) Gewirthian Perspectives on Human Rights (ed.), Abingdon: Routledge, ISBN 9781138649866.\nGeorg Meggle, ed. (2005). \"Political Terrorism and Rules of Just War\". Ethics of terrorism & counter-terrorism. ontos verlag. ISBN 978-3-937202-68-6. \nChristian Lund, ed. (1999). \"Universal Rights and Historical Context\". Development and rights: negotiating justice in changing societies. Routledge. ISBN 978-0-7146-4941-2. \n\"Aesthetic Identity, Well-Being, and the Right to Beauty\", The International Journal of the Arts in Society. 4:1. 71-80.\n\n\n== References ==\n\n\n== External links ==\nDel 1 Föredrag av Jan-Ove Tuv och Per Bauhn", "ns": 0, "pageid": 13334155, "title": "Per Bauhn"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}