{"batchcomplete": "", "query": {"normalized": [{"to": "Peter Kropotkin", "from": "Peter_Kropotkin"}], "pages": {"51074": {"extract": "Prince Pyotr Alexeyevich Kropotkin (/kroʊˈpɒtkɪn, krə-/; Russian: Пётр Алексе́евич Кропо́ткин; December 9, 1842 – February 8, 1921) was a Russian activist, scientist, and philosopher, who advocated anarchism. Kropotkin was a proponent of a communist society free from central government and based on voluntary associations between workers. He wrote many books, pamphlets and articles, the most prominent being The Conquest of Bread and Fields, Factories and Workshops, and his principal scientific offering, Mutual Aid: A Factor of Evolution. He also contributed the article on anarchism to the Encyclopædia Britannica Eleventh Edition.\n\n\n== Biography ==\n\n\n=== Early life ===\nKropotkin was born in Moscow, into the second-highest level of the Russian aristocracy. His mother was the daughter of a Cossack general. His father, Alexei Petrovich Kropotkin, was a prince in Smolensk, of the Rurik dynasty which had ruled Russia before the rise of the Romanovs. Kropotkin's father owned large tracts of land and nearly 1,200 male serfs in three provinces.\n\"[U]nder the influence of republican teachings,\" Kropotkin dropped his princely title at age 12, and \"even rebuked his friends, when they so referred to him.\"\nIn 1857, at age 14, Kropotkin enrolled in the Corps of Pages at St. Petersburg. Only 150 boys – mostly children of nobility belonging to the court – were educated in this privileged corps, which combined the character of a military school endowed with special rights and of a court institution attached to the Imperial Household. Kropotkin's memoirs detail the hazing and other abuse of pages for which the Corps had become notorious.\nIn Moscow, Kropotkin developed an interest in the condition of the peasantry, and this interest grew as he grew older. Although his work as a page for Tsar Alexander II made Kropotkin skeptical about the tsar's \"liberal\" reputation, Kropotkin was greatly pleased by the tsar's decision to emancipate the serfs in 1861. In St. Petersburg, he read widely on his own account, and gave special attention to the works of the French encyclopædists and to French history. The years 1857–1861 witnessed a growth in the intellectual forces of Russia, and Kropotkin came under the influence of the new liberal-revolutionary literature, which largely expressed his own aspirations.\nIn 1862, Kropotkin was promoted from the Corps of Pages to the army. The members of the corps had the prescriptive right to choose the regiment to which they would be attached. For some time, he was aide de camp to the governor of Transbaikalia at Chita. Later he was appointed attaché for Cossack affairs to the governor-general of East Siberia at Irkutsk.\n\n\n=== Geographical expeditions in Siberia ===\n\nAdministrative work was scarce, and in 1864 Kropotkin accepted position in a geographical survey expedition, crossing North Manchuria from Transbaikalia to the Amur, and soon was attached to another expedition up the Sungari River into the heart of Manchuria. The expeditions yielded valuable geographical results. The impossibility of obtaining any real administrative reforms in Siberia now induced Kropotkin to devote himself almost entirely to scientific exploration, in which he continued to be highly successful.\nIn 1866, Kropotkin began reading the works of the French anarchist Pierre-Joseph Proudhon, and other political thinkers such as John Stuart Mill and Alexander Herzen. These readings, along with his experiences among peasants in Siberia, led him to declare himself an anarchist by 1872.\nIn 1867, Kropotkin resigned his commission in the army and returned to St. Petersburg, where he entered the Saint Petersburg Imperial University to study mathematics, becoming at the same time secretary to the geography section of the Russian Geographical Society. His departure from a family tradition of military service prompted his father to disinherit him, \"leaving him a 'prince' with no visible means of support\"' In 1871, he explored the glacial deposits of Finland and Sweden for the Society. In 1873, he published an important contribution to science, a map and paper in which he showed that the existing maps entirely misrepresented the physical features of Asia; the main structural lines were in fact from southwest to northeast, not from north to south or from east to west as had been previously supposed. During this work, he was offered the secretaryship of the Society, but he had decided that it was his duty not to work at fresh discoveries but to aid in diffusing existing knowledge among the people at large. Accordingly, he refused the offer and returned to St. Petersburg, where he joined the revolutionary party.\n\n\n=== Activism in Switzerland and France ===\nKropotkin visited Switzerland in 1872 and became a member of the International Workingmen's Association (IWA) at Geneva. However, he found that he did not like IWA's style of socialism. Instead, he studied the programme of the more radical Jura federation at Neuchâtel and spent time in the company of the leading members, and adopted the creed of anarchism.\nOn returning to Russia, Kropotkin's friend Dmitri Klements introduced him to the Circle of Tchaikovsky, a socialist/populist group created in 1872. Kropotkin worked to spread revolutionary propaganda among peasants and workers, and acted as a bridge between the Circle and the aristocracy. Throughout this period, Kropotkin maintained his position within the Geographical Society in order to provide cover for his activities.\nIn 1874, Kropotkin was arrested and imprisoned in the Peter and Paul Fortress for subversive political activity, as a result of his work with the Circle of Tchaikovsky. Because of his aristocratic background, he received special privileges in prison, such as permission to continue his geographical work in his cell. He delivered his report on the subject of the Ice Age, where he argued that it had taken place in not as distant a past as originally thought. In 1876, just before his trial, Kropotkin was moved to a low-security prison in St. Petersburg, from which he escaped with the help of his friends. On the night of the escape, Kropotkin and his friends celebrated by dining in one of the finest restaurants in St. Petersburg, assuming correctly that the police would not think to look for them there. After this, he boarded a boat, and headed to England. After a short stay there, he moved to Switzerland where he joined the Jura Federation. In 1877, he moved to Paris, where he helped start the socialist movement. In 1878, he returned to Switzerland where he edited the Jura Federation's revolutionary newspaper Le Révolté, and published various revolutionary pamphlets.\n\nIn 1881, shortly after the assassination of Tsar Alexander II, he was expelled from Switzerland. After a short stay at Thonon (Savoy), he stayed in London for nearly a year. He attended the Anarchist Congress in London from July 14, 1881. Other delegates included Marie Le Compte, Errico Malatesta, Saverio Merlino, Louise Michel, Nicholas Tchaikovsky and Émile Gautier. While respecting \"complete autonomy of local groups\", the congress defined propaganda actions that all could follow and agreed that propaganda by the deed was the path to social revolution. The Radical of July 23, 1881 reported that the congress met on July 18 at the Cleveland Hall, Fitzroy Square, with speeches by Marie Le Compte, \"the transatlantic agitator\", Louise Michel, and Kropotkin. Later Le Compte and Kropotkin gave talks to the Homerton Social Democratic Club and to the Stratford Radical and Dialectical Club.\nKropotkin returned to Thonon in late 1882. Soon he was arrested by the French government, tried at Lyon, and sentenced by a police-court magistrate (under a special law passed on the fall of the Paris Commune) to five years' imprisonment, on the ground that he had belonged to the IWA (1883). The French Chamber repeatedly agitated on his behalf, and he was released in 1886. He was invited to Britain by Charlotte Wilson, with whom he co-founded the Freedom Press, an anarchist newspaper which continues to this day. Kropotkin was a regular contributor. He settled near London, living at various times in Harrow – where his daughter, Alexandra, was born – Ealing and Bromley (6 Crescent Road 1886–1914). He also lived for a number of years in Brighton. While living in London, Kropotkin became friends with a number of prominent English-speaking socialists, including William Morris and George Bernard Shaw.\n\n\n=== Return to Russia ===\n\nIn 1917, after the February Revolution, Kropotkin returned to Russia again after years of exile. His arrival was greeted by cheering crowds of tens of thousands of people. He was offered the ministry of education in the provisional government, which he promptly refused, feeling that working with them would be a violation of his anarchist principles.\nHis enthusiasm for the changes happening in the Russian Empire turned to disappointment when the Bolsheviks seized power in the October Revolution. \"This buries the revolution\", he said. He thought that the Bolsheviks had shown how the revolution was not to be made; by authoritarian rather than libertarian methods. He had spoken out against authoritarian socialism in his writings (for example The Conquest of Bread), making the prediction that any state founded on these principles would most likely see its own breakup and the restoration of capitalism.\n\n\n=== Death ===\n\nKropotkin died of pneumonia on February 8, 1921, in the city of Dmitrov, and was buried at the Novodevichy Cemetery. Thousands of people marched in his funeral procession, including, with Vladimir Lenin's approval, anarchists carrying banners with anti-Bolshevik slogans. It was to become the last public demonstration of anarchists, which saw engaged speeches by Emma Goldman and Aron Baron. In 1957 the Dvorets Sovetov station of the Moscow Metro was renamed Kropotkinskaya in his honor.\n\n\n== Philosophy ==\n\n\n=== Critique of capitalism ===\nKropotkin pointed out what he considered to be the fallacies of the economic systems of feudalism and capitalism. He believed they create poverty and artificial scarcity while promoting privilege. Instead, he proposed a more decentralized economic system based on mutual aid, mutual support, and voluntary cooperation, asserting that the tendencies for this kind of organization already exist, both in evolution and in human society.\n\n\n=== Cooperation and competition ===\nIn 1902, Kropotkin published his book Mutual Aid: A Factor of Evolution, which provided an alternative view of animal and human survival, beyond the claims of interpersonal competition and natural hierarchy proffered at the time by some \"social Darwinists\" such as Francis Galton. He argued that \"it was an evolutionary emphasis on cooperation instead of competition in the Darwinian sense that made for the success of species, including the human\". Kropotkin explored the widespread use of cooperation as a survival mechanism in human societies - through their many stages - and among animals. He used many real-life examples in an attempt to show that the main factor in facilitating evolution is cooperation between individuals in free-associated societies and groups, without central control, authority, or compulsion. He did so in order to counteract the concept of fierce competition as the core of evolution, which concept provided a rationalization for the dominant political, economic, and social theories of the time and for the prevalent interpretations of Darwinism. In the last chapter, he wrote:\n\nIn the animal world we have seen that the vast majority of species live in societies, and that they find in association the best arms for the struggle for life: understood, of course, in its wide Darwinian sense – not as a struggle for the sheer means of existence, but as a struggle against all natural conditions unfavourable to the species. The animal species[...] in which individual struggle has been reduced to its narrowest limits[...] and the practice of mutual aid has attained the greatest development[...] are invariably the most numerous, the most prosperous, and the most open to further progress. The mutual protection which is obtained in this case, the possibility of attaining old age and of accumulating experience, the higher intellectual development, and the further growth of sociable habits, secure the maintenance of the species, its extension, and its further progressive evolution. The unsociable species, on the contrary, are doomed to decay.\n\nKropotkin did not deny the presence of competitive urges in humans, but did not see them as the driving force of history (as did capitalists and social Darwinists). He believed that seeking out conflict proved socially beneficial only in attempts to destroy unjust, authoritarian institutions such as the State or the Church, which he saw as stifling human creativity and freedom and impeding human instinctual drive towards sociality and cooperation.\nKropotkin's observations of cooperative tendencies in indigenous peoples (pre-feudal, feudal, and those remaining in modern societies) led him to conclude that not all human societies were based on competition, such as those of industrialized Europe, and that many societies exhibited cooperation among individuals and groups as the norm. He also concluded that most pre-industrial and pre-authoritarian societies (where he claimed that leadership, central government and class did not exist) actively defend against the accumulation of private property by, for example, equally distributing within the community a person's possessions when he died, or by not allowing a gift to be sold, bartered or used to create wealth (see Gift economy).\n\n\n=== Mutual aid ===\nIn The Conquest of Bread, Kropotkin proposed a system of economics based on mutual exchanges made in a system of voluntary cooperation. He believed that should a society be socially, culturally, and industrially developed enough to produce all the goods and services required by it, then no obstacle, such as preferential distribution, pricing or monetary exchange will prevent everyone to take what they need from the social product. He supported the eventual abolition of money or tokens of exchange for goods and services.\nKropotkin believed that Bakunin's collectivist economic model was simply a wage system by a different name, and that such a system would breed the same type of centralization and inequality as a capitalist wage system. He stated that it is impossible to determine the value of an individual's contributions to the products of social labor, and thought that anyone who was placed in a position of trying to make such determinations would wield authority over those whose wages they determined. He further developed these ideas in Fields, Factories and Workshops.\nAccording to Kirkpatrick Sale:\n\nWith Mutual Aid especially, and later with Fields, Factories, and Workshops, Kropotkin was able to move away from the absurdist limitations of individual anarchism and no-laws anarchism that had flourished during this period and provide instead a vision of communal anarchism, following the models of independent cooperative communities he discovered while developing his theory of mutual aid. It was an anarchism that opposed centralized government and state-level laws as traditional anarchism did, but understood that at a certain small scale, communities and communes and co-ops could flourish and provide humans with a rich material life and wide areas of liberty without centralized control.\n\n\n=== Self-sufficiency ===\nKropotkin's focus on local production led to his view that a country should strive for self-sufficiency – manufacture its own goods and grow its own food, lessening dependence on imports. To these ends he advocated irrigation and greenhouses to boost local food production ability.\n\n\n== Works ==\n\n\n=== Books ===\n\n\n=== Articles ===\n\n\n=== Pamphlets ===\n\n\n== See also ==\n\nAnarchist communism\nAnarchist schools of thought\nKatorga\nList of Russian anarchists\n\n\n== References ==\n\n\n== Further reading ==\n\n\n=== Books on Kropotkin ===\nMac Laughlin, Jim (2016). Kropotkin and the Anarchist Intellectual Tradition. Pluto Press (UK). ISBN 9780745335131. \nAlan, Barnard (March 2004). \"Mutual Aid and the Foraging Mode of Thought: Re-reading Kropotkin on the Khoisan\". Social Evolution & History. 3 (1): 3–21. \nJoll, James (1980). The Anarchists. Cambridge, MA: Harvard University Press. ISBN 0-674-03641-7. LCCN 80-010503. \nWoodcock, George & Avakumovic, Ivan (1950). The Anarchist Prince: A Biographical Study of Peter Kropotkin. \nMorris, Brian (2004). Kropotkin: the Politics of Community. Humanity Press. \nThe World That Never Was: A True Story of Dreamers, Schemers, Anarchists and Secret Police by Alex Butterworth (Pantheon Books, 2010)\nEngelbert, Arthur (2012). Help! Gegenseitig behindern oder helfen. Eine politische Skizze zur Wahrnehmung heute. Würzburg: Königshausen & Neumann. ISBN 978-3-8260-5017-6. \nCahm, Caroline (1989). Kropotkin and the rise of revolutionary anarchism 1872–1886. Cambridge: Cambridge University Press. ISBN 0 521 36445 0. \nWalter, Nicolas (2004). \"Kropotkin, Peter\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/42326.  (Subscription or UK public library membership required.)\n\n\n=== Journal articles ===\nGould, S.J. (June 1997). \"Kropotkin was no crackpot\". Natural History. 106: 12–21. \nBasic Kropotkin: Kropotkin and the History of Anarchism by Brian Morris, Anarchist Communist Editions pamphlet no.17 (The Anarchist Federation, October 2008).\nEfremenko D., Evseeva Y. Studies of Social Solidarity in Russia: Tradition and Modern Trends. // American Sociologist, v. 43, 2012, no. 4, pp. 349–365. – NY: Springer Science+Business Media.\n\n\n== External links ==", "ns": 0, "pageid": 51074, "title": "Peter Kropotkin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}