{"batchcomplete": "", "query": {"normalized": [{"to": "Peter Glassen", "from": "Peter_Glassen"}], "pages": {"7580142": {"extract": "Peter Glassen (1920–1986) was a professor of philosophy at the University of Manitoba from 1949 until his death in 1986. He was previously (1948–49) a member of the psychology department at the University of Saskatchewan. He developed a considerable reputation as an analytic moral philosopher on the basis of a number of articles published in the late 1950s and early 1960s. He was also known for his arguments against metaphysical materialism.\n\n\n== Early years ==\nBorn in Szeged, Hungary (then the Austro-Hungarian Empire) on October 19, 1920, Glassen emigrated with his parents to Toronto, Canada in 1929, residing on Gladstone Avenue in the city's west end. He graduated from Bloor Collegiate Institute in 1940. Among other academic awards, Glassen received the R.W. Leonard Entrance Scholarship for General Proficiency from the University of Toronto, valued at what was then the very substantial sum of $900. He graduated from the university with a B.A. in 1944 and an M.A. in 1945.\n\n\n== Studies at Harvard ==\nIn 1945, Glassen entered Harvard University, having been awarded the Philip H. Sears scholarship. There he studied with Ralph Barton Perry, C. I. Lewis, Henry D. Aiken, W. T. Stace, Henry Austryn Wolfson and others. In October 1947 he qualified for the A.M. degree and, under Aiken's supervision, continued to work on his doctoral dissertation (\"The Ethics of Shaftesbury and Hutcheson\", later changed to \"The Criterion of Rightness in Action\") for several years, but never completed his Ph.D. due to his commitments as an assistant professor.\n\n\n== Career at the University of Manitoba ==\nGlassen's first set of publications consisted in eight papers published in major philosophical journals in 1957, 1958 and 1959. These reflected his core interests: analytic moral theory (where he was a cognitivist and champion of ordinary language analysis), value theory (particularly the classification of, and distinctions among, moral and non-moral varieties of normative judgment), and epistemology (notably the question of the possibility of synthetic a priori knowledge). There followed a period of reduced activity, with two papers on cognitivism in 1962 and 1963, several reviews for Dialogue from 1963 to 1970, and finally a series of papers on another subject of enduring interest—the refutation of arguments against dualism—between 1976 and 1984. Glassen also authored a number of conference papers, including two that were published in the proceedings of the 12th and 13th meetings of the International Congress of Philosophy, in 1958 and 1963 respectively. Several other papers were unpublished and—with one or two exceptions—are likely lost.\nIn 1961, Glassen travelled to England on a Canada Council grant, meeting with many leading moral philosophers of the time, including Sir David Ross, H. B. Acton and others.\nGlassen's early promise was not entirely realized. This was at least partly due to the lasting effects of a personal tragedy. While returning from Toronto to Winnipeg for the beginning of the 1965-66 school year, Glassen was involved in a car accident that took the life of the other driver. Though not ultimately found at fault, Glassen never fully recovered from the shock. His scholarly output declined and he turned down an opportunity to move to the more prominent department at the University of Toronto in 1967. His career might have faded into complete obscurity had it not been for the development of eliminative materialism by fellow University of Manitoba philosophers Paul Churchland and Patricia Churchland in the 1970s. This aroused his vehement opposition and revived his interest in writing and publishing. After several years of good health, a series of illnesses in 1985-86 brought on a recurrence of depression and alcoholism, leading to his death by suicide on or about March 24, 1986 in Winnipeg.\n\n\n== List of known writings ==\n\n\n== Synopses of Major Articles ==\nSome Questions about Relations (1957) is an analysis of the ontology of relations. Glassen argues that a relation has both properties (e.g. reflexivity (R), symmetry (S), transitivity (T)) and content. There must be content because many relations share the same set of properties while not being the same relation (e.g. \"to the left of\" and \"before\" are both [-R, -S, T]). Thus a relation \"r\" may be defined in terms of content and properties, e.g. as {r =df con, p1, p2, p3}. Glassen proceeds to point out several troubling questions that arise when we try to understand whether the relationship between content and properties is necessary or accidental. He admits in his conclusion that, \"given the Bradleyan flavour of the problems to which it gives rise\", there may be something wrong—and perhaps quite importantly wrong—with the initial distinction between content and properties. This paper was reviewed by Alonzo Church in The Journal of Symbolic Logic 32:3 (Sept. 1968), p. 408.\nA Fallacy in Aristotle's Argument about the Good (1957) is a close analysis of a crucial paragraph in Book I, chapter 7 of Aristotle's Nicomachean Ethics. Glassen argues that Aristotle fails to show (or even to attempt to argue) that it follows from the fact that the function of a good man is activity of the soul in accordance with virtue that the good of man—his final goal—is precisely that function. This reflects Glassen's attention to the distinction between morality and the broader theory of value. Glassen's argument has been referred to in a number of subsequent papers. Aurel Kolnai, referring to the same problem although not specifically to Glassen's paper, called this the \"Aristotelian Equivocation\".\nAre There Unresolvable Moral Disputes? (1962) was influential in the field of ethical objectivism in its introduction of subjective bases of approval on top of the objective bases for approval outlined in emotivist theory - an introduction which made possible the resolution of moral disputes theoretically unresolvable under the emotivist theory. In a way, his work can be seen as straddling the line between emotivism and ethical objectivism.\n\n\n== References ==", "ns": 0, "pageid": 7580142, "title": "Peter Glassen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}