{"batchcomplete": "", "query": {"normalized": [{"to": "Peter van Inwagen", "from": "Peter_van_Inwagen"}], "pages": {"1677156": {"extract": "Peter van Inwagen (born September 21, 1942) is an American analytic philosopher and the John Cardinal O'Hara Professor of Philosophy at the University of Notre Dame. He is also a Research Professor of Philosophy at Duke University each Spring. He previously taught at Syracuse University and earned his PhD from the University of Rochester in 1969 under the direction of Richard Taylor. Van Inwagen is one of the leading figures in contemporary metaphysics, philosophy of religion, and philosophy of action. He was the president of the Society of Christian Philosophers from 2010 to 2013.\n\n\n== Career ==\nHis 1983 monograph An Essay on Free Will played an important role in rehabilitating libertarianism with respect to free will in mainstream analytical philosophy. In the book, Van Inwagen introduces the term incompatibilism about free will and determinism, to stand in contrast to compatibilism - the view that free will is compatible with determinism.\nVan Inwagen's central argument (the Consequence Argument) for this view says that \"If determinism is true, then our acts are the consequences of the laws of nature and events in the remote past. But it is not up to us what went on before we were born, and neither is it up to us what the laws of nature are. Therefore, the consequences of those things (including our present acts) are not up to us.\"\nVan Inwagen also added what he called the Mind Argument (after the philosophical journal Mind where such arguments often appeared). \"The Mind argument proceeds by identifying indeterminism with chance and by arguing that an act that occurs by chance, if an event that occurs by chance can be called an act, cannot be under the control of its alleged agent and hence cannot have been performed freely. Proponents of [this argument] conclude, therefore, that free will is not only compatible with determinism but entails determinism.\"\nThe Consequence Argument and the Mind Argument are the two horns in the classic dilemma and standard argument against free will. If determinism is true, our actions are not free. If indeterminism is true, our actions are random and our will can not be morally responsible for them.\nVan Inwagen concludes that \"Free Will Remains a Mystery.\" In an article written in the third person called \"Van Inwagen on Free Will,\" he describes the problem with his incompatibilist free will if random chance directly causes our actions. He imagines that God causes the universe to revert a thousand times to exactly the same circumstances that it was in at some earlier time and we could observe all the \"replays.\" If the agent's actions are random, she sometimes \"would have agent-caused the crucial brain event and sometimes (in seventy percent of the replays, let us say) she would not have... I conclude that even if an episode of agent causation is among the causal antecedents of every voluntary human action, these episodes do nothing to undermine the prima facie impossibility of an undetermined free act.\"\nIn a paper submitted to The Journal of Ethics entitled \"How to Think about the Problem of Free Will,\" Van Inwagen worries that the concept \"free will\" may be incoherent. He says \"There are seemingly unanswerable arguments that (if they are indeed unanswerable) demonstrate that free will is incompatible with determinism. And there are seemingly unanswerable arguments that ... demonstrate that free will is incompatible with indeterminism. But if free will is incompatible both with determinism and indeterminism, the concept 'free will' is incoherent, and the thing free will does not exist.\"\nIn his book Material Beings, Van Inwagen argues that all material objects are either elementary particles or living organisms. Every composite material object is made up of elementary particles, and the only such composite objects are living organisms. A consequence of this view is that everyday objects such as tables, chairs, cars, buildings, and clouds do not exist. While there seem to be such things, this is only because there are elementary particles arranged in specific ways. For example, where it seems that there is a chair, Van Inwagen says that there are only elementary particles arranged chairwise. These particles do not compose an object, any more than a swarm of bees composes an object. Like a swarm of bees, the particles we call a chair maintain a more or less stable arrangement for a while, which gives the impression of a single object. An individual bee, by contrast, has parts that are unified in the right way to constitute a single object (namely, a bee).\nVan Inwagen gave the 2003 Gifford Lectures; the lectures are published in his The Problem of Evil. There Van Inwagen argues that the argument from evil is a philosophical argument and, like most philosophical arguments, it fails.\nIn recent years, Van Inwagen has shown an interest in the afterlife debate, particularly in relation to resurrection of the body. In his unpublished article, \"I Look for the Resurrection of the Dead and the Life of the World to Come,\" Van Inwagen concludes that Christians must account for some sort of physical continuity in their account of existence of the same person after death. In particular, Van Inwagen notes, this is a problem for the Christian materialist, one who believes that human beings are physical substances.\n\n\n== Awards and honors ==\nHe was elected to the American Academy of Arts and Sciences in 2005 and was President of the Central Division of the American Philosophical Association in 2008/09. He was the President of the Society of Christian Philosophers from 2010 to 2013.\nHe has delivered important named lectures including:\nThe F.D. Maurice Lectures, three lectures delivered at the University of London in March, 1999\nThe Wilde Lectures on Natural Religion, eight lectures delivered at Oxford University in Trinity Term, 2000\nThe Stewart Lectures: three lectures delivered at Princeton University, October 2002\nThe Gifford Lectures, eight lectures delivered at the University of St. Andrews, May 2003\nThe Jellema Lectures: two lectures delivered at Calvin College, March 2004\nThe Münster Lectures in Philosophy, including a student colloquium at the University of Münster, November 2015\nIn May 2011 it was announced that he is to receive an honorary doctorate from the University of St Andrews, Scotland.\n\n\n== Books ==\nExistence: Essays in Ontology. Cambridge: Cambridge University Press. 2014. ISBN 1-1076-2526-2. \nThe Problem of Evil. Oxford: Oxford University Press. 2006. ISBN 0-19-924560-6. \nOntology, Identity, and Modality: Essays in Metaphysics. Cambridge: Cambridge University Press. 2002. ISBN 0-521-79164-2. \nThe Possibility of Resurrection and Other Essays in Christian Apologetics. Boulder, CO: Westview Press. 1998. ISBN 0-8133-2731-8. \nGod, Knowledge and Mystery: Essays in Philosophical Theology. Ithaca: Cornell University Press. 1995. ISBN 0-8014-8186-4. \nMetaphysics. Boulder, CO: Westview Press. 1993. rev. ed. 2002. ISBN 0-8133-9055-9.  \nMaterial Beings. Ithaca: Cornell University Press. 1990. ISBN 0-8014-8306-9. \nAn Essay on Free Will. Oxford: Oxford University Press. 1983. ISBN 0-19-824924-1. \n\n\n== Personal life ==\nVan Inwagen lives in Granger, Indiana, with his wife Elisabeth. Van Inwagen converted to Christianity in 1980.\n\n\n== See also ==\nMereological nihilism\nAmerican philosophy\nList of American philosophers\n\n\n== Notes ==\n\n\n== References ==\nDean Zimmerman, \"Peter van Inwagen\", A Companion to Metaphysics, 2nd ed., ed. by Gary Rosenkrantz, Ernest Sosa, and Jaegwon Kim (Malden, Mass.: Blackwell, 2009), pp. 619–621\n\n\n== External links ==\nOfficial Page at the University of Notre Dame\nThe Problem of Evil, Oxford University Press, 2006. (Gifford Lectures 2002)\nPapers by van Inwagen\nVan Inwagen (Brief professional overview)\nArgument Against Free Will\n\"Metaphysics\" (Entry in the Stanford Encyclopedia of Philosophy)\nInterviews from the PBS program Closer to Truth\nWorks by or about Peter van Inwagen in libraries (WorldCat catalog)", "ns": 0, "pageid": 1677156, "title": "Peter van Inwagen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}