{"batchcomplete": "", "query": {"normalized": [{"to": "Peter Railton", "from": "Peter_Railton"}], "pages": {"5187274": {"extract": "Peter Albert Railton (born May 23, 1950) is an American philosopher who is Gregory S. Kavka Distinguished University Professor and John Stephenson Perrin Professor of Philosophy at the University of Michigan, Ann Arbor, where he has taught since 1979. He has also been a visiting professor at the University of California, Berkeley and Princeton University. He was elected a Fellow of the American Academy of Arts & Sciences in 2004.\n\n\n== Education and Career ==\nHe received his Ph.D. from Princeton in 1980, writing a dissertation under the supervision of David K. Lewis. Although his dissertation concerned scientific explanation, on which he has published several articles, his main research since centers on contemporary metaethics and normative ethics, especially consequentialism. He is the author of the book Facts, Norms, and Values (Cambridge University Press, 2003), a collection of his major papers in ethics, and a co-editor (with Stephen Darwall and Allan Gibbard) of Moral Discourse and Practice: Some Philosophical Approaches (Oxford University Press, 1996).\nA public lecture he gave concerning his own struggles with depression attracted widespread notice and praise in the academic community.\n\n\n== Moral Realism ==\nRailton has playfully described himself as a \"stark, raving moral realist\". However, unlike some moral realists, he thinks moral facts that make moral statements true are natural facts.\n\n\n== Selected publications ==\n1984, \"Alienation, Consequentialism, and the Demands of Morality,\" Philosophy and Public Affairs, Vol. 13, No. 2, pp. 134–171.\n1986, \"Moral Realism,\" The Philosophical Review, Vol. 95, No. 2, pp. 163–207.\n1991, \"Moral Theory As A Moral Practice,\" Noûs, Vol. 25, No. 2, pp. 185–190.\n1992, \"Some Questions About the Justification of Morality,\" Philosophical Perspectives, Vol. 6, pp. 27–53.\n1992, \"Pluralism, Determinacy, and Dilemma,\" Ethics, Vol. 102, No. 4, pp. 720–742.\n1993, \"Noncognitivism about Rationality: Benefits, Costs, and an Alternative,\" Philosophical Issues, Vol. 4, pp. 36–51.\n1994, \"Truth, Reason, and the Regulation of Belief,\" Philosophical Issues, Vol. 5, pp. 71–93.\n1996, \"Moral Realism: Prospects and Problems,\" in Sinnott-Armstrong and Timmons (eds.), Moral Knowledge?, Oxford University Press.\n1996, Moral Discourse and Practice (co-edited with Stephen Darwall and Allan Gibbard), Oxford University Press.\n2003, Facts, Values, and Norms, Cambridge University Press.\n\n\n== References ==\n\n\n== Sources ==\n4 U-M scholars named AAAS fellows\n\n\n== External links ==\nVideo interview/discussion with Railton on Bloggingheads.tv", "ns": 0, "pageid": 5187274, "title": "Peter Railton"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}