{"batchcomplete": "", "query": {"normalized": [{"to": "Peter Sloterdijk", "from": "Peter_Sloterdijk"}], "pages": {"962308": {"extract": "Peter Sloterdijk (German: [ˈsloːtɐˌdaɪk]; born 26 June 1947) is a German philosopher and cultural theorist. He is a professor of philosophy and media theory at the University of Art and Design Karlsruhe. He co-hosted the German television show Im Glashaus: Das Philosophische Quartett from 2002 until 2012.\n\n\n== Biography ==\nSloterdijk's father is Dutch. He studied philosophy, German studies and history at the University of Munich and the University of Hamburg from 1968 to 1974. In 1975 he received his PhD from the University of Hamburg. In the 1980s he worked as a freelance writer, and published his Kritik der zynischen Vernunft in 1983. He has since published a number of philosophical works acclaimed in Germany. In 2001 he was named chancellor of the University of Art and Design Karlsruhe, part of the Center for Art and Media Karlsruhe. In 2002 he began to co-host Im Glashaus: Das Philosophische Quartett (\"In the Glass House: The Philosophical Quartet\"), a show on the German ZDF television channel devoted to discussing key contemporary issues in-depth.\n\n\n== Philosophical stance ==\nSloterdijk rejects the existence of dualisms—body and soul, subject and object, culture and nature, etc.—since their interactions, \"spaces of coexistence\", and common technological advancement create hybrid realities. Sloterdijk's ideas are sometimes referred to as posthumanism, and seek to integrate different components that have been, in his opinion, erroneously considered detached from each other. Consequently, he proposes the creation of an \"ontological constitution\" that would incorporate all beings—humans, animals, plants, and machines.\n\n\n== Philosophical style ==\nIn the style of Nietzsche, Sloterdijk remains convinced that contemporary philosophers have to think dangerously and let themselves be \"kidnapped\" by contemporary \"hyper-complexities\": they must forsake our present humanist and nationalist world for a wider horizon at once ecological and global. Sloterdijk's philosophical style strikes a balance between the firm academicism of a scholarly professor and a certain sense of anti-academicism (witness his ongoing interest in the ideas of Osho, of whom he became a disciple in the late seventies). Taking a sociological stance, Andreas Dorschel sees Sloterdijk's timely innovation at the beginning of the 21st century in having introduced the principles of celebrity into philosophy. Sloterdijk himself, viewing exaggeration to be required in order to catch attention, describes the way he presents his ideas as \"hyperbolic\" (hyperbolisch).\n\n\n== Individual works ==\n\n\n=== Critique of Cynical Reason ===\nThe Kritik der zynischen Vernunft, published by Suhrkamp in 1983 (and in English as Critique of Cynical Reason, 1988), became the best-selling work on philosophy in the German language since the Second World War and launched Sloterdijk's career as an author.\n\n\n=== Spheres ===\nThe trilogy Spheres is the philosopher's magnum opus. The first volume was published in 1998, the second in 1999, and the last in 2004.\nSpheres is about \"spaces of coexistence\", spaces commonly overlooked or taken for granted that conceal information crucial to developing an understanding of the human. The exploration of these spheres begins with the basic difference between mammals and other animals: the biological and utopian comfort of the mother's womb, which humans try to recreate through science, ideology, and religion. From these microspheres (ontological relations such as fetus-placenta) to macrospheres (macro-uteri such as nations or states), Sloterdijk analyzes spheres where humans try but fail to dwell and traces a connection between vital crisis (e.g., emptiness and narcissistic detachment) and crises created when a sphere shatters.\nSloterdijk has said that the first paragraphs of Spheres are \"the book that Heidegger should have written\", a companion volume to Being and Time, namely, \"Being and Space\". He was referring to his initial exploration of the idea of Dasein, which is then taken further as Sloterdijk distances himself from Heidegger's positions.\n\n\n=== Globalization ===\nSloterdijk also argues that the current concept of globalization lacks historical perspective. In his view it is merely the third wave in a process of overcoming distances (the first wave being the metaphysical globalization of the Greek cosmology and the second the nautical globalization of the 15th century). The difference for Sloterdijk is that, while the second wave created cosmopolitanism, the third is creating a global provincialism. Sloterdijk's sketch of a philosophical history of globalization can be found in Im Weltinnenraum des Kapitals (2005; translated as In the World Interior of Capital), subtitled \"Die letzte Kugel\" (\"The final sphere\").\n\n\n=== Rage and Time ===\nIn his Zorn und Zeit (translated as Rage and Time), Sloterdijk characterizes the emotion of rage as a psychopolitical force throughout human history. The political aspects are especially pronounced in the Western tradition, beginning with the opening words of Homer's Iliad, \"Of the rage of Achilles, son of Peleus, sing, O Goddess...\". Sloterdijk acknowledges the contributions of psychoanalysis for our understanding of strong emotional attitudes: \"In conformity with its basic erotodynamic approach, psychoanalysis brought much hatred to light, the other side of life.\" (Rage and Time, p. 14) Importantly, for Sloterdijk, Judeo-Christian conceptions of God ultimately \"piggyback\" on the feelings of rage and resentment, creating \"metaphysical revenge banks\". For Sloterdijk, \"God thus becomes the location of a transcendent repository of suspended human rage-savings and frozen plans of revenge.\" \n\n\n== Genetics dispute ==\nShortly after Sloterdijk conducted a symposium on philosophy and Heidegger, he stirred up controversy with his essay \"Regeln für den Menschenpark\" (\"Rules for the Human Park\"). In this text, Sloterdijk regards cultures and civilizations as \"anthropogenic hothouses,\" installations for the cultivation of human beings; just as we have established wildlife preserves to protect certain animal species, so too ought we to adopt more deliberate policies to ensure the survival of Aristotle's zoon politikon.\n\"The taming of man has failed\", Sloterdijk laments. \"Civilisation's potential for barbarism is growing; the everyday bestialisation of man is on the increase.\"\nBecause of the eugenic policies of the Nazis in Germany's recent history, such discussions are seen in Germany as carrying a sinister load. Breaking a German taboo on the discussion of genetic manipulation, Sloterdijk's essay suggests that the advent of new genetic technologies requires more forthright discussion and regulation of \"bio-cultural\" reproduction. In the eyes of Habermas, this made Sloterdijk a \"fascist\". Sloterdijk replied that this was, itself, resorting to \"fascist\" tactics to discredit him.\nThe core of the controversy was not only Sloterdijk's ideas but also his use of the German words Züchtung (\"breeding\", \"cultivation\") and Selektion (\"selection\"). Sloterdijk rejected the accusation of Nazism, which he considered alien to his historical context. Still, the paper started a controversy in which Sloterdijk was strongly criticized, both for his alleged usage of a fascist rhetoric to promote Plato's vision of a government with absolute control over the population, and for committing a non-normative, simplistic reduction of the bioethical issue itself. This second criticism was based on the vagueness of Sloterdijk's position on how exactly society would be affected by developments in genetic science. After the controversy multiplied positions both for and against him, Die Zeit published an open letter from Sloterdijk to Habermas in which he vehemently accused Habermas of \"criticizing behind his back\" and espousing a view of humanism that Sloterdijk had declared dead.\n\n\n== Welfare state dispute ==\nAnother dispute emerged after Sloterdijk's article \"Die Revolution der gebenden Hand\" (13 June 2009; transl. \"The revolution of the giving hand\") in the Frankfurter Allgemeine, one of Germany's most widely read newspapers. There Sloterdijk claimed that the national welfare state is a \"fiscal kleptocracy\" that had transformed the country into a \"swamp of resentment\" and degraded its citizens into \"mystified subjects of tax law\".\nSloterdijk opened the text with the famous quote of leftist critics of capitalism (made famous in the 19th century by Proudhon in his \"What Is Property?\") \"Property is theft\", stating, however, that it is nowadays the modern state that is the biggest taker. \"We are living in a fiscal grabbing semi-socialism – and nobody calls for a fiscal civil war.\"\nHe repeated his statements and stirred up the debate in his articles titled \"Kleptokratie des Staates\" (transl. \"Kleptocracy of the state\") and \"Aufbruch der Leistungsträger\" (transl. \"Uprising of the performers\") in the German monthly Cicero – Magazin für politische Kultur.\nAccording to Sloterdijk, the institutions of the welfare state lend themselves to a system that privileges the marginalized, but relies, unsustainably, on the class of citizens who are materially successful. Sloterdijk's provocative recommendation was that income taxes should be deeply reduced, the difference being made up by donations from the rich in a system that would reward higher givers with social status. Achievers would be praised for their generosity, rather than being made to feel guilty for their success, or resentful of society's dependence on them.\nIn January 2010, an English translation was published, titled \"A Grasping Hand – The modern democratic state pillages its productive citizens\", in Forbes and in the Winter 2010 issue of City Journal.\nSloterdijk's 2010 book, Die nehmende Hand und die gebende Seite, contains the texts that triggered the 2009–2010 welfare state dispute.\n\n\n== Sex and feminism ==\nIn September 2016, Sloterdijk published the e-mail novel The Schelling Project. The semi-autobiographical text contains a self-portrait of the author, appearing as \"Peer Sloterdijk\"; several of Sloterdijk's friends such as Thomas Macho, Siegfried Mauser and Michaela Boenke figure in the novel in slight disguise. Together, so the plot goes, they draft a research proposal to the German Research Funding Agency (Deutsche Forschungsgemeinschaft) on the evolution of the female orgasm. To make it look more profound and thus to impress the reviewers, the team fakes a connection of the issue to the metaphysics of the German idealist philosopher Friedrich Wilhelm Joseph Schelling. The reviewers, though, see through the mystification and turn down the application. Following the rejection, the team splits and each of its members takes his or her own course. While Sloterdijk's e-mail novel about an academic hoax was rated mediocre in terms of literary quality, it came to be seen more as a political statement, specifically as an attack on gender mainstreaming in 21st century Germany. Critic Elke Schmitter, in a review article for Der Spiegel under the heading 'Woman as an Old Boys' Joke', described Sloterdijk's text as an anti-feminist pamphlet thinly veiled as a novel. In an interview with Süddeutsche Zeitung Sloterdijk defended himself against the charges and claimed his attitude towards women to be adoration rather than contempt.\n\n\n== Honours and awards ==\n1993: Ernst Robert Curtius Prize for Essay Writing\n2000: Friedrich Märker Prize for Essay Writing\n2001: Christian Kellerer Prize for the future of philosophical thought\n2005: Business Book Award for the Financial Times Deutschland\n2005: Sigmund Freud Prize for Scientific Prose\n2005: Austrian Decoration for Science and Art\n2006: Commander of the Ordre des Arts et des Lettres\n2008: Lessing Prize for Criticism\n2008: Cicero Prize\n2008: International Mendelssohn Prize in Leipzig (category Social Responsibility)\n2009: BDA award for architectural criticism\n2013: Ludwig-Börne-Prize\n\n\n== Film appearances ==\nMarx Reloaded, Arte, April 2011\n\n\n== List of works ==\n\n\n=== Works in English translation ===\nCritique of Cynical Reason, translation by Michael Eldred ; foreword by Andreas Huyssen, Minneapolis, University of Minnesota Press, 1988. ISBN 0-8166-1586-1\nThinker on Stage: Nietzsche's Materialism, translation by Jamie Owen Daniel; foreword by Jochen Schulte-Sasse, Minneapolis, University of Minnesota Press, 1989. ISBN 0-8166-1765-1\nTheory of the Post-War Periods: Observations on Franco-German relations since 1945, translation by Robert Payne; foreword by Klaus-Dieter Müller, Springer, 2008. ISBN 3-211-79913-3\nTerror from the Air, translation by Amy Patton, Los Angeles, Semiotext(e), 2009. ISBN 1-58435-072-5\nGod's Zeal: The Battle of the Three Monotheisms, Polity Pr., 2009. ISBN 978-0-7456-4507-0\nDerrida, an Egyptian, Polity Pr., 2009. ISBN 0-7456-4639-5\nRage and Time, translation by Mario Wenning, New York, Columbia University Press, 2010. ISBN 978-0-231-14522-0\nNeither Sun nor Death, translation by Steven Corcoran, Semiotext(e), 2011. ISBN 978-1-58435-091-0 – Sloterdijk answers questions posed by German writer Hans-Jürgen Heinrichs, commenting on such issues as technological mutation, development media, communication technologies, and his own intellectual itinerary.\nBubbles: Spheres Volume I: Microspherology, translation by Wieland Hoban, Los Angeles, Semiotext(e), 2011. ISBN 1-58435-104-7\nThe Art of Philosophy: Wisdom as a Practice, translation by Karen Margolis, New York, Columbia University Press, 2012. ISBN 978-0-231-15870-1\nYou Must Change Your Life, translation by Wieland Hoban, Cambridge, Polity Press, 2013. ISBN 978-0-7456-4921-4\nIn the World Interior of Capital: Towards a Philosophical Theory of Globalization, translation by Wieland Hoban, Cambridge, Polity Press, 2013. ISBN 978-0-7456-4769-2\nNietzsche Apostle, (Semiotext(e)/Intervention Series), translation by Steve Corcoran, Los Angeles, Semiotext(e), 2013. ISBN 978-1-58435-099-6\nGlobes: Spheres Volume II: Macrospherology, translation by Wieland Hoban, Los Angeles, Semiotext(e), 2014. ISBN 1-58435-160-8\nNot Saved: Essays after Heidegger, translation by Ian Alexander Moore and Christopher Turner, Cambridge, Polity Press, forthcoming 2016.\n\n\n=== Original German titles ===\nKritik der zynischen Vernunft, 1983.\nDer Zauberbaum. Die Entstehung der Psychoanalyse im Jahr 1785, 1985.\nDer Denker auf der Bühne. Nietzsches Materialismus, 1986. (Thinker on Stage: Nietzsche's Materialism)\nKopernikanische Mobilmachung und ptolmäische Abrüstung, 1986.\nZur Welt kommen – Zur Sprache kommen. Frankfurter Vorlesungen, 1988.\nEurotaoismus. Zur Kritik der politischen Kinetik, 1989.\nVersprechen auf Deutsch. Rede über das eigene Land, 1990.\nWeltfremdheit, 1993.\nFalls Europa erwacht. Gedanken zum Programm einer Weltmacht am Ende des Zeitalters seiner politischen Absence, 1994.\nScheintod im Denken – Von Philosophie und Wissenschaft als Übung, Frankfurt am Main (Suhrkamp), 1995.\nIm selben Boot – Versuch über die Hyperpolitik, Frankfurt am Main (Suhrkamp), 1995.\nSelbstversuch, Ein Gespräch mit Carlos Oliveira, 1996.\nDer starke Grund zusammen zu sein. Erinnerungen an die Erfindung des Volkes, 1998.\nSphären I – Blasen, Mikrosphärologie, 1998. (Spheres I)\nSphären II – Globen, Makrosphärologie, 1999. (Spheres II)\nRegeln für den Menschenpark. Ein Antwortschreiben zu Heideggers Brief über den Humanismus, 1999.\nDie Verachtung der Massen. Versuch über Kulturkämpfe in der modernen Gesellschaft, 2000.\nÜber die Verbesserung der guten Nachricht. Nietzsches fünftes Evangelium. Rede zum 100. Todestag von Friedrich Nietzsche, 2000.\nNicht gerettet. Versuche nach Heidegger, 2001.\nDie Sonne und der Tod, Dialogische Untersuchungen mit Hans-Jürgen Heinrichs, 2001.\nTau von den Bermudas. Über einige Regime der Phantasie, 2001.\nLuftbeben. An den Wurzeln des Terrors, 2002.\nSphären III – Schäume, Plurale Sphärologie, 2004. (Spheres III)\nIm Weltinnenraum des Kapitals, 2005.\nWas zählt, kehrt wieder. Philosophische Dialogue, with Alain Finkielkraut (from French), 2005.\nZorn und Zeit. Politisch-psychologischer Versuch, 2006. ISBN 3-518-41840-8\nDer ästhetische Imperativ, 2007.\nDerrida Ein Ägypter, 2007.\nGottes Eifer. Vom Kampf der drei Monotheismen, Frankfurt am Main (Insel), 2007.\nTheorie der Nachkriegszeiten, (Suhrkamp), 2008.\nDu mußt dein Leben ändern, Frankfurt am Main (Suhrkamp), 2009.\nPhilosophische Temperamente Von Platon bis Foucault, München (Diederichs) 2009. ISBN 978-3-424-35016-6\nScheintod im Denken, Von Philosophie und Wissenschaft als Ubung (Suhrkamp), 2010.\nDie nehmende Hand und die gebende Seite, (Suhrkamp), 2010.\nDie schrecklichen Kinder der Neuzeit, (Suhrkamp), 2014.\nWas geschah im 20. Jahrhundert? Unterwegs zu einer Kritik der extremistischen Vernunft, (Suhrkamp), 2016.\n\n\n== References ==\n\n\n== External links ==\n Media related to Peter Sloterdijk at Wikimedia Commons\n Quotations related to Peter Sloterdijk at Wikiquote\nPeter Sloterdijk website\nPeter Sloterdijk at the Internet Movie Database\nThe Grasping Hand, by Peter Sloterdijk, City Journal, Winter 2010\nSee Stefan Lorenz Sorgner, \"In Search of Lost Cheekiness, An Introduction to Peter Sloterdijk's Critique of Cynical Reason\", in: Tabula Rasa, 20 (2003)\nThe Operable Man, a Sloterdijk essay on the Ethical State of Gene Technology\nReview of Bubbles, in: Los Angeles Review of Books\nEurope’s Times and Unknown Waters, Cluj-Napoca, Braşoveanu, Narcisa (April 2009). \"The Narcissistic and the Cynical Attitudes – Two Identitary Masks, Gilles Lipovetsky, L'ère du vide. Essais sur l'individualisme contemporain and Peter Sloterdijk, Kritik der zynischen Vernunft\"\nTopics: Spheres (Feb/Mar 2005) (interview)\nBarthélémy on Sloterdijk & Stiegler\nPeter Sloterdijk; Esferas, helada cósmica y políticas de climatización - Colección Novatores, Nº 28 - 2008, Ed. Institución Alfons el Magnànim (IAM) – Adolfo Vásquez Rocca PhD.\nMichel Weber, \"The Art of Philosophy—Critical review,\" Cosmos and History: The Journal of Natural and Social Philosophy, vol. 10, no. 2, 2014, pp. 327–333.", "ns": 0, "pageid": 962308, "title": "Peter Sloterdijk"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}