{"batchcomplete": "", "query": {"normalized": [{"to": "Petr Hájek", "from": "Petr_Hájek"}], "pages": {"19471069": {"extract": "Petr Hájek (born 6 February 1940 in Prague; Czech pronunciation: [ˈpɛtr̩ ˈɦaːjɛk]) is a Czech scientist in the area of mathematical logic and a professor of mathematics. He worked at the Institute of Computer Science at the Academy of Sciences of the Czech Republic and as a lecturer at the Faculty of Mathematics and Physics at the Charles University in Prague and at the Faculty of Nuclear Sciences and Physical Engineering of the Czech Technical University in Prague.\n\n\n== Academics ==\nPetr Hájek studied at the Faculty of Mathematics and Physics of the Charles University in Prague Influenced by Petr Vopěnka, he specialized in set theory, arithmetic, later also in logic and artificial intelligence. He contributed to establishing the mathematical fundamentals of fuzzy logic. Following the Velvet Revolution he was appointed a senior lecturer (1993), and a professor (1997). From 1992 to 2000 he held the position of chairman of the Institute of Computer Science at the Academy of Sciences of the Czech Republic. From 1996 to 2003 he was also president of the Kurt Gödel Society.\nLater he graduated from Academy of Performing Arts in Prague, where he studied Pipe organ under Jiří Reinberger to become an organ player in a church.\n\n\n== Awards ==\n2002, Medal of the Minister of Education of the Czech Republic\n2006, Medal of Merit, third grade, in the area of sciences by President of the Czech Republic Václav Klaus\n2008, doctor honoris causa from Silesian University in Opava\n\n\n== Papers ==\nHájek, Petr; Kalášek, Pavel; Kůrka, Petr (1960). O dynamické logice. Praha: Academia. \nVopěnka, Petr; Hájek, Petr (1972). The Theory of Semisets. Trans. Jech, T. and Rousseau, G. Praha: Academia. \nHájek, Petr; Havránek, Tomáš; Chytil, Metoděj K. (1983). Metoda GUHA: automatická tvorba hypotéz. Praha: Academia. \nHájek, Petr; Pudlák, Pavel (1993). Metamatemathics of First-Order Arithmetic. Berlin: Springer. \n\n\n== See also ==\nSemiset\n\n\n== References ==\n\n\n== External links ==\nPetr Hájek's former webpage\nDatabases of the National Library of the Czech Republic", "ns": 0, "pageid": 19471069, "title": "Petr Hájek"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}