{"batchcomplete": "", "query": {"normalized": [{"to": "Petrus Ramus", "from": "Petrus_Ramus"}], "pages": {"311650": {"extract": "Petrus Ramus (French: Pierre de la Ramée; Anglicized to Peter Ramus /ˈreɪməs/; 1515 – 26 August 1572) was an influential French humanist, logician, and educational reformer. A Protestant convert, he was killed during the St. Bartholomew's Day Massacre.\n\n\n== Early life ==\nHe was born at the village of Cuts in Picardy; his father was a farmer. He gained admission at age twelve (thus about 1527) to the Collège de Navarre, working as a servant. A reaction against scholasticism was in full tide, at a transitional time for Aristotelianism. On the occasion of receiving his degree in 1536, Ramus allegedly took as his thesis Quaecumque ab Aristotele dicta essent, commentitia esse, which Walter J. Ong paraphrases as follows:\n\"All the things that Aristotle has said are inconsistent because they are poorly systematized and can be called to mind only by the use of arbitrary mnemonic devices.\"\nAccording to Ong this kind of spectacular thesis was in fact routine at the time. Even so, Ong raises questions as to whether Ramus actually ever delivered this thesis.\n\n\n== Early academic career ==\nRamus, as graduate of the university, started courses of lectures. At this period he was engaged in numerous separate controversies. One opponent in 1543 was the Benedictine Joachim Périon. He was accused, by Jacques Charpentier, professor of medicine, of undermining the foundations of philosophy and religion. Arnaud d'Ossat, a pupil and friend of Ramus, defended him against Charpentier. Ramus was made to debate Goveanus (Antonio de Gouveia), over two days. The matter was brought before the parlement of Paris, and finally before Francis I. By him it was referred to a commission of five, who found Ramus guilty of having \"acted rashly, arrogantly and impudently,\" and interdicted his lectures (1544).\n\n\n== Royal support ==\nHe withdrew from Paris, but soon afterwards returned, the decree against him being canceled by Henry II, who came to the throne in 1547, through the influence of Charles, Cardinal of Lorraine. He obtained a position at the Collège de Navarre.\nIn 1551 Henry II appointed him a regius professor at the university but he preferred to call himself a professor of philosophy and eloquence at the Collège de France, where for a considerable time he lectured before audiences numbering as many as 2,000. Pierre Galland, another professor there, published Contra novam academiam Petri Rami oratio (1551), and called him a \"parricide\" for his attitude to Aristotle. The more serious charge was that he was a nouveau academicien, in other words a sceptic. Audomarus Talaeus (Omer Talon c.1510–1581), a close ally of Ramus, had indeed published a work in 1548 derived from Cicero's description of Academic scepticism, the school of Arcesilaus and Carneades.\n\n\n== After conversion ==\nIn 1561 he faced significant enmity following his adoption of Protestantism. He had to flee from Paris; and, though he found an asylum in the palace of Fontainebleau, his house was pillaged and his library burned in his absence. He resumed his chair after this for a time, but in 1568 the position of affairs was again so threatening that he found it advisable to ask permission to travel.\nHe spent around two years, in Germany and Switzerland. The Second Helvetic Confession earned his disapproval, in 1571, rupturing his relationship with Theodore Beza and leading Ramus to write angrily to Heinrich Bullinger.\nReturning to France, he fell a victim in the St. Bartholomew's Day Massacre (1572). Hiding for a while in a bookshop off the Rue St Jacques, he returned to his lodgings, on 26 August, the third day of the violence. There he was stabbed while at prayer. Suspicions against Charpentier have been voiced ever since.\n\n\n== Pedagogue ==\nA central issue is that Ramus's anti-Aristotelianism arose out of a concern for pedagogy. Aristotelian philosophy, in its Early Modern form as scholasticism showing its age, was in a confused and disordered state. Ramus sought to infuse order and simplicity into philosophical and scholastic education by reinvigorating a sense of dialectic as the overriding logical and methodological basis for the various disciplines.\nHe published in 1543 the Aristotelicae Animadversiones and Dialecticae Partitiones, the former a criticism on the old logic and the latter a new textbook of the science. What are substantially fresh editions of the Partitiones appeared in 1547 as Institutiones Dialecticae, and in 1548 as Scholae Dialecticae; his Dialectique (1555), a French version of his system, is the earliest work on the subject in the French language.\nIn the \"Dialecticae partitiones,\" Ramus recommends the use of summaries, headings, citations and examples. Ong calls Ramus's use of outlines, \"a reorganization of the whole of knowledge and indeed of the whole human lifeworld.\"\nAfter studying Ramus's work, Ong concluded that the results of his \"methodizing\" of the arts \"are the amateurish works of a desperate man who is not a thinker but merely an erudite pedagogue\". On the other hand, his work had an immediate impact on the issue of disciplinary boundaries, where educators largely accepted his arguments, by the end of the century.\n\n\n== Logician ==\nThe logic of Ramus enjoyed a great celebrity for a time, and there existed a school of Ramists boasting numerous adherents in France, Germany, Switzerland, and the Netherlands. It cannot be said, however, that Ramus's innovations mark any epoch in the history of logic, and there is little ground for his claim to supersede Aristotle by an independent system of logic. The distinction between natural and artificial logic, i.e., between the implicit logic of daily speech and the same logic made explicit in a system, passed over into the logical handbooks.\nHe amends the syllogism. He admits only the first three figures, as in the original Aristotelian scheme, and in his later works he also attacks the validity of the third figure, following in this the precedent of Laurentius Valla. Ramus also set the modern fashion of deducing the figures from the position of the middle term in the premises, instead of basing them, as Aristotle does, upon the different relation of the middle to the major term and minor term.\n\n\n== Rhetorician ==\nAs James Jasinski explains, \"the range of rhetoric began to be narrowed during the 16th century, thanks in part to the works of Peter Ramus.\"  In using the word \"narrowed,\" Jasinski is referring to Ramus argument for divorcing rhetoric from dialectic (logic), a move that had far reaching implications for rhetorical studies and for popular conceptions of public persuasion. Contemporary rhetoricians have tended to reject Ramus's view in favor of a more wide ranging (and in many respects, Aristotelian) understanding of the rhetorical arts as encompassing \"a [broad] range of ordinary language practices.\"  Rhetoric, traditionally, had had five parts, of which inventio (invention) was the first. Ramus insisted on rhetoric to be studied alongside dialectic through two main manuals: invention and judgement under the dialectic manual, and style and delivery in the rhetoric manual. Memory, one of the five skills of traditional rhetoric, was regarded by Ramus as being part of psychology, as opposed to being part of rhetoric, and thus dispensed form his idea of rhetoric and dialectic. Brian Vickers said that the Ramist influence here did add to rhetoric: it concentrated more on the remaining aspect of elocutio or effective use of language, and emphasised the role of vernacular European languages (rather than Latin). Ramist reforms strengthened the rhetoricians' tendency to focus on style. The effect was that rhetoric was applied in literature.\nInvention involves fourteen topics, including definition, cause, effect, subject, adjunct, difference, contrary, comparison, similarity, and testimony. Style encompasses four tropes: metaphor, synecdoche, metonymy, and irony. It also includes rules for poetic meter and rhythmical prose, figures corresponding to attitudes a speaker may take, and of repetition. Delivery covers the use of voice and gestures.\nHis rhetorical leaning is seen in the definition of logic as the ars disserendi; he maintains that the rules of logic may be better learned from observation of the way in which Cicero persuaded his hearers than from a study of Aristotle's works on logic (the Organon).\nLogic falls, according to Ramus, into two parts: invention (treating of the notion and definition) and judgment (comprising the judgment proper, syllogism and method). Here he was influenced by Rodolphus Agricola. This division gave rise to the jocular designation of judgment or mother-wit as the \"secunda Petri\". But what Ramus does here in fact redefines rhetoric. There is a new configuration, with logic and rhetoric each having two parts: rhetoric was to cover elocutio and pronuntiatio. In general, Ramism liked to deal with binary trees as method for organising knowledge.\n\n\n== Mathematician ==\nHe was also known as a mathematician, a student of Johannes Sturm. It has been suggested that Sturm was an influence in another way, by his lectures given in 1529 on Hermogenes of Tarsus: the Ramist method of dichotomy is to be found in Hermogenes.\nHe had students of his own. He corresponded with John Dee on mathematics, and at one point recommended to Elizabeth I that she appoint him to a university chair.\nThe views of Ramus on mathematics implied a limitation to the practical: he considered Euclid's theory on irrational numbers to be useless. The emphasis on technological applications and engineering mathematics was coupled to an appeal to nationalism (France was well behind Italy, and needed to catch up with Germany).\n\n\n== Ramism ==\n\nThe teachings of Ramus had a broadly based reception well into the seventeenth century. Later movements, such as Baconianism, pansophism, and Cartesianism, in different ways built on Ramism, and took advantage of the space cleared by some of the simplifications (and oversimplifications) it had effected. The longest-lasting strand of Ramism was in systematic Calvinist theology, where textbook treatments with a Ramist framework were still used into the eighteenth century, particularly in New England.\nThe first writings on Ramism, after the death of Ramus, included biographies, and were by disciples of sorts: Freigius (1574 or 1575), Banosius (1576), Nancelius (1599), of whom only Nancelius was closely acquainted with the man. Followers of Ramus in different fields included Caspar Olevianus, Johannes Piscator, Hieronymus Treutler, Johannes Althusius, the statesman Emdens, and John Milton.\n\n\n== Works ==\nHe published fifty works in his lifetime and nine appeared after his death. Ong undertook the complex bibliographical task of tracing his books through their editions.\nAristotelicae Animadversiones (1543)\nBrutinae questiones (1547)\nRhetoricae distinctiones in Quintilianum (1549)\nDialectique (1555)\nArithmétique (1555)\nDe moribus veterum Gallorum (Paris, 1559; second edition, Basel, 1572)\nLiber de Cæsaris Militia Paris, 1584\nAdvertissement sur la réformation de l'université de Paris, au Roy, Paris, (1562)\nThree grammars: Grammatica latina (1548), Grammatica Graeca (1560), Grammaire Française (1562)\nScolae physicae, metaphysicae, mathematicae (1565, 1566, 1578)\nProoemium mathematicum (Paris, 1567)\nScholarum mathematicarum libri unus et triginta (Basel, 1569) (his most famous work)\nCommentariorum de religione christiana (Frankfurt, 1576)\n\n\n== See also ==\nMnemonics\nRamism\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"article name needed\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== Further reading ==\nNelly Bruyère, Méthode et dialectique dans l'oeuvre de La Ramée: Renaissance et Age classique, Paris, Vrin 1984\nDesmaze, Charles. Petrus Ramus, professeur au Collège de France, sa vie, ses ecrits, sa mort (Paris, 1864).\nFreedman, Joseph S. Philosophy and the Arts in Central Europe, 1500-1700: Teaching and Texts at Schools and Universities (Ashgate, 1999).\nGraves, Frank Pierrepont. Peter Ramus and the Educational Reformation of the Sixteenth Century (Macmillan, 1912).\nHøffding, Harald. History of Modern Philosophy (English translation, 1900), vol. i.185.\nHoward Hotson, Commonplace Learning: Ramism and Its German Ramifications, 1543–1630 (Oxford: Oxford University Press, 2007).\nLobstein, Paul. Petrus Ramus als Theolog (Strassburg, 1878).\nMiller, Perry. The New England Mind (Harvard University Press, 1939).\nMilton, John. A Fuller Course in the Art of Logic Conformed to the Method of Peter Ramus (London, 1672). Ed. and trans. Walter J. Ong and Charles J. Ermatinger. Complete Prose Works of John Milton: Volume 8. Ed. Maurice Kelley. New Haven: Yale UP, 1982. p. 206-407.\nOng, Walter J. (1982). Orality and literacy: The technologizing of the word. New York: Methuen.(p. viii).\n---.Ramus, Method, and the Decay of Dialogue: From the Art of Discourse to the Art of Reason (Harvard University Press, 1958; reissued with a new foreword by Adrian Johns, University of Chicago Press, 2004.[3] ISBN 0-226-62976-7).\n---. Ramus and Talon Inventory (Harvard University Press, 1958).\n\nOwen, John. The Skeptics of the French Renaissance (London, 1893).\nPranti, K. \"Uber P. Ramus\" in Munchener Sitzungs berichte (1878).\nSaisset, Émile. Les précurseurs de Descartes (Paris, 1862).\nSharratt, Peter. \"The Present State of Studies on Ramus,\" Studi francesi 47-48 (1972) 201-13.\n—. \"Recent Work on Peter Ramus (1970–1986),\" Rhetorica: A Journal of the History of Rhetoric 5 (1987): 7-58.\n—. \"Ramus 2000,\" Rhetorica: A Journal of the History of Rhetoric 18 (2000): 399-455.\n\nVoigt. Uber den Ramismus der Universität Leipzig (Leipzig, 1888).\nWaddington, Charles De Petri Rami vita, scriptis, philosophia (Paris, 1848).\n\n\n== External links ==\nWorks by Petrus Ramus at Project Gutenberg\nWorks by or about Petrus Ramus at Internet Archive\n'Ramism' entry in The Dictionary of the History of Ideas\nSellberg, Erland. \"Petrus Ramus\". Stanford Encyclopedia of Philosophy. \nPetrus Ramus at the Mathematics Genealogy Project\nCatholic Encyclopedia entry\nCharles Waddington, Ramus (Pierre de la Ramée) sa vie, ses écrits et ses opinions (1855)", "ns": 0, "pageid": 311650, "title": "Petrus Ramus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}