{"batchcomplete": "", "query": {"normalized": [{"to": "Phaleas of Chalcedon", "from": "Phaleas_of_Chalcedon"}], "pages": {"21751690": {"extract": "Phaleas of Chalcedon (Greek: Φαλέας ὁ Χαλκηδόνιος; fl. likely in early 4th century BCE) was a Greek statesman of antiquity, who argued that all citizens of a model city should be equal in property and education.\nThe only surviving reference to Phaleas of Chalcedon appears in Aristotle's Politics. According to Aristotle, Phaleas argued that an equal division of land and equal education for all citizens would eliminate civil strife. Although Phaleas recognized that such a radical constitution would be difficult to implement in established cities, he believed it would be practicable in newly founded cities. In established cities, Phaleas recommended setting up dowries for the rich to give to the poor in order to level property ownership over time. In addition to equality of land and education, Phaleas proposed that all artisans be publicly owned slaves.\nAristotle criticized several aspects of Phaleas' proposed constitution. Aristotle argued that while leveling land ownership would appease the poor, it would lead to insurrection among the rich who were to be dispossessed and who viewed their wealth as a right of nobility. Rather, in order to eliminate civil strife, society must educate the populace in such a way as to control want and greed; the poor must be taught to accept their station and the rich not to become overly greedy. Aristotle further argued that equal distribution of land does not achieve equality of property, as other assets, such as cattle, furniture and slaves, are also of value; if property were to be regulated, one should regulate all types of property.\n\n\n== See also ==\nPolis\n\n\n== References ==", "ns": 0, "pageid": 21751690, "title": "Phaleas of Chalcedon"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}