{"batchcomplete": "", "query": {"normalized": [{"to": "Philip Mazzei", "from": "Philip_Mazzei"}], "pages": {"2730615": {"extract": "Filippo Mazzei (Italian pronunciation: [matˈtsei], but sometimes erroneously cited with the name of Philip Mazzie; December 25, 1730 – March 19, 1816) was an Italian physician. A close friend of Thomas Jefferson, Mazzei acted as an agent to purchase arms for Virginia during the American Revolutionary War.\n\n\n== Biography ==\nMazzei was born Filippo Mazzei in Poggio a Caiano in Tuscany as a son of Domenico and Elisabetta. He studied medicine in Florence and practiced in Italy and the Middle East for several years before moving to London in 1755 to take up a mercantile career as an importer. In London he worked as a teacher of Italian language. While in London he met the Americans Benjamin Franklin and Thomas Jefferson of Virginia. While doing work for Franklin, Mazzei shared his idea of importing Tuscan products, wine and olive trees, to the New World. They convinced him to undertake his next venture.\nOn September 2, 1773 Mazzei boarded a ship from Livorno to Virginia bringing with him plants, seeds, silkworms, and 10 farmers from Lucca. While visiting Jefferson at his estate, the two became good friends and Jefferson gave Mazzei a large allotment of land for an experimental plantation.Mazzei and Jefferson started what became the first commercial vineyard in the Commonwealth of Virginia. They shared an interest in politics and libertarian values, and maintained an active correspondence for the rest of Mazzei's life.\nIn 1779 Mazzei returned to Italy as a secret agent for the state of Virginia. He purchased and shipped arms to them until 1783. After briefly visiting the United States again in 1785, Mazzei travelled throughout Europe promoting Republican ideals. He wrote a political history of the American Revolution, 'Recherches historiques et politiques sur les Etats-Unis de l'Amerique septentrionale\", and published it in Paris in 1788. After its publication Mazzei became an unofficial roving ambassador in Europe for American ideas and institutions.\nWhile in the Polish-Lithuanian Commonwealth he became attached as a Privy Councilor at the court of King Stanislaus II. There he became acquainted with Polish liberal and constitutional thought, like the works of Wawrzyniec Grzymała Goślicki and ideas of Golden Freedoms and Great Sejm. King Stanislaus II appointed Mazzei to be Poland's representative in Paris, where he again met Jefferson.\nAfter Poland was partitioned between Russia and Prussia in 1795, Mazzei, along with the rest of the Polish court, was given a pension by the Russian crown. He later spent more time in France, becoming active in the politics of the French Revolution under the Directorate. When Napoleon overthrew that government Mazzei returned to Pisa, Italy. He died there in 1816. After his death the remainder of his family returned to the United States at the urging of Thomas Jefferson. They settled in Massachusetts and Virginia. Mazzei's daughter married a nephew of John Adams.\nHe was buried at the Pisa Suburbano Cemetery in Pisa. En Virginia habia casado con la francesa, Marie Hautefenille \"Petronille\" Martin, viuda del antiguo socio. Ella murio en 1788 en Virginia. Tenian 8 años separados.Luego casa en 1796 a los 66 años Antonia Antoni en Livorno. Tienen una hija llamada Elisabetta, nacida el dia 23/7/1798 en Livorno. Casada por 1817 con Andrea Pini, tenor, natural de Bologna.\n\n\n== Mazzei letter ==\nMany biographers believe Jefferson and Washington had a falling out over a letter Jefferson sent to Mazzei in Italy, which called Washington's administration \"Anglican, monarchical, and aristocratical\" as England and claimed that Washington had appointed as military officers \"all timid men that prefer the calm of despotism to the boisterous sea of liberty ... [I]t would give you a fever were I to name to you the apostates who have gone over to these heresies, men who were Samsons in the field and Solomons in the council, but who have had their heads shorn by the harlot England.\" The letter was eventually published overseas and then re-translated back into English by Noah Webster and published in the United States.\nThis contribution was acknowledged by John F. Kennedy in his book A Nation of Immigrants, in which he states that:\n\nThe great doctrine 'All men are created equal' and incorporated into the Declaration of Independence by Thomas Jefferson, was paraphrased from the writing of Philip Mazzei, an Italian-born patriot and pamphleteer, who was a close friend of Jefferson. A few alleged scholars try to discredit Mazzei as the creator of this statement and idea, saying that \"there is no mention of it anywhere until after the Declaration was published\". This phrase appears in Italian in Mazzei's own hand, written in Italian, several years prior to the writing of the Declaration of Independence. Mazzei and Jefferson often exchanged ideas about true liberty and freedom. No one man can take complete credit for the ideals of American democracy.\n\n\n== Legacy ==\nA 40-cent United States airmail stamp was issued in 1980 to commemorate the 250th anniversary of Mazzei's birth.\n\n\n== See also ==\nAmerican Revolution\nPatrick Henry\nGeorge Mason\nJames Monroe\nWilliam Paca\nFrancesco Vigo\nJohn Page\nFounding Fathers of the United States\nList of important people in the era of the American Revolution\n\n\n== References ==\n\n\n== Mazzei's writings ==\n\n\n=== In French ===\nFilippo Mazzei: Recherches Historiques et Politiques sur les Etats-Unis de l'Amérique Septentrionale (Historical and Political Enquiries Concerning the United States of North America). Four Volumes.\nFilippo Mazzei, Stanisław August Poniatowski, Lettres de Philippe Mazzei et du roi Stanislas-Auguste de Pologne., Roma : Istituto storico italiano per l'età moderna e contemporanea, 1982\n\n\n=== In Italian ===\nFilippo Mazzei: Memorie della vita e delle peregrinazioni del fiorentino Filippo Mazzei. a cura di Gino Capponi, Lugano, Tip. della Svizzera Italiana, 1845–1846, 2 volumes\nFilippo Mazzei:Del commercio della seta fatto in Inghilterra dalla Compagnia delle Indie Orientali (manoscritto inedito di Filippo Mazzei – 1769) a cura di Silvano Gelli, Poggio a Caiano, Comune di Poggio a Caiano, 2001.\n\n\n== Sources ==\n\n\n=== In English ===\nPhilip Mazzei: My Life and Wanderings, ed. Marchione, Sister Margherita, American Institute of Italian Studies, Morristown, NJ, 1980, 437pp. Translation to English of Mazzei's autobiography\nMarchione: Philip Mazzei: Selected Writings and Correspondence:\n\nVol. I – Virginia's Agent during the American Revolution, XLVIII, 585 pp.;\nVol. II – Agent for the King of Poland during the French Revolution, 802 pp.;\nVol. III – World Citizen, 623 pp.\n\nCassa di Risparmi e Depositi, Prato, 1983.\nMarchione, Sister Margherita: Philip Mazzei: Jefferson's \"Zealous Whig\", American Institute of Italian Studies, Morristown, NJ, 1975, 352 pp.\nMarchione: The Adventurous Life of Philip Mazzei – La vita avventurosa di Filippo Mazzei (bilingue inglese – italiano), University Press of America, Lanham, MD, 1995, 235 pp.\nMarchione: The Constitutional Society of 1784, Center for Mazzei Studies, Morristown, NJ, 1984, 49 pp.\nMarchione: Philip Mazzei: World Citizen (Jefferson's \"Zealous Whig\"), University Press of America, Lanham, MD, 1994, 158 pp.\nRenee Critcher Lyons: Foreign-Born American Patriots-Sixteen Volunteer Leaders In The Revolutionary War, 2014. North Carolina-McFarland Publishing\n\n\n=== In Italian ===\nFilippo Mazzei: Scelta di scritti e lettere:\n\nVol.I: 1765–1788. Agente di Virginia durante la rivoluzione americana; pp. XLVII–582\nVol.II:1788–1791. Agente del Re di Polonia durante la Rivoluzione Francese; pp. XVI–703, XVII–633\nVol.III: 1792–1816. Cittadino del Mondo; pp. XVII–633\n\nPrato, 1984, Ediz.del Palazzo per Cassa di Risparmi e Depositi di Prato.\nMarchione, Sister Margherita: Istruzioni per essere liberi ed eguali, Cisalpino-Gogliardica, Milan, 1984, 160 pp\nMarchione: The Adventurous Life of Philip Mazzei - La vita avventurosa di Filippo Mazzei (bilingue inglese – italiano), University Press of America, Lanham, MD, 1995, 235 pp\n\n\n== Others books about Mazzei ==\n\n\n=== In English ===\nBiaggi, Mario: An Appreciation of Philip Mazzei – an Unsung American Patriot, in CONGRESSIONAL RECORD, Washington, D.C., September 12, 1984\nDi Grazia, Marco: Philip Mazzei, a hero of American independence. Illustrations and cover Marcello Mangiantini, translation Miranda MacPhail Tuscan Regional Government, Poggio a Caiano. nessuna data, circa 1990, 52p\nGaines, William H.: Virginia History in Documents 1621-1788, Virginia State Library, Richmond, 1974\nGarlick, Richard, Jr: Philip Mazzei, Friend of Jefferson: His Life and letters, Baltimore-London-Paris, The Johns Hopkins Press-Humphrey Nilfort Oxford University Press – Société d’Editions Les Belles Lettres, 1933\nGarlick: Italy and the Italians in Washington's time, New York Arno Press, 1975\nGuzzetta, Charles: Mazzei in America, in DREAM STREETS – THE BIG BOOK OF ITALIAN AMERICAN CULTURE, Lawrence DiStasi editor, Harper & Row, New York, 1989\nKennedy, John F.: A Nation of Immigrants, Harper & Row, New York, 1964\nLippucci, Mary Theresa: The correspondence between Thomas Jefferson and Philip Mazzei, 1779–1815\nMalone, Dumas (editor): Dictionary of American Biography, VOL. VI, Charles Scribner's Sons, New York, 1933\nMarraro, Howard R.: An Unpublished Jefferson Letter to Mazzei, Italica, Vol. 35, No. 2 (June 1958), pp. 83–87\nMarraro: Jefferson Letters Concerning the Settlement of Mazzei's Virginia Estate, The Mississippi Valley Historical Review, Vol. 30, No. 2 (September 1943), pp. 235–242\nMarraro: Philip Mazzei - Virginia's Agent in Europe, New York Public Library, 1935\nMarraro: Philip Mazzei and his Polish friends sn,1944?\nSammartino, Peter: The Contributions of Italians to the United States before the Civil War: a conference to celebrate the 250th anniversary of the birth of Philip Mazzei, Washington, D.C., April 18–20, 1980, Washington, D.C., National Italian American Foundation, 1980.\nSchiavo, Giovanni Ermenegildo: Philip Mazzei : one of America's founding fathers, New York: Vigo Press, 1951\n\n\n=== In Italian ===\nAA.VV., Dalla Toscana all’America: il contributo di Filippo Mazzei, Poggio a Caiano, Comune di Poggio a Caiano, 2004.\nBecattini Massimo, Filippo Mazzei mercante italiano a Londra (1756–1772), Poggio a Caiano, Comune di Poggio a Caiano, 1997.\nBolognesi Andrea, Corsetti Luigi, Di Stadio Luigi: Filippo Mazzei mostra di cimeli e scritti, catalogo della mostra a cura di, Poggio a Caiano, palazzo Comunale, 3-25 luglio 1996, Comune di Poggio a Caiano, 1996.\nCamajani Guelfo Guelfi,Filippo Mazzei : un illustre toscano del Settecento : medico, agricoltore, scrittore, giornalista, diplomatico, Firenze, Associazione Internazionale Toscani nel Mondo, 1976.\nCiampini Raffaele, Lettere di Filippo Mazzei alla corte di Polonia (1788–1792), Bologna : N. Zanichelli, 1937\nCorsetti Luigi, Gradi Renzo: Bibliografia su Filippo Mazzei Avventuriero della Libertà\" a cura di, con scritti di Margherita Marchione e Edoardo Tortarolo, Poggio a Caiano, C.I.C Filippo Mazzei – Associazione Culturale \"Ardengo Soffici\", 1993.\nDi Stadio Luigi, Filippo Mazzei tra pubblico e privato. Raccolta di documenti inediti\", a cura di, Poggio a Caiano, Biblioteca Comunale di Poggio a Caiano, 1996.\nGerosa Guido, Il fiorentino che fece l'America. Vita e avventure di Filippo Mazzei 1730–1916, Milano, SugarCo Edizioni, 1990.\nGradi Renzo, Un bastimento carico di Roba bestie e uomini in un manoscritto inedito di Filippo Mazzei, Poggio a Caiano, Comune di Poggio a Caiano, 1991.\nGradi Renzo, Parigi: luglio 1789. Scritti e memorie del fiorentino Filippo Mazzei, a cura di, Comune di Poggio a Caiano, 1989.\nGullace Giovanni, Figure dimenticate dell'indipendenza americana, Filippo Mazzei e Francesco Vigo, Roma : Il Veltro, 1977.\nMasini Giancarlo, Gori Iacopo, L'America fu concepita a Firenze, Firenze : Bonechi, 1998\nTognetti Burigana Sara, Tra riformismo illuminato e dispotismo napoleonico; esperienze del \"cittadino americano\" Filippo Mazzei, Roma, Edizioni di Storia e letteratura, 1965.\nTortarolo Edoardo, Illuminismo e Rivoluzioni. Biografia politica di Filippo Mazzei, Milano, Angeli, 1986.\nŁukaszewicz, Witold, Filippo Mazzei, Giuseppe Mazzini; saggi sui rapporti italo-polacchi, Wroclaw, Poland Zakład Narodowy im. Ossolińskich, 1970.\n\n\n== External links ==\nwww.philipmazzei.us Official site\nMonticello the home of Thomas Jefferson\nPhilip Mazzei \"Encyclopædia Britannica\"\nA branch o Mazzei's Family Today\nPhilip Mazzei at the library of Congress\nAnother Site about P.Mazzei and other famous Italian American", "ns": 0, "pageid": 2730615, "title": "Philip Mazzei"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}