{"batchcomplete": "", "query": {"normalized": [{"to": "Philip Doddridge", "from": "Philip_Doddridge"}], "pages": {"250790": {"extract": "Philip Doddridge DD (26 June 1702 – 26 October 1751) was an English Nonconformist leader, educator, and hymnwriter.\n\n\n== Early life ==\nPhilip Doddridge was born in London the last of the twenty children of Daniel Doddridge (d 1715), a dealer in oils and pickles. His father was a son of John Doddridge (1621–1689), rector of Shepperton, Middlesex, who was ejected from his living following the Act of Uniformity of 1662 and became a nonconformist minister, and a great-nephew of the judge and MP Sir John Doddridge (1555–1628). Philip's mother, Elizabeth, considered to have been the greater influence on him, was the orphan daughter of the Rev John Bauman (d 1675), a Lutheran clergyman who had fled from Prague to escape religious persecution, during the unsettled period following the flight of the Elector Palatine. In England, Rev John Bauman (sometimes written Bowerman) was appointed master of the grammar school at Kingston upon Thames.\nBefore Philip could read, his mother began to teach him the history of the Old and New Testament from blue Dutch chimney-tiles on the chimney place of their sitting room. In his youth, Philip Doddridge was educated first by a tutor employed by his parent then boarded at a private school in London. In 1712, he then attended the grammar school at Kingston-upon-Thames, where his maternal grandfather had been master. The school's master when Doddridge attended, was Rev Daniel Mayo (1672-1733), the son of John Bauman's friend Richard Mayo, ejected vicar of Kingston-upon-Thames.\nHis mother died when he was only 8 years old on 12 April 1711. Four years later his father died on 17 July 1715. He then had a guardian named Downes who moved him to another private school at St Albans where he was much influenced by the Presbyterian minister Samuel Clark of St Albans. Downes squandered Doddridge's inheritance, leaving the orphaned thirteen-year-old Philip Doddridge destitute in St Albans. Here, Clark took him on, treating him as a son, guiding his education and encouraging his call to the ministry. Having remained lifelong friends, Doddridge preached at the funeral of his older friend remarking: \"To him under God I owe even myself and all my opportunities of public usefulness in the church.\"\n\n\n== Marriage ==\nOn 22 December 1730 he married Mercy Maris (1709–1790), daughter of Richard Maris, a baker and maltster of Worcester, and his second wife, Elizabeth Brindley. The marriage was at Upton upon Severn where Mercy's family lived. They had nine children. The first, Elizabeth or Tetsey (1731–1736), died just before her fifth birthday and was buried under the altar of the Doddridge Chapel, Northampton. Four children survived to adulthood.\n\n\n== Contribution to education and religious life ==\nWith independent religious leanings, Philip Doddridge declined offers which would have led him into the Anglican ministry or a career in law; and in 1719, with Clark's support, chose instead to enter the Dissenting academy at Kibworth in Leicestershire. Here he was taught by John Jennings, whom Doddridge briefly succeeded in 1723. Later that year, at a general meeting of Nonconformist ministers, Philip Doddridge was chosen to conduct the academy being newly established a few miles away at Market Harborough. It moved many times, and was known as Northampton Academy, Doddridge died in 1751 and the academy continued. and is probably best known as Daventry Academy.\nAlso in 1723 he received an invitation to be pastor to an independent congregation at Northampton, which he also accepted. Here his popularity as a preacher is said to have been chiefly due to his \"high susceptibility, joined with physical advantages and perfect sincerity.\" His sermons were mostly practical in character, and his aim was to cultivate in his hearers a spiritual and devotional frame of mind.\nThroughout the 1730s and 1740s Philip Doddridge continued his academic and pastoral work, and developed close relations with numerous early religious revivalists and independents, through extensive visits and correspondence. Through this approach he helped establish and maintain a circle of influential independent religious thinkers and writers, including Dr Isaac Watts. He also became a prolific author and hymnwriter. In 1736 both the universities at Aberdeen gave him the degree of Doctor of Divinity. However, these multifarious labours led to so many engagements and bulky correspondence that it interfered seriously both with his preaching and academic duties (he had some 200 students to whom he lectured on philosophy and theology, in the mathematical or Spinozistic style).\nDoddridge was a prolific writer. His The Rise and Progress of Religion in the Soul was translated into seven languages. Charles Spurgeon referred to The Rise and Progress as \"that holy book\". Reading this book led William Wilberforce, the anti-slave trade campaigner, to become a Christian. Besides a New Testament commentary and other theological works, Doddridge also wrote over 400 hymns. Most of the hymns were written as summaries of his sermons and were to help the congregation express their response to the truths they were being taught.\n\n\n== Doddridge's Youth's Scheme ==\nConcerned at the small number of students attending the Dissenting Academies, in 1750 Doddridge initiated a Youth's Scheme, to provide capable boys from poor families, with a grammar school education that would enable them to undertake further study at a dissenting academy. Doddridge used this subscription-funded Youth's Scheme to attach a preparatory school to Northampton Academy, initially with six students:\n\nMr Bennet, a serious lad lately arrived, and who is subsisted by an exhibition of ten guineas [£10.50] yearly from Lady Huntingdon, Messrs Howe, Brooks, Robotham, Cole, and [Samuel] Smith; three of whom come from a distance.\n\nSamuel Smith had been recommended and was supported by Doddridge’s friend Robert Cruttenden. Doddridge now had thirty 'pupils' in his Academy, and six 'students' in his school. Initially, the senior students at the Academy were responsible for teaching the students, but had he lived, it was his intention to employ a third tutor, alongside himself and Samuel Clark. The Youth's Scheme did not survive Doddridge's death.\n\n\n== Death and legacy ==\nIn 1751 Philip Doddridge's health, which had never been good, broke down. He sailed for Lisbon on 30 September of that year; the change was unavailing, and he died there of tuberculosis. He was buried in a cemetery attached to the British Factory in Lisbon, where his grave and tomb may still be seen.\nPhilip Doddridge worked towards a united Nonconformist body that would have wide appeal, retaining highly cultured elements without alienating those less educated.\nHis best known work, The Rise and Progress of Religion in the Soul (1745), dedicated to Isaac Watts, was often reprinted and became widely influential. It was through reading it, together with Isaac Milner, that William Wilberforce began the spiritual journey which eventually led to his conversion. It is said that this work best illustrates Doddridge's religious genius, and it has been widely translated. His other well-known works include: The Family Expositor (6 vols., 1739–1756); Life of Colonel Gardiner (1747); and a Course of Lectures on Pneumatology, Ethics and Divinity (1763). Doddridge also published several courses of sermons on particular topics.\nJohn Wesley stated, in the Preface to his Notes on the New Testament, that he was indebted to 'the Family Expositor of the late pious and learned Dr. Doddridge' for some 'useful observations'.\nMany of Doddridge's hymns, such as O God of Bethel, by whose hand, continue to be used to this day across the English-speaking world.\nDoddridge's academy evolved into New College, Hampstead, later known as New College London, a centre for training Congregational and then United Reformed Church ministers. (Not connected with Royal Holloway, University of London, also a constituent college of the University of London and briefly known as Royal Holloway and Bedford New College when those two colleges merged in the 1970s.) The library of the college, which held a large collection of his manuscripts, was transferred to Dr Williams's Library in 1976.\n\n\n== Doddridge United Reformed Church ==\nThe Doddridge United Reformed Church (formerly the Castle Hill URC) in Doddridge Street, Northampton, was formerly Congregational, Doddridge and Commercial Street URC. It was the scene of the ministry of Doddridge from 1729-51. The church was founded in 1662, built in 1695 and enlarged 1842. It united with Commercial Street church in 1959 and became a United Reformed Church in 1972. The interior has galleries and box pews and a memorial to Doddridge. The building was Grade II listed by English Heritage in 1952.\n\n\n== See also ==\nEnglish Dissenter\nIndependent (religion)\nCongregational church\nParable of the Faithful Servant\nDr Williams's Library\nThe Doddridge Centre in St James Road, in the area of St. James End, Northampton\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"article name needed\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== Further reading ==\nThree sermons on the evidences of Christianity (1752)\nMemoirs, by Rev. Job Orton (1766)\nLetters to and from Dr Doddridge, by Rev. Thomas Stedman (1790)\nCorrespondence and Diary, in 5 vols., by his grandson, John Doddridge Humphreys (1829)\nStoughton, John (1851). Philip Doddridge: His Life and Labours: A Centenary Memorial. London: Jackson and Walford. \nStanford's Philip Doddridge (1880)\n\n\n== External links ==\nWorks by Philip Doddridge at Project Gutenberg\nWorks by or about Philip Doddridge at Internet Archive\nWorks by Philip Doddridge at Christian Classics Ethereal Library\nWorks by Philip Doddridge at Post-Reformation Digital Library\nHymns by Philip Doddridge\nBiography of Philip Doddridge by Thomas Coleman\nDr Williams's Library, Gordon Square, London, hold many of Doddridge's manuscripts including his wife, Mercy's diary", "ns": 0, "pageid": 250790, "title": "Philip Doddridge"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}