{"batchcomplete": "", "query": {"normalized": [{"to": "Philip Jourdain", "from": "Philip_Jourdain"}], "pages": {"3966802": {"extract": "Philip Edward Bertrand Jourdain (16 October 1879 – 1 October 1919) was a British logician and follower of Bertrand Russell.\nHe was born in Ashbourne in Derbyshire one of a large family belonging to Emily Clay and his father Francis Jourdain (who was the vicar at Ashbourne). He was partly disabled by Friedreich's ataxia. He corresponded with Georg Cantor and Gottlob Frege, and took a close interest in the paradoxes related to Russell's paradox, formulating the card paradox version of the liar paradox. He corresponded with Ludwig Wittgenstein, meeting with him in Cambridge to discuss Frege's book Grundgesetze der Arithmetik, of parts of which Jourdain had prepared a translation. He also worked on algebraic logic, and the history of science with Isaac Newton as a particular study. He was London editor for The Monist. Near the end of his life he became increasingly obsessed by trying to prove the axiom of choice, and published several incorrect proofs of it.\nHis sister Eleanor Jourdain was an English academic and author.\n\n\n== Works ==\nThe following works of Philip Jourdain are available from Internet Archive:\n1908: Some Points in the Foundation of Mathematical Physics in The Monist v 18\n1911: Some Modern Advances in Logic in The Monist v 21\n1913: The Nature of Mathematics\n1913: The Nature and Validity of the Principle of Least Action in The Monist v 23\n1914: The Economy of Thought in The Monist v 24\n1918: The Philosophy of B*rtr*nd R*ss*ll with an appendix of leading passages from certain other works\n1919: Indefinables and Indemonstrables in Mathematics and Theology in The Monist v 29\nJordain acted as editor for\n1914: Augustus De Morgan: Essays on the Life and Work of Newton\nJourdain made the following translations:\n1911: Ernst Mach History and Root of the Principle of Conservation of Energy\n1915: Ernst Mach The Science of Mechanics\n1915: Georg Cantor Contributions to the Foundation of the Theory of Transfinite Numbers\n\n\n== References ==\n\nIvor Grattan-Guinness (1977) Dear Russell—Dear Jourdain: a Commentary on Russell's Logic, Based on His Correspondence with Philip Jourdain. Duckworth.\nSainsbury, R. M. (Oct 1979). \"Review: Dear Russell—Dear Jourdain, by I. Grattan-Guinness\". Mind. New Series. 88 (352): 604–607.  .\n\nArchibald Edward Heath (1920) \"Philip Edward Bertrand Jourdain\", The Monist 30:161–182.\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Philip Jourdain\", MacTutor History of Mathematics archive, University of St Andrews .\nWorks by or about Philip Jourdain at Internet Archive", "ns": 0, "pageid": 3966802, "title": "Philip Jourdain"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}