{"batchcomplete": "", "query": {"normalized": [{"to": "Philo the Dialectician", "from": "Philo_the_Dialectician"}], "pages": {"14125745": {"extract": "Philo the Dialectician (fl. 300 BC) was a dialectic philosopher of the Megarian school. He is often called Philo of Megara although the city of his birth is unknown. He is most famous for the disputes he had with his teacher Diodorus Cronus concerning the idea of the possible and the criteria of the truth of conditional statements.\n\n\n== Life ==\nPhilo was a disciple of Diodorus Cronus, and a friend of Zeno, though older than the latter. In his Menexenus he mentioned the five daughters of his teacher.\nJerome incorrectly refers to Philo as the teacher of Carneades. Diogenes Laërtius mentions a (presumably different) Philo who was a disciple of Pyrrho.\n\n\n== Philosophy ==\nPhilo disputed with Diodorus respecting the idea of the possible and the criteria of the truth of conditional statements.\nIn regards to things possible, Philo was similar to Aristotle, as he recognized that not only what is, or will be, is possible (as Diodorus maintained), but also what is in itself conformable to the particular purpose of the object in question, as of straw to burn.\nBoth Philo and Diodorus sought for criteria for the correct form of conditional propositions, and each of them did so in a manner corresponding to what he maintained respecting the idea of the possible. Philo regarded a conditional as true unless it has both a true antecedent and a false consequent. Precisely, let T0 and T1 be true statements, and let F0 and F1 be false statements; then, according to Philo, each of the following conditionals is a true statement, because it is not the case that the consequent is false while the antecedent is true (it is not the case that a false statement is asserted to follow from a true statement):\nIf T0, then T1\nIf F0, then T0\nIf F0, then F1\nThe following conditional does not meet this requirement, and is therefore a false statement according to Philo:\nIf T0, then F0\nIndeed, Sextus says \"According to [Philo], there are three ways in which a conditional may be true, and one in which it may be false.\" Philo's criterion of truth is what would now be called a truth-functional definition of \"if ... then\"; it is the definition used in modern logic.\nIn contrast, Diodorus allowed the validity of conditionals only when the antecedent clause could never lead to an untrue conclusion. A century later, the Stoic philosopher Chrysippus attacked the assumptions of both Philo and Diodorus.\n\n\n== References ==\n\n\n== External links ==\nBobzien, Susanne. \"Dialectical School\". Stanford Encyclopedia of Philosophy. \nSelected Bibliography on the \"Master Argument\" in Diodorus Cronus and Philo the Dialectician with a bibliography on Diodorus and the problem of future contingents\n This article incorporates text from a publication now in the public domain: Smith, William, ed. (1870). \"Philon the Megarian or Dialectician\". Dictionary of Greek and Roman Biography and Mythology. III. p. 312-313.", "ns": 0, "pageid": 14125745, "title": "Philo the Dialectician"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}