{"batchcomplete": "", "query": {"normalized": [{"to": "Phillip H. Wiebe", "from": "Phillip_H._Wiebe"}], "pages": {"30860309": {"extract": "Phillip H. Wiebe (born 1945) is the former Chair of the Department of Philosophy, Professor of Philosophy and former Dean of Arts and Religious Studies at Trinity Western University and its School of Graduate Studies. He is the author of God and Other Spirits and Visions of Jesus, both from Oxford University Press. His primary areas of research are in philosophy of religion and science, and epistemology.\n\n\n== Degrees ==\nHe received a B.A. and M.A.. from the University of Manitoba, and a Ph.D. from the University of Adelaide.\nStudied at Adelaide under notable scholar J. J. C. Smart, .\n\n\n== Areas of expertise ==\nAnalytic philosophy; philosophy of religion, religious experience.\nSome have described Phillip Wiebe as a \"Mystical Empiricist.\"\nAlso a noted Shroud of Turin expert.\n\n\n== Works ==\n\n\n=== Books ===\nWiebe, Phillip H. (1988). Theism in an Age of Science. Lanham, MD: American University Press. ISBN 978-0-819-16820-7. OCLC 17202715. \n——— (1997). Visions of Jesus: direct encounters from the New Testament to today. New York ; Oxford: Oxford University Press. ISBN 978-0-195-09750-4. OCLC 35884871. \n——— (2004). God and Other Spirits: intimations of transcendence in Christian experience. New York ; Oxford: Oxford University Press. ISBN 978-0-195-14012-5. OCLC 52091936.  According to WorldCat, the book is held in 698 libraries \n——— (2014). Visions and appearances of Jesus. Abilene, TX: Leafwood Publishers. ISBN 978-0-891-12608-9. OCLC 868642309. \n——— (2015). Intuitive knowing as spiritual experience. New York, NY: Palgrave Macmillan. ISBN 978-1-137-54948-8. OCLC 907621832. \n\n\n== References ==", "ns": 0, "pageid": 30860309, "title": "Phillip H. Wiebe"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}