{"batchcomplete": "", "query": {"normalized": [{"to": "Philip Pettit", "from": "Philip_Pettit"}], "pages": {"4023645": {"extract": "Philip Noel Pettit (born 1945) is an Irish philosopher and political theorist. He is Laurence Rockefeller University Professor of Politics and Human Values at Princeton University and also Professor of Philosophy at the Australian National University. He was a Guggenheim Fellow.\n\n\n== Life ==\nHe was educated at Garbally College, the National University of Ireland, Maynooth and Queen's University, Belfast. He was a lecturer at University College, Dublin, a Research Fellow at Trinity Hall, Cambridge, and professor at the University of Bradford. He was for many years Professorial Fellow in Social and Political Theory at the Research School of Social Sciences, Australian National University. He is the recipient of numerous honours, including an honorary doctorate from the National University of Ireland. He was keynote speaker at Graduate Conference, University of Toronto.\nPettit defends a version of republicanism in political philosophy. His book Republicanism: A Theory of Freedom and Government provided the underlying justification for political reforms in Spain under José Luis Rodríguez Zapatero. Pettit detailed his relationship with Zapatero in his A Political Philosophy in Public Life: Civic Republicanism in Zapatero's Spain, co-authored with José Luis Martí.\nPettit holds that the lessons learned when thinking about problems in one area of philosophy often constitute ready-made solutions to problems faced in completely different areas. Views he defends in philosophy of mind give rise to the solutions he offers to problems in metaphysics about the nature of free will, and to problems in the philosophy of the social sciences, and these in turn give rise to the solutions he provides to problems in moral philosophy and political philosophy. His corpus as a whole was the subject of a series of critical essays published in Common Minds: Themes from the Philosophy of Philip Pettit (Oxford University Press, 2007).\n\n\n== Affiliations and honors ==\nFellow of the American Academy of Arts and Sciences (2009)\nHonorary member of the Royal Irish Academy (2010)\nCorresponding Fellow of the British Academy (2013)\nFellow of the Australian academies in Humanities and Social Science\nMember of the scientific committee of the Fundacion IDEAS\n\n\n== Selected bibliography ==\n\n\n=== Books ===\nThe Concept of Structuralism: a Critical Analysis (1975)\nJudging justice: an introduction to contemporary political philosophy (1980)\nRawls: 'A Theory of Justice' and its critics (1990) with Chandran Kukathas\nThe Common Mind; an essay on psychology, society and politics (1993)\nNot Just Deserts. A Republican Theory of Criminal Justice (ISBN 978-0-19-824056-3) with John Braithwaite\nRepublicanism: a theory of freedom and government (1997)\nThree Methods of Ethics: a debate (1997) with Marcia Baron and Michael Slote\nA Theory of Freedom: from psychology to the politics of agency (2001)\nRules, Reasons and Norms: selected essays (2002)\nThe Economy of Esteem: an essay on civil and political society (2004) with Geoffrey Brennan\nMind, Morality, and Explanation: Selected Collaborations (with Frank Jackson and Michael Smith) (Oxford University Press, 2004)\nMade with Words: Hobbes on Language, Mind, and Politics (2007)\n\"Joining the Dots\" in Common Minds: Themes from the Philosophy of Philip Pettit (2007) edited by Geoffrey Brennan, Robert E. Goodin, Frank Jackson and Michael Smith\nA Political Philosophy in Public Life: Civic Republicanism in Zapatero's Spain (2010) with José Luis Martí\nGroup Agency: The Possibility, Design, and Status of Corporate Agents. (2011) with Christian List\nOn The People's Terms: A Republican Theory and Model of Democracy. (2012)\nThe Robust Demands of the Good: Ethics with Attachment, Virtue, and Respect. (2015)\n\n\n=== Chapters in books ===\nPettit, Philip (2004), \"The common good\", in Dowding, Keith; Pateman, Carole; Goodin, Robert E., Justice and democracy: essays for Brian Barry, Cambridge New York: Cambridge University Press, pp. 25–39, ISBN 9780521836951. \nPettit, Philip (2009), \"Freedom in the spirit of Sen\", in Morris, Christopher, Amartya Sen, Cambridge New York: Cambridge University Press, pp. 91–114, ISBN 9780521618069 \n\n\n== References ==\n\n\n== Further reading ==\nDimova-Cookson, Maria (2012), \"Republicanism, philosophy of freedom, and the history of ideas: an interview with Philip Pettit.\", in Browning, Gary; Dimova-Cookson, Maria; Prokhovnik, Raia, Dialogues with contemporary political theorists, Houndsmill, Basingstoke, Hampshire New York: Palgrave Macmillan, pp. 155–169, ISBN 9780230303058 \n\n\n== External links ==\nProfile: Philip Pettit, princeton.edu; accessed 13 March 2015.\nPettit: Republican reflections on the 15-M movement, in Books and Ideas; accessed 13 March 2015.\nEye to Eye: an interview with Pettit by Petri Koikkalainen and Sami Syrjämäki, academia.edu; accessed 13 March 2015.", "ns": 0, "pageid": 4023645, "title": "Philip Pettit"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}