{"batchcomplete": "", "query": {"normalized": [{"to": "Piergiorgio Odifreddi", "from": "Piergiorgio_Odifreddi"}], "pages": {"4115728": {"extract": "Piergiorgio Odifreddi (born July 13, 1950 in Cuneo) is an Italian mathematician, logician and aficionado of the history of science, who is also extremely active as a popular science writer and essayist, especially in a perspective of philosophical atheism as a member of the Italian Union of Rationalist Atheists and Agnostics. He is philosophically and politically near to Bertrand Russell and Noam Chomsky.\n\n\n== Early life and education ==\nBorn in Cuneo in the Piedmont, he received his Laurea cum laude in mathematics in Turin in 1973. He then specialized in the United States at the University of Illinois at Urbana–Champaign and UCLA from 1978 and 1980, and in the Soviet Union at Novosibirsk State University in 1982 and 1983.\n\n\n== Teaching career ==\nFrom 1983 to 2007, he taught logic at the University of Turin, and from 1985 to 2003 he was visiting professor at Cornell University, where he collaborated with Anil Nerode, Richard Platek, and Richard Shore. From 2001 to 2003 he taught at Università Vita-Salute San Raffaele, which was founded by Luigi Maria Verzé.\nHe has been visiting professor at Monash University in Melbourne in 1988, the Chinese Academy of Sciences in Beijing in 1992 and in 1995, the Università di Nanchino in 1998, Buenos Aires Universitt in 2001 and the Italian Academy at Columbia University in 2006.\n\n\n== Writing ==\nHe has written editorials and books reviews for La rivista dei libri (the Italian edition of the New York Review of Books), is a regular contributor to Le Scienze (the Italian edition of Scientific American), and has also written for several newspapers such as La Repubblica, La Stampa and the weekly L'Espresso. The television stations Radio Tre, RAI Due and RAI Tre have hosted many of his discussions on various scientific topics.\n\n\n== Political Views ==\nOdifreddi was heavily influenced by Bertrand Russell and Noam Chomsky. He repeatedly manifested his opposition to US policies, in particular against that of George W. Bush and Israel, as indicated in his writings Non siamo tutti americani, La dannata Terra Santa and the controversial Intervista a Hitler, in his book Il matematico impertinente.\nHis views on Israel \"immodestly inspired\" by José Saramago and Noam Chomsky caused protests, which led to the deletion of an editorial he wrote in his blog at la Repubblica on November 2012, where he talked about the Israeli incursion in the Gaza Strip. In protest of the censorship, he decided to close his blog with a bitter post, eventually re-opening it years later.\n\n\n== Radio and Television ==\nOdifreddi had over 400 TV appearances in Italy, the most notable being:\n2002 – Chi ha ucciso Fermat?, directed by Vittorio Attamante – 20 episodes on Radio2 for Alle otto della sera.\n2004 – Vite da logico, directed by Vittorio Attamante – 20 episodes on Radio2 for Alle otto della sera.\n2008 – In Cammino verso Santiago de Compostela, with Sergio Valzania and Franco Cardini – 33 episodes on Radio3 for Il Cammino.\n2009 – A tutto Darwin – 5 episodes on Radio3 for Radio3 scienza, with interviews to Dario Fo.\n2009 – Buon compleanno, Darwin!, directed by Caterina Olivetti – 20 episodes on Radio2 for Alle otto della sera.\n2009 – A tutto Galileo – 5 episodes on Radio3 for Radio3 scienza, with interviews to Roberto Benigni and Riccardo Giacconi.\n\n\n== Other activities ==\nPiergiorgio Odifreddi participated in the Stock Exchange of Visions project in 2007.\n\n\n== Honors ==\n1998 – Galileo Prize of the Italian Mathematical Union.\n2002 – Peano Prize of Mathesis\n2005 – Commander OMRI\n\n\n== Works ==\n\n\n=== Academic writings ===\nClassical recursion Theory, North Holland – Elsevier, 1988, ISBN 9780080886596; 2nd edn. 1992, ISBN 0-444-89483-7\nClassical recursion Theory. Volume II, North Holland – Elsevier, 1999\n\n\n=== Popular writings ===\nIl Vangelo secondo la Scienza, Einaudi, 1999, ISBN 88-06-14930-X (The Gospel According to Science)\nLa matematica del Novecento, prefazione di Gian-Carlo Rota, Einaudi, 2000, ISBN 88-06-15153-3 (The Mathematics of the 20th Century)\nThe Mathematical Century: The 30 greatest problems of the last 100 years, translated by Arturo Sangalli, forward by Freeman Dyson, 2004, Princeton University Press ISBN 0-691-09294-X\n\nIl computer di Dio, Cortina, 2000, ISBN 88-7078-663-3 (God's Computer)\nC'era una volta un paradosso, Einaudi, 2001, ISBN 88-06-15090-1 (Once upon a time there was a paradox)\nLa repubblica dei numeri, Cortina, 2002, ISBN 88-7078-776-1 (The Republic of Numbers)\nZichicche, Dedalo, 2003, ISBN 88-220-6260-4\nIl diavolo in cattedra. La logica matematica da Aristotele a Kurt Gödel, Einaudi, 2003, ISBN 88-06-16721-9 (The Devil in the Professor's Chair: Mathematical Logic from Aristotle to Kurt Goedel)\nDivertimento geometrico – Da Euclide ad David Hilbert, Bollati Boringhieri, 2003, ISBN 88-339-5714-4 (Geometric Diversions – From Euclid to Hilbert)\nLe menzogne di Ulisse. L'avventura della logica da Parmenide ad Amartya Sen, Longanesi, 2004, ISBN 88-304-2044-1 (Ulysses' Lies. The Adventure of Logic from Parmenides to Amartya Sen)\nIl matematico impertinente, Longanesi, 2005, ISBN 88-304-2222-3 (The Impertinent Mathematician)\nPenna, pennello, bacchetta: le tre invidie del matematico, Laterza, 2005, ISBN 88-420-7643-0 (Pen, brush, baton: the three envies of the mathematician)\nIdee per diventare matematico, Zanichelli, 2005, ISBN 88-08-07063-8 (Ideas for becoming a mathematician)\nIncontri con menti straordinarie, Longanesi, 2006, ISBN 88-304-2346-7 (Meetings with extraordinary minds)\nChe cos'è la logica?, Luca Sossella editore, 2006, ISBN 88-89829-19-2 (What is logic?)\nLa scienza espresso: Note brevi, semibrevi e minime per una biblioteca scientifica universale, Einaudi, 2006, ISBN 978-88-06-18258-8 (Science express)\nPerché non-possiamo essere cristiani (e meno che mai cattolici), Longanesi, 2007, ISBN 978-88-304-2427-2 (Why we cannot be Christians (much less Catholics))\n\n\n== References ==\n\n\n== External links ==\nPiergiorgio Odifreddi's Official Site (IT)\nArticle by Odifreddi on Recursive Functions in Stanford Encyclopedia of Philosophy", "ns": 0, "pageid": 4115728, "title": "Piergiorgio Odifreddi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}