{"batchcomplete": "", "query": {"normalized": [{"to": "Pierre-André Taguieff", "from": "Pierre-André_Taguieff"}], "pages": {"3214486": {"extract": "Pierre-André Taguieff (born 4 August 1946) is a philosopher and director of research at the French National Centre for Scientific Research in an Institut d'Etudes Politiques de Paris laboratory, the CEVIPOF. He is also a member of the Cercle de l'Oratoire think tank.\nTaguieff is the author of a number of books and papers on racism and antisemitism, including The Force of Prejudice: On Racism and Its Doubles (2001) and Rising from the Muck: The New Antisemitism in Europe (2004). He is known in particular for his studies on the French National Front and populism.\n\n\n== Beliefs and works ==\n\n\n=== On racism ===\nIn La Force du préjugé – essai sur le racisme et ses doubles (1987), Taguieff analyzed several different types of racism:\nThe first type of racism is against miscegenation, in favor of racial segregation, and wants to preserve differences between various alleged races. 19th century racialism theories, such as Arthur de Gobineau's An Essay on the Inequality of the Human Races (1853–55), are an example of this type of racism, which pretends to be founded on science and on the existence of biological human races. In other words, this pseudo-scientific racism mistakes differences in the amount of melanin (which determines skin color) for racial differences.\nThe second type is insidiously hosted by the Enlightenment philosophy of universalism: its dream of unity of mankind may bring it, in specific and extreme cases, to the will to annihilate all cultural differences, amounting to effective genocide or ethnocides. Taguieff's point is not in declaring that the Enlightenment philosophy is racist in itself, but extreme forms of this will of universality may lead, in practice, to the destruction of the plurality of cultures and to the rejection of even moderate forms of multiculturalism.\nThe third and more recent type has integrated the cultural relativists' attacks against racism. This new form of racism has reversed the famous anti-racist arguments of ethnologist Claude Lévi-Strauss. According to Lévi-Strauss, different cultures are incommensurable, and, because of this, each one thinks progress and superiority is on its side - Lévi-Strauss, in his 1952 essay for the UNESCO, used the famous metaphor of two trains crossing each other's path: each one thinks he is going the right way, while the other seems not to move or to move backward. Because of this, ethnocentrism is a necessary optical illusion, which in turn racist discourse uses to justify itself.\nTaguieff was himself accused of racism on several occasions, for instance when he praised Oriana Fallaci's book The Rage and the Pride, a book that some anti-racist militants consider to be racist. He was also criticized for his contribution to the controversial website Dreuz info, which French newspaper Le Monde described as ultra zionist and islamophobic.\n\n\n=== On the Nouvelle Droite's discourse ===\nAccording to Taguieff, racist discourse, such as that supported by Alain de Benoist's Nouvelle Droite far-right movement, has accepted the theories of cultural relativism and the non-existence of biological race. Claiming to uphold cultural relativism and thus antiracism, this new racist discourse in fact reiterates the strict distinction of various ethnic groups and segregation between them.\nSince it argues that \"ethnic groups\" exist but are not biological races, it claims not to be racist. However, apart from the pseudo-scientific racist theories of the 19th century, it espouses an anti-assimilationist point of view in completely rejecting the notion of a social melting pot. Arguing that the Enlightenment's philosophy of universality, taken to extremes, is a form of racism, it pretends to be antiracist by preaching strict separation of ethnic groups. However, if the critics of \"universal racism\" are correct, it is clear that this new form of racism is descended in a direct line from the old discourse of separation between different supposed races.\n\n\n=== About anti-Semitism and The Protocols of the Elders of Zion ===\nTaguieff is also very interested in the work of Leon Poliakov and Norman Cohn and has worked a great deal on the antisemitic forgery The Protocols of the Elders of Zion. Today he works on nationalism, the future of the Republic, and the concept of progress.\nPierre-André Taguieff's denunciation of antisemitism and of the instrumentalisation of anti-Zionism by specific ultra-minority groups has caused controversy, his opponents claiming that he was identifying anti-Zionism with antisemitism. However, Pierre-André Taguieff is a staunch opponent of any form of communitarianism whatsoever. As such, he does not claim that anti-Zionism is necessarily antisemitism, but simply that in some Islamist circles, explicit anti-Zionism may dissimulate implicit antisemitism, in the pure tradition of the European history of antisemitism.\nDespite its contrast to conservatism (he is a former situationist close to René Viénet), Pierre-André Taguieff wrote Les Contre-réactionnaires (Denoël, 2007) in which he opposed both antiracism and antifascism. He considers them as ideologies which are instrumentalized by far-left groups (p. 576) « aiming to regularize as many illegal immigrants as possible without any regulation » (p. 574).\n\n\n== Bibliography ==\n\n\n== See also ==\nProtocols of Zion (film)\n\n\n== Notes ==\n\n\n== External links ==\nPierre-André Taguieff on the new \"anti-Zionism\"\nAbout Pierre-André Taguieff : The Force of Prejudice. On Racism and Its Doubles\nRethinking anti-Racism by Pierre-André Taguieff\n\"The Illuminati fair: Esotericism, Plot Theory, Extremism\"", "ns": 0, "pageid": 3214486, "title": "Pierre-André Taguieff"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}