{"batchcomplete": "", "query": {"pages": {"38422": {"extract": "Plotinus (/plɒˈtaɪnəs/; Greek: Πλωτῖνος; c. 204/5 – 270) was a major Greek-speaking philosopher of the ancient world. In his philosophy there are three principles: the One, the Intellect, and the Soul. His teacher was Ammonius Saccas and he is of the Platonic tradition. Historians of the 19th century invented the term Neoplatonism and applied it to him and his philosophy which was influential in Late Antiquity. Much of the biographical information about Plotinus comes from Porphyry's preface to his edition of Plotinus' Enneads. His metaphysical writings have inspired centuries of Pagan, Christian, Islamic and Gnostic metaphysicians and mystics.\n\n\n== Biography ==\nPorphyry reported that Plotinus was 66 years old when he died in 270, the second year of the reign of the emperor Claudius II, thus giving us the year of his teacher's birth as around 205. Eunapius reported that Plotinus was born in the Deltaic Lycopolis in Egypt, which has led to speculations that he may have been a native Egyptian of Roman, Greek, or Hellenized Egyptian descent.\nPlotinus had an inherent distrust of materiality (an attitude common to Platonism), holding to the view that phenomena were a poor image or mimicry (mimesis) of something \"higher and intelligible\" [VI.I] which was the \"truer part of genuine Being\". This distrust extended to the body, including his own; it is reported by Porphyry that at one point he refused to have his portrait painted, presumably for much the same reasons of dislike. Likewise Plotinus never discussed his ancestry, childhood, or his place or date of birth. From all accounts his personal and social life exhibited the highest moral and spiritual standards.\nPlotinus took up the study of philosophy at the age of twenty-seven, around the year 232, and travelled to Alexandria to study. There he was dissatisfied with every teacher he encountered until an acquaintance suggested he listen to the ideas of Ammonius Saccas. Upon hearing Ammonius lecture, he declared to his friend, \"this was the man I was looking for,\" and began to study intently under his new instructor. Besides Ammonius, Plotinus was also influenced by the works of Alexander of Aphrodisias, Numenius, and various Stoics.\n\n\n=== Expedition to Persia and return to Rome ===\nAfter spending the next eleven years in Alexandria, he then decided, at the age of around 38, to investigate the philosophical teachings of the Persian philosophers and the Indian philosophers. In the pursuit of this endeavor he left Alexandria and joined the army of Gordian III as it marched on Persia. However, the campaign was a failure, and on Gordian's eventual death Plotinus found himself abandoned in a hostile land, and only with difficulty found his way back to safety in Antioch.\nAt the age of forty, during the reign of Philip the Arab, he came to Rome, where he stayed for most of the remainder of his life. There he attracted a number of students. His innermost circle included Porphyry, Amelius Gentilianus of Tuscany, the Senator Castricius Firmus, and Eustochius of Alexandria, a doctor who devoted himself to learning from Plotinus and attending to him until his death. Other students included: Zethos, an Arab by ancestry who died before Plotinus, leaving him a legacy and some land; Zoticus, a critic and poet; Paulinus, a doctor of Scythopolis; and Serapion from Alexandria. He had students amongst the Roman Senate beside Castricius, such as Marcellus Orontius, Sabinillus, and Rogantianus. Women were also numbered amongst his students, including Gemina, in whose house he lived during his residence in Rome, and her daughter, also Gemina; and Amphiclea, the wife of Ariston the son of Iamblichus. Finally, Plotinus was a correspondent of the philosopher Cassius Longinus.\n\n\n=== Later life ===\nWhile in Rome Plotinus also gained the respect of the Emperor Gallienus and his wife Salonina. At one point Plotinus attempted to interest Gallienus in rebuilding an abandoned settlement in Campania, known as the 'City of Philosophers', where the inhabitants would live under the constitution set out in Plato's Laws. An Imperial subsidy was never granted, for reasons unknown to Porphyry, who reports the incident.\nPorphyry subsequently went to live in Sicily, where word reached him that his former teacher had died. The philosopher spent his final days in seclusion on an estate in Campania which his friend Zethos had bequeathed him. According to the account of Eustochius, who attended him at the end, Plotinus' final words were: \"Strive to give back the Divine in yourselves to the Divine in the All.\" [\"The Six Enneads\" translated by Stephen Mackenna and B. S. Page.] Eustochius records that a snake crept under the bed where Plotinus lay, and slipped away through a hole in the wall; at the same moment the philosopher died.\nPlotinus wrote the essays that became the Enneads over a period of several years from ca. 253 until a few months before his death seventeen years later. Porphyry makes note that the Enneads, before being compiled and arranged by himself, were merely the enormous collection of notes and essays which Plotinus used in his lectures and debates, rather than a formal book. Plotinus was unable to revise his own work due to his poor eyesight, yet his writings required extensive editing, according to Porphyry: his master's handwriting was atrocious, he did not properly separate his words, and he cared little for niceties of spelling. Plotinus intensely disliked the editorial process, and turned the task to Porphyry, who not only polished them but put them into the arrangement we now have.\n\n\n== Major ideas ==\n\n\n=== One ===\n\nPlotinus taught that there is a supreme, totally transcendent \"One\", containing no division, multiplicity or distinction; beyond all categories of being and non-being. His \"One\" \"cannot be any existing thing\", nor is it merely the sum of all things [compare the Stoic doctrine of disbelief in non-material existence], but \"is prior to all existents\". Plotinus identified his \"One\" with the concept of 'Good' and the principle of 'Beauty'. [I.6.9]\nHis \"One\" concept encompassed thinker and object. Even the self-contemplating intelligence (the noesis of the nous) must contain duality. \"Once you have uttered 'The Good,' add no further thought: by any addition, and in proportion to that addition, you introduce a deficiency.\" [III.8.11] Plotinus denies sentience, self-awareness or any other action (ergon) to the One [V.6.6]. Rather, if we insist on describing it further, we must call the One a sheer potentiality (dynamis) or without which nothing could exist. [III.8.10] As Plotinus explains in both places and elsewhere [e.g. V.6.3], it is impossible for the One to be Being or a self-aware Creator God. At [V.6.4], Plotinus compared the One to \"light\", the Divine Nous (first will towards Good) to the \"Sun\", and lastly the Soul to the \"Moon\" whose light is merely a \"derivative conglomeration of light from the 'Sun'\". The first light could exist without any celestial body.\nThe One, being beyond all attributes including being and non-being, is the source of the world—but not through any act of creation, willful or otherwise, since activity cannot be ascribed to the unchangeable, immutable One. Plotinus argues instead that the multiple cannot exist without the simple. The \"less perfect\" must, of necessity, \"emanate\", or issue forth, from the \"perfect\" or \"more perfect\". Thus, all of \"creation\" emanates from the One in succeeding stages of lesser and lesser perfection. These stages are not temporally isolated, but occur throughout time as a constant process. Later Neoplatonic philosophers, especially Iamblichus, added hundreds of intermediate beings as emanations between the One and humanity; but Plotinus' system was much simpler in comparison.\nThe One is not just an intellectual conception but something that can be experienced, an experience where one goes beyond all multiplicity. Plotinus writes, \"We ought not even to say that he will see, but he will be that which he sees, if indeed it is possible any longer to distinguish between seer and seen, and not boldly to affirm that the two are one.\"\n\n\n=== Emanation by the One ===\nSuperficially considered, Plotinus might seems to offer an alternative to the orthodox Christian notion of creation ex nihilo (out of nothing), although Plotinus never mentions Christianity in any of his works. The metaphysics of Emanation, however, just like the metaphysics of Creation, confirms the absolute transcendence of the One or of the Divine, as the source of the Being of all things that yet remains transcendent of them in its own nature; the One is in no way affected or diminished by these emanations, just as the Christian God in no way is affected by some sort of exterior \"nothingness\". Plotinus, using a venerable analogy that would become crucial for the (largely Neoplatonic) metaphysics of developed Christian thought, likens the One to the Sun which emanates light indiscriminately without thereby diminishing itself, or reflection in a mirror which in no way diminishes or otherwise alters the object being reflected.\nThe first emanation is Nous (Divine Mind, Logos, Order, Thought, Reason), identified metaphorically with the Demiurge in Plato's Timaeus. It is the first Will toward Good. From Nous proceeds the World Soul, which Plotinus subdivides into upper and lower, identifying the lower aspect of Soul with nature. From the world soul proceeds individual human souls, and finally, matter, at the lowest level of being and thus the least perfected level of the cosmos. Despite this relatively pedestrian assessment of the material world, Plotinus asserted the ultimately divine nature of material creation since it ultimately derives from the One, through the mediums of nous and the world soul. It is by the Good or through beauty that we recognize the One, in material things and then in the Forms.\nThe essentially devotional nature of Plotinus' philosophy may be further illustrated by his concept of attaining ecstatic union with the One (henosis). Porphyry relates that Plotinus attained such a union four times during the years he knew him. This may be related to enlightenment, liberation, and other concepts of mystical union common to many Eastern and Western traditions.\n\n\n=== The true human and happiness ===\n\nAuthentic human happiness for Plotinus consists of the true human identifying with that which is the best in the universe. Because happiness is beyond anything physical, Plotinus stresses the point that worldly fortune does not control true human happiness, and thus “… there exists no single human being that does not either potentially or effectively possess this thing we hold to constitute happiness.” (Enneads I.4.4) The issue of happiness is one of Plotinus’ greatest imprints on Western thought, as he is one of the first to introduce the idea that eudaimonia (happiness) is attainable only within consciousness.\nThe true human is an incorporeal contemplative capacity of the soul, and superior to all things corporeal. It then follows that real human happiness is independent of the physical world. Real happiness is, instead, dependent on the metaphysical and authentic human being found in this highest capacity of Reason. “For man, and especially the Proficient, is not the Couplement of Soul and body: the proof is that man can be disengaged from the body and disdain its nominal goods.” (Enneads I.4.14) The human who has achieved happiness will not be bothered by sickness, discomfort, etc., as his focus is on the greatest things. Authentic human happiness is the utilization of the most authentically human capacity of contemplation. Even in daily, physical action, the flourishing human’s “…Act is determined by the higher phase of the Soul.” (Enneads III.4.6) Even in the most dramatic arguments Plotinus considers (if the Proficient is subject to extreme physical torture, for example), he concludes this only strengthens his claim of true happiness being metaphysical, as the truly happy human being would understand that which is being tortured is merely a body, not the conscious self, and happiness could persist.\nPlotinus offers a comprehensive description of his conception of a person who has achieved eudaimonia. “The perfect life” involves a man who commands reason and contemplation. (Enneads I.4.4) A happy person will not sway between happy and sad, as many of Plotinus’ contemporaries believed. Stoics, for example, question the ability of someone to be happy (presupposing happiness is contemplation) if they are mentally incapacitated or even asleep. Plotinus disregards this claim, as the soul and true human do not sleep or even exist in time, nor will a living human who has achieved eudaimonia suddenly stop using its greatest, most authentic capacity just because of the body’s discomfort in the physical realm. “…The Proficient’s will is set always and only inward.” (Enneads I.4.11)\nOverall, happiness for Plotinus is \"...a flight from this world's ways and things.\" (Theat 176AB) and a focus on the highest, i.e. Forms and The One.\n\n\n=== Against causal astrology ===\nPlotinus seems to be one of the first to argue against the still popular notion of causal astrology. In the late tractate 2.3, \"Are the stars causes?\", Plotinus makes the argument that specific stars influencing one's fortune (a common Hellenistic theme) attributes irrationality to a perfect universe, and invites moral turpitude. He does, however, claim the stars and planets are ensouled, as witnessed by their movement.\n\n\n=== Plotinus's Relation to Plato ===\nSee Also, Allegorical interpretations of Plato\nFor several centuries after the Protestant Reformation, Neo-Platonism was condemned as a decadent and 'oriental' distortion of Platonism. In a famous 1929 essay, E. R. Dodds showed that key conceptions of Neo-Platonism could be traced from their origin in Plato's dialogues, through his immediate followers (e.g., Speusippus) and the Neo-Pythagoreans, to Plotinus and the Neo-Platonists. Thus Plotinus' philosophy was, he argued, 'not the starting-point of Neo-Platonism but its intellectual culmination.' Further research reinforced this view and by 1954 Merlan could say 'The present tendency is toward bridging rather than widening the gap separating Platonism from Neo-Platonism.'\nSince the 1950s, the Tübingen School of Plato interpretation has argued that the so-called 'unwritten doctrines' of Plato debated by Aristotle and the Early Academy strongly resemble Plotinus's metaphysics. In this case, the Neo-Platonic reading of Plato would be, at least in this central area, historically justified. This implies that Neo-Platonism is less of an innovation than it appears without the recognition of Plato's unwritten doctrines. Advocates of the Tübingen School emphasize this advantage of their interpretation. They see Plotinus as advancing a tradition of thought begun by Plato himself. Plotinus's metaphysics, at least in broad outline, was therefore already familiar to the first generation of Plato's students. This confirms Plotinus' own view, for he considered himself not the inventor of a system but the faithful interpreter of Plato's doctrines.\n\n\n=== Plotinus and the Gnostics ===\n\nAt least two modern conferences within Hellenic philosophy fields of study have been held in order to address what Plotinus stated in his tract Against the Gnostics and who he was addressing it to, in order to separate and clarify the events and persons involved in the origin of the term \"Gnostic\". From the dialogue, it appears that the word had an origin in the Platonic and Hellenistic tradition long before the group calling themselves \"Gnostics\"—or the group covered under the modern term \"Gnosticism\"—ever appeared. It would seem that this shift from Platonic to Gnostic usage has led many people to confusion. The strategy of sectarians taking Greek terms from philosophical contexts and re-applying them to religious contexts was popular in Christianity, the Cult of Isis and other ancient religious contexts including Hermetic ones (see Alexander of Abonutichus for an example).\nPlotinus and the Neoplatonists viewed Gnosticism as a form of heresy or sectarianism to the Pythagorean and Platonic philosophy of the Mediterranean and Middle East. He accused them of using senseless jargon and being overly dramatic and insolent in their distortion of Plato's ontology.\" Plotinus attacks his opponents as untraditional, irrational and immoral and arrogant. He also attacks them as elitist and blasphemous to Plato for the Gnostics despising the material world and its maker.\nThe Neoplatonic movement (though Plotinus would have simply referred to himself as a philosopher of Plato) seems to be motivated by the desire of Plotinus to revive the pagan philosophical tradition. Plotinus was not claiming to innovate with the Enneads, but to clarify aspects of the works of Plato that he considered misrepresented or misunderstood. Plotinus does not claim to be an innovator, but rather a communicator of a tradition. Plotinus referred to tradition as a way to interpret Plato's intentions. Because the teachings of Plato were for members of the academy rather than the general public, it was easy for outsiders to misunderstand Plato's meaning. However, Plotinus attempted to clarify how the philosophers of the academy had not arrived at the same conclusions (such as misotheism or dystheism of the creator God as an answer to the problem of evil) as the targets of his criticism.\n\n\n== Influence ==\n\n\n=== Ancient world ===\nThe emperor Julian the Apostate was deeply influenced by Neoplatonism, as was Hypatia of Alexandria, as well as many Christians, most notably Pseudo-Dionysius the Areopagite. St. Augustine, though often referred to as a \"Platonist,\" acquired his Platonist philosophy through the mediation of the Neoplatonist teachings of Plotinus.\n\n\n=== Christianity ===\nPlotinus' philosophy had an influence on the development of Christian theology. In A History of Western Philosophy, philosopher Bertrand Russell wrote that:\n\nTo the Christian, the Other World was the Kingdom of Heaven, to be enjoyed after death; to the Platonist, it was the eternal world of ideas, the real world as opposed to that of illusory appearance. Christian theologians combined these points of view, and embodied much of the philosophy of Plotinus. [...] Plotinus, accordingly, is historically important as an influence in moulding the Christianity of the Middle Ages and of theology.\n\nThe Eastern Orthodox position on energy, for example, is often contrasted with the position of the Roman Catholic Church, and in part this is attributed to varying interpretations of Aristotle and Plotinus, either through Thomas Aquinas for the Roman Catholics or Gregory of Nyssa for the Orthodox Christians.\n\n\n=== Islam ===\nNeoplatonism and the ideas of Plotinus influenced medieval Islam as well, since the Sunni Abbasids fused Greek concepts into sponsored state texts, and found great influence amongst the Ismaili Shia. Persian philosophers as well, such as Muhammad al-Nasafi and Abu Yaqub Sijistani. By the 11th century, Neoplatonism was adopted by the Fatimid state of Egypt, and taught by their da'i. Neoplatonism was brought to the Fatimid court by Hamid al-Din al-Kirmani, although his teachings differed from Nasafi and Sijistani, who were more aligned with original teachings of Plotinus. The teachings of Kirmani in turn influenced philosophers such as Nasir Khusraw of Persia.\n\n\n=== Renaissance ===\nIn the Renaissance the philosopher Marsilio Ficino set up an Academy under the patronage of Cosimo de Medici in Florence, mirroring that of Plato. His work was of great importance in reconciling the philosophy of Plato directly with Christianity. One of his most distinguished pupils was Pico della Mirandola, author of An Oration On the Dignity of Man. Our term 'Neo Platonist' has its origins in the Renaissance.\n\n\n=== England ===\nIn England, Plotinus was the cardinal influence on the 17th-century school of the Cambridge Platonists, and on numerous writers from Samuel Taylor Coleridge to W. B. Yeats and Kathleen Raine.\n\n\n=== India ===\nSarvepalli Radhakrishnan and Ananda Coomaraswamy used the writing of Plotinus in their own texts as a superlative elaboration upon Indian monism, specifically Upanishadic and Advaita Vedantic thought. Coomaraswamy has compared Plotinus' teachings to the Hindu school of Advaita Vedanta (advaita meaning \"not two\" or \"non-dual\").\nAdvaita Vedanta and Neoplatonism have been compared by J. F. Staal, Frederick Copleston, Aldo Magris and Mario Piantelli, Radhakrishnan, Gwen Griffith-Dickson, and John Y. Fenton.\nThe joint influence of Advaitin and Neoplatonic ideas on Ralph Waldo Emerson was considered by Dale Riepe in 1967.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nCritical editions of the Greek text\nÉmile Bréhier, Plotin: Ennéades (with French translation), Collection Budé, 1924–1938.\nPaul Henry and Hans-Rudolf Schwyzer (eds.), Editio maior (3 volumes), Paris, Desclée de Brouwer, 1951–1973.\nPaul Henry and Hans-Rudolf Schwyzer (eds.), Editio minor, Oxford, Oxford Classical Text, 1964–1982.\nComplete English translation\nPlotinus. The Enneads (translated by Stephen MacKenna), London, Medici Society, 1917–1930.\nA. H. Armstrong, Plotinus. Enneads (with Greek text), Loeb Classical Library, 7 vol., 1966–1988.\nThomas Taylor, Collected Writings of Plotinus, Frome, Prometheus Trust, 1994. ISBN 1-898910-02-2 (contains approximately half of the Enneads)\nLexica\nJ. H. Sleeman and G. Pollet, Lexicon Plotinianum, Leiden, 1980.\nRoberto Radice (ed.), Lexicon II: Plotinus, Milan, Biblia, 2004. (Electronic edition by Roberto Bombacigno)\nThe Life of Plotinus by Porphyry\nPorphyry, \"On the Life of Plotinus and the Arrangement of his Works\" in Mark Edwards (ed.), Neoplatonic Saints: The Lives of Plotinus and Proclus by their Students, Liverpool, Liverpool University Press, 2000.\nAnthologies of texts in translation, with annotations\nKevin Corrigan, Reading Plotinus: A Practical Introduction to Neoplatonism, West Lafayette, Purdue University Press, 2005.\nJohn M. Dillon and Lloyd P. Gerson, Neoplatonic Philosophy: Introductory Readings, Hackett, 2004.\nIntroductory works\nKevin Corrigan, Reading Plotinus. A Practical Introduction to Neoplatonism, Purdue University Press, 1995.\nLloyd P. Gerson, Plotinus, New York, Routledge, 1994.\nLLoyd P. Gerson (ed.), The Cambridge Companion to Plotinus, Cambridge, 1996.\nDominic J. O'Meara, Plotinus. An Introduction to the Enneads, Oxford, Clarendon Press, 1993. (Reprinted 2005)\nJohn M. Rist, Plotinus. The Road to Reality, Cambridge, Cambridge University Press, 1967.\nMajor commentaries in English\nCinzia Arruzza, Plotinus: Ennead II.5, On What Is Potentially and What Actually, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2015, ISBN 978-1-930972-63-6\nMichael Atkinson, Plotinus: Ennead V.1, On the Three Principal Hypostases, Oxford, 1983.\nKevin Corrigan, Plotinus' Theory of Matter-Evil: Plato, Aristotle, and Alexander of Aphrodisias (II.4, II.5, III.6, I.8), Leiden, 1996.\nJohn N. Deck, Nature, Contemplation and the One: A Study in the Philosophy of Plotinus, University of Toronto Press, 1967; Paul Brunton Philosophical Foundation, 1991.\nJohn M. Dillon, H.J. Blumenthal, Plotinus: Ennead IV.3-4.29, \"Problems Concerning the Soul, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2015, ISBN 978-1-930972-89-6\nEyjólfur K. Emilsson, Steven K. Strange, Plotinus: Ennead VI.4 & VI.5: On the Presence of Being, One and the Same, Everywhere as a Whole, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2015, ISBN 978-1-930972-34-6\nBarrie Fleet, Plotinus: Ennead III.6, On the Impassivity of the Bodiless, Oxford, 1995.\nBarrie Fleet, Plotinus: Ennead IV.8, On the Descent of the Soul into Bodies, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2012. ISBN 978-1-930972-77-3\nLloyd P. Gerson, Plotinus: Ennead V.5, That the Intelligibles are not External to the Intellect, and on the Good, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2013, ISBN 978-1-930972-85-8\nGary M. Gurtler, SJ, Plotinus: Ennead IV.4.30-45 & IV.5, \"Problems Concerning the Soul, The Enneads of Plotinus Series edited by John M. Dillon and Andrew Smith, Parmenides Publishing, 2015, ISBN 978-1-930972-69-8\nW. Helleman-Elgersma, Soul-Sisters. A Commentary on Enneads IV, 3 (27), 1–8 of Plotinus, Amsterdam, 1980.\nJames Luchte, Early Greek Thought: Before the Dawn. London: Bloomsbury Publishing, 2011. ISBN 978-0567353313.\nKieran McGroarty, Plotinus on Eudaimonia: A Commentary on Ennead I.4, Oxford, 2006.\nP. A. Meijer, Plotinus on the Good or the One (VI.9), Amsterdam, 1992.\nH. Oosthout, Modes of Knowledge and the Transcendental: An Introduction to Plotinus Ennead V.3, Amsterdam, 1991.\nJ. Wilberding, Plotinus' Cosmology. A study of Ennead II. 1 (40), Oxford, 2006.\nA. M. Wolters, Plotinus on Eros (eNN. III.5), Amsterdam, 1972.\nGeneral works on Neoplatonism\nRobert M. Berchman, From Philo to Origen: Middle Platonism in Transition, Chico, Scholars Press, 1984.\nFrederick Copleston, A History of Philosophy: Vol. 1, Part 2. ISBN 0-385-00210-6\nP. Merlan, \"Greek Philosophy from Plato to Plotinus\" in A. H. Armstrong (ed.), The Cambridge History of Later Greek and Early Medieval Philosophy, Cambridge, 1967. ISBN 0-521-04054-X\nPauliina Remes, Neoplatonism (Ancient Philosophies), University of California Press, 2008.\nThomas Taylor, The fragments that remain of the lost writings of Proclus, surnamed the Platonic successor, London, 1825. (Selene Books reprint edition, 1987. ISBN 0-933601-11-5)\nRichard T. Wallis, Neoplatonism and Gnosticism, University of Oklahoma, 1984. ISBN 0-7914-1337-3 and ISBN 0-7914-1338-1\nStudies on some aspects of Plotinus' work\nR. B. Harris (ed.), Neoplatonism and Indian Thought, Albany, 1982.\nGiannis Stamatellos, Plotinus and the Presocratics. A Philosophical Study of Presocratic Influences in Plotinus' Enneads, Albany, 2008.\nN. Joseph Torchia, Plotinus, Tolma, and the Descent of Being, New York, Peter Lang, 1993. ISBN 0-8204-1768-8\nAntonia Tripolitis, The Doctrine of the Soul in the thought of Plotinus and Origen, Libra Publishers, 1978.\nM. F. Wagner (ed.), Neoplatonism and Nature. Studies in Plotinus' Enneads, Albany, 2002.\n\n\n== External links ==\nWorks by Plotinus at Project Gutenberg\nWorks by or about Plotinus at Internet Archive\nText of the Enneads\nGreek original (page scans of Adolf Kirchhoff's 1856 Teubner edition) with English (complete) and French (partial) translations;\nOnline English translations\nThe Internet Classics Archive of MIT The Six Enneads, translated into English by Stephen MacKenna and B.S. Page.\nOn the Intelligible Beauty, translated by Thomas Taylor Ennead V viii(see also the Catalog of other books which include Porphyry, Plotinus' biographer - TTS Catalog).\nPhilosophy Archive: An Essay on the Beautiful, translated into English by Thomas Taylor in 1917\nOn the First Good and the Other Goods, Ennead 1.7 Translated by Eric S. Fallick, 2011\nOn Dialectic, Ennead 1.3 Translated by Eric S. Fallick, 2015\nEncyclopedias\nGerson, Lloyd P. \"Plotinus\". Stanford Encyclopedia of Philosophy. \nMoore, Edward. \"Plotinus\". Internet Encyclopedia of Philosophy. \nBibliographies\nIn English, by Richard Dufour.\nIn French by Pierre Thillet.\nPlotinus' Criticism of Aristotle's Categories (Enneads VI, 1-3) with an annotated bibliography", "ns": 0, "pageid": 38422, "title": "Plotinus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}