{"batchcomplete": "", "query": {"normalized": [{"to": "Pope John XXI", "from": "Pope_John_XXI"}], "pages": {"23830": {"extract": "Pope John XXI (Latin: Ioannes XXI; c. 1215 – 20 May 1277), born Peter Juliani (Latin: Petrus Iulianus; Portuguese: Pedro Julião), was Pope from 8 September 1276 to his death in 1277. Apart from Damasus I (from Roman Lusitania), he has been the only Portuguese pope. He is usually identified with the logician and herbalist Peter of Spain (Latin: Petrus Hispanus; Portuguese: Pedro Hispano), which would make him the only pope to have been a physician.\n\"Pope John XXI\" was actually the 20th pope named John, but decided to skip the number XX.\n\n\n== Life ==\n\n\n=== Early life ===\nPedro Julião was probably born in Lisbon between 1210 and 1220. He started his studies at the episcopal school of Lisbon Cathedral and later joined the University of Paris, although some historians claim that he was educated at Montpellier. Wherever he studied, he concentrated on medicine, theology, logic, physics, metaphysics, and Aristotle's dialectic. He is traditionally and usually identified with the medical author Peter of Spain, an important figure in the development of logic and pharmacology. Peter of Spain taught at the University of Siena in the 1240s and his Summulae Logicales was used as a university textbook on Aristotelian logic for the next three centuries. At the court in Lisbon, he was the councilor and spokesman for King Afonso III in church matters. Later, he became prior of Guimarães.\nHe was Archdeacon of Vermoim (Vermuy) in the Archdiocese of Braga. He tried to become bishop of Lisbon but was defeated. Instead, he became the Master of the school of Lisbon. Peter became the physician of Pope Gregory X (1271–76) early in his reign. In March 1273 he was elected Archbishop of Braga, but did not assume that post; instead, on 3 June 1273, Pope Gregory X created him Cardinal Bishop of Tusculum (Frascati).\n\n\n=== Papacy ===\nAfter the death of Pope Adrian V on 18 August 1276, Peter was elected Pope on 8 September. He was crowned a week later on 20 September. One of John XXI's few acts during his brief reign was the reversal of a decree recently passed at the Second Council of Lyon (1274); the decree had not only confined cardinals in solitude until they elected a successor Pope, but also progressively restricted their supplies of food and wine if their deliberations took too long. Though much of John XXI's brief papacy was dominated by the powerful Cardinal Giovanni Gaetano Orsini, who succeeded him as Pope Nicholas III. John attempted to launch a crusade for the Holy Land, pushed for a union with the Eastern church, and did what he could to maintain peace between the Christian nations. He also launched a mission to convert the Tatars, but he died before it could start. To secure the necessary quiet for his medical studies, he had an apartment added to the papal palace at Viterbo, to which he could retire when he wished to work undisturbed. On 14 May 1277, while the pope was alone in this apartment, it collapsed; John was buried under the ruins and died on 20 May in consequence of the serious injuries he had received. He was buried in the Duomo di Viterbo, where his tomb can still be seen.\n\n\n== Legacy ==\nAfter his death, it was rumored that John XXI had actually been a necromancer, a suspicion frequently directed towards the few scholars among medieval popes (see, e.g., Sylvester II). It was also said that his death had been an act of God, stopping him from completing a heretical treatise. Since the works of \"Peter of Spain\" continued to be studied and appreciated, however, Dante Alighieri placed \"Pietro Spano\" in his Paradiso's Heaven of the Sun with the spirits of other great religious scholars.\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Bibliography ===\nGuiraud, J. and L. Cadier (editors), Les registres de Grégoire X et de Jean XXI (1271-1277) (Paris, 1892-1898) [Bibliothèque de l'Ecole française à Rome, 2 série, 12]. (in Latin)\nWalter, Fritz, Die Politik der Kurie unter Gregor X (Berlin 1894). (in German)\nStapper, Richard, Papst Johannes XXI. Eine Monographie (Münster 1898) [Kirchengeschichtliche Studien, Volume 4, no. 4]. (in German)\nGregorovius, Ferdinand, History of Rome in the Middle Ages, Volume V. part 2, second edition, revised (London: George Bell, 1906).\nH. D. Sedgwick, Italy in the Thirteenth Century Volume II (Boston-New York 1912).\nMazzi-Belli, V., \"Pietro Hispano papa Giovanni XXI,\" Rivista di storia della medicina 15 (1971), 39-87. (in Italian)\nMorceau, Joseph, \"Un pape portugais: Jean XXI, dénommé Pierre d'Espagne,\" Teoresi 24 (1979), 391-407. (in French)\nMaxwell-Stuart, P. G. Chronicle of the Popes: The Reign-by-Reign Record of the Papacy from St. Peter to the Present, Thames & Hudson, 2002, p. 119. ISBN 0-500-01798-0.\nJosé Francisco Meirinhos: Giovanni XXI. In: Massimo Bray (ed.): Enciclopedia dei Papi, Istituto della Enciclopedia Italiana, Vol. 2  (Niccolò I, santo, Sisto IV), Rome, 2000, OCLC 313581688\nTemplate:DBI\nJean Claude Bologne: La Naissance Interdite; Stérilité, avortement, contraception au Moyen-Age. Orban, Paris, 1988, ISBN 2-85565-434-3.\nMichael Hanst (1992). \"Johannes XXI\". In Bautz, Friedrich Wilhelm. Biographisch-Bibliographisches Kirchenlexikon (BBKL) (in German). 3. Herzberg: Bautz. cols. 224–228. ISBN 3-88309-035-2. \nJoachim Telle: Petrus Hispanus in der altdeutschen Medizinliteratur und Texte unter besonderer Berücksichtigung des ‚Thesaurus pauperum‘. 2 vols., Heidelberg, 1972.\n\n\n== External links ==\nLiterature by and about Pope John XXI in the German National Library catalogue\nWorks by and about Pope John XXI in the Deutsche Digitale Bibliothek (German Digital Library)\nJ. P. Kirsch: Art. Pope John XXI (XX), in: The Catholic Encyclopedia, Vol. VIII (1910)\nSalvino Leone: Archive copy at the Wayback Machine\nJoke Spruyt: Peter of Spain (2001), in: Stanford Encyclopedia of Philosophy", "ns": 0, "pageid": 23830, "title": "Pope John XXI"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}