{"batchcomplete": "", "query": {"normalized": [{"to": "Porphyry (philosopher)", "from": "Porphyry_(philosopher)"}], "pages": {"794399": {"extract": "Porphyry of Tyre (/ˈpɔːrfəri/; Greek: Πορφύριος, Porphyrios, Arabic: Furfūriyūs; c. 234 – c. 305 AD) was a Neoplatonic philosopher who was born in Tyre, in the Roman Empire. He edited and published the Enneads, the only collection of the work of his teacher Plotinus. His commentary on Euclid's Elements was used as a source by Pappus of Alexandria.\nHe also wrote many works himself on a wide variety of topics. His Isagoge, or Introduction, is an introduction to logic and philosophy, and in Latin translation it was the standard textbook on logic throughout the Middle Ages. In addition, through several of his works, most notably Philosophy from Oracles and Against the Christians, which was banned by emperor Constantine the Great, he was involved in a controversy with a number of early Christians.\n\n\n== Biography ==\nPorphyry was born in Tyre. His parents named him Malchus (\"king\" in the Semitic languages) but his teacher in Athens, Cassius Longinus, gave him the name Porphyrius (\"clad in purple\"), possibly a reference to his Phoenician heritage, or a punning allusion to his name and the color of royal robes. Under Longinus he studied grammar and rhetoric.\nIn 262 he went to Rome, attracted by the reputation of Plotinus, and for six years devoted himself to the practice of Neoplatonism, during which time he severely modified his diet. At one point he became suicidal. On the advice of Plotinus he went to live in Sicily for five years to recover his mental health. On returning to Rome, he lectured on philosophy and completed an edition of the writings of Plotinus (who had died in the meantime) together with a biography of his teacher. Iamblichus is mentioned in ancient Neoplatonic writings as his pupil, but this most likely means only that he was the dominant figure in the next generation of philosophers. The two men differed publicly on the issue of theurgy.\nIn his later years, he married Marcella, a widow with seven children and an enthusiastic student of philosophy. Little more is known of his life, and the date of his death is uncertain.\n\n\n== Introduction (Isagoge) ==\n\nPorphyry is best known for his contributions to philosophy. Apart from writing the Aids to the Study of the Intelligibles (Ἀφορμαὶ πρὸς τὰ νοητά; Sententiae Ad Intelligibilia Ducentes), a basic summary of Neoplatonism, he is especially appreciated for his Introduction to Categories (Introductio in Praedicamenta or Isagoge et in Aristotelis Categorias commentarium), a very short work often considered to be a commentary on Aristotle's Categories, hence the title. According to Barnes (2003), however, the correct title is simply Introduction (Εἰσαγωγή Isagoge), and the book is an introduction not to the Categories in particular, but to logic in general, comprising as it does the theories of predication, definition, and proof. The Introduction describes how qualities attributed to things may be classified, famously breaking down the philosophical concept of substance into the five components genus, species, difference, property, accident.\nAs Porphyry's most influential contribution to philosophy, the Introduction to Categories incorporated Aristotle's logic into Neoplatonism, in particular the doctrine of the categories of being interpreted in terms of entities (in later philosophy, \"universal\"). Boethius' Isagoge, a Latin translation of Porphyry's \"Introduction\", became a standard medieval textbook in European schools and universities, which set the stage for medieval philosophical-theological developments of logic and the problem of universals. In medieval textbooks, the all-important Arbor porphyriana (\"Porphyrian Tree\") illustrates his logical classification of substance. To this day, taxonomy benefits from concepts in Porphyry's Tree, in classifying living organisms (see cladistics).\nThe Introduction was translated into Arabic by Abd-Allāh Ibn al-Muqaffaʿ from a Syriac version. With the Arabicized name Isāghūjī (إيساغوجي) it long remained the standard introductory logic text in the Muslim world and influenced the study of theology, philosophy, grammar, and jurisprudence. Besides the adaptations and epitomes of this work, many independent works on logic by Muslim philosophers have been entitled Isāghūjī. Porphyry's discussion of accident sparked a long-running debate on the application of accident and essence.\n\n\n== Philosophy from Oracles (De Philosophia ex Oraculis Haurienda) ==\nPorphyry is also known as an opponent of Christianity and defender of Paganism; his precise contribution to the philosophical approach to traditional religion may be discovered in the fragments of Philosophy from Oracles (Περὶ τῆς ἐκ λογίων φιλοσοφίας; De Philosophia ex Oraculis Haurienda), which was originally three books in length. There is debate as to whether it was written in his youth (as Eunapius reports) or closer in time to the persecutions of Christians under Diocletian and Galerius.\nWhether or not Porphyry was the pagan philosopher opponent in Lactantius' Divine Institutes, written at the time of the persecutions, has long been discussed. The fragments of the Philosophy from Oracles are only quoted by Christians, especially Eusebius, Theodoret, Augustine, and John Philoponus. The fragments contain oracles identifying proper sacrificial procedure, the nature of astrological fate, and other topics relevant for Greek and Roman religion in the third century. Whether this work contradicts his treatise defending vegetarianism, which also warned the philosopher to avoid animal sacrifice, is disputed among scholars.\n\n\n== Against the Christians (Adversus Christianos) ==\nDuring his retirement in Sicily, Porphyry wrote Against the Christians (Κατὰ Χριστιανῶν; Adversus Christianos) which consisted of fifteen books. Porphyry acknowledged Jesus Christ only as an outstanding philosopher. Some thirty Christian apologists, such as Methodius, Eusebius, Apollinaris, Augustine, Jerome, etc., responded to his challenge. In fact, everything known about Porphyry’s arguments is found in these refutations, largely because Theodosius II ordered every copy burned in A.D. 435 and again in 448.\nPorphyry became one of the most able pagan adversaries of Christianity of his day. His aim was not to disprove the substance of Christianity’s teachings but rather the records within which the teachings are communicated.\nHis criticisms may have targeted Christians more than Christ; he is reported to have said in another work (the Philosophy from Oracles): \"The gods have proclaimed Christ to have been most pious, but the Christians are a confused and vicious sect.\"\nAccording to Jerome, Porphyry especially attacked the prophecy of Daniel because Jews and Christians pointed to the historical fulfillment of its prophecies as a decisive argument. But these prophecies, he maintained, were written not by Daniel but by some Jew who in the time of Antiochus Epiphanes (d. 164 B.C.) gathered up the traditions of Daniel's life and wrote a history of recent past events but in the future tense, falsely dating them back to Daniel's time.\nDaniel did not predict so much future events as he narrated past ones. Finally what he had told up to Antiochus contained true history; if anything was guessed beyond that point it was false, for he had not known the future. (quoted by Jerome)\nThe first part of Daniel, with the exception of the dream in Daniel 2, is historic, not prophetic. Porphyry, attacking only the prophetic portion, declares it to be merely a late anonymous narrative of past events, purporting to have been predicted long before by Daniel. Thus Porphyry's scheme was based on the supposed spuriousness of Daniel's prophecies.\nPorphyry devised his own interpretation where the third “prophetic kingdom” was Alexander, and assigned the Macedonian Ptolemies and Seleucids to the fourth kingdom. From among these he chose ten kings, making the eleventh to be Antiochus Epiphanes. In this way he threw his main strength against the book of Daniel, recognizing that if this pillar of faith be shaken, the whole structure of prophecy must tremble. If the writer was not Daniel, then he lied on a frightful scale, ascribing to God prophecies which were never uttered, and making claim of miracles that were never wrought. And if Daniel's authorship could be shown to be false, then Christ Himself would be proved to bear witness to an imposter. (Matt. 24: 15.) Porphyry's thesis was adopted by Edward Gibbon, the English deist Anthony Collins, and most Modernist scholars.\nAugustine and the 5th-century ecclesiastical historian Socrates of Constantinople, assert that Porphyry was once a Christian.\n\n\n== Other subjects ==\nPorphyry was opposed to the theurgy of his disciple Iamblichus. Much of Iamblichus' mysteries is dedicated to the defense of mystic theurgic divine possession against the critiques of Porphyry. French philosopher Pierre Hadot maintains that for Porphyry, spiritual exercises are an essential part of spiritual development.\nPorphyry was, like Pythagoras, an advocate of vegetarianism on spiritual and ethical grounds. These two philosophers are perhaps the most famous vegetarians of classical antiquity. He wrote the On Abstinence from Animal Food (Περὶ ἀποχῆς ἐμψύχων; De Abstinentia ab Esu Animalium), advocating against the consumption of animals, and he is cited with approval in vegetarian literature up to the present day.\nPorphyry also wrote widely on astrology, religion, philosophy, and musical theory. He produced a History of Philosophy (Philosophos historia) with vitae of philosophers that included a life of his teacher, Plotinus. His life of Plato from book iv exists only in quotes by Cyril of Alexandria. His book Vita Pythagorae on the life of Pythagoras is not to be confused with the book of the same name by Iamblichus. His commentary on Ptolemy's Harmonics (Eis ta Harmonika Ptolemaiou hypomnēma) is an important source for the history of ancient harmonic theory.\n\n\n== Works by Porphyry ==\nAd Gaurum (of uncertain attribution) – ed. K. Kalbfleisch. Abhandlungen der Preussischen Akadamie der Wissenschaft. phil.-hist. kl. (1895): 33-62.\nAd Gedalium (a lost commentary on Aristotle's Categories in seven books (see Simplicius, In Aristotelis Categorias commentarium, 2.5-9), the testimonia are published in Andrew Smith (ed.), Porphyrius, Porphyrii Philosophi fragmenta. Fragmenta Arabica David Wasserstein interpretante, Berlin: Walter de Gruyter, 1993\nContra Christianos – ed.: Adolf von Harnack, Porphyrius, \"Gegen die Christen,\" 15 Bücher: Zeugnisse, Fragmente und Referate. Abhandlungen der königlich preussischen Akademie der Wissenschaften: Jahrgang 1916: philosoph.-hist. Klasse: Nr. 1 (Berlin: 1916).\nContra los Cristianos: Recopilación de Fragmentos, Traducción, Introducción y Notas – E. A. Ramos Jurado, J. Ritoré Ponce, A. Carmona Vázquez, I. Rodríguez Moreno, J. Ortolá Salas, J. M. Zamora Calvo (Cádiz: Servicio de Publicaciones de la Universidad de Cádiz 2006).\nCorpus dei Papiri Filosofici Greci e Latini III: Commentari – (Florence: Leo S. Olschki, 1995). <# 6 and #9 may or may not be by Porphyry>\nDe abstinentia ab esu animalium – Jean Bouffartigue, M. Patillon, and Alain-Philippe Segonds, edd., 3 vols., Budé (Paris, 1979–1995).\nDe Philosophia ex oraculis haurienda – G. Wolf, ed. (Berlin: 1956).\nEpistula ad Anebonem – A. R. Sodano ed. (Naples: L'arte Tipografia, 1958).\nFragmenta – Andrew Smith, ed. (Stvtgardiae et Lipsiae: B. G. Tevbneri, 1993).\nThe Homeric Questions: a Bilingual Edition – Lang Classical Studies 2, R. R. Schlunk, trans. (Frankfurt-am-Main: Lang, 1993).\nIsagoge, Stefan Weinstock, ed., in Catalogus Codicum astrologorum Graecorum, Franz Cumont, ed. (Brussels, 1940): V.4, 187-228. (This is an introduction to the Tetrabiblos of Ptolemy, not to be confused with the more famous Isagoge on logic.)\nKommentar zur Harmonielehre des Ptolemaios Ingemar Düring. ed. (Göteborg: Elanders, 1932).\nOpuscula selecta Augusts Nauck, ed. (Lipsiae: B. G. Tevbneri, 1886) (online at archive.org).\nPorphyrii in Platonis Timaeum commentarium fragmenta A. R. Sodano, ed. (Napoli: 1964).\nPorphyry, the Philosopher, to Marcella: Text and Translation with Introduction and Notes Kathleen O’Brien Wicker, trans., Text and Translations 28; Graeco-Roman Religion Series 10 (Atlanata: Scholars Press, 1987).\nPros Markellan Griechiser Text, herausgegeben, übersetzt, eingeleitet und erklärt von W. Pötscher (Leiden: E. J. Brill, 1969).\nSententiae ad Intelligibilia Ducentes – E. Lamberz, ed. (Leipzig: Teubner, 1975).\nVie de Pythagore, Lettre à Marcella – E. des Places, ed. and trans. (Paris: Les Belles Lettre, 1982).\nLa Vie de Plotin – Luc Brisson, ed. Histoire de l'antiquité classique 6 & 16 (Paris: Librairie Philosophique J. Vrin: 1986–1992), 2 vols.\nVita Plotini – in Plotinus, Armstrong, ed. LCL (Cambridge, Mass.: Harvard University Press, 1968), 2-84.\n\n\n== Translations ==\nIsagoge – Mediaeval Sources in Translation 16, E. Warren, trans. (Toronto: Pontifical Institute of Mediaeval Studies, 1975).\nPorphyry's Introduction. Translation of the 'Isagoge' with a Commentary by J. Barnes (Oxford, 2003).\nPorphyry. On Aristotle's Categories. Translated by Steven K. Strange (Ithaca, New York, 1992).\nThe Organon or Logical Treatises of Aristotle with the Introduction of Porphyry. Bohn's Classical Library 11–12, Octavius Freire Owen, trans. (London: G. Bell, 1908–1910), 2 vols.\nFive Texts on the Mediaeval Problem of Universals: Porphyry, Boethius, Abelard, Duns Scotus, Ockham Paul Vincent Spade, trans. (Indianapolis: Hackett, 1994).\nSelect Works of Porphyry. Translated by T. Taylor (Guildford, 1994). Contains Abstinence from Eating Animal Food, the Sententiae and the Cave of the Nymphs.\nLaunching-Points to the Realm of Mind. Translation of the 'Sententiae' by K. Guthrie (Grand Rapids, Michigan, 1988).\nNeoplatonic Saints: The Lives of Plotinus and Proclus. Translated Texts for Historians 35 (Liverpool: Liverpool University Press, 2000).\nOn Abstinence from Killing Animals – Gilliam Clark, trans. (Ithaca: Cornell University Press, 2000).\nThe Cave of the Nymphs in the Odyssey A revised text with translation by Seminar Classics 609, State University of New York at Buffalo, Arethusa Monograph 1 (Buffalo: Dept. of Classics, State University of New York at Buffalo, 1969).\nOn the Cave of the Nymphs – Robert Lamberton, trans. (Barrytown, N. Y.: Station Hill Press, 1983).\nPorphyry Against the Christians – R. M. Berchman, trans., Ancient Mediterranean and Medieval Texts and Contexts 1 (Leiden: Brill, 2005).\nPorphyry’s Against the Christians: The Literary Remains – R. Joseph Hoffmann, trans. (Amherst: Prometheus Books, 1994).\nThe Homeric Questions – edited and translated by R. Schlunk (New York, 1993).\nPorphyry's Letter to His Wife Marcella Concerning the Life of Philosophy and the Ascent to the Gods. Translated by Alice Zimmern (Grand Rapids, Michigan, 1989).\nPorphyry the Philosopher, Introduction to the Tetrabiblos and Serapio of Alexandria, Astrological Definitions – Translated by James Herschel Holden (Tempe, Az.: A.F.A., Inc., 2009).\nTranslations of several fragments are contained in Appendix 1 of Religion and Identity in Porphyry of Tyre by Aaron Johnson (Cambridge, 2013).\n\n\n== See also ==\nMacarius Magnes – his work Apocriticus contains a series of excerpts from Porphyry's Against the Christians\n\n\n== Notes ==\n\n\n== References ==\nIamblichus: De mysteriis. Translated with an Introduction and Notes by Emma C. Clarke, John M. Dillon and Jackson P. Hershbell (Society of Biblical Literature; 2003) ISBN 1-58983-058-X.\nBarker, A. (2003). \"Porphyry,\" in S. Hornblower and A. Spawforth, eds., Oxford Classical Dictionary, revised 3rd edition, pp. 1226–1227.\nBarnes, J. Trans. (2003). Porphyry: Introduction. Clarendon Press.\nBeutler, R. (1894–1980). \"Porphyrios (21)\" in A. Pauly, G. Wissowa, W. Kroll, K. Witte, K. Mittelhaus and K. Ziegler, eds., Paulys Realencyclopädie der classischen Altertumswissenschaft, vol. 22.1.\nBidez, J. (1913). Vie de Porphyre. Ghent.\nClark, Gillian, \"Porphyry of Tyre on the New Barbarians,\" in R. Miles (ed), Constructing Identities in Late Antiquity (London: Routledge, 1999), 112–132; = in Eadem, Body and Gender, Soul and Reason in Late Antiquity (Farnham; Burlington, VT, Ashgate, 2011) (Variorum collected studies series, CS978), art. XIV.\nClark, Gillian, \"Philosophic Lives and the philosophic life: Porphyry and Iamblichus,\" in T. Hägg and P. Rousseau (eds), Greek Biography and Panegyric in Late Antiquity (Berkeley and Los Angeles, University of California Press, 2000), 29–51; = in Eadem, Body and Gender, Soul and Reason in Late Antiquity (Farnham; Burlington, VT, Ashgate, 2011) (Variorum collected studies series, CS978), art. XV.\nClark, Gillian, \"Fattening the soul: Christian asceticism and Porphyry On Abstinence,\" Studia Patristica, 35, 2001, 41-51; = in Eadem, Body and Gender, Soul and Reason in Late Antiquity (Farnham; Burlington, VT, Ashgate, 2011) (Variorum collected studies series, CS978), art. XVI.\nDigeser, E. D. (1998). \"Lactantius, Porphyry, and the Debate over Religious Toleration,\" The Journal of Roman Studies 88, pp. 129–146.\nEmilsson, E., \"Porphyry\". Retrieved April 19, 2009.\nFroom, LeRoy (1950). The Prophetic Faith of our Fathers (DjVu and PDF). 1. \nGirgenti, G. (1987) Porfirio negli ultimi cinquant'anni: bibliografia sistematica e ragionata della letteratura primaria e secondaria riguardante il pensiero porfiriano e i suoi influssi storici Milan.\nO'Connor, J. and E. Robertson, \"Porphyry Malchus\". Retrieved April 14, 2009.\nSarton, G. (1936). \"The Unity and Diversity of the Mediterranean World,\" Osiris 2, pp. 406–463. (In JSTOR.)\nSmith, Andrew (1987) Porphyrian Studies since 1913, in W. Haase, ed., Aufstieg und Niedergang der Römischen Welt II.36.2, pp. 717–773.\nSmith, Andrew (1974) Porphyry's Place in the Neoplatonic Tradition. A Study in post-Plotinian Neoplatonism, The Hague, Nijhoff.\nWilken, R. (1979). \"Pagan Criticism of Christianity: Greek Religion and Christian Faith,\" in W. Schoedel and R. Wilken, eds., Early Christian Literature and the Classical Intellectual Tradition, pp. 117–134.\nZuiddam, B. A. \"Old Critics and Modern Theology,\" Dutch Reformed Theological Journal (South Africa), xxxvi, 1995, № 2.\n\n\n== External links ==\n Media related to Porphyry (philosopher) at Wikimedia Commons\n Works written by or about Porphyry at Wikisource\n Greek Wikisource has original text related to this article: Πορφύριος\nPorphyry Malchus (mathematician) - entry in MacTutor History of Maths Archives.\nEmilsson, Eyjólfur. \"Porphyry\". Stanford Encyclopedia of Philosophy. .\nΠερὶ τοῦ ἐν Ὀδυσσείᾳ τῶν Νυμφῶν Ἄντρου (The Cave of the Nymphs in the Odyssey), original Greek text.\nΕἰσαγωγὴ εἰς τὴν Ἀποτελεσματικὴν τοῦ Πτολεμαίου (Introduction to Ptolemy's Tetrabiblos), original Greek text.\nPorphyry, On Abstinence from Animal Food, Book I, translated by Thomas Taylor.\nPorphyry, On Abstinence from Animal Food, Book II, translated by Thomas Taylor.\nPorphyry, On Abstinence from Animal Food, Book III, translated by Thomas Taylor.\nPorphyry, On Abstinence from Animal Food, Book IV, translated by Thomas Taylor.\nPorphyry, On the Cave of Nymphs, translated by Thomas Taylor.\nPorphyry, Auxiliaries to the Perception of Intelligible Natures, translated by Thomas Taylor.\nPorphyry, Isagoge, translated by Octavius Freire Owen.\nThe Isagoge, or Introduction of Porphyry, translated by Thomas Taylor with an extensive preface by the translator.\nPorphyry, On the Life of Plotinus\nPorphyry, Comments on the Book of Daniel.\nAdditional texts, edited by Roger Pearse", "ns": 0, "pageid": 794399, "title": "Porphyry (philosopher)"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}