{"batchcomplete": "", "query": {"pages": {"24086": {"extract": "Protagoras (/proʊˈtæɡərəs/; Greek: Πρωταγόρας; c. 490 – c. 420 BC) was a pre-Socratic Greek philosopher and is numbered as one of the sophists by Plato. In his dialogue, Protagoras, Plato credits him with having invented the role of the professional sophist.\nHe also is believed to have created a major controversy during ancient times through his statement that, \"Man is the measure of all things\", interpreted by Plato to mean that there is no absolute truth, but that which individuals deem to be the truth. Although there is reason to question the extent of the interpretation of his arguments that has followed, that concept of individual relativity was revolutionary for the time, and contrasted with other philosophical doctrines that claimed the universe was based on something objective, outside of human influence or perceptions.\n\n\n== Background ==\nProtagoras was born in Abdera, Thrace, opposite the island of Thasos (today part of the Xanthi regional unit). According to Aulus Gellius, he originally made his living as a porter, but one day he was seen by the philosopher Democritus carrying a load of small pieces of wood he had tied with a short cord. Democritus realized that Protagoras had tied the load together with such perfect geometric accuracy that he must be a mathematical prodigy. Democritus promptly took him into his own household and taught him philosophy. Protagoras became well known in Athens and even became a friend of Pericles.\nThe dates of his lifetime are not recorded, but extrapolated from writings that have survived the ages. In Protagoras Plato wrote that, before a gathering of Socrates, Prodicus, and Hippias, Protagoras stated that he was old enough to be the father of any of them. This suggests a birth date of not later than 490 BC. In the Meno he is said to have died at approximately the age of 70, after 40 years as a practicing Sophist. His death, then, may be presumed to have occurred circa 420 BC, but is not known for certain, since assumptions about it are based on an apparently fake story about his trial for impiety in Athens.\nPlutarch wrote that Pericles and Protagoras spent a whole day discussing an interesting point of legal responsibility, that probably involved a more philosophical question of causation: \"In an athletic contest a man had been accidentally hit and killed with a javelin. Was his death to be attributed to the javelin, to the man who threw it, or to the authorities responsible for the conduct of the games?\"\n\n\n== Philosophy ==\nEven though he was mentored by Democritus, Protagoras did not share his enthusiasm for the pursuit of mathematics. \"For perceptible lines are not the kind of things the geometer talks about, since no perceptible thing is straight or curved in that way, nor is a circle tangent to a ruler at a point, but the way Protagoras used to say in refuting the geometers\" (Aristotles, Metaphysics 997b34-998a4). Protagoras was skeptical about the application of theoretical mathematics to the natural world; he did not believe they were really worth studying at all. According to Philodemus, Protagoras said that \"The subject matter is unknowable and the terminology distasteful\". Nonetheless, mathematics was considered to be by some a very viable form of art, and Protagoras says on the arts, \"art (tekhnê) without practice and practice without art are nothing\" (Stobaeus, Selections 3.29.80).\nProtagoras also was known as a teacher who addressed subjects connected to virtue and political life. He especially was involved in the question of whether virtue could be taught, a commonplace issue of fifth century BC Greece, that has been related to modern readers through Plato's dialogue. Rather than educators who offered specific, practical training in rhetoric or public speaking, Protagoras attempted to formulate a reasoned understanding, on a very general level, of a wide range of human phenomena, including language and education. In Plato's Protagoras, he claims to teach \"the proper management of one's own affairs, how best to run one's household, and the management of public affairs, how to make the most effective contribution to the affairs of the city by word and action\".\nHe also seems to have had an interest in \"orthoepeia\"—the correct use of words—although this topic is more strongly associated with his fellow sophist Prodicus. In his eponymous Platonic dialogue, Protagoras interprets a poem by Simonides, focusing on the use of words, their literal meaning, and the author's original intent. This type of education would have been useful for the interpretation of laws and other written documents in the Athenian courts. Diogenes Laërtius reports that Protagoras devised a taxonomy of speech acts such as assertion, question, answer, command, etc. Aristotle also says that Protagoras worked on the classification and proper use of grammatical gender.\nThe titles of his books such as, Technique of Eristics (Technē Eristikōn, literally \"Practice of Wranglings\", with wrestling used as a metaphor for intellectual debate) prove that Protagoras also was a teacher of rhetoric and argumentation. Diogenes Laërtius states that he was one of the first to take part in rhetorical contests in the Olympic games.\n\n\n=== Relativism ===\nProtagoras also said that on any matter, there are two arguments (logoi) opposed to one another, and according to Aristotle, Protagoras was criticized for having claimed \"to make the weaker argument stronger (ton hēttō logon kreittō poiein)\".\nProtagoras is credited with the philosophy of relativism, which he discusses in his work, Truth (also known as Refutations). Although knowledge of his work is limited, discussion of Protagoras' relativism is based on one of his most famous statements: \"Man is the measure of all things: of the things that are, that they are, of the things that are not, that they are not.\" By this, Protagoras meant that each individual is the measure of how things are perceived by that individual. Therefore, things are, or are not, true according to how the individual perceives them. For example, Person X may believe that the weather is cold, whereas Person Y may believe that the weather is hot. According to the philosophy of Protagoras, there is no absolute evaluation of the nature of a temperature because the evaluation will be relative to who is perceiving it. Therefore, to Person X, the weather is cold, whereas to Person Y, the weather is hot. This philosophy implies that there are no absolute \"truths\". The truth, according to Protagoras, is relative, and differs according to each individual.\nAs with many fragments of the pre-Socratic philosophers, this phrase has been passed down through the ages, without any context, and consequently, its meaning is open to interpretation. His use of the word χρήματα (chrēmata, \"things used\") instead of the general word ὄντα (onta, \"entities\") signifies, however, that Protagoras was referring to things that are used by, or in some way, related to, humans, such as properties, social entities, ideas, feelings, judgments, which originate in the human mind. Protagoras did not suggest that humans must be the measure of the motion of the stars, the growing of plants, or the activity of volcanoes.\nAs many modern thinkers will, Plato ascribes relativism to Protagoras and uses his predecessor's teachings as a foil for his own commitment to objective and transcendent realities and values. Plato ascribes to Protagoras an early form of what today, John Wild would label, phenomenalism. That being an assertion that something that is, or appears for a single individual, is true or real for that individual.\nHowever, as described in Plato's Theaetetus, Protagoras's views allow that some views may result from an ill body or mind. He stressed that although all views may appear equally true, and perhaps, should be equally respected, they certainly are not of equal gravity. One view may be useful and advantageous to the person who has it, while the perception of another may prove harmful. Hence, Protagoras believed that the sophist was there to teach the student how to discriminate between them, i.e., to teach \"virtue\".\nBoth Plato and Aristotle argue against some of Protagoras's claims regarding relativity; however, they argue that the concept provides Protagoras with too convenient an exemption from his own theory and that relativism is true for him yet false for those who do not believe it. They claim that by asserting that truth is relative, Protagoras then could say that whatever further theory he proposed must be true.\nBecause knowledge of most of his work is limited or missing, modern attempts to apply the Protagoras theory of relativism tend to result in disagreement and refer to scientific reasoning. Carol Poster states that with a modern preference toward scientific reasoning and objective truth, for example, rather than considering individuals evaluating their sense of comfort, a modern philosopher would look at a modern instrument, the thermometer, objectively to see the scientific measure of the temperature, whereas the Greek method would entail looking at larger philosophical implications.\n\n\n=== Agnosticism ===\nProtagoras also was a proponent of agnosticism. Reportedly, in his lost work, On the Gods, he wrote: \"Concerning the gods, I have no means of knowing whether they exist or not, nor of what sort they may be, because of the obscurity of the subject, and the brevity of human life.\" According to Diogenes Laërtius, the outspoken, agnostic position taken by Protagoras aroused anger, causing the Athenians to expel him from the city, and all copies of his book were collected and burned in the marketplace. The deliberate destruction of his works also is mentioned by Cicero.\nThe classicist John Burnet doubts this account, however, as both Diogenes Laërtius and Cicero wrote hundreds of years later and as no such persecution of Protagoras is mentioned by contemporaries who make extensive references to this philosopher. Burnet notes that even if some copies of the Protagoras books were burned, enough of them survived to be known and discussed in the following century. A claim has been made that Protagoras is better classified as an atheist, since he held that if something is not able to be known it does not exist.\n\n\n=== Spectrum of topics ===\nNonetheless, very few fragments from Protagoras have survived, although he is known to have written several different works: Antilogiae and Truth. The latter is cited by Plato, and was known alternatively as, The Throws (a wrestling term referring to the attempt to floor an opponent). It began with the \"Man is the measure\" (ἄνθρωπος μέτρον) pronouncement. According to Diogenes Laërtius other books by Protagoras include: On the Gods, Art of Eristics, Imperative, On Ambition, On Incorrect Human Actions, On those in Hades, On Sciences, On Virtues, On the Original State of Things and Trial over a Fee.\n\n\n== See also ==\nAnthropocentrism\nParadox of the Court\n\n\n== Notes ==\n\n\n== References ==\nGuthrie, W. K. C., The Sophists. New York: Cambridge University Press (May 27, 1977). ISBN 0-521-09666-9.\nLee, Mi-Kyoung (2005). \"Epistemology after Protagoras: responses to relativism in Plato, Aristotle, and Democritus\". ISBN 978-0-19-926222-9. Retrieved September 22, 2016. \nvan Ophuijsen, J.M., van Raalte, M., Stork, P., Protagoras of Abdera: The Man, His Measure. Brill, 2013. ISBN 978-90-04-25120-5 (hardback); ISBN 978-90-04-25124-3 (e-book)\n\n\n== External links ==\n Quotations related to Protagoras at Wikiquote\n Laërtius, Diogenes (1925). \"Others: Protagoras\". Lives of the Eminent Philosophers. 2:9. Translated by Hicks, Robert Drew (Two volume ed.). Loeb Classical Library. \n \"Protagoras\". Encyclopædia Britannica (11th ed.). 1911. \nPoster, Carol. \"Protagoras\". Internet Encyclopedia of Philosophy.", "ns": 0, "pageid": 24086, "title": "Protagoras"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}