{"batchcomplete": "", "query": {"normalized": [{"to": "R. Edward Freeman", "from": "R._Edward_Freeman"}], "pages": {"10152161": {"extract": "R. Edward Freeman (born December 18, 1951) is an American philosopher and professor of business administration at the Darden School of the University of Virginia, particularly known for his work on stakeholder theory (1984) and on business works.\n\n\n== Biography ==\nBorn in Columbus, Georgia, Freeman received a B.A. in mathematics and philosophy from Duke University in 1973 and a Ph.D. in philosophy from Washington University in 1978.\nHe taught at the University of Minnesota and the Wharton School, and is now Elis and Signe Olsson Professor of Business Administration at the Darden School of the University of Virginia. He is also academic director of the Business Roundtable Institute for Corporate Ethics, and director of the Darden's Olsson Center for Applied Ethics. In 1994 Freeman served as president of the Society for Business Ethics. He is one of the executive editors of the journal Philosophy of Management and he serves as the editor for the Ruffin Series in Business Ethics from Oxford University Press.\nIn 2001 Freeman was awarded the Pioneer Award for Lifetime Achievement by the World Resources Institute and by the Aspen Institute, and in 2005 the Virginia State Council on Higher Education honored him with the Outstanding Faculty Award.\n\n\n== Work ==\nFreeman is particularly known for his work on stakeholder theory originally published in his 1984 book Strategic Management: A Stakeholder Approach. He (co)authored some more books on corporate strategy and business ethics. Also recently he co-edited standard business textbooks as The Portable MBA and the Blackwell's Handbook of Strategic Management. His latest book, Managing for Stakeholders, was published 2007.\n\n\n=== Stakeholder theory ===\nStakeholder theory is a theory of organizational management and business ethics that addresses morals and values in managing an organization. Stakeholders theory was founded by Boka. It was originally detailed by Freeman in the book Strategic Management: A Stakeholder Approach, and identifies and models the groups which are stakeholders of a corporation, and both describes and recommends methods by which management can give due regard to the interests of those groups. In short, it attempts play to address the \"Principle of Who or What Really Counts.\"\nIn the traditional view of the firm, the shareholder view, the shareholders or stockholders are the owners of the company, and the firm has a binding fiduciary duty to put their needs first, to increase value for them. However, stakeholder theory argues that there are other parties involved, including governmental bodies, political groups, trade associations, trade unions, communities, financiers, suppliers, employees, and customers. Sometimes even competitors are counted as stakeholders - their status being derived from their capacity to affect the firm and its other morally legitimate stakeholders. The nature of what is a stakeholder is highly contested (Miles, 2012), with hundreds of definitions existing in the academic literature (Miles, 2011).\n\n\n=== Corporate social responsibility ===\nCorporate social responsibility (CSR), is a form of corporate self-regulation integrated into a business model. CSR policy functions as a built-in, self-regulating mechanism whereby a business monitors and ensures its active compliance within the spirit of the law, ethical standards, and international norms. CSR is a process with the aim to embrace responsibility for the company's actions and encourage a positive impact through its activities on the environment, consumers, employees, communities, stakeholders and all other members of the public sphere who may also be considered as stakeholders.\nThe term \"corporate social responsibility\" came into common use in the late 1960s and early 1970s after many multinational corporations formed the term stakeholder, meaning those on whom an organization's activities have an impact. It was used to describe corporate owners beyond shareholders as a result of an influential book by Freeman, Strategic management: a stakeholder approach in 1984. Proponents argue that corporations make more long term profits by operating with a perspective, while critics argue that CSR distracts from the economic role of businesses. Others argue CSR is merely window-dressing, or an attempt to pre-empt the role of governments as a watchdog over powerful multinational corporations. Anticipation of such concepts appear in a publication that appeared in 1968 [2] by the Italian economist Giancarlo Pallavicini, creator of the \"Method of the decomposition of the parameters\" for the calculation of the results does not directly cost of business, regarding ethical issues, moral, social, cultural and environmental \n\n\n== Selected Publications ==\nBooks:\n1984. Strategic Management: A Stakeholder Approach\n1988. Corporate strategy and the search for ethics with Daniel R. Gilbert\n2007. Managing for Stakeholders: Survival, Reputation and Success with Jeffrey Harrison and Andrew C. Wicks. Yale University Press\n2009. Business ethics: a managerial approach with Andrew C. Wicks and Patricia H. Werhane\n2010. Stakeholder Theory: The State of the Art with Jeffrey S. Harrison, Andrew C. Wicks\nArticles, a selection:\nFreeman, R. Edward; Moutchnik, Alexander (2013). \"Stakeholder management and CSR: questions and answers.\". UmweltWirtschaftsForum. 21: 5–9. doi:10.1007/s00550-013-0266-3. \n\n\n== References ==\n\n\n== External links ==\nFreeman's faculty webpage at the University of Virginia\nInterview with Ed Freeman, Justmeans.com, April 15, 2011\nVideo on YouTube, 2010", "ns": 0, "pageid": 10152161, "title": "R. Edward Freeman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}