{"batchcomplete": "", "query": {"normalized": [{"to": "Rada Iveković", "from": "Rada_Iveković"}], "pages": {"7266959": {"extract": "Rada Iveković (born 1945 in Zagreb, Yugoslavia) is a Croatian professor, philosopher, Indologist, and writer.\n\n\n== Research ==\nIvekovic’s research interests include comparative philosophy (Asian philosophy, particularly Indian, and Western), feminist theory and feminist philosophy as well as political philosophy.\nIn particular, the following aspects have been of intellectual inspiration for Ivekovic’s work: contemporary European philosophy, postmodern philosophy, Orientalism in (Western) philosophy, the feminine in philosophy, issues of nation, state und citizenship, problems of nationalism, of violence and war, European identity issues, and democracy.\nIvekovic’s other interests include: literary theory and literary criticism, religion and mythology, gender studies and women writers, anthropology, and contemporary French philosophy in particular.\n\n\n== Political positioning ==\nIvekovic holds that the inequality of the sexes (Inégalité des sexes) and other alterities, inequalities, exclusions, subordinating inclusions (e.g. through discrimination by gender, national citizenship, ethnicity, colonization) leads to a fatal partitioning of reason (\"Le partage de la raison\"). On the war events on the territory of Yugoslavia she takes an explicitly anti-patriarchal, anti-racist and non-nationalist stance.\nIn 1997 Ivekovic published a study on gender/sex in philosophy, taking issue with Jean-François Lyotard.\n\n\n== Career ==\nIveković grew up mostly in Zagreb and Belgrade, living in Zagreb, from 1963 until leaving Croatia for exile in 1991-1992 in a self-described \"protest against nationalism.\"\nAt Zagreb University, she studied Indology, Philosophy and English Studies (1969) and from 1970 to 1973, Buddhist philosophy at Delhi University where she received her PhD in 1972.\nFrom 1975 to 1991-1992, Iveković was a Lecturer in the History of Asian Philosophy and Comparative Philosophy at Zagreb University. From 1998-2003 she was a professor at Paris VIII. Since 2003 Professor in the Department of Sociology at University Jean Monnet - St.Etienne and after 2004, the Program Director at Collège international de philosophie (Paris).\n\n\n== Selected works in English ==\n1984: She and Slavenka Drakulić-Illić contributed the piece \"Neofeminism, and its six mortal sins\" to the 1984 anthology Sisterhood Is Global: The International Women's Movement Anthology, edited by Robin Morgan.\n2004: \"COMMENTARY - The Veil in France: Secularism, Nation, Women\". Economic and Political Weekly. Vol. 39, 11, 1117-1119.\n2005: \"Borders and Partitions: Exception as Space and Time\" (Abstract for the conference Polemos, Stasis ... War, Civil War, 24–27 June 2005, National Chiao Tung University, Taiwan: Center for Humanities and Social Theory). [1]\n2005: \"The Fiction of Gender Constructing the Fiction of Nation: On How Fictions Are Normative, and Norms Produce Exceptions\". Anthropological Yearbook of European Cultures 2005 (Gender and Nation in South Eastern Europe), 19-38.\n\n\n== Sources ==\n\nMost comprehensive CV, until 2004, in English\nShort portrait in German with photo, 1997\n\n\n== Further reading ==\nGrebowicz, Margret. Gender after Lyotard. Albany: State University of New York Press, 2007.", "ns": 0, "pageid": 7266959, "title": "Rada Iveković"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}