{"batchcomplete": "", "query": {"normalized": [{"to": "Raimond Gaita", "from": "Raimond_Gaita"}], "pages": {"679397": {"extract": "Raimond Gaita (born Raimund Gaita 14 May 1946, Dortmund, Germany) is an Australian philosopher and award-winning writer. He was, until 2011, Foundation Professor of Philosophy at the Australian Catholic University and Professor of Moral Philosophy at King's College London. He is currently Professorial Fellow in the Melbourne Law School and the Faculty of Arts, University of Melbourne and Emeritus Professor of Moral Philosophy at King's College London. He is a Fellow of the Australian Academy of the Humanities.\n\n\n== Life ==\nRaimund Gaita (later styled as Raimond Gaita) was born in Dortmund, Westphalia, Germany, on 14 May 1946, to a Yugoslav-born, Romanian father, Romulus Gaiţă (28 December 1922 – May 1996) and a German mother, Christel \"Christine\" Anna Dörr (16 November 1928 – 1958). In Germany from 1942 to 1945 Romulus was employed as a smith and metal worker. The Gaita family migrated to Australia in April 1950, just before Raimond turned four. He attended St. Patrick's College, Ballarat (Victoria), Melbourne High School (Victoria), the University of Melbourne (BA Hons, MA) and the University of Leeds (PhD).\nThe story of his childhood and the lives of his family members and close friends is told in his memoir Romulus, My Father, which was made into a film starring Eric Bana (Romulus), Franka Potente (Christine), Kodi Smit-McPhee (Raimond) and Marton Csokas (Hora). In a later book, After Romulus, a collection of essays, \"he reflects on the writing of the Romulus, My Father, the making of the film, his relationship to the desolate beauty of the central Victorian landscape, the philosophies that underpinned his father's relationship to the world and, most movingly, the presence and absence of his mother and his unassuaged longing for her\". (from the publisher)\nHe is married to Yael Gaita, who was born in Tel Aviv and until 2008 was a teacher at King David School, Melbourne, where she taught Hebrew. Gaita has two children, Katerina and Eva and two step children, Dahlia and Michelle.\n\n\n== Awards and recognition ==\nRomulus My Father won the Nettie Palmer Prize for Non-Fiction in the Victorian Premier's Literary Award and was shortlisted for the Queensland Premier's Literary Awards for Contribution to Public Debate, the Braille Book of the Year, the National Biography Award. It was nominated by the New Statesman, London, as one of the best books of 1999 and, in 2000, by The Australian Financial Review as one of the ten best books of the decade. In 2007 it was made into an award winning feature film of the same name.\nA Common Humanity: Thinking about Love and Truth and Justice was nominated by The Economist as one of the best books of 2000.\nThe Philosopher's Dog was shortlisted for the New South Wales Premier's Literary Awards, 2003 and The Age Book of the Year, 2003. It was nominated by the Kansas City Star as one of the ten best books of 2005.\nIn 2009, the University of Antwerp awarded Gaita the degree of Doctor Honoris Causa \"for his exceptional contribution to contemporary moral philosophy and for his singular contribution the role of the intellectual in today's academic world\". In 2011, Routledge published Christopher Cordner (ed.) Philosophy, Ethics, and a Common Humanity: Essays in Honour of Raimond Gaita. Also in 2011, Flinders University held a conference in Gaita's honour: A Sense for Humanity: The Ethical Thought of Raimond Gaita, which was published as a book of the same title in 2014 by Monash University Press.\n\n\n== Bibliography ==\n\n\n=== Books ===\nGaita, Raimond, ed. (1990). Value and understanding : essays for Peter Winch. London: Routledge. \nGood and Evil: An Absolute Conception, London: Macmillan, New York: St. Martin's Press, 1991.\nRomulus, My Father, Melbourne: Text Publishing, 1998\nA Common Humanity: Thinking about Love and Truth and Justice, Melbourne: Text Publishing, 1999; London & New York: Routledge, 2000.\nThe Philosopher's Dog, Melbourne: Text Publishing, 2002.\nWhy the War Was Wrong (ed.), Melbourne: Text Publishing, 2003.\nBreach of Trust: Truth, Morality and Politics, Melbourne: Black Inc., 2004.\nGood and Evil: An Absolute Conception, Revised edition, London & New York: Routledge 2004.\nGaza: Morality, Law and Politics (ed.), Perth: University of Western Australia Press, 2010.\nEssays on Muslims and Multiculturalism (ed.), Melbourne: Text Publishing, 2011.\nSinging For All He's Worth: Essays in Honour of J. G. Rosenberg, Alex Skovron, Raimond Gaita and Alex Miller (eds.), Sydney: Picador, 2011.\nAfter Romulus, Melbourne: Text Publishing, 2011.\n\n\n==== Translated editions ====\nOther editions and translations of The Philosopher's Dog\nThe Philosopher's Dog, London: Routledge, 2003.\nThe Philosopher' Dog: Friendship with Animals, New York: Random House, 2003.\nDe Hond Van De Filosoof, Amsterdam: Ambo/Anthos, 2003.\nDer Hund des Philosophen, Berlin: Rogner & Berhnard, 2003.\n部分地区明天即可送达, Taipei: The Bookery, 2004.\n部分地区明天即可送达, Beijing: People's Literature Publishing House, 2004.\nFilozofun Köpeği, Istanbul: Dost Kitabevi Yayınları, 2005.\nTokyo, Shuei-Sha, 2005.\nHa-Kelev shel ha-filosof, Jerusalem: The Attic, 2005.\nIl cane del filosofo, Genoa: Il Melangola, 2007.\nO Cão do Filósofo, Cruz Quebrada (Portugal): Casa das Letras, 2007.\nO Cão do Filósofo, São Paulo: Difel, 2011.\n\nOther editions and translations of Romulus My Father\nRomulus, My Father, London: Review, 2000.\nRomulus, Mi Padre, Barcelona: Ediciones Del Bronce, 2001.\nRomuls, Mein Vater, Salzburg and Hamburg, Salzburg and Vienna: Residenz Verlag, 2001\nRomulus, mijn vader, Amsterdam: Ambo, 2004.\nAvi, Romulus, Jerusalem: Carmel, 2008.\nRomulus, Mio Padre, Rome: Elliot Edizioni, 2011.\nMoj ojciec Romulus, Warsaw: Czarne 2013\n\n\n=== Essays ===\nGaita, Raimond (Dec 1995). \"Remembering the Holocaust : absolute value and the nature of evil\". Quadrant. 39 (12): 7–15. \n\n\n== References ==\n\n\n== Further reading ==\nJ. Franklin (2003), Corrupting the Youth: A History of Philosophy in Australia, Macleay Press, ch. 16.\n\n\n== External links ==\nYouTube videos\nRaimond Gaita – Emeritus Professor of Moral Philosophy at King's College London\nProfessor Raimond Gaita interviewed on the Australian Broadcasting Corporation\nRaimond Gaita interviewed about Torture on Philosophy Bites\nGaita and Robert Connolly discuss Romulus, My Father (the film)\nVideo: Raimond Gaita lecture on Plato", "ns": 0, "pageid": 679397, "title": "Raimond Gaita"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}