{"batchcomplete": "", "query": {"normalized": [{"to": "Rainer Forst", "from": "Rainer_Forst"}], "pages": {"6504945": {"extract": "Rainer Forst (born August 15, 1964, Wiesbaden) is a German philosopher and political theorist, and was named the \"most important political philosopher of his generation\" in 2012, when he won the Gottfried Wilhelm Leibniz Prize. Currently he is Professor of Political Theory at the Department for Social Sciences, Johann Wolfgang Goethe University in Frankfurt. He is often identified with the newest generation of scholars associated with the Frankfurt School of critical theory. He received his doctorate under the supervision of Jürgen Habermas in 1993.\nHis main areas of research are political theory, pragmatism, tolerance, and political and social justice. His first book in English, Contexts of Justice, incorporated elements of Anglo-American liberal theory and communitarianism with German critical and social theory.\n\n\n== Publications ==\nKontexte der Gerechtigkeit. Politische Philosophie jenseits von Liberalismus und Kommunitarismus. 1994, 1996 und 2004, Suhrkamp Verlag. English Title (von John M. M. Farrell): Contexts of Justice. Political Philosophy beyond Liberalism and Communitarianism, Berkeley. Los Angeles: University of California Press, 2002.\nToleranz. Philosophische Grundlagen und gesellschaftliche Praxis einer umstrittenen Tugend. 2000, Campus Verlag (Herausgeber). (In German)\nToleranz im Konflikt. Geschichte, Gehalt und Gegenwart eines umstrittenen Begriffs. 2003, Suhrkamp Verlag. (In German)\nDas Recht auf Rechtfertigung. Elemente einer konstruktivistischen Theorie der Gerechtigkeit. 2007, Suhrkamp Verlag. (In German); The right to justification: elements of a constructivist theory of justice. 2012, Columbia University Press.\n\n\n== See also ==\nCritical Theory\n\n\n== References ==\n\n\n== Further reading ==\nGuillaume, Xavier (2012), \"The right to justification: towards a critical theory of justice and democracy. An interview with Rainer Forst.\", in Browning, Gary; Dimova-Cookson, Maria; Prokhovnik, Raia, Dialogues with contemporary political theorists, Houndsmill, Basingstoke, Hampshire New York: Palgrave Macmillan, pp. 105–120, ISBN 9780230303058 \n\n\n== External links ==\nOfficial University Hompepage (German)", "ns": 0, "pageid": 6504945, "title": "Rainer Forst"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}