{"batchcomplete": "", "query": {"normalized": [{"to": "Ralph Waldo Emerson", "from": "Ralph_Waldo_Emerson"}], "pages": {"26202": {"extract": "Ralph Waldo Emerson (May 25, 1803 – April 27, 1882), known professionally as Waldo Emerson, was an American essayist, lecturer, and poet who led the Transcendentalist movement of the mid-19th century. He was seen as a champion of individualism and a prescient critic of the countervailing pressures of society, and he disseminated his thoughts through dozens of published essays and more than 1,500 public lectures across the United States.\nEmerson gradually moved away from the religious and social beliefs of his contemporaries, formulating and expressing the philosophy of Transcendentalism in his 1836 essay, \"Nature\". Following this ground-breaking work, he gave a speech entitled \"The American Scholar\" in 1837, which Oliver Wendell Holmes Sr. considered to be America's \"Intellectual Declaration of Independence\".\nEmerson wrote most of his important essays as lectures first, then revised them for print. His first two collections of essays Essays: First Series and Essays: Second Series, published respectively in 1841 and 1844—represent the core of his thinking, and include such well-known essays as \"Self-Reliance\", \"The Over-Soul\", \"Circles\", \"The Poet\" and \"Experience\". Together with \"Nature\", these essays made the decade from the mid-1830s to the mid-1840s Emerson's most fertile period.\nEmerson wrote on a number of subjects, never espousing fixed philosophical tenets, but developing certain ideas such as individuality, freedom, the ability for humankind to realize almost anything, and the relationship between the soul and the surrounding world. Emerson's \"nature\" was more philosophical than naturalistic: \"Philosophically considered, the universe is composed of Nature and the Soul\". Emerson is one of several figures who \"took a more pantheist or pandeist approach by rejecting views of God as separate from the world.\"\nHe remains among the linchpins of the American romantic movement, and his work has greatly influenced the thinkers, writers and poets that have followed him. When asked to sum up his work, he said his central doctrine was \"the infinitude of the private man.\" Emerson is also well known as a mentor and friend of fellow Transcendentalist Henry David Thoreau.\n\n\n== Early life, family, and education ==\n\nEmerson was born in Boston, Massachusetts, on May 25, 1803, son of Ruth Haskins and the Rev. William Emerson, a Unitarian minister. He was named after his mother's brother Ralph and the father's great-grandmother Rebecca Waldo. Ralph Waldo was the second of five sons who survived into adulthood; the others were William, Edward, Robert Bulkeley, and Charles. Three other children—Phebe, John Clarke, and Mary Caroline–died in childhood. Ralph Waldo Emerson was of entirely English ancestry all of which had been in New England since the early colonial period.\nThe young Ralph Waldo Emerson's father died from stomach cancer on May 12, 1811, less than two weeks before Emerson's eighth birthday. Emerson was raised by his mother, with the help of the other women in the family; his aunt Mary Moody Emerson in particular had a profound effect on Emerson. She lived with the family off and on, and maintained a constant correspondence with Emerson until her death in 1863.\nEmerson's formal schooling began at the Boston Latin School in 1812 when he was nine. In October 1817, at 14, Emerson went to Harvard College and was appointed freshman messenger for the president, requiring Emerson to fetch delinquent students and send messages to faculty. Midway through his junior year, Emerson began keeping a list of books he had read and started a journal in a series of notebooks that would be called \"Wide World\". He took outside jobs to cover his school expenses, including as a waiter for the Junior Commons and as an occasional teacher working with his uncle Samuel in Waltham, Massachusetts. By his senior year, Emerson decided to go by his middle name, Waldo. Emerson served as Class Poet; as was custom, he presented an original poem on Harvard's Class Day, a month before his official graduation on August 29, 1821, when he was 18. He did not stand out as a student and graduated in the exact middle of his class of 59 people.\nIn 1826, faced with poor health, Emerson went to seek out warmer climates. He first went to Charleston, South Carolina, but found the weather was still too cold. He then went further south, to St. Augustine, Florida, where he took long walks on the beach and began writing poetry. While in St. Augustine he made the acquaintance of Prince Achille Murat. Murat, the nephew of Napoleon Bonaparte, was only two years his senior; they became extremely good friends and enjoyed one another's company. The two engaged in enlightening discussions on religion, society, philosophy, and government, and Emerson considered Murat an important figure in his intellectual education.\nWhile in St. Augustine, Emerson had his first experience of slavery. At one point, he attended a meeting of the Bible Society while there was a slave auction taking place in the yard outside. He wrote, \"One ear therefore heard the glad tidings of great joy, whilst the other was regaled with 'Going, gentlemen, going!' \"\n\n\n== Early career ==\n\nAfter Harvard, Emerson assisted his brother William in a school for young women established in their mother's house, after he had established his own school in Chelmsford, Massachusetts; when his brother William went to Göttingen to study divinity, Emerson took charge of the school. Over the next several years, Emerson made his living as a schoolmaster, then went to Harvard Divinity School. Emerson's brother Edward, two years younger than he, entered the office of lawyer Daniel Webster, after graduating from Harvard first in his class. Edward's physical health began to deteriorate and he soon suffered a mental collapse as well; he was taken to McLean Asylum in June 1828 at age 23. Although he recovered his mental equilibrium, he died in 1834 from apparently longstanding tuberculosis. Another of Emerson's bright and promising younger brothers, Charles, born in 1808, died in 1836, also of tuberculosis, making him the third young person in Emerson's innermost circle to die in a period of a few years.\nEmerson met his first wife, Ellen Louisa Tucker, in Concord, New Hampshire, on Christmas Day 1827, and married her when she was 18. The couple moved to Boston, with Emerson's mother Ruth moving with them to help take care of Ellen, who was already sick with tuberculosis. Less than two years later, Ellen died at the age of 20 on February 8, 1831, after uttering her last words: \"I have not forgotten the peace and joy\". Emerson was heavily affected by her death and visited her grave in Roxbury daily. In a journal entry dated March 29, 1832, Emerson wrote, \"I visited Ellen's tomb & opened the coffin\".\nBoston's Second Church invited Emerson to serve as its junior pastor and he was ordained on January 11, 1829. His initial salary was $1,200 a year, increasing to $1,400 in July, but with his church role he took on other responsibilities: he was chaplain to the Massachusetts legislature, and a member of the Boston school committee. His church activities kept him busy, though during this period, facing the imminent death of his wife, he began to doubt his own beliefs.\nAfter his wife's death, he began to disagree with the church's methods, writing in his journal in June 1832: \"I have sometimes thought that, in order to be a good minister, it was necessary to leave the ministry. The profession is antiquated. In an altered age, we worship in the dead forms of our forefathers\". His disagreements with church officials over the administration of the Communion service and misgivings about public prayer eventually led to his resignation in 1832. As he wrote, \"This mode of commemorating Christ is not suitable to me. That is reason enough why I should abandon it\". As one Emerson scholar has pointed out, \"Doffing the decent black of the pastor, he was free to choose the gown of the lecturer and teacher, of the thinker not confined within the limits of an institution or a tradition\".\nEmerson toured Europe in 1833 and later wrote of his travels in English Traits (1856). He left aboard the brig Jasper on Christmas Day, 1832, sailing first to Malta. During his European trip, he spent several months in Italy, visiting Rome, Florence and Venice, among other cities. When in Rome, he met with John Stuart Mill, who gave him a letter of recommendation to meet Thomas Carlyle. He went to Switzerland, and had to be dragged by fellow passengers to visit Voltaire's home in Ferney, \"protesting all the way upon the unworthiness of his memory\". He then went on to Paris, a \"loud modern New York of a place\", where he visited the Jardin des Plantes. He was greatly moved by the organization of plants according to Jussieu's system of classification, and the way all such objects were related and connected. As Richardson says, \"Emerson's moment of insight into the interconnectedness of things in the Jardin des Plantes was a moment of almost visionary intensity that pointed him away from theology and toward science\".\nMoving north to England, Emerson met William Wordsworth, Samuel Taylor Coleridge, and Thomas Carlyle. Carlyle in particular was a strong influence on Emerson; Emerson would later serve as an unofficial literary agent in the United States for Carlyle, and in March 1835, he tried to convince Carlyle to come to America to lecture. The two would maintain correspondence until Carlyle's death in 1881.\n\nEmerson returned to the United States on October 9, 1833, and lived with his mother in Newton, Massachusetts, until October, 1834, when he moved to Concord, Massachusetts, to live with his step-grandfather Dr. Ezra Ripley at what was later named The Old Manse. Seeing the budding Lyceum movement, which provided lectures on all sorts of topics, Emerson saw a possible career as a lecturer. On November 5, 1833, he made the first of what would eventually be some 1,500 lectures, discussing The Uses of Natural History in Boston. This was an expanded account of his experience in Paris. In this lecture, he set out some of his important beliefs and the ideas he would later develop in his first published essay Nature:\n\nNature is a language and every new fact one learns is a new word; but it is not a language taken to pieces and dead in the dictionary, but the language put together into a most significant and universal sense. I wish to learn this language, not that I may know a new grammar, but that I may read the great book that is written in that tongue.\n\nOn January 24, 1835, Emerson wrote a letter to Lydia Jackson proposing marriage. Her acceptance reached him by mail on the 28th. In July 1835, he bought a house on the Cambridge and Concord Turnpike in Concord, Massachusetts which he named \"Bush\"; it is now open to the public as the Ralph Waldo Emerson House. Emerson quickly became one of the leading citizens in the town. He gave a lecture to commemorate the 200th anniversary of the town of Concord on September 12, 1835. Two days later, he married Lydia Jackson in her home town of Plymouth, Massachusetts, and moved to the new home in Concord together with Emerson's mother on September 15.\nEmerson quickly changed his wife's name to Lidian, and would call her Queenie, and sometimes Asia, and she called him Mr. Emerson. Their children were Waldo, Ellen, Edith, and Edward Waldo Emerson. Edward Waldo Emerson was the father of Raymond Emerson. Ellen was named for his first wife, at Lidian's suggestion.\nEmerson was poor when he was at Harvard, and later supported his family for much of his life. He inherited a fair amount of money after his first wife's death, though he had to file a lawsuit against the Tucker family in 1836 to get it. He received $11,600 in May 1834, and a further $11,674.49 in July 1837. In 1834, he considered that he had an income of $1,200 a year from the initial payment of the estate, equivalent to what he had earned as a pastor.\n\n\n== Literary career and Transcendentalism ==\n\nOn September 8, 1836, the day before the publication of Nature, Emerson met with Frederic Henry Hedge, George Putnam and George Ripley to plan periodic gatherings of other like-minded intellectuals. This was the beginning of the Transcendental Club, which served as a center for the movement. Its first official meeting was held on September 19, 1836. On September 1, 1837, women attended a meeting of the Transcendental Club for the first time. Emerson invited Margaret Fuller, Elizabeth Hoar and Sarah Ripley for dinner at his home before the meeting to ensure that they would be present for the evening get-together. Fuller would prove to be an important figure in Transcendentalism.\nEmerson anonymously published his first essay, Nature, on September 9, 1836. A year later, on August 31, 1837, Emerson delivered his now-famous Phi Beta Kappa address, \"The American Scholar\", then known as \"An Oration, Delivered before the Phi Beta Kappa Society at Cambridge\"; it was renamed for a collection of essays (which included the first general publication of \"Nature\") in 1849. Friends urged him to publish the talk, and he did so, at his own expense, in an edition of 500 copies, which sold out in a month. In the speech, Emerson declared literary independence in the United States and urged Americans to create a writing style all their own and free from Europe. James Russell Lowell, who was a student at Harvard at the time, called it \"an event without former parallel on our literary annals\". Another member of the audience, Reverend John Pierce, called it \"an apparently incoherent and unintelligible address\".\nIn 1837, Emerson befriended Henry David Thoreau. Though they had likely met as early as 1835, in the fall of 1837, Emerson asked Thoreau, \"Do you keep a journal?\" The question went on to be a lifelong inspiration for Thoreau. Emerson's own journal comes to 16 large volumes, in the definitive Harvard University Press edition published between 1960 and 1982. Some scholars consider the journal to be Emerson's key literary work.\nIn March 1837, Emerson gave a series of lectures on The Philosophy of History at Boston's Masonic Temple. This was the first time he managed a lecture series on his own, and was the beginning of his serious career as a lecturer. The profits from this series of lectures were much larger than when he was paid by an organization to talk, and Emerson continued to manage his own lectures often throughout his lifetime. He would eventually give as many as 80 lectures a year, traveling across the northern part of the United States. He traveled as far as St. Louis, Des Moines, Minneapolis, and California.\nOn July 15, 1838, Emerson was invited to Divinity Hall, Harvard Divinity School for the school's graduation address, which came to be known as his \"Divinity School Address\". Emerson discounted biblical miracles and proclaimed that, while Jesus was a great man, he was not God: historical Christianity, he said, had turned Jesus into a \"demigod, as the Orientals or the Greeks would describe Osiris or Apollo\". His comments outraged the establishment and the general Protestant community. For this, he was denounced as an atheist, and a poisoner of young men's minds. Despite the roar of critics, he made no reply, leaving others to put forward a defense. He was not invited back to speak at Harvard for another thirty years.\nThe Transcendental group began to publish its flagship journal, The Dial, in July 1840. They planned the journal as early as October 1839, but work did not begin until the first week of 1840. George Ripley was its managing editor and Margaret Fuller was its first editor, having been hand-chosen by Emerson after several others had declined the role. Fuller stayed on for about two years and Emerson took over, utilizing the journal to promote talented young writers including Ellery Channing and Thoreau.\nIt was in 1841 that Emerson published Essays, his second book, which included the famous essay, \"Self-Reliance\". His aunt called it a \"strange medley of atheism and false independence\", but it gained favorable reviews in London and Paris. This book, and its popular reception, more than any of Emerson's contributions to date laid the groundwork for his international fame.\nIn January 1842 Emerson's first son Waldo died from scarlet fever. Emerson wrote of his grief in the poem \"Threnody\" (\"For this losing is true dying\"), and the essay \"Experience\". That same month, William James was born, and Emerson agreed to be his godfather.\nBronson Alcott announced his plans in November 1842 to find \"a farm of a hundred acres in excellent condition with good buildings, a good orchard and grounds\". Charles Lane purchased a 90-acre (360,000 m2) farm in Harvard, Massachusetts, in May 1843 for what would become Fruitlands, a community based on Utopian ideals inspired in part by Transcendentalism. The farm would run based on a communal effort, using no animals for labor; its participants would eat no meat and use no wool or leather. Emerson said he felt \"sad at heart\" for not engaging in the experiment himself. Even so, he did not feel Fruitlands would be a success. \"Their whole doctrine is spiritual\", he wrote, \"but they always end with saying, Give us much land and money\". Even Alcott admitted he was not prepared for the difficulty in operating Fruitlands. \"None of us were prepared to actualize practically the ideal life of which we dreamed. So we fell apart\", he wrote. After its failure, Emerson helped buy a farm for Alcott's family in Concord which Alcott named \"Hillside\".\nThe Dial ceased publication in April 1844; Horace Greeley reported it as an end to the \"most original and thoughtful periodical ever published in this country\". (An unrelated magazine of the same name would be published in several periods through 1929.)\nIn 1844, Emerson published his second collection of essays, entitled \"Essays: Second Series\". This collection included \"The Poet\", \"Experience\", \"Gifts\", and an essay entitled \"Nature\", a different work from the 1836 essay of the same name.\nEmerson made a living as a popular lecturer in New England and much of the rest of the country. He had begun lecturing in 1833; by the 1850s he was giving as many as 80 per year. He addressed the Boston Society for the Diffusion of Useful Knowledge and the Gloucester Lyceum, among others. Emerson spoke on a wide variety of subjects and many of his essays grew out of his lectures. He charged between $10 and $50 for each appearance, bringing him as much as $2,000 in a typical winter \"season\". This was more than his earnings from other sources. In some years, he earned as much as $900 for a series of six lectures, and in another, for a winter series of talks in Boston, he netted $1,600. He eventually gave some 1,500 lectures in his lifetime. His earnings allowed him to expand his property, buying 11 acres (45,000 m2) of land by Walden Pond and a few more acres in a neighboring pine grove. He wrote that he was \"landlord and waterlord of 14 acres, more or less\".\nEmerson was introduced to Indian philosophy when reading the works of French philosopher Victor Cousin. In 1845, Emerson's journals show he was reading the Bhagavad Gita and Henry Thomas Colebrooke's Essays on the Vedas. Emerson was strongly influenced by Vedanta, and much of his writing has strong shades of nondualism. One of the clearest examples of this can be found in his essay \"The Over-soul\":\n\nWe live in succession, in division, in parts, in particles. Meantime within man is the soul of the whole; the wise silence; the universal beauty, to which every part and particle is equally related, the eternal ONE. And this deep power in which we exist and whose beatitude is all accessible to us, is not only self-sufficing and perfect in every hour, but the act of seeing and the thing seen, the seer and the spectacle, the subject and the object, are one. We see the world piece by piece, as the sun, the moon, the animal, the tree; but the whole, of which these are shining parts, is the soul.\n\nFrom 1847 to 1848, he toured England, Scotland, and Ireland. He also visited Paris between the French Revolution of 1848 and the bloody June Days. When he arrived, he saw the stumps where trees had been cut down to form barricades in the February riots. On May 21 he stood on the Champ de Mars in the midst of mass celebrations for concord, peace and labor. He wrote in his journal: \"At the end of the year we shall take account, & see if the Revolution was worth the trees.\" The trip left an important imprint on Emerson's later work. His 1856 book English Traits is based largely on observations recorded in his travel journals and notebooks. Emerson later came to see the American Civil War as a 'revolution' that shared common ground with the European revolutions of 1848.\nIn February 1852 Emerson and James Freeman Clarke and William Henry Channing edited an edition of the works and letters of Margaret Fuller, who had died in 1850. Within a week of her death, her New York editor Horace Greeley suggested to Emerson that a biography of Fuller, to be called Margaret and Her Friends, be prepared quickly \"before the interest excited by her sad decease has passed away\". Published with the title The Memoirs of Margaret Fuller Ossoli, Fuller's words were heavily censored or rewritten. The three editors were not concerned about accuracy; they believed public interest in Fuller was temporary and that she would not survive as a historical figure. Even so, for a time, it was the best-selling biography of the decade and went through thirteen editions before the end of the century.\nWalt Whitman published the innovative poetry collection Leaves of Grass in 1855 and sent a copy to Emerson for his opinion. Emerson responded positively, sending a flattering five-page letter as a response. Emerson's approval helped the first edition of Leaves of Grass stir up significant interest and convinced Whitman to issue a second edition shortly thereafter. This edition quoted a phrase from Emerson's letter, printed in gold leaf on the cover: \"I Greet You at the Beginning of a Great Career\". Emerson took offense that this letter was made public and later became more critical of the work.\n\n\n== Civil War years ==\nEmerson was staunchly anti-slavery, but he did not appreciate being in the public limelight and was hesitant about lecturing on the subject. He did, however, give a number of lectures during the pre-Civil War years, beginning as early as November, 1837. A number of his friends and family members were more active abolitionists than he, at first, but from 1844 on, he took a more active role in opposing slavery. He gave a number of speeches and lectures, and notably welcomed John Brown to his home during Brown's visits to Concord. He voted for Abraham Lincoln in 1860, but Emerson was disappointed that Lincoln was more concerned about preserving the Union than eliminating slavery outright. Once the American Civil War broke out, Emerson made it clear that he believed in immediate emancipation of the slaves.\nAround this time, in 1860, Emerson published The Conduct of Life, his seventh collection of essays. In this book, Emerson \"grappled with some of the thorniest issues of the moment,\" and \"his experience in the abolition ranks is a telling influence in his conclusions.\" These essays also find Emerson strongly embracing the idea of war as a means of national rebirth: \"Civil war, national bankruptcy, or revolution, [are] more rich in the central tones than languid years of prosperity,\" Emerson writes.\nEmerson visited Washington, D.C, at the end of January 1862. He gave a public lecture at the Smithsonian on January 31, 1862, and declared: \"The South calls slavery an institution... I call it destitution... Emancipation is the demand of civilization\". The next day, February 1, his friend Charles Sumner took him to meet Lincoln at the White House. Lincoln was familiar with Emerson's work, having previously seen him lecture. Emerson's misgivings about Lincoln began to soften after this meeting. In 1865, he spoke at a memorial service held for Lincoln in Concord: \"Old as history is, and manifold as are its tragedies, I doubt if any death has caused so much pain as this has caused, or will have caused, on its announcement.\" Emerson also met a number of high-ranking government officials, including Salmon P. Chase, the secretary of the treasury, Edward Bates, the attorney general, Edwin M. Stanton, the secretary of war, Gideon Welles, the secretary of the navy, and William Seward, the secretary of state.\nOn May 6, 1862, Emerson's protégé Henry David Thoreau died of tuberculosis at the age of 44 and Emerson delivered his eulogy. Emerson would continuously refer to Thoreau as his best friend, despite a falling out that began in 1849 after Thoreau published A Week on the Concord and Merrimack Rivers. Another friend, Nathaniel Hawthorne, died two years after Thoreau in 1864. Emerson served as one of the pallbearers as Hawthorne was buried in Concord, as Emerson wrote, \"in a pomp of sunshine and verdure\". He was elected a Fellow of the American Academy of Arts and Sciences in 1864.\n\n\n== Final years and death ==\n\nStarting in 1867, Emerson's health began declining; he wrote much less in his journals. Beginning as early as the summer of 1871 or in the spring of 1872, Emerson started having memory problems and suffered from aphasia. By the end of the decade, he forgot his own name at times and, when anyone asked how he felt, he responded, \"Quite well; I have lost my mental faculties, but am perfectly well\".\nIn the spring of 1871 Emerson took a trip on the transcontinental railroad, barely two years after its completion. Along the way and in California he met a number of dignitaries, including Brigham Young during a stopover in Salt Lake City. Part of his California visit included a trip to Yosemite, and while there he met a young and unknown John Muir, a signature event in Muir's career.\nEmerson's Concord home caught fire on July 24, 1872; Emerson called for help from neighbors and, giving up on putting out the flames, all attempted to save as many objects as possible. The fire was put out by Ephraim Bull Jr., the one-armed son of Ephraim Wales Bull. Donations were collected by friends to help the Emersons rebuild, including $5,000 gathered by Francis Cabot Lowell, another $10,000 collected by LeBaron Russell Briggs, and a personal donation of $1,000 from George Bancroft. Support for shelter was offered as well; though the Emersons ended up staying with family at the Old Manse, invitations came from Anne Lynch Botta, James Elliot Cabot, James Thomas Fields and Annie Adams Fields. The fire marked an end to Emerson's serious lecturing career; from then on, he would lecture only on special occasions and only in front of familiar audiences.\nWhile the house was being rebuilt, Emerson took a trip to England, continental Europe, and Egypt. He left on October 23, 1872, along with his daughter Ellen while his wife Lidian spent time at the Old Manse and with friends. Emerson and his daughter Ellen returned to the United States on the ship Olympus along with friend Charles Eliot Norton on April 15, 1873. Emerson's return to Concord was celebrated by the town and school was canceled that day.\nIn late 1874 Emerson published an anthology of poetry called Parnassus, which included poems by Anna Laetitia Barbauld, Julia Caroline Dorr, Jean Ingelow, Lucy Larcom, Jones Very, as well as Thoreau and several others. The anthology was originally prepared as early as the fall of 1871 but was delayed when the publishers asked for revisions.\nThe problems with his memory had become embarrassing to Emerson and he ceased his public appearances by 1879. As Holmes wrote, \"Emerson is afraid to trust himself in society much, on account of the failure of his memory and the great difficulty he finds in getting the words he wants. It is painful to witness his embarrassment at times\". On April 21, 1882, Emerson was found to be suffering from pneumonia. He died on April 27, 1882. Emerson is buried in Sleepy Hollow Cemetery, Concord, Massachusetts. He was placed in his coffin wearing a white robe given by American sculptor Daniel Chester French.\n\n\n== Lifestyle and beliefs ==\n\nEmerson's religious views were often considered radical at the time. He believed that all things are connected to God and, therefore, all things are divine. Critics believed that Emerson was removing the central God figure; as Henry Ware, Jr. said, Emerson was in danger of taking away \"the Father of the Universe\" and leaving \"but a company of children in an orphan asylum\". Emerson was partly influenced by German philosophy and Biblical criticism. His views, the basis of Transcendentalism, suggested that God does not have to reveal the truth but that the truth could be intuitively experienced directly from nature. When asked his religious belief, Emerson stated, \"I am more of a Quaker than anything else. I believe in the 'still, small voice,' and that voice is Christ within us.\"\nEmerson did not become an ardent abolitionist until 1844, though his journals show he was concerned with slavery beginning in his youth, even dreaming about helping to free slaves. In June 1856, shortly after Charles Sumner, a United States Senator, was beaten for his staunch abolitionist views, Emerson lamented that he himself was not as committed to the cause. He wrote, \"There are men who as soon as they are born take a bee-line to the axe of the inquisitor. . . . Wonderful the way in which we are saved by this unfailing supply of the moral element\". After Sumner's attack, Emerson began to speak out about slavery. \"I think we must get rid of slavery, or we must get rid of freedom\", he said at a meeting at Concord that summer. Emerson used slavery as an example of a human injustice, especially in his role as a minister. In early 1838, provoked by the murder of an abolitionist publisher from Alton, Illinois named Elijah Parish Lovejoy, Emerson gave his first public antislavery address. As he said, \"It is but the other day that the brave Lovejoy gave his breast to the bullets of a mob, for the rights of free speech and opinion, and died when it was better not to live\". John Quincy Adams said the mob-murder of Lovejoy \"sent a shock as of any earthquake throughout this continent\". However, Emerson maintained that reform would be achieved through moral agreement rather than by militant action. By August 1, 1844, at a lecture in Concord, he stated more clearly his support for the abolitionist movement. He stated, \"We are indebted mainly to this movement, and to the continuers of it, for the popular discussion of every point of practical ethics\".\nEmerson is often known as one of the most liberal democratic thinkers of his time who believed that through the democratic process, slavery should be abolished. While being an avid abolitionist who was known for his criticism of the legality of slavery, Emerson struggled with the implications of race. His usual liberal leanings did not clearly translate when it came to believing that all races had equal capability or function, which was a common conception for the period in which he lived. Many critics believe that it was his views on race that inhibited him from becoming an abolitionist earlier in his life and also inhibited him from being more active in the anti-slavery movement. Much of his early life, he was silent on the topic of race and slavery. It was not until well into his 30s that Emerson began to publish writings on race and slavery, and it was not until his late 40s and 50s that he became known as an anti-slavery activist.\nDuring his early life, Emerson seems to develop a hierarchy of races based on faculty to reason or rather, whether African slaves were distinguishably equal to white men based on their ability to reason. In a journal entry written in 1822, Emerson writes about a personal observation:\n\"It can hardly be true that the difference lies in the attribute of reason. I saw ten, twenty, a hundred large lipped, lowbrowed black men in the streets who, except in the mere matter of language, did not exceed the sagacity of the elephant. Now is it true that these were created superior to this wise animal, and designed to control it? And in comparison with the highest orders of men, the Africans will stand so low as to make the difference which subsists between themselves & the sagacious beasts inconsiderable\"\nAs with many supporters of slavery, during his early years, Emerson seems to have thought that the faculties of African slaves were not equal to their white owners. But this belief in racial inferiorities did not make Emerson a supporter of slavery. Emerson wrote later that year that, \"No ingenious sophistry can ever reconcile the unperverted mind to the pardon of Slavery; nothing but tremendous familiarity, and the bias of private interest\". Emerson saw the removal of people from their homeland, the treatment of slaves, and the self-seeking benefactors of slaves as gross injustices. For Emerson, slavery was a moral issue while superiority of the races was an issue Emerson tried to analyze from a scientific perspective based what he believe to be inherited traits.\nEmerson saw himself as a man of \"Saxon descent\", by which he meant that he was ethnically English. In a speech given in 1835 titled \"Permanent Traits of the English National Genius\", Emerson said the following, \"The inhabitants of the United States, especially of the Northern portion, are descended from the people of England and have inherited the traits of their national character\". Emerson saw direct ties between race based on national identity and the inherent nature of the human being. White Americans who were native-born in the United States and of primarily or entirely English ancestry were a group which Emerson categorized as its own \"race\", and which Emerson thought had a unique position of being superior to other nations. Emerson's idea of race was more based on a shared culture, environment, and history, not the scientific traits that modern science defines as race. He believed that native-born Americans of English descent were superior to European immigrants, including Northern Europeans such as the Irish, French, and German as well as being superior to English people from England, who he considered a close second and the only really comparable group.\nLater in his life, Emerson's ideas on race changed when he became more involved in the abolitionist movement while at the same time he began to more thoroughly analyze the philosophical implications of race and racial hierarchies. His beliefs shifted focus to the potential outcomes of racial conflicts. Emerson's racial views were closely related to his views on nationalism and national superiority, specifically that of the Saxons of ancient England, which was a common view in the United States of that time. Emerson used contemporary theories of race and natural science to support a theory of race development. He believed that the current political battle and the current enslavement of other races was an inevitable racial struggle, one that would result in the inevitable union of the United States. Such conflicts were necessary for the dialectic of change that would eventually allow the progress of the nation. In much of his later work, Emerson seems to allow the notion that different races will eventually mix in America. This hybridization process would lead to a superior race that would be to the advantage of the superiority of the United States. (Field 9).\nEmerson was a supporter of the spread of community libraries in the nineteenth century, having this to say of them:\nConsider what you have in the smallest chosen library. A company of the wisest and wittiest men that could be picked out of all civil countries, in a thousand years, have set in best order the results of their learning and wisdom.\nEmerson may have had erotic thoughts about at least one man. During his early years at Harvard, he found himself attracted to a young freshman named Martin Gay about whom he wrote sexually charged poetry. He also had a number of romantic interests in various women throughout his life, such as Anna Barker and Caroline Sturgis.\n\n\n== Legacy ==\n\nAs a lecturer and orator, Emerson—nicknamed the Sage of Concord—became the leading voice of intellectual culture in the United States. James Russell Lowell, editor of the Atlantic Monthly and the North American Review, commented in his book My Study Windows (1871), that Emerson was not only the \"most steadily attractive lecturer in America,\" but also \"one of the pioneers of the lecturing system.\" Herman Melville, who had met Emerson in 1849, originally thought he had \"a defect in the region of the heart\" and a \"self-conceit so intensely intellectual that at first one hesitates to call it by its right name\", though he later admitted Emerson was \"a great man\". Theodore Parker, a minister and Transcendentalist, noted Emerson's ability to influence and inspire others: \"the brilliant genius of Emerson rose in the winter nights, and hung over Boston, drawing the eyes of ingenuous young people to look up to that great new star, a beauty and a mystery, which charmed for the moment, while it gave also perennial inspiration, as it led them forward along new paths, and towards new hopes\".\nEmerson's work not only influenced his contemporaries, such as Walt Whitman and Henry David Thoreau, but would continue to influence thinkers and writers in the United States and around the world down to the present. Notable thinkers who recognize Emerson's influence include Nietzsche and William James, Emerson's godson. \"There is little disagreement that Emerson was the most influential writer of 19th-century America, though these days he is largely the concern of scholars. Walt Whitman, Henry David Thoreau and William James were all positive Emersonians, while Herman Melville, Nathaniel Hawthorne and Henry James were Emersonians in denial—while they set themselves in opposition to the sage, there was no escaping his influence. To T. S. Eliot, Emerson's essays were an \"encumbrance.\" Waldo the Sage was eclipsed from 1914 until 1965, when he returned to shine, after surviving in the work of major American poets like Robert Frost, Wallace Stevens and Hart Crane.\"\nIn his book The American Religion, Harold Bloom repeatedly refers to Emerson as \"The prophet of the American Religion\", which in the context of the book refers to indigenously American religions such as Mormonism and Christian Science, which arose largely in Emerson's lifetime, but also to Mainline Protestant churches that Bloom says have become in the United States more gnostic than their European counterparts. In The Western Canon, Harold Bloom compares Emerson to Michel de Montaigne: \"The only equivalent reading experience that I know is to reread endlessly in the notebooks and journals of Ralph Waldo Emerson, the American version of Montaigne.\" Several of Emerson's poems were included in Bloom's The Best Poems of the English Language, although he wrote that none of the poems are as outstanding as the best of Emerson's essays, which Bloom listed as \"Self-Reliance\", \"Circles\", \"Experience\", and \"nearly all of Conduct of Life\". In his belief that line lengths, and rhythms, and phrases are determined by breath Emerson's poetry foreshadowed the theories of Charles Olson.\n\n\n== Namesakes ==\nIn May 2006, 168 years after Emerson delivered his \"Divinity School Address\", Harvard Divinity School announced the establishment of the Emerson Unitarian Universalist Association Professorship. Harvard has also named a building, Emerson Hall (1900), after him.\nThe Emerson String Quartet, formed in 1976, took their name from Ralph Waldo Emerson.\nThe Ralph Waldo Emerson Prize is awarded annually to high school students for essays on historical subjects.\n\n\n== Selected works ==\n\nCollections\nEssays: First Series (1841)\nEssays: Second Series (1844)\nPoems (1847)\nNature, Addresses and Lectures (1849)\nRepresentative Men (1850)\nEnglish Traits (1856)\nThe Conduct of Life (1860)\nMay Day and Other Poems (1867)\nSociety and Solitude (1870)\nLetters and Social Aims (1876)\nIndividual essays\n\"Nature\" (1836)\n\"Self-Reliance\" (Essays: First Series)\n\"Compensation\" (First Series)\n\"The Over-Soul\" (First Series)\n\"Circles\" (First Series)\n\"The Poet\" (Essays: Second Series)\n\"Experience\" (Essays: Second Series)\n\"Politics\" (Second Series)\n\"The American Scholar\"\n\"New England Reformers\"\nPoems\n\"Concord Hymn\"\n\"The Rhodora\"\n\"Brahma\"\n\"Uriel\"\n\"The Snow-Storm (poem)\"\n\"A Nation's Strength\"\n\nLetters\nLetter to Martin Van Buren\n\n\n== See also ==\n\nAmerican philosophy\nList of American philosophers\nBuild a better mousetrap, and the world will beat a path to your door, a phrase often attributed to Emerson.\nTransparent eyeball\n\n\n== Notes ==\n\n\n== References ==\nAllen, Gay Wilson (1981). Waldo Emerson. New York: Viking Press. ISBN 0-670-74866-8. \nBaker, Carlos (1996). Emerson Among the Eccentrics: A Group Portrait. New York: Viking Press. ISBN 0-670-86675-X. \nBosco, Ronald A. and Joel Myerson (2006). Emerson Bicentennial Essays. Boston: Massachusetts Historical Society. ISBN 093490989X. \nBosco, Ronald A. and Joel Myerson (2006). The Emerson Brothers: A Fraternal Biography in Letters. Oxford: Oxford University Press. ISBN 9780195-140361. \nBosco, Ronald A. and Joel Myerson (2003). Emerson in His Own Time. Iowa City: University of Iowa Press. ISBN 0-87745-842-1. \nBosco, Ronald A. and Joel Myerson (2010). Ralph Waldo Emerson: A Documentary Volume. Detroit: Cengage Learning. ISBN 9780787681692. \nBuell, Lawrence (2003). Emerson. Cambridge, Massachusetts: The Belknap Press of Harvard University Press. ISBN 0-674-01139-2. \nEmerson, Ralph Waldo (1983). Essays and Lectures. New York: Library of America. ISBN 0-940450-15-1. \nEmerson, Ralph Waldo (1994). Collected Poems and Translations. New York: Library of America. ISBN 0-940450-28-3. \nEmerson, Ralph Waldo (2010). Selected Journals: 1820–1842. New York: Library of America. ISBN 1-59853-067-4. \nEmerson, Ralph Waldo (2010). Selected Journals: 1841–1877. New York: Library of America. ISBN 1-59853-068-2. \nGougeon, Len (2010). Virtue's Hero: Emerson, Antislavery, and Reform. Athens, Georgia: University of Georgia Press. ISBN 0-8203-3469-3. \nGura, Philip F (2007). American Transcendentalism: A History. New York: Hill and Wang. ISBN 978-0-8090-3477-2. \nKaplan, Justin (1979). Walt Whitman: A Life. New York: Simon and Schuster. ISBN 0-671-22542-1. \nKoch, Daniel R. (2012). Ralph Waldo Emerson in Europe: Class, Race and Revolution in the making of an American Thinker. London: I.B. Tauris. \nMcAleer, John (1984). Ralph Waldo Emerson: Days of Encounter. Boston: Little, Brown and Company. ISBN 0-316-55341-7. \nMyerson, Joel (2000). A Historical Guide to Ralph Waldo Emerson. New York: Oxford University Press. ISBN 0-19-512094-9. \nMyerson, Joel, Petrolionus, Sandra Herbert, Walls, Laura Dassaw, eds. (2010). The Oxford Handbook of Transcendentalism. New York: Oxford University Press. ISBN 0-19-533103-6.  CS1 maint: Multiple names: authors list (link)\nPacker, Barbara L. (2007). The Transcendentalists. Athens, Georgia: The University of Georgia Press. ISBN 978-0-8203-2958-1. \nPaolucci, Stefano (2008). Emerson Writes to Clough. A Lost Letter Found in Italy. \"Emerson Society Papers\": 19.1 (2008), 1, 4-5.  \nPorte, Joel & Morris, Saundra, eds. (1999). The Cambridge Companion to Ralph Waldo Emerson. Cambridge, United Kingdom: Cambridge University Press. ISBN 0-521-49946-1.  CS1 maint: Multiple names: authors list (link)\nRichardson, Robert D. Jr. (1995). Emerson: The Mind on Fire. Berkeley, California: University of California Press. ISBN 0-520-08808-5. \nRosenwald, Lawrence (1988). Emerson and the Art of the Diary. New York: Oxford University Press. ISBN 0-19-505333-8. \nRusk, Ralph Leslie (1957). The life of Ralph Waldo Emerson. New York: Columbia University Press. \nStephen, Leslie (1902). \"Emerson\". Studies of a Biographer. London: Duckworth & Co. pp. 130–167. \nSullivan, Wilson (1972). New England Men of Letters. New York: The Macmillan Company. ISBN 0-02-788680-8. \nvon Frank, Albert J. (1994). An Emerson Chronology. New York: G. K. Hall & Co. ISBN 0-8161-7266-8. \nVon Mehren, Joan (1994). Minerva and the Muse: A Life of Margaret Fuller. Amherst, Massachusetts: University of Massachusetts Press. ISBN 1-55849-015-9. \nWard, Julius H. (1887). The Andover Review. Houghton Mifflin. \n\n\n== Further reading ==\nLong, Roderick (2008). \"Emerson, Ralph Waldo (1803–1882)\". In Hamowy, Ronald. The Encyclopedia of Libertarianism. Thousand Oaks, CA: SAGE; Cato Institute. pp. 142–3. ISBN 978-1-4129-6580-4. LCCN 2008009151. OCLC 750831024. \n\n\n== Archival sources ==\nRalph Waldo Emerson papers, 1814–1867 (25 boxes) are housed at the Rare Book and Manuscript Library at Columbia University\nRalph Waldo Emerson additional papers, 1852–1898 (.5 linear feet) are housed at Houghton Library at Harvard University.\nRalph Waldo Emerson lectures and sermons, c. 1831 – 1882 (10 linear feet) are housed at Houghton Library at Harvard University.\nRalph Waldo Emerson letters to Charles King Newcomb, 1842 Mar. 18 – 1858 July 25 (22 items) are housed at the Concord Public Library.\n\n\n== External links ==\nThe Collected Works of Ralph Waldo Emerson, Harvard University Press, Ronald A. Bosco, General Editor; Joel Myerson, Textual Editor\nWorks by Ralph Waldo Emerson at Project Gutenberg\nWorks by or about Ralph Waldo Emerson at Internet Archive\nWorks by Ralph Waldo Emerson at LibriVox (public domain audiobooks) \nThe Works of Ralph Waldo Emerson at RWE.org\nReading Ralph Waldo Emerson, a blog featuring excerpts from Emerson's journals\nRepresentative Men from American Studies at the University of Virginia.\nThe Works of Ralph Waldo Emerson transcendentalists.com\nMark Twain on Ralph Waldo Emerson Shapell Manuscript Foundation\nThe Enduring Significance of Emerson's Divinity School Address\" – by John Haynes Holmes\nThe Living Legacy of Ralph Waldo Emerson by Rev. Schulman and R. Richardson\nA Tribute to Ralph Waldo Emerson – a hypertext guide, in English and in Italian\nRalph Waldo Emerson complete Works at the University of Michigan\nStanford Encyclopedia of Philosophy: \"Ralph Waldo Emerson\" – by Russell Goodman\nInternet Encyclopedia of Philosophy: \"Ralph Waldo Emerson\" – by Vince Brewton\nLife in the Ralph Waldo Emerson House – slideshow by The New York Times\nA bibliography of books about Emerson\n\"Writings of Emerson and Thoreau\" from C-SPAN's American Writers: A Journey Through History\nBooknotes interview with Robert D. Richardson on Emerson: The Mind on Fire, August 13, 1995.\nRalph Waldo Emerson at Find a Grave\nRalph Waldo Emerson letters and manuscript. Available online through Lehigh University's I Remain: A Digital Archive of Letters, Manuscripts, and Ephemera.", "ns": 0, "pageid": 26202, "title": "Ralph Waldo Emerson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}