{"batchcomplete": "", "query": {"normalized": [{"to": "Randy Cohen", "from": "Randy_Cohen"}], "pages": {"1921183": {"extract": "Randy Cohen is an American writer and humorist known as the author of The Ethicist column in The New York Times Magazine between 1999 and 2011. The column was syndicated throughout the U.S. and Canada. Cohen is also known as the author of several books, a playwright, and the host of the public radio show Person Place Thing.\n\n\n== Career ==\nCohen graduated from the University at Albany, SUNY in 1971, with a Bachelor of Arts in music. He received an MFA in music composition from the California Institute of the Arts. In 2011, Cohen received the honorary degree Doctor of Humane Letters from the University at Albany.\nHe spent several years \"writing humor pieces, essays, and stories for leading newspapers and magazines,\" including The New Yorker, Harpers, and The Atlantic; his first paid, published piece was in 1976 for The Village Voice In 1981, his book of satiric letters, Modest Proposals, was published by St. Martins Press. In 1989, his collection of humor pieces, Diary of a Flying Man, was published by Knopf. In 2002, The Good, The Bad, & The Difference: How to Tell Right from Wrong in Everyday Situations was published by Doubleday. His book Be Good: how to navigate the ethics of everything was by Chronicle Books in August 2012.\nCohen was a writer on Late Night with David Letterman for 950 episodes over seven years, starting in 1984. He shared in three Primetime Emmy Awards for Outstanding Writing for his work on the show. Perhaps his biggest contribution was the invention of Letterman's famous feature, the \"Top Ten List.\"\nCohen wrote for TV Nation, sharing in a Primetime Emmy Award for Outstanding Informational Series in 1995. In 1996, he became the original head writer for The Rosie O'Donnell Show.\nCohen wrote for Slate starting in 1996. At Slate, he became known for \"News Quiz,\" a satiric reader-participation feature which began in February 1998 and ended in November 2000. He also co-wrote a first-season episode of Ed, first broadcast on February 14, 2001.\nCohen wrote The Ethicist column in The New York Times Magazine between 1999 and 2011. From 2001 to 2005, he also answered listeners' questions on ethics for the National Public Radio radio news program, All Things Considered. In a surprise move, the Times ended Cohen's stint as The Ethicist, making his final column Sunday, February 27, 2011. The column continued with the same format but a new byline until early 2015, when it abandoned the question and answer format for a discussion format among a number of persons.\nCohen donated $585 to MoveOn.org's voter registration effort in 2004, apparently in violation of Times policy, which had banned political donations in 2003. The Spokane, Wash., Spokesman-Review decided on June 20, 2007, to drop Cohen's column, which had been scheduled to begin running in the paper on the following Saturday, because of his donation. Cohen responded that he saw no ethical violation, because he viewed MoveOn as no more activist than other organizations, such as the Boy Scouts of America. Nonetheless, he said he would not make such donations in the future.\nCohen wrote about the eighteenth century boxing champion Daniel Mendoza. “The Punishing Blow” debuted in 2009 at the Woodstock Fringe Festival and ran in 2010 at Manhattan's Clurman Theater.\nIn winter 2012, public radio station WAMC launched Cohen's new show Person Place Thing. In the show's first season, Cohen interviewed guests Dick Cavett, Jane Smiley, Susie Essman, Dave Cowens, Michael Pollan, John Hockenberry, Rickie Lee Jones, Ed Koch, Samantha Bee, RL Stine, and Sir Roger Bannister.\n\n\n== Cohen's ethical beliefs ==\nIn a public speech archived as a podcast on the New York Times podcast website, Cohen outlines his personal beliefs about ethics as being ultimately dependent on a person's immediate circumstances, while dismissing the notion that personal moral character might influence an individual's ethics.\nCohen categorically rejects the idea that individual people are inherently good or bad, asserting that in his opinion all individuals have in them the capacity to do good or bad at different times, in different contexts. In Cohen's view of ethics, individuals are all more or less the same with respect to ethics, but society is often to blame for the very existence of an ethical dilemma, which aligns him (by his own admission) with many of the beliefs of the Society for Ethical Culture; a fundamental premise of this ethical framework is that humans are morally obligated to promote changes in society so all people can lead more ethical lives.\n\n\n== Bibliography ==\nModest Proposals (1981, ISBN 0-312-54365-4), a book of satiric letters\nDiary of a Flying Man (1989, ISBN 978-0-394-56124-0), a collection of stories and humor pieces\nThe Good, the Bad & the Difference: How to Tell Right from Wrong in Everyday Situations (2002, ISBN 0-385-50273-7), a collection of his columns\nBe Good: how to navigate the ethics of everything (2012, Chronicle Books ISBN 978-1452107905), a guide, in Q&A format, to facing everyday moral challenges.\n\n\n== Personal life ==\nCohen was born in Charleston, South Carolina and raised in Reading, Pennsylvania, in what he has called a \"suburban reform Jewish household.\"\nHe was formerly married to the writer and activist Katha Pollitt, with whom he has a daughter, Sophie Pollitt-Cohen.\n\n\n== References ==\nSpecific references:\n\nGeneral references:\n\n\n== External links ==\nRandy Cohen at the Internet Movie Database\nThe Ethicist Archives at the New York Times website\nPerson Place Thing with Randy Cohen\n\"No. 500: End of an Error\". Cohen's 500th (and last) \"News Quiz\". Slate magazine. November 2000.", "ns": 0, "pageid": 1921183, "title": "Randy Cohen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}