{"batchcomplete": "", "query": {"normalized": [{"to": "Raya Dunayevskaya", "from": "Raya_Dunayevskaya"}], "pages": {"955000": {"extract": "Raya Dunayevskaya, born Raya Shpigel (Russian: Ра́я Шпи́гель; May 1, 1910 - June 9, 1987), later Rae Spiegel, also known by the pseudonym Freddie Forest, was the American founder of the philosophy of Marxist Humanism in the United States of America. At one time Leon Trotsky's secretary, she later split with him and ultimately founded the organization News and Letters Committees and was its leader until her death.\n\n\n== Biography ==\nOf Jewish descent, Dunayevskaya was born Raya Shpigel in today's Ukraine and emigrated to the United States (her name changed to Rae Spiegel) and joined the revolutionary movement in her childhood. Active in the American Communist Party youth organization, she was expelled at age 18 and thrown down a flight of stairs when she suggested that her local comrades should find out Trotsky's response to his expulsion from the Soviet Communist Party and the Comintern. By the following year she found a group of independent Trotskyists in Boston, led by Antoinette Buchholz Konikow, an advocate of birth control and legal abortion. In the 1930s, she adopted her mother's maiden name Dunayevskaya.\nWithout getting permission from the U.S. Trotskyist organization, she went to Mexico in 1937 to serve as Leon Trotsky's Russian language secretary during his exile there. Having returned to Chicago in 1938 after the deaths of her father and brother, she broke with Trotsky in 1939 when he continued to maintain that the Soviet Union was a \"workers' state\" even after the Molotov-Ribbentrop Pact. She opposed any notion that workers should be asked to defend this \"workers' state\" allied with Nazi Germany in a world war. Along with theorists such as C.L.R. James, and later Tony Cliff, Dunayevskaya argued that the Soviet Union had become 'state capitalist'. Toward the end of her life, she stated that what she called \"my real development\" only began after her break with Trotsky.\nHer simultaneous study of the Russian economy and of Marx's early writings (later known as the Economic and Philosophical Manuscripts of 1844), led to her theory that not only was the U.S.S.R. a 'state capitalist' society, but that 'state capitalism' was a new world stage. Much of her initial analysis was published in The New International in 1942-1943.\nIn 1940, she was involved in the split in the Socialist Workers Party that led to the formation of the Workers Party (WP), with which she shared an objection to Trotsky's characterisation of the Soviet Union as a 'degenerated workers' state'. Within the WP, she formed the Johnson-Forest Tendency alongside C. L. R. James (she being \"Freddie Forest\" and he \"J.R. Johnson\", named for their party cadre names). The tendency argued that the Soviet Union was 'state capitalist', while the WP majority maintained that it was bureaucratic collectivist.\nDifferences within the WP steadily widened, and in 1947, after a brief period of independent existence during which they published a series of documents, the tendency returned to the ranks of the SWP. Their membership in the SWP was based on a shared insistence that there was a pre-revolutionary situation just around the corner, and the shared belief that a Leninist party must be in place to take advantage of the coming opportunities.\nBy 1951, with the failure of their shared perspective to materialize, the tendency developed a theory that rejected Leninism and saw the workers as being spontaneously revolutionary. This was borne out for them by the 1949 U.S. miners' strike. In later years, they were to pay close attention to automation, especially in the automobile industry, which they came to see as paradigmatic of a new stage of capitalism. This led to the tendency leaving the SWP again to begin independent work.\nAfter more than a decade of developing the theory of state capitalism, Dunayevskaya continued her study of the Hegelian dialectic by taking on a task the Johnson-Forest Tendency had set itself: exploring Hegel's Philosophy of Mind. She advanced an interpretation of Hegel's Absolutes holding that they involved a dual movement: a movement from practice that is itself a form of theory and a movement from theory reaching to philosophy. She considered these 1953 letters to be \"the philosophic moment\" from which the whole development of Marxist Humanism flowed.\nIn 1953 Dunayevskaya moved to Detroit, where she was to live until 1984. In 1954-1955 she and C.L.R. James engaged in a split. In 1955, she founded her own organization, News and Letters Committees, and a Marxist-Humanist newspaper, News & Letters, which remains in publication today. The newspaper covers women's struggles, the liberation of workers, people of color, gay, lesbian, bisexual and transsexual rights and the disability rights movement, while not separating that coverage from philosophical and theoretical articles.\nDunayevskaya wrote what came to be known as her \"trilogy of revolution\": Marxism and Freedom: From 1776 Until Today (1958), Philosophy and Revolution (1973), and Rosa Luxemburg, Women's Liberation, and Marx's Philosophy of Revolution (1982). In addition, she selected and introduced a collection of writings, published in 1985, Women's Liberation and the Dialectics of Revolution.\nIn the last year of her life she was working on a new book which she had tentatively titled, Dialectics of Organization and Philosophy: The 'Party' and Forms of Organization Born Out of Spontaneity.\nRaya Dunayevskaya's speeches, letters, publications, notes, recordings and other items are located in the Walter P. Reuther Library at Wayne State University in Detroit. Microfilm copies of the collection are available from the WSU Archives of Labor and Urban Affairs. Guides to the collection are available from News and Letters Committees.\n\n\n== Quotations ==\n\"He who glorifies theory and genius but fails to recognize the limits of a theoretical work, fails likewise to recognize the indispensability of the theoretician. All of history is the history of the struggle for freedom. If, as a theoretician, one's ears are attuned to the new impulse from the workers, new \"categories\" will be created, a new way of thinking, a new step forward in philosophic cognition.\" –from Marxism and Freedom\n\"Precisely where Hegel sounds most abstract, seems to close the shutters tight against the whole movement of history, there he lets the lifeblood of the dialectic – absolute negativity – pour in. It is true Hegel writes as if the resolution of opposing live forces can be overcome by a mere thought transcendence. But he has, by bringing oppositions to their most logical extreme, opened new paths, a new relationship of theory to practice, which Marx worked out as a totally new relationship of philosophy to revolution. Today's revolutionaries turn their backs on this at their peril.\" –from Philosophy and Revolution\n\"It is true that other post-Marx Marxists have rested on a truncated Marxism; it is equally true that no other generation could have seen the problematic of our age, much less solve our problems. Only live human beings can recreate the revolutionary dialectic forever anew. And these live human beings must do so in theory as well as in practice. It is not a question only of meeting the challenge from practice, but of being able to meet the challenge from the self-development of the Idea, and of deepening theory to the point where it reaches Marx's concept of the philosophy of 'revolution in permanence.'\" –from Rosa Luxemburg, Women's Liberation, and Marx's Philosophy of Revolution\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n=== Books ===\nTrilogy of Revolution\nMarxism and Freedom: From 1776 Until Today. [1958] 2000. Humanity Books. ISBN 1-57392-819-4.\nPhilosophy and Revolution: from Hegel to Sartre and from Marx to Mao. Third ed. 1989. Columbia University Press. ISBN 0-231-07061-6.\nRosa Luxemburg, Women's Liberation, and Marx's Philosophy of Revolution. 1991. University of Illinois Press. ISBN 0-252-01838-9.\n\nOther\nWomen’s Liberation and the Dialectics of Revolution: Reaching for the Future. 1996. Wayne State University Press. ISBN 0-8143-2655-2.\nThe Marxist-Humanist Theory of State-Capitalism. 1992. News & Letters Committee. ISBN 0-914441-30-2.\nThe Power of Negativity: Selected Writings on the Dialectic in Hegal and Marx. 2002. Lexington Books. ISBN 0-7391-0266-4. Image\n\n\n=== Articles ===\n\"The Shock of Recognition and the Philosophic Ambivalence of Lenin\". TELOS, No. 5 (Spring 1970). New York: Telos Press.\n\n\n=== Introductions ===\nFrantz Fanon, Soweto & American Black Thought by Lou Turner and John Alan ; new introd. by Raya Dunayevskaya. – new expanded edition, Chicago : News and Letters, 1986\n\n\n=== Archives ===\nRaya Dunayevskaya Papers Walter P. Reuther Library, Detroit, Michigan. The first portion of the collection exists as organized and donated by Ms. Dunayevskaya and relates to the development of Marxist-Humanism. The second portion was donated after Ms. Dunayevskaya’s death and relates her last writings and unfinished works. Documents range from 1924-1987.\n\n\n=== Writings about Dunayevskaya ===\nAfary, Janet, \"The Contribution of Raya Dunayevskaya, 1910-1987: A Study in Hegelian Marxist Feminism,\" Extramares (1)1, 1989. pp. 35–55.\nAnderson, Kevin, chapter 8, From 1954 to Today: \"Lefebvre, Colletti, Althusser, and Dunayevskaya,\" in Lenin, Hegel and Western Marxism: A Critical Study, University of Illinois Press: Urbana, 1995.\nAnderson, Kevin, \"Sources of Marxist-Humanism: Fanon, Kosik, Dunayevskaya,\" Quarterly Journal of Ideology (10)4, 1986. pp. 15–29.\nChicago Literary Review, \"Marxist-Humanism, an Interview with Raya Dunayevskaya, Chicago Literary Review, March 15, 1985.\nEaston, Judith, \"Raya Dunayevskaya,\" Bulletin of the Hegel Society of Great Britain (16), Autumn/Winter 1987. pp. 7–12.\nGogol, Eugene, Raya Dunayevskaya: Philosopher of Marxist-Humanism, Wipfandstock Publishers: Eugene, Oregon, 2003. Archived July 28, 2009, at the Wayback Machine.\nGreeman, Richard, \"Raya Dunayevskaya: Thinker, Fighter, Revolutionary,\" Against the Current, January/February 1988.\nHudis, Peter, \"Workers as Reason: The Development of a New Relation of Worker and Intellectual in American Marxist-Humanism,\" Historical Materialism (11)4, pp. 267–293.\nJeannot, Thomas M., \"Dunayevskaya's Conception of Ultimate Reality and Meaning,\" Ultimate Reality and Meaning (22)4, December 1999. pp. 276–293.\nKellner, Douglas, \"A Comment on the Dunayevskaya-Marcuse Dialogue,\" Quarterly Journal of Ideology (13)4, 1989. p. 29.\nLe Blanc, Paul, \"The Philosophy and Politics of Freedom,\" Monthly Review (54)8. [1]\nMoon, Terry, \"Dunayevskaya, Raya,\" in Women Building Chicago 1790-1990: A Biographical Dictionary, Bloomington: Indiana University Press, 2001. pp. 238–241.\nRich, Adrienne, \"Living the Revolution,\" Women's Review of Books (3)12, September 1986.\nRockwell, Russell, \"Hegel and Social Theory in Critical Theory and Marxist-Humanism,\" International Journal of Philosophy (32)1, 2003.\nSchultz, Rima Lunin and Adele Hast, \"Introduction,\" in Women Building Chicago 1790-1990, Bloomington: Indiana University Press, 2001.\n\n\n== External links ==\nBiography\nNews and Letters Newspaper\nRaya Dunayevskaya Collection at Walter Reuther Library, Wayne State University\nArchive at struggle.net\nLibertarian Communist Library Raya Dunayevskaya holdings\nMarxists Internet Archive Raya Dunayevskaya Archive\nMarxist-Humanist Dialectics", "ns": 0, "pageid": 955000, "title": "Raya Dunayevskaya"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}