{"batchcomplete": "", "query": {"normalized": [{"to": "Raymond Frey", "from": "Raymond_Frey"}], "pages": {"36169092": {"extract": "Raymond G. Frey (1941–2012) was Professor of Philosophy at Bowling Green State University, specializing in moral, political and legal philosophy, and author or editor of a number of books, including Interests and Rights: The Case Against Animals (1980), Euthanasia and Physician-Assisted Suicide (1998, with Gerald Dworkin and Sissela Bok), and The Oxford Handbook of Animal Ethics (2011, with Tom Beauchamp, eds.).\nFrey obtained his B.A. in philosophy in 1966 from The College of William and Mary, his M.A. in 1968 from the University of Virginia, and his D.Phil. in 1974 from the University of Oxford – where his supervisor was R. M. Hare – for a thesis on \"Rules and Consequences as Grounds for Moral Judgment\".\nDavid DeGrazia wrote in 1991 that Frey was one of five authors – along with Peter Singer, Tom Regan, Mary Midgley, and Steve Sapontzis – who had made significant philosophical contributions to the work of placing animals within ethical theory.\nFrey writes from a preference utilitarian perspective, as does Singer. Preference utilitarianism defines an act as good insofar as it fulfills the preferences (interests) of the greatest number. In his early work, Interests and Rights (1980), Frey disagreed with Singer – who in his Animal Liberation (1975) wrote that the interests of nonhuman animals must be included when judging the consequences of an act – on the grounds that animals have no interests. Frey argued that interests are dependent on desire, and that one cannot have a desire without a corresponding belief. He argued further that animals have no beliefs because they are unable to comprehend the concept of a belief (that is, they are unable to hold a second-order belief: a belief about a belief), which he argues requires language: \"If someone were to say, e.g. 'The cat believes that the door is locked,' then that person is holding, as I see it, that the cat holds the declarative sentence 'The door is locked' to be true; and I can see no reason whatever for crediting the cat or any other creature which lacks language, including human infants, with entertaining declarative sentences.\" He concludes that animals have no interests.\nCounter-arguments include that first-order beliefs may be held in the absence of second-order ones – that is, a non-human animal or human infant might hold a belief while failing to understand the concept of belief — and that human beings could not have developed language in the first place without some pre-verbal beliefs. Frey has since rejected some of his early conclusions. The importance of Interests and Rights, according to DeGrazia, lay in its rigorous treatment of the problem of animal minds and moral status.\n\n\n== Selected publications ==\nBooks\nwith Tom Beauchamp (eds.). The Oxford Handbook of Animal Ethics. Oxford University Press, 2011\nwith Christopher W. Morris (eds.). Value, Welfare, and Morality. Cambridge University Press, 1994\nwith Christopher W. Morris (eds.). Liability and Responsibility: Essays in Law and Morals. Cambridge University Press, 1991\nRights, Killing and Suffering: Moral Vegetarianism and Applied Ethics. Blackwell, 1985\nUtility and Rights. Blackwell, 1984.\nRights, Killing and Suffering. Blackwell, 1983\nInterests and Rights: The Case Against Animals. Oxford University Press, 1980\nPapers\n\"Medicine, Animal Experimentation, and the Moral Problem of Unfortunate Humans,\" Social Philosophy and Policy 13 (1996): 118-211\nWhat has sentiency to do with the possession of rights?\" in David A. Paterson and Richard D. Ryder (eds.), Animals' Rights: A Symposium. Centaur Press, 1979.\n\n\n== Notes ==", "ns": 0, "pageid": 36169092, "title": "Raymond Frey"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}