{"batchcomplete": "", "query": {"normalized": [{"to": "Reinhold Niebuhr", "from": "Reinhold_Niebuhr"}], "pages": {"204706": {"extract": "Karl Paul Reinhold Niebuhr (/ˈraɪnhoʊld ˈniːbʊər/; June 21, 1892 – June 1, 1971) was an American theologian, ethicist, commentator on politics and public affairs, and professor at Union Theological Seminary for more than 30 years. The brother of another prominent theologian, H. Richard Niebuhr, he is also known for having composed the Serenity Prayer, He received the Presidential Medal of Freedom in 1964. Among his most influential books are Moral Man and Immoral Society and The Nature and Destiny of Man, the second of which Modern Library ranked one of the top 20 nonfiction books of the twentieth century. Starting as a minister with working-class sympathies in the 1920s and sharing with many other ministers a commitment to theological pacifism, his thinking evolved during the 1930s neo-orthodox realist theology as he developed the philosophical perspective known as Christian realism. He attacked utopianism as ineffectual for dealing with reality, writing in The Children of Light and the Children of Darkness (1944), \"Man's capacity for justice makes democracy possible; but man's inclination to injustice makes democracy necessary.\"\nNiebuhr's realism deepened after 1945 and led him to support American efforts to confront Soviet communism around the world. A powerful speaker, he was one of the most influential thinkers of the 1940s and 1950s in public affairs. Niebuhr battled with religious liberals over what he called their naïve views of the contradictions of human nature and the optimism of the Social Gospel, and battled with the religious conservatives over what he viewed as their naïve view of scripture and their narrow definition of \"true religion\". During this time he was viewed by many as the intellectual rival of John Dewey. Niebuhr was also one of the founders of Americans for Democratic Action and spent time at the Institute for Advanced Study in Princeton, New Jersey.\nNiebuhr's long-term impact on political philosophy and political theology involve his utilizing the resources of the Christian faith to argue for political realism and his contributions to modern just war thinking. His work has also significantly influenced international relations theory, leading many scholars to move away from idealism and embrace realism. Many leading political scientists, such as George F. Kennan, Hans Morgenthau, Kenneth Waltz, and political historians, such as Richard Hofstadter, Arthur M. Schlesinger Jr., and Christopher Lasch, have noted his influence on their thinking. Andrew Bacevich labelled Niebuhr's book The Irony of American History \"the most important book ever written on U.S. foreign policy\".\nAside from academics, numerous politicians and activists such as Thomas Edison, U.S. President Barack Obama, former President Jimmy Carter, Martin Luther King Jr., Hillary Clinton, Hubert Humphrey, Dean Acheson, Madeleine Albright, and John McCain have also cited his influence on their thought. Schlesinger described Niebuhr as \"the most influential American theologian of the 20th century\" and Time posthumously called Niebuhr \"the greatest Protestant theologian in America since Jonathan Edwards\". Recent years have seen a renewed interest in Niebuhr's work, in part because of Obama's stated admiration for Niebuhr.\n\n\n== Early life and education ==\nNiebuhr was born in Wright City, Missouri, the son of German immigrants Gustav Niebuhr, and his wife, Lydia (née Hosto). His father was a German Evangelical pastor; his denomination was the American branch of the established Prussian Church Union in Germany. It is now part of the United Church of Christ. The family spoke German at home. His brother H. Richard Niebuhr also became a famous theological ethicist, and his sister Hulda Niebuhr became a divinity professor in Chicago. The Niebuhr family moved to Lincoln, Illinois, in 1902 when Gustav Niebuhr became pastor of Lincoln's St. John's German Evangelical Synod church. Reinhold Niebuhr first served as pastor of a church when he served from April to September 1913 as interim minister of St. John's following his father's death.\nNiebuhr attended Elmhurst College in Illinois and graduated in 1910. He studied at Eden Theological Seminary in Webster Groves, Missouri, where, as he admitted, he was deeply influenced by Samuel D. Press in \"biblical and systematic subjects\", and Yale Divinity School, where he earned a Bachelor of Divinity degree in 1914 and a Master of Arts degree the following year. He always regretted not taking a doctorate. He said that Yale gave him intellectual liberation from the localism of his German-American upbringing.\n\n\n== Marriage and family ==\nIn 1931 Niebuhr married Ursula Keppel-Compton. She was a member of the Church of England and was educated at Oxford University in theology and history. She met Niebuhr while studying for her master's degree at Union Theological Seminary. For many years, she was on faculty at Barnard College (the women's college of Columbia University) where she helped establish and then chaired the religious studies department. The Niebuhrs had two children, Christopher Niebuhr and Elisabeth Sifton Niebuhr. Ursula Niebuhr left evidence in her professional papers at the Library of Congress showing that she co-authored some of her husband's later writings.\n\n\n== Detroit ==\nIn 1915, Niebuhr was ordained a pastor. The German Evangelical mission board sent him to serve at Bethel Evangelical Church in Detroit, Michigan. The congregation numbered sixty-six on his arrival and grew to nearly 700 by the time he left in 1928. The increase reflected his ability to reach people outside the German American community and among the growing population attracted to jobs in the booming automobile industry. In the early 1900s Detroit became the fourth-largest city in the country, attracting many black and white migrants from the rural South, as well as Jewish and Catholic ethnics from eastern and southern Europe. They competed for jobs and limited housing, and the city's rapid changes and rise in social tensions contributed to the growth in numbers of Ku Klux Klan members in the city, which reached its peak in 1925, and to the Black Legion. During that year's city election campaign, in which the Klan publicly supported several candidates, including for the office of mayor, Niebuhr spoke out publicly against the Klan to his congregation, describing them as \"one of the worst specific social phenomena which the religious pride of a people has ever developed\". Only one of their several candidates gained a seat on the city council, and Charles Bowles, the mayoral candidate, was defeated.\n\n\n=== World War I ===\nAs America entered the World War in 1917, Niebuhr was the unknown pastor of a small German-speaking congregation in Detroit (it stopped using German in 1919). All German American culture in the United States and nearby Canada came under attack for suspicion of having dual loyalties. Niebuhr repeatedly stressed the need to be loyal to America, and won an audience in national magazines for his appeals to the German Americans to be patriotic. Theologically, he went beyond the issue of national loyalty as he endeavored to fashion a realistic ethical perspective of patriotism and pacifism. He endeavored to work out a realistic approach to the moral danger posed by aggressive powers, which many idealists and pacifists failed to recognize. During the war, he also served his denomination as Executive Secretary of the War Welfare Commission, while maintaining his pastorate in Detroit. A pacifist at heart, he saw compromise as a necessity and was willing to support war in order to find peace—compromising for the sake of righteousness.\n\n\n=== Origins of Niebuhr's working class and labor class sympathy ===\nSeveral attempts have been made to explicate the origins of Niebuhr's sympathies from the 1920s to working class and labor class issues as documented by his biographer Richard W. Fox. One supportive example has concerned his interest in the plight of auto workers in Detroit. This one interest among others can be briefly summarized below.\nAfter seminary, Niebuhr preached the Social Gospel, and then initiated the engagement of what he considered the insecurity of Ford workers. Niebuhr had moved to the left and was troubled by the demoralizing effects of industrialism on workers. He became an outspoken critic of Henry Ford and allowed union organizers to use his pulpit to expound their message of workers' rights. Niebuhr attacked poor conditions created by the assembly lines and erratic employment practices.\nBecause of his opinion about factory work, Niebuhr rejected liberal optimism. He wrote in his diary:\n\nWe went through one of the big automobile factories to-day.... The foundry interested me particularly. The heat was terrific. The men seemed weary. Here manual labour is a drudgery and toil is slavery. The men cannot possibly find any satisfaction in their work. They simply work to make a living. Their sweat and their dull pain are part of the price paid for the fine cars we all run. And most of us run the cars without knowing what price is being paid for them.... We are all responsible. We all want the things which the factory produces and none of us is sensitive enough to care how much in human values the efficiency of the modern factory costs.\n\nThe historian Ronald H. Stone thinks that Niebuhr never talked to the assembly line workers (many of his parishioners were skilled craftsmen) but projected feelings onto them after discussions with Rev. Samuel Marquis. Niebuhr's criticism of Ford and capitalism resonated with progressives and helped make him nationally prominent. His serious commitment to Marxism developed after he moved to New York in 1928.\nIn 1923, Niebuhr visited Europe to meet with intellectuals and theologians. The conditions he saw in Germany under the French occupation of the Rhineland dismayed him. They reinforced the pacifist views that he had adopted throughout the 1920s after World War I.\n\n\n== 1930s: Growing influence in New York ==\nNiebuhr captured his personal experiences in Detroit in his book Leaves from the Notebook of a Tamed Cynic. He continued to write and publish throughout his career, and also served as editor of the magazine Christianity and Crisis from 1941 through 1966.\nIn 1928, Niebuhr left Detroit to become Professor of Practical Theology at Union Theological Seminary in New York. He spent the rest of his career there, until retirement in 1960. While teaching theology at Union Theological Seminary, Niebuhr influenced many generations of students and thinkers, including the German minister Dietrich Bonhoeffer of the anti-Nazi Confessing Church.\nThe Fellowship of Socialist Christians was organized in the early 1930s by Niebuhr and others with similar views. Later it changed its name to Frontier Fellowship and then to Christian Action. The main supporters of the Fellowship in the early days included Eduard Heimann, Sherwood Eddy, Paul Tillich and Rose Terlin. In its early days the group thought capitalist individualism was incompatible with Christian ethics. Although not Communist, the group acknowledged Karl Marx's social philosophy. Niebuhr was among the group of 51 prominent Americans who formed the International Relief Association (IRA) that is today known as the International Rescue Committee (IRC). The committee mission was to assist Germans suffering from the policies of the Hitler regime.\n\n\n=== Niebuhr and Dewey ===\nIn the 1930s Niebuhr was often seen as an intellectual opponent of John Dewey. Both men were professional polemicists and their ideas often clashed, although they contributed to the same realms of liberal intellectual schools of thought. Niebuhr was a strong proponent of the \"Jerusalem\" religious tradition as a corrective to the secular \"Athens\" tradition insisted upon by Dewey. In the book Moral Man and Immoral Society (1932), Niebuhr strongly criticized Dewey's philosophy, although his own ideas were still intellectually inchoate. Two years later, in a review of Dewey's book A Common Faith (1934), Niebuhr was calm and respectful towards Dewey's \"religious footnote\" on his then large body of educational and pragmatic philosophy.\n\n\n== Neo-orthodox theology ==\nIn 1939 Niebuhr explained his theological odyssey:\n\n... About midway in my ministry which extends roughly from the peace of Versailles [1919] to the peace of Munich [1938], measured in terms of Western history, I underwent a fairly complete conversion of thought which involved rejection of almost all the liberal theological ideals and ideas with which I ventured forth in 1915. I wrote a book [Does Civilization need Religion?], my first, in 1927 which ... contains almost all the theological windmills against which today I tilt my sword. These windmills must have tumbled shortly thereafter for every succeeding volume expresses a more and more explicit revolt against what is usually known as liberal culture.\n\nIn the 1930s Niebuhr worked out many of his ideas about sin and grace, love and justice, faith and reason, realism and idealism, and the irony and tragedy of history, which established his leadership of the neo-orthodox movement in theology. Influenced strongly by Karl Barth and other dialectical theologians of Europe, he began to emphasize the Bible as a human record of divine self-revelation; it offered for Niebuhr a critical but redemptive reorientation of the understanding of humanity's nature and destiny.\nNiebuhr couched his ideas in Christ-centered principles such as the Great Commandment and the doctrine of original sin. His major contribution was his view of sin as a social event—as pride—with selfish self-centeredness as the root of evil. The sin of pride was apparent not just in criminals, but more dangerously in people who felt good about their deeds—rather like Henry Ford (whom he did not mention by name). The human tendency to corrupt the good was the great insight he saw manifested in governments, business, democracies, utopian societies, and churches. This position is laid out profoundly in one of his most influential books, Moral Man and Immoral Society (1932). He was a debunker of hypocrisy and pretense and made the avoidance of self-righteous illusions the center of his thoughts.\nNiebuhr argued that to approach religion as the individualistic attempt to fulfill biblical commandments in a moralistic sense is not only an impossibility but also a demonstration of man's original sin, which Niebuhr interpreted as self-love. Through self-love man becomes focused on his own goodness and leaps to the false conclusion—one he called the \"Promethean illusion\"—that he can achieve goodness on his own. Thus man mistakes his partial ability to transcend himself for the ability to prove his absolute authority over his own life and world. Constantly frustrated by natural limitations, man develops a lust for power which destroys him and his whole world. History is the record of these crises and judgments which man brings on himself; it is also proof that God does not allow man to overstep his possibilities. In radical contrast to the Promethean illusion, God reveals himself in history, especially personified in Jesus Christ, as sacrificial love which overcomes the human temptation to self-deification and makes possible constructive human history.\n\n\n== Politics ==\n\n\n=== Domestic ===\nDuring the 1930s, Niebuhr was a prominent leader of the militant faction of the Socialist Party of America, although he disliked die-hard Marxists. He described their beliefs as a religion and a thin one at that. In 1941, he co-founded the Union for Democratic Action, a group with a strongly militarily interventionist, internationalist foreign policy and a pro-union, liberal domestic policy. He was the group's president until it transformed into the Americans for Democratic Action in 1947.\n\n\n=== International ===\nWithin the framework of Christian Realism, Niebuhr became a supporter of American action in World War II, anti-communism, and the development of nuclear weapons. However, he opposed the Vietnam War.\nAt the outbreak of World War II, the pacifist component of his liberalism was challenged. Niebuhr began to distance himself from the pacifism of his more liberal colleagues and became a staunch advocate for the war. Niebuhr soon left the Fellowship of Reconciliation, a peace-oriented group of theologians and ministers, and became one of their harshest critics.\nThis departure from his peers evolved into a movement known as Christian Realism. Niebuhr is widely considered to have been its primary advocate. Niebuhr supported the Allies during World War II and argued for the engagement of the United States in the war. As a writer popular in both the secular and the religious arena and a professor at the Union Theological Seminary, he was very influential both in the United States and abroad. While many clergy proclaimed themselves pacifists because of their World War I experiences, Niebuhr declared that a victory by Germany and Japan would threaten Christianity. He renounced his socialist connections and beliefs and resigned from the pacifist Fellowship of Reconciliation. He based his arguments on the Protestant beliefs that sin is part of the world, that justice must take precedence over love, and that pacifism is a symbolic portrayal of absolute love but cannot prevent sin. Although his opponents did not portray him favorably, Niebuhr's exchanges with them on the issue helped him mature intellectually.\nNiebuhr debated Charles Clayton Morrison, editor of The Christian Century magazine, about America's entry into World War II. Morrison and his pacifistic followers maintained that America's role should be strictly neutral and part of a negotiated peace only, while Niebuhr claimed himself to be a realist, who opposed the use of political power to attain moral ends. Morrison and his followers strongly supported the movement to outlaw war that began after World War I and the Kellogg-Briand Pact of 1928. The pact was severely challenged by the Japanese invasion of Manchuria in 1931. With his publication of Moral Man and Immoral Society (1932), Niebuhr broke ranks with The Christian Century and supported interventionism and power politics. He supported the reelection of President Franklin D. Roosevelt in 1940 and published his own magazine, Christianity and Crisis. In 1945, however, Niebuhr charged that use of the atomic bomb on Hiroshima was \"morally indefensible\".\nArthur M. Schlesinger Jr. explained Niebuhr's influence:\n\nTraditionally, the idea of the frailty of man led to the demand for obedience to ordained authority. But Niebuhr rejected that ancient conservative argument. Ordained authority, he showed, is all the more subject to the temptations of self-interest, self-deception and self-righteousness. Power must be balanced by power. He persuaded me and many of my contemporaries that original sin provides a far stronger foundation for freedom and self-government than illusions about human perfectibility. Niebuhr's analysis was grounded in the Christianity of Augustine and Calvin, but he had, nonetheless, a special affinity with secular circles. His warnings against utopianism, messianism and perfectionism strike a chord today.... We cannot play the role of God to history, and we must strive as best we can to attain decency, clarity and proximate justice in an ambiguous world.\n\nNiebuhr's defense of Roosevelt made him popular among liberals, as the historian Morton White noted:\n\nThe contemporary liberal's fascination with Niebuhr, I suggest, comes less from Niebuhr's dark theory of human nature and more from his actual political pronouncements, from the fact that he is a shrewd, courageous, and right-minded man on many political questions. Those who applaud his politics are too liable to turn then to his theory of human nature and praise it as the philosophical instrument of Niebuhr's political agreement with themselves. But very few of those whom I have called \"atheists for Niebuhr\" follow this inverted logic to its conclusion: they don't move from praise of Niebuhr's theory of human nature to praise of its theological ground. We may admire them for drawing the line somewhere, but certainly not for their consistency.\n\nAfter Joseph Stalin signed the Molotov–Ribbentrop Pact with Adolf Hitler in August 1939, Niebuhr severed his past ties with any fellow-traveler organization having any known Communist leanings. In 1947, Niebuhr helped found the liberal Americans for Democratic Action (ADA). His ideas influenced George Kennan, Hans Morgenthau, Arthur M. Schlesinger Jr., and other realists during the Cold War on the need to contain Communist expansion.\nIn his last cover story for Time magazine (March 1948), Whittaker Chambers said of Niebuhr:\n\nMost U.S. liberals think of Niebuhr as a solid socialist who has some obscure connection with Union Theological Seminary that does not interfere with his political work. Unlike most clergymen in politics, Dr. Niebuhr is a pragmatist. Says James Loeb, secretary of Americans for Democratic Action: \"Most so-called liberals are idealists. They let their hearts run away with their heads. Niebuhr never does. For example, he has always been the leading liberal opponent of pacifism. In that period before we got into the war when pacifism was popular, he held out against it steadfastly. He is also an opponent of Marxism.\n\nIn the 1950s, Niebuhr described Senator Joseph McCarthy as a force of evil, not so much for attacking civil liberties, as for being ineffective in rooting out Communists and their sympathizers. In 1953, he supported the execution of the Rosenbergs, saying, \"Traitors are never ordinary criminals and the Rosenbergs are quite obviously fiercely loyal Communists... Stealing atomic secrets is an unprecedented crime.\"\n\n\n== Views on race, ethnicity and other religious affiliations ==\nHis views developed during his pastoral tenure in Detroit, which had become a place of immigration, migration, competition and development as a major industrial city. During the 1920s, Niebuhr spoke out against the rise of the Ku Klux Klan in Detroit, which had recruited many members threatened by the rapid social changes. The Klan proposed positions that were anti-black, anti-Jewish and anti-Catholic. Niebuhr's preaching against the Klan, especially in relation to the 1925 mayoral election, gained him national attention.\nNiebuhr's thoughts on racial justice developed slowly after he abandoned socialism. Niebuhr attributed the injustices of society to human pride and self-love and believed that this innate propensity for evil could not be controlled by humanity. But, he believed that a representative democracy could improve society's ills. Like Edmund Burke, Niebuhr endorsed natural evolution over imposed change and emphasized experience over theory. Niebuhr's Burkean ideology, however, often conflicted with his liberal principles, particularly regarding his perspective on racial justice. Though vehemently opposed to racial inequality, Niebuhr adopted a conservative position on segregation.\nWhile after World War II most liberals endorsed integration, Niebuhr focused on achieving equal opportunity. He warned against imposing changes that could result in violence. The violence that followed peaceful demonstrations in the 1960s forced Niebuhr to reverse his position against imposed equality; witnessing the problems of the Northern ghettos later caused him to doubt that equality was attainable.\n\n\n=== Catholicism ===\nAnti-Catholicism surged in Detroit in the 1920s in reaction to the rise in the number of Catholic immigrants from southern Europe since the early 20th century. It was exacerbated by the revival of the Ku Klux Klan, which recruited many members in Detroit. Niebuhr defended pluralism by attacking the Klan. During the Detroit mayoral election of 1925, Niebuhr's sermon, \"We fair-minded Protestants cannot deny\", was published on the front pages of both the Detroit Times and the Free Press.\nThis sermon urged people to vote against mayoral candidate Charles Bowles, who was being openly endorsed by the Klan. The Catholic incumbent, John W. Smith, won by a narrow 30,000 votes. Niebuhr preached against the Klan and helped to influence its decline in political power in Detroit. Niebuhr preached:\n\nthat it was Protestantism that gave birth to the Ku Klux Klan, one of the worst specific social phenomena which the religious pride and prejudice of peoples has ever developed.... I do not deny that all religions are periodically corrupted by bigotry. But I hit Protestant bigotry the hardest at this time because it happens to be our sin and there is no use repenting for other people's sins. Let us repent of our own.... We are admonished in Scripture to judge men by their fruits, not by their roots; and their fruits are their character, their deeds and accomplishments.\n\n\n=== Martin Luther King Jr. ===\nIn the \"Letter from Birmingham Jail\" Martin Luther King Jr. wrote, \"Individuals may see the moral light and voluntarily give up their unjust posture; but, as Reinhold Niebuhr has reminded us, groups tend to be more immoral than individuals.\" King valued Niebuhr's social and ethical ideals. King attributed his own nonviolent posture more to the influence of Niebuhr and Paul Tillich than to the example of Gandhi. King invited Niebuhr to participate in the third Selma to Montgomery March in 1965, and Niebuhr responded by telegram: \"Only a severe stroke prevents me from accepting ... I hope there will be a massive demonstration of all the citizens with conscience in favor of the elemental human rights of voting and freedom of assembly\" (Niebuhr, March 19, 1965). Two years later, Niebuhr defended King's decision to speak out against the Vietnam War, calling him \"one of the greatest religious leaders of our time\". Niebuhr asserted: \"Dr. King has the right and a duty, as both a religious and a civil rights leader, to express his concern in these days about such a major human problem as the Vietnam War.\" Of his country's intervention in Vietnam, Niebuhr admitted: \"For the first time I fear I am ashamed of our beloved nation.\"\n\n\n=== Judaism ===\nAs a young pastor in Detroit, he favored conversion of Jews to Christianity, scolding evangelical Christians who were anti-Semitic or ignoring them. He spoke out against \"the unchristlike attitude of Christians\" and what he described as his fellow Christians' \"Jewish bigotry\". His 1933 article in the Christian Century was an attempt to sound the alarm within the Christian community over Hitler's \"cultural annihilation of the Jews\". Eventually his theology evolved to the point where he was the first prominent Christian theologian to argue it was inappropriate for Christians to seek to convert Jews to their faith.\nAs a preacher, writer, leader, and adviser to political figures, Niebuhr supported Zionism and the development of Israel. His solution to anti-Semitism was a combination of a Jewish homeland, greater tolerance, and assimilation in other countries. As early as 1942, he advocated the expulsion of Arabs from Palestine and their resettlement in other Arab countries. His position may have related to his religious conviction that life on earth is imperfect, and his concern about German anti-Semitism.\n\n\n== History ==\nIn 1952, Niebuhr published The Irony of American History, in which he interpreted the meaning of the United States' past. Niebuhr questioned whether a humane, \"ironical\" interpretation of American history was credible on its own merits, or only in the context of a Christian view of history. Niebuhr's concept of irony referred to situations in which \"the consequences of an act are diametrically opposed to the original intention\", and \"the fundamental cause of the disparity lies in the actor himself, and his original purpose.\" His reading of American history based on this notion, though from the Christian perspective, is so rooted in historical events that readers who do not share his religious views can be led to the same conclusion. Niebuhr's great foe was idealism. American idealism, he believed, comes in two forms: the idealism of the antiwar non-interventionists, who are embarrassed by power; and the idealism of pro-war imperialists, who disguise power as virtue. He said the non-interventionists, without mentioning Harry Emerson Fosdick by name, seek to preserve the purity of their souls, either by denouncing military actions or by demanding that every action taken be unequivocally virtuous. They exaggerate the sins committed by their own country, excuse the malevolence of its enemies and, as later polemicists have put it, inevitably blame America first. Niebuhr argued this approach was a pious way to refuse to face real problems.\n\n\n== Serenity Prayer ==\n\nNiebuhr claimed he wrote the short Serenity Prayer. Fred R. Shapiro, who had cast doubts on Niebuhr's claim, conceded in 2009 that, \"The new evidence does not prove that Reinhold Niebuhr wrote [the prayer], but it does significantly improve the likelihood that he was the originator.\" The earliest known version of the prayer, from 1937, attributes the prayer to Niebuhr in this version:\n\"Father, give us courage to change what must be altered, serenity to accept what cannot be helped, and the insight to know the one from the other.\"\nThe most popular version, the authorship of which is unknown, reads:\nGod grant me the serenity to accept the things I cannot change,\nCourage to change the things I can,\nAnd the wisdom to know the difference.\n\n\n== Influence and honors ==\n\nNiebuhr exerted a significant influence upon mainline Protestant clergy in the years immediately following World War II, much of it in concord with the neo-orthodox and the related movements. That influence began to wane and then drop toward the end of his life.\nThe historian Arthur M. Schlesinger Jr. in the late twentieth century described the legacy of Niebuhr as being contested between American liberals and conservatives, both of whom wanted to claim him. Martin Luther King Jr. gave credit to Niebuhr's influence. Foreign-policy conservatives point to Niebuhr's support of the containment doctrine during the Cold War as an instance of moral realism; progressives cite his later opposition to the Vietnam War.\nIn more recent years, Niebuhr has enjoyed something of a renaissance in contemporary thought, although usually not in liberal Protestant theological circles. Both major-party candidates in the 2008 presidential election cited Niebuhr as an influence: Senator John McCain, in his book Hard Call, \"celebrated Niebuhr as a paragon of clarity about the costs of a good war\". President Barack Obama said that Niebuhr was his \"favorite philosopher\" and \"favorite theologian\". Slate magazine columnist Fred Kaplan characterized Obama's 2009 Nobel Peace Prize acceptance speech a \"faithful reflection\" of Niebuhr.\nKenneth Waltz's seminal work on international relations theory, Man, the State, and War, includes many references to Niebuhr's thought. Waltz emphasizes Niebuhr's contributions to political realism, especially \"the impossibility of human perfection\". Andrew Bacevich's book The Limits of Power: The End of American Exceptionalism refers to Niebuhr 13 times. Bacevich emphasises Niebuhr's humility and his belief that Americans were in danger of becoming enamored of U.S. power.\nOther leaders of American foreign policy in the late twentieth century and early twenty-first century have acknowledged Niebuhr's importance to them, including Jimmy Carter, Madeleine Albright, and Hillary Clinton.\n\n\n== Legacy and honors ==\nDuring his lifetime, Niebuhr was awarded several honorary doctorates.\nIn 1964, President Lyndon B. Johnson awarded Niebuhr the Presidential Medal of Freedom.\nIn Niebuhr's honor, New York City named West 120th Street between Broadway and Riverside Drive Reinhold Niebuhr Place. This is the site of Union Theological Seminary in Manhattan, where Niebuhr taught for more than 30 years.\nElmhurst College, his alma mater, established the Niebuhr Medal to honor him and his brother.\n\n\n== Personal style ==\nNiebuhr was often described as a charismatic speaker. The journalist Alden Whitman wrote of his speaking style:\n\nHe possessed a deep voice and large blue eyes. He used his arms as though he were an orchestra conductor. Occasionally one hand would strike out, with a pointed finger at the end, to accent a trenchant sentence. He talked rapidly and (because he disliked to wear spectacles for his far-sightedness) without notes; yet he was adroit at building logical climaxes and in communicating a sense of passionate involvement in what he was saying.\n\n\n== Selected works ==\nLeaves from the Notebook of a Tamed Cynic, Richard R. Smith pub, (1930), Westminster John Knox Press 1991 reissue: ISBN 0-664-25164-1, diary of a young minister's trials\nMoral Man and Immoral Society: A Study of Ethics and Politics, Charles Scribner's Sons (1932), Westminster John Knox Press 2002: ISBN 0-664-22474-1;\nInterpretation of Christian Ethics, Harper & Brothers (1935)\nBeyond Tragedy: Essays on the Christian Interpretation of History, Charles Scribner's Sons (1937), ISBN 0-684-71853-7\nChristianity and Power Politics, Charles Scribner's Sons (1940)\nThe Nature and Destiny of Man: A Christian Interpretation, Charles Scribner's Sons (1943), from his 1939 Gifford Lectures, Volume one: Human Nature, Volume two: Human Destiny. Reprint editions include: Prentice Hall vol. 1: ISBN 0-02-387510-0, Westminster John Knox Press 1996 set of 2 vols: ISBN 0-664-25709-7\nThe Children of Light and the Children of Darkness, Charles Scribner's Sons (1944), Prentice Hall 1974 edition: ISBN 0-02-387530-5, Macmillan 1985 edition: ISBN 0-684-15027-1, 2011 reprint from the University of Chicago Press, with a new introduction by Gary Dorrien: ISBN 978-0-226-58400-3\nFaith and History (1949) ISBN 0-684-15318-1\nThe Irony of American History, Charles Scribner's Sons (1952), 1985 reprint: ISBN 0-684-71855-3, Simon and Schuster: ISBN 0-684-15122-7, 2008 reprint from the University of Chicago Press, with a new introduction by Andrew J. Bacevich: ISBN 978-0-226-58398-3, read an excerpt\nChristian Realism and Political Problems (1953) ISBN 0-678-02757-9\nThe Self and the Dramas of History, Charles Scribner's Sons (1955), University Press of America, 1988 edition: ISBN 0-8191-6690-1\nLove and Justice: Selections from the Shorter Writings of Reinhold Niebuhr, ed. D. B. Robertson (1957), Westminster John Knox Press 1992 reprint, ISBN 0-664-25322-9\nPious and Secular America (1958) ISBN 0-678-02756-0\nReinhold Niebuhr on Politics: His Political Philosophy and Its Application to Our Age as Expressed in His Writings ed. by Harry R. Davis and Robert C. Good. (1960) online edition\nA Nation So Conceived: Reflections on the History of America From Its Early Visions to its Present Power with Alan Heimert, Charles Scribner's Sons (1963)\nThe Structure of Nations and Empires (1959) ISBN 0-678-02755-2\nNiebuhr, Reinhold. The Essential Reinhold Niebuhr: Selected Essays and Addresses ed. by Robert McAffee Brown (1986). 264 pp. Yale University Press, ISBN 0-300-04001-6\nRemembering Reinhold Niebuhr. Letters of Reinhold & Ursula M. Niebuhr, ed. by Ursula Niebuhr (1991) Harper, 0060662344\n\n\n== See also ==\n\nChristian socialism\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nA detailed bibliography of Niebuhr's publications\nObama's Theologian, E. J. Dionne and David Brooks debate on Speaking of Faith, American Public Media\nNiebuhr, Reinhold. \"The Public Theology of Reinhold Niebuhr\" (radio interviews online)\nReflections by Ursula Niehbuhr on the 100th anniversary of Reinhold Niebuhr's birth Retrieved April 15, 2013\nReinhold Niebuhr books and articles online\nThe Niebuhr Legacy, Elmhurst College\nReinhold Niebuhr Papers, (Library of Congress)\nWorks by or about Reinhold Niebuhr in libraries (WorldCat catalog)\n\"The Ironic Element in the American Situation\", an excerpt from The Irony of American History\nReinhold Niebuhr: April 27, 1958 Interview, The Mike Wallace Interview collection, The University of Texas at Austin.\n\"Reinhold Niebuhr\", Time Magazine Cover (Mar. 8 1948)\nBrian Urquhart, \"What You Can Learn from Reinhold Niebuhr\", The New York Review of Books\nThe Niebuhr Society\nNiebuhr on Tolerance", "ns": 0, "pageid": 204706, "title": "Reinhold Niebuhr"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}