{"batchcomplete": "", "query": {"normalized": [{"to": "Richard Jeffrey", "from": "Richard_Jeffrey"}], "pages": {"4294354": {"extract": "Richard C. Jeffrey (August 5, 1926 – November 9, 2002) was an American philosopher, logician, and probability theorist. He was a native of Boston, Massachusetts.\nJeffrey served in the U.S. Navy during World War II. As a graduate student he studied under Rudolf Carnap, and Carl Hempel. He received his M.A. from the University of Chicago in 1952 and his Ph.D. from Princeton in 1957. After holding academic positions at MIT, City College of New York, Stanford University, and the University of Pennsylvania, he joined the faculty of Princeton University in 1974 and became a professor emeritus there in 1999. He was also a visiting professor at the University of California, Irvine.\nAs a philosopher, Jeffrey specialized in epistemology and decision theory. He is perhaps best known for defending and developing the Bayesian approach to probability—specifically, for inventing \"Jeffrey conditioning\" (which he referred to as \"probability kinematics\"), a way of modeling the change in the probability of a proposition in light of new evidence.\nJeffrey also wrote or co-wrote two widely used and influential logic textbooks: Formal Logic: Its Scope and Limits, a basic introduction to logic, and Computability and Logic, a more advanced text dealing with, among other things, the famous negative results of twentieth century logic such as Gödel's incompleteness theorems and Tarski's indefinability theorem.\nJeffrey, who died of lung cancer at the age of 76, was known for his sense of humor, which often came through in his breezy writing style. In the preface of his posthumously published Subjective Probability, he refers to himself as \"a fond foolish old fart dying of a surfeit of Pall Malls\" (p. xii).\n\n\n== Selected bibliography ==\nFormal Logic: Its Scope and Limits. 3rd ed. McGraw Hill, 1990. ISBN 0-07-032357-7\nFormal Logic: Its Scope and Limits. 4th ed., John P. Burgess (editor), Hackett Publishing, 2006, ISBN 0-87220-813-3; ISBN 978-0-87220-813-1\nThe Logic of Decision. 2nd ed. University of Chicago Press, 1990. ISBN 0-226-39582-0\nProbability and the Art of Judgment. Cambridge University Press, 1992. ISBN 0-521-39770-7\nComputability and Logic (with George Boolos and John P. Burgess). 4th ed. Cambridge University Press, 2002. ISBN 0-521-00758-5\nSubjective Probability: The Real Thing. Cambridge University Press, 2004. ISBN 0-521-53668-5\n\n\n== References ==\n\n\n== External links ==\nHis website at Princeton; includes several manuscripts, including Subjective Probability\nBibliography\nCurriculum Vitae\nPage devoted to the memory of Richard Jeffrey\nStanford Encyclopedia of Philosophy entry on Bayes' Theorem (discusses Jeffrey conditioning)\nTribute, by Brian Skyrms,vishal yadav[1]\nRichard C. Jeffrey Papers [1](Richard C. Jeffrey Papers, 1934-2002, ASP.2003.02, Archives of Scientific Philosophy, Special Collections Department, University of Pittsburgh)", "ns": 0, "pageid": 4294354, "title": "Richard Jeffrey"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}