{"batchcomplete": "", "query": {"normalized": [{"to": "Richard Milton Martin", "from": "Richard_Milton_Martin"}], "pages": {"2860251": {"extract": "Richard Milton Martin (1916, Cleveland, Ohio – 22 November 1985, Milton, Massachusetts) was an American logician and analytic philosopher. In his Ph.D. thesis written under Frederic Fitch, Martin discovered virtual sets a bit before Quine, and was possibly the first non-Pole other than Joseph Henry Woodger to employ a mereological system. Building on these and other devices, Martin forged a first-order theory capable of expressing its own syntax as well as some semantics and pragmatics (via an event logic), all while abstaining from set and model theory (consistent with his nominalist principles), and from intensional notions such as modality.\n\n\n== Career ==\nMartin was educated as follows:\nB.A. Harvard, philosophy, 1941;\nM.A. Columbia, 1941;\nPh.D. Yale, philosophy, 1952.\nMartin studied under Alfred North Whitehead, then in his last year at Harvard, and may have studied under Ernest Nagel at Columbia.\nDuring WWII, Martin taught mathematics at Princeton University, then at the University of Chicago. After the war, he taught philosophy at Bryn Mawr College 1946–48, the University of Pennsylvania (Penn) 1948–59, the University of Texas 1959–63, New York University 1963–73, Northwestern 1973–76 (full-time) and 1976–85 (one course per year). Martin also held visiting appointments at Bonn, Yale, Hamburg, the New School, and Temple.\nIn 1976, Martin largely retired from teaching, becoming a research associate with Boston University’s Center for the History and Philosophy of Science. He made excellent use of the resulting leisure, so that his final decade of life was by far his most productive, publishing over 100 book chapters and journal articles. In 1979, he published the definitive treatment of his logic / first-order theory, Part A of Semiotics, and edited a volume of Carolyn Eisele’s writings on Charles Sanders Peirce. He helped edit the Festschrift books for Fitch and J. N. Findlay, respectively, published in 1975 and 1985.\nAt the time of his death, Martin served on the editorial board of eight journals and on the advisory board of the Peirce Edition Project. In 1981, he became president of the Charles S. Peirce Society. In 1984, he was elected president of the Metaphysical Society of America.\nDespite having held tenure track appointments from 1948 until his death, the only Ph.D. thesis known to have been completed under Martin’s supervision is that of James Scoggin. Otherwise, Martin’s legacy is coextensive with his published writings.\n\n\n== Ideas ==\n\"…one of the most many-sided, prolific, and scholarly of analytic philosophers.\"\n—Hans Burkhardt, Foreword to Metaphysical.\nMartin was part of the first wave of American analytic philosophers; arguably, only Quine (1908–2000), Fitch (1909–1987), and Henry Leonard (1905–67) preceded him. His chronological elders Nelson Goodman (1906–1998) and Wilfrid Sellars (1912–89) were arguably his contemporaries, as they all began their careers in earnest at about the same time, namely right after WWII. Martin's formal treatment of syntax followed Alfred Tarski; of semantics, Rudolf Carnap. Martin was generally well-disposed towards Carnap's work, contributed a long paper to the Schilpp volume on Carnap, and was seen as a disciple. Paradoxically, Martin was a positivist and radical nominalist who also sympathized with process theology and orthodox Christianity.\nBetween 1943 and 1992, Martin published 16 books and about 240 papers (of which 179 were included in his books) on an extraordinary range of subjects, including aesthetics, logic, the foundation of mathematics, metaphysics, syntax/semantics/pragmatics, the philosophy of science, phenomenology, process philosophy, theology, Frege, and Charles Sanders Peirce. Martin preached and practiced that philosophy should be done formally, by employing first-order logic, the theory of virtual sets and relations, and a multiplicity of predicates, all culminating in an event logic. Starting with the papers reprinted in his 1969 Belief, Martin argued that the Frege's Art des Gegebensein was crucial to his thinking. Just what this Art entailed remains to be elucidated.\nMartin was especially fond of applying his first-order theory to the analysis of ordinary language, a method he termed logico-linguistics. He often referenced the work of the linguists Zellig Harris (admiringly) and Henry Hiz (more critically); Martin, Harris, and Hiz all taught at Penn in the 1950s. Yet Martin was dismissive of the related theoretical work by Noam Chomsky and his MIT colleagues and students. Ironically, Martin appears to have been Chomsky's main teacher of logic; while a student at Penn, Chomsky took every course Martin taught.\nQuine's Word and Object cites Martin with approval, but Martin's wider impact has not been commensurate with the breadth and depth of his writings; the secondary literature on Martin consists of little more than reviews of his books. This silence, as puzzling as it is broad-based, begs elucidation.\n\n\n== Quotations ==\n“Over the portals of the entrance to contemporary philosophy is writ: Enter here fully equipped with the tools of the new logic.” Intension, p. 153.\n“God made first-order logic and all the rest is the handiwork of man.” Semiotics, p. xv.\n\n\n== Bibliography ==\nThe first four titles below and Part A of Semiotics are monographs. The other titles are fairly loose collections of papers, most first published in journals.\n1958. Truth and Denotation: A Study in Semantical Theory. University of Chicago Press.\n1974 (1959). Toward a Systematic Pragmatics (Studies in Logic and the Foundations of Mathematics). Greenwood Press.\n1959. The Notion of Analytic Truth. University of Pennsylvania Press.\n1963. Intension and Decision. Prentice-Hall.\n1969. Belief, Existence, and Meaning. New York University (NYU) Press.\n1971. Logic, Language, and Metaphysics. NYU Press.\n1974. Whitehead's Categorial Scheme and Other Papers. Martinus Neijhoff.\n1978. Events, Reference, and Logical Form. Catholic University of America Press.\n1978. Semiotics and Linguistic Structure. State University of New York (SUNY) Press.\n1979. Pragmatics, Truth, and Language. Reidel.\n1979. Peirce's Logic of Relations and Other Studies. Boston Studies in the Philosophy of Science. John Benjamins.\n1980. Primordiality, Science, and Value. SUNY Press.\n1981. Logico-Linguistic Papers. Foris (Netherlands).\n1983. Mind, Modality, Meaning, and Method. SUNY Press.\n1988. Metaphysical Foundations: Mereology and Metalogic. Philosophia Verlag.\n1992. Logical Semiotics and Mereology. John Benjamins.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\nMeguire, Philip, 2005, \"Richard Milton Martin: American Logician,\" Review of Modern Logic 10: 7–65. Contains a:\nBibliography of Martin's articles published in journals, conference proceedings, and in books edited by others;\nCombined topic index for the papers appearing in Martin's books.", "ns": 0, "pageid": 2860251, "title": "Richard Milton Martin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}