{"batchcomplete": "", "query": {"normalized": [{"to": "Richard Sylvan", "from": "Richard_Sylvan"}], "pages": {"433347": {"extract": "Richard Sylvan (13 December 1935 – 16 June 1996) was a philosopher, logician, and environmentalist.\n\n\n== Biography ==\nSylvan was born Francis Richard Routley in Levin, New Zealand, and his early work is cited with this surname. He studied at Victoria University College of the University of New Zealand (now Victoria University of Wellington), and then Princeton University, before taking positions successively at several Australian institutions, including the University of Sydney. From 1971 until his death in Bali, Indonesia, he was a fellow at the Research School of Social Sciences at the Australian National University in Canberra.\nSylvan was married to the philosopher/environmentalist Val Routley (later, Val Plumwood), with whom he worked closely for twenty years before their separation in 1982. After his divorce from Plumwood, he married Louise Sylvan (née Mirlin) in 1983 and adopted the last name Sylvan (an English word meaning \"of the forest\") to reflect his love of the forest and commitment to environmentalism.\n\n\n== Work in logic and metaphysics ==\nSylvan was instrumental in the development and study of relevance logic. In 1972, Sylvan (in a paper co-authored with Plumwood) proposed a semantics for certain relevant logics that had been developed by American philosophers Nuel Belnap and Alan Ross Anderson. Together with Robert K. Meyer, Routley turned this into a semantics for a large number of logical systems. Their work in logic work helped make ANU a center for the study of non-classical logic in general. Routley's work had particular influence for Graham Priest, a well-known proponent of non-classical logic; Sylvan and Priest edited a well-regarded volume on the topic. Priest in turn influenced Sylvan; they met in 1976 at the Australasian Association of Logic conference in Canberra at a time when Sylvan was doing novel work on dialetheism — the view that some contradictions are true. Not long after meeting Priest, then investigating a logic capable of handling such true contradictions, Sylvan also endorsed the view.\nSylvan's studies ranged over a variety of topics in logic and the philosophy of logic. He wrote important papers on free logic, general modal logic, and natural deduction systems. However, much of his most important work in logic was dedicated to relevant logic, for which he authored numerous papers (both technical and expository).\nFrom early in his career (and for many years after), Sylvan defended a sophisticated Meinong-inspired ontology (which he called \"noneism\"), first presented in his 1966 paper, \"Some Things Do Not Exist.\" After several more papers in the 1970s, the theory was given a book-length treatment in 1980, Exploring Meinong's Jungle and Beyond. The view—also defended in recent years by Priest—utilizes a modal theory including \"impossible worlds\" to deal with supposed objects, like the \"round square.\" Sylvan's formulation is logically consistent, and avoids certain paradoxes associated with Meinong's original ontology; although, like many Meinongian views, it faces criticism due to its presumed ontological implausibility.\n\n\n== Environmental ethics and politics ==\nOutside of logic and metaphysics, Sylvan was a proponent of so-called deep environmental ethics in the study of environmental ethics (following shallow/deep distinction formulated by Arne Næss). In his important 1973 paper \"Is There a Need for a New, an Environmental, Ethic?\", he defended a then-unorthodox account of the intrinsic value of the non-human, natural world. For this he was sometimes considered a defender of deep ecology, but he was in fact very critical of much of the domain.\nBeginning in the 1970s, Sylvan published several other notable articles and books on environmental ethics and issues, and he co-authored the 1994 book The Greening of Ethics with David Bennett. From his work in environmental ethics, Sylvan took an interest in anarchism, contributing an often-cited entry on the subject to A Companion to Contemporary Political Philosophy.\n\n\n== References ==\n\n\n== External links ==\nRichard Sylvan on nonexistent objects", "ns": 0, "pageid": 433347, "title": "Richard Sylvan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}