{"batchcomplete": "", "query": {"normalized": [{"to": "Richard Wollheim", "from": "Richard_Wollheim"}], "pages": {"373717": {"extract": "Richard Arthur Wollheim (5 May 1923 – 4 November 2003) was a British philosopher noted for original work on mind and emotions, especially as related to the visual arts, specifically, painting. Wollheim served as the president of the British Society of Aesthetics from 1992 onwards until his death in 2003.\nSon of an actress and a theatre impresario, Wollheim attended Westminster School, London, and Balliol College, Oxford (1941–2, 1945–8), interrupted by active military service in World War II. In 1949 he obtained a congratulatory first in Philosophy, Politics and Economics, and began teaching at University College London, where he became Grote Professor of Mind and Logic and Department Head from 1963 to 1982. He was visiting professor at Harvard University, Columbia University, the University of Minnesota, Graduate Center, CUNY, the University of California-Berkeley, UC Davis and elsewhere. He chaired the Department at UC Berkeley, 1998–2002. On retirement from Berkeley, he served briefly as a guest lecturer at Balliol College. Wollheim gave several distinguished lecture series, most notably the Andrew M. Mellon lectures in Fine Arts, National Gallery of Art, Washington, D.C. (1984), published as Painting as an Art.\nIn 1962, he published an article \"A paradox in the theory of democracy\", in which Wollheim argued that a supporter of democracy faces a contradiction when he votes. On the one hand he wants a particular party or candidate to win, but on the other hand he wants whoever wins the most votes to win. This has become known as Wollheim's paradox.\nHis Art and its Objects was one of the twentieth century's most influential texts on philosophical aesthetics in English. In a 1965 essay, 'Minimal Art', he seems to have coined the phrase, although its meaning eventually drifted from his. As well as for his work on the philosophy of art, Wollheim was known for his philosophical treatments of depth psychology, especially Sigmund Freud's. His posthumously-published autobiography of youth, Germs: A Memoir of Childhood, with complementary essays, discloses a good deal about his family background and his life up to early manhood, providing valuable material for understanding his interests and sensibility.\n\n\n== Publications ==\nFor an extensive bibliography of Richard Wollheim's publications by a professional bibliographer, see Eddie Yeghiayan's UC-Irvine site. See also the 'Philweb' listing.\nNote: given his unique mind, personality, and distinctive writing styles, along with his curiosity and sociability, many of Richard Wollheim's publications are outside academic categories. Besides books, he published many articles, in journals and edited collections, book reviews, and gallery catalogues for shows. He also left writings in manuscript, letters and recordings of his talks.\nBooks and separately published works (selected)\nF. H. Bradley. Harmondsworth; Baltimore: Penguin, 1959. 2d edition, 1969.\n'Socialism and Culture'. (Fabian Tract, 331.) London: Fabian Society, 1961.\n'On Drawing an Object'. London: University College, 1965 (long essay). Repr. in On Art and the Mind.\nArt and Its Objects: an Introduction to Aesthetics. New York: Harper & Row, 1968. Harmondsworth: Penguin Books, 1970. As Harper Torchbook, 1971.\nArt and its Objects: With Six Supplementary Essays. 2d edition. Cambridge, New York: Cambridge University Press, 1980.\nA Family Romance. London: Jonathan Cape, 1969. New York: Farrar, Straus, Giroux, 1969 (novel).\nFreud. (Fontana Modern Masters.) London: Collins, 1971. Paperback, 1973. American and later Cambridge University Press (1981) eds. titled Sigmund Freud.\nOn Art and the Mind: essays and lectures. Cambridge, Mass.: Harvard University Press,1972.\n'The Good Self and the Bad Self: the Moral Psychology of British Idealism and the English School of Psychoanalysis Compared' (1975)—repr. in The Mind and Its Depths, 1993.\n'The Sheep and the Ceremony' (1976)—repr. in The Mind and Its Depths, 1983.\nThe Thread of Life. Cambridge, Mass.: Harvard University Press, 1984.\nPainting as an Art. Andrew M. Mellon Lectures in Fine Arts, National Gallery of Art, Washington, D.C. Cambridge, Mass.: Harvard University Press, 1987.\nThe Mind and Its Depths. Cambridge, Mass.: Harvard University Press, 1993 (essays).\nOn the Emotions. New Haven and London: Yale University Press, 1999.\nGerms: a memoir of childhood. London: Waywiser Press, 2004.\nEdited books\nThe Image in Form: Selected Writings of Adrian Stokes (1974)\nFreud: A Collection of Critical Essays (1974)\nPhilosophical Essays on Freud, with James Hopkins. Cambridge: Cambridge University Press, 1982.\nR.B.Kitaj : A Retrospective, with Richard Morphet. London: Tate Publishing, 1994.\nSome main articles\n\"Minimal Art\", Arts Magazine (January 1965): 26–32. Repr. in On Art and the Mind.\n\"Nelson Goodman's Languages of Art\", The Journal of Philosophy: 62, no. 16 (Ag. 1970): 531.\n\"Adrian Stokes, critic, painter, poet\", Times Literary Supplement (17 February 1978): 207–209.\n\"The Cabinet of Dr Lacan\", Topoi: 10 no. 2 (1991): 163–174. [1]\n\"A Bed out of Leaves\", London Review of Books 25, no. 23 (4 December 2003). [2]\n\n\n== Notes ==\n\n\n== External links ==\nThe Guardian's obituary, Arthur Danto\nThe Daily Telegraph's obituary\nThe San Francisco Chronicle's obituary\nThe New York Times's obituary (subscription)\nUCL obituary – PDF format\nBruce Vermazen, Richard Wollheim Remembered", "ns": 0, "pageid": 373717, "title": "Richard Wollheim"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}