{"batchcomplete": "", "query": {"normalized": [{"to": "Richard Shusterman", "from": "Richard_Shusterman"}], "pages": {"8978155": {"extract": "Richard Shusterman is an American pragmatist philosopher. Known for his contributions to philosophical aesthetics and the emerging field of somaesthetics, currently he is the Dorothy F. Schmidt Eminent Scholar in the Humanities and Professor of Philosophy at Florida Atlantic University.\n\n\n== Biography and Career ==\nRichard Shusterman was born on December 3, 1949, to a Jewish family living in Philadelphia, USA. At the age 16 he left his home and went to Israel, where he continued his education, studying English and philosophy at the Hebrew University of Jerusalem. There he received a B.A. degree in English and Philosophy, and later an M.A. degree in philosophy (both degrees awarded magna cum laude). After teaching at different Israeli academic institutions, and receiving tenure at Ben-Gurion University of the Negev with an episode as a visiting fellow at St. John’s College, Oxford University during academic year 1984/85, Shusterman became an Associate Professor of Philosophy at Temple University, Philadelphia, USA in 1986. He was granted tenure in 1988 and promoted to full professor in 1991. He then served as chair of the philosophy department between the years of 1998–2004. In 2004 Richard Shusterman left Temple University to become the Dorothy F. Schmidt Eminent Scholar in the Humanities at Florida Atlantic University, Boca Raton, where he also holds the rank of Professor in the departments of Philosophy and English. Richard Shusterman has been married twice. From his first marriage in Israel, he has two sons and a daughter. He has one daughter from his second marriage, which ended in 2013.\nDuring his years at the University of Jerusalem, Shusterman focused on analytic philosophy. The interest carried over with his doctoral dissertation at Oxford University; The Object of Literary Criticism which he wrote at St. John’s College under the supervision of J. O. Urmson and defended in 1979. It was published under the original title in 1984. 1988 saw the publication of Shusterman’s second book, T. S. Eliot and the Philosophy of Criticism, and with it came a turn in his philosophical focus as well. Influenced by the work that produced the book and personal experiences, Shusterman’s attention moved from analytic philosophy to pragmatism. He also began work to develop his own theory of pragmatist aesthetics; based on John Dewey’s aesthetics but augmented by the argumentative methods and tools of analytic philosophy. His third book published, Pragmatist Aesthetics in 1992, brought a big breakthrough in Shusterman’s academic career. The book’s original approach to the problems of definition of art, organic wholes, interpretation, popular art, and the ethics of taste brought him international fame as the book was translated into 14 languages and several editions were published. Shusterman’s position was further strengthened by three subsequent publications: Practicing Philosophy in 1997, Performing Live in 2000, and Surface and Depth in 2002; in which he continued the pragmatist tradition, raising significant interest, provoking numerous critiques and stimulating debates not only among professional philosophers, but in the areas of literary and cultural studies as well. In Practicing Philosophy, Shusterman introduces his concept of ‘somaesthetics’, which he elaborates in greater detail in Performing Live. Somaesthetics is the focus of Shusterman’s two subsequent books, Body Consciousness: A Philosophy of Mindfulness and Somaesthetics (2008) and Thinking through the Body: Essays in Somaesthetics (2012). The first of these books, translated into seven languages, helped establish somaesthetics as an international, interdisciplinary project involving scholars from fields beyond philosophy, while the second book consolidated this movement toward the interdisciplinary approach by applying somaesthetics to various arts, and cultural practices.\nIn 2007, as a part of his project of developing somaesthetics, Shusterman established the Center for Body, Mind, and Culture at FAU. He is a member of many editorial boards and has been allocated important grants and fellowships for his research; from the National Endowment of the Humanities, the Fulbright Commission, and the Humboldt Foundation.\nOne of the important factors influencing Shusterman's philosophy has been his international career. For instance, his work in France with Pierre Bourdieu, the Sorbonne, and the College International de Philosophie has allowed his pragmatism to engage and deploy the contemporary French philosophical tradition. His Fulbright Professorship in Berlin enabled his pragmatism to intersect more closely with contemporary German philosophy. Similarly, his years as a visiting research professor in Hiroshima, Japan and in Beijing and Shandong in China facilitated his study of Asian philosophy and Zen practice.\nShusterman philosophy stretches beyond the confines of professional academic life. In 1995, he was a delegate member of the UNESCO project Philosophy and Democracy in the World, and for several years he directed the UNESCO project MUSIC: Music, Urbanism, Social Integration and Culture. In 2012 he prepared a project commissioned by UNESCO that aims to use the internet to stimulate international youth to immerse in dialogue about peace and violence, through the medium of art. Recalling the classical Greek concept of education, the project is named PAIDEIA, an acronym that stands for Peace through Art and Internet Dialog for Education and Intercultural Association. On a more local level, during the years 1998-2004, he organized and hosted a public discussion forum, titled “Dialogues on the Square”, at Philadelphia’s main Barnes & Noble bookstore, at Rittenhouse Square. In 2002, he received his professional certification as a Feldenkrais practitioner, and he has worked since as a somatic educator and therapist.\n\n\n== Key ideas ==\n\n\n=== Shusterman's place in the contemporary Pragmatism ===\nContemporary pragmatism can be divided into two sub-fields; the neo-classical and the neo-analytical. The latter has been well described by Richard Rorty, as an amalgam of the elements of classical pragmatism and analytic philosophy, which is sometimes supplemented, especially in Rorty’s case, by the ideas of continental thinkers like Martin Heidegger. The former, represented, among others, by Susan Haack, is more conservative in its development of the classical tradition and adopts a critical stance toward Rorty’s interpretation thereof.\nAssuming this description is correct, Shusterman’s pragmatism lies somewhere in the middle between the above-mentioned positions. Although his analytic background and acceptance of some of Rorty’s ideas (he even subsumes his and Rorty’s thought under a common category of “reconstructivist genealogical-poetic pragmatism”) seemingly make him a neo-analytic pragmatist, the stress he puts on the importance of the notion of experience, which Rorty would like to substitute with the notion of language, chimes perfectly with the neo-classical stance.\nBesides classical pragmatism and analytic philosophy, Shusterman’s interests touch varied traditions and disciplines: continental sociology (Pierre Bourdieu) and philosophy (Michel Foucault, Michel de Montaigne, Friedrich Nietzsche), Western body therapy (Moshe Feldenkrais, F. Matthias Alexander) as well as East-Asian thought (Confucius).\nThis diversity of interests and inspirations finds its reflection in the scope of Shusterman’s philosophical work which embraces not only aesthetics, but also metaphysics, ethics, philosophy of language, political theory as well as metaphilosophy; in which he advocates the idea of philosophy as the art of living.\n\n\n=== Experience ===\nExperience serves as a basic category in Shusterman’s pragmatism, both in terms of methodology (the pragmatist should always work from experience ) as well as ontology or epistemology (experience “is a transactional nexus of interacting energies connecting the embodied self and its environing world”) but contrary to John Dewey, Shusterman does not engage in constructing a general metaphysical conception. He has, however, made significant comments on Dewey’s insights  and defends Dewey's idea of immediate, nondiscursive experience against the criticism put forward by Richard Rorty.\nWhile Rorty shares Dewey’s commitment to debunk epistemological foundationalism, he (Rorty) believes that the notion of language is better suited to achieve this goal, than the notion of immediate, non-discursive experience preferred by Dewey. Rorty further says that Dewey’s theory itself collapses into a version of foundationalism, where immediate, non-discursive experience serves as evidence for particular knowledge claims.\nTo this, Shusterman replies that: (a) The anti-foundationalist thrust of the notion of language is not as clear as Rorty sees it (in fact language has been frequently used as a foundationalist category) (b) Dewey never really intended his theory of experience to be a kind of epistemological foundationalism, but rather wanted to celebrate the richness and value of immediate experience, including “the immediate dimension of somatic experience” and to emphasize the positive role such experience can play in improving the quality of human life. (The inspiration of body theorist-therapist F. M. Alexander is important here). Although he argues that Dewey’s theory was ultimately spoiled by a kind of foundationalism (not the one Rorty accuses Dewey of but rather one asserting that the specific quality of immediate experience is the glue that makes coherent thought possible), Shusterman believes that the philosophical value of experience can and should be reaffirmed in an anti-foundationalist form.\nIn Shusterman’s and, also, Dewey's opinion, the eastern meditation practices repair perception for understanding our dependence on the society’s moral order. Shusterman underlines that even if, as Rorty claims, Wilfrid Sellars’s critique of the myth of the given proves that immediate, non-discursive somatic experience cannot be integrated into epistemology, it does not preclude that this experience may be usefully deployed in philosophy as such, because to think otherwise would be to wrongly conflate all philosophy with one of its sub-disciplines, i.e. theory of cognition. And the fact that we can hardly imagine any form of application of the immediate somatic experience in the realm of philosophy is not a proof that this is impossible, but rather indicates that our conception of philosophy is dominated by an idealistic paradigm, naturally hostile to the body as such. The will to change this situation has been one of the reasons why Shusterman developed a philosophical sub-discipline devoted to the body and its experience: Somaesthetics.\n\n\n=== Definitions of art ===\nShusterman also addresses the philosophical problems of defining art; by presenting both, meta-theoretical insights as well as definitions of his own.\nOn the meta-theoretical level he criticizes essentialist, classificatory definitions of art (preferred by the traditional analytic philosophy), which he calls “wrapper definitions” since they aim “at the perfect coverage” of the logical extension of the notion of art. Shusterman finds these definitions problematic, given art’s contested value and nature as well as its unpredictable development in the future. He further argues that there is a goal for art definitions, which is more important than the conceptual coverage that is directional/transformational in “illuminating the special point and value of art or [...] improving art’s appreciation”.\nHe says that these ideas may converge, but since they may as well not, it is unacceptable to exclude any definitions only on the basis that they do not satisfy the standards of taxonomical validity, like e.g. evaluative definitions which nevertheless can be useful in their own way. Besides discussing the issue of wrapper definitions in general, Shusterman has also criticized particular definitions of that kind invented by George Dickie and Arthur Danto.\nShusterman advocates a definition of art; as experience that is influenced by Dewey’s definition with significant changes. While he accepts the majority of the elements central to the Dewey’s conception of this experience (e.g., that it cannot be reduced to the private mental world of the subject being rather an interaction between the subject and the object), there are some he finds questionable (e.g. Dewey’s insistence on the unity and coherence of aesthetic experience which Shusterman would like to supplement with aesthetics of rupture and fragmentation). He says that Dewey was wrong to treat his definition of art as experience as a traditionalist wrapper definition, thus making it vulnerable to the valid charges, that it is both too narrow and too wide (there are some artworks which do not engender aesthetic experiences and, conversely, in some cases aesthetic experience accompanies phenomena which simply cannot be redefined as art, like natural beauty, e.g.). He further says that what Dewey should have done instead was to assign to it the directional and transformational role mentioned above. Conceived this way, Shusterman argues, the definition of art as experience has an undeniable value because even though it cannot embrace the whole extension of the concept of art it “underlines a crucial background condition, direction, and valued goal of art” (i.e. aesthetic experience) and also helps to widen “the realm of art by challenging the rigid division between art and action that is supported by definitions that define art as mimesis, poiesis, or the narrow practice defined by the institutional art world\".\nShusterman also advocates a definition of art as dramatization, which supplements the definition he has inherited from Dewey not only by illuminating art’s nature from a slightly different angle, but also by serving a different, yet equally important purpose – the reconciliation of two prominent and, at the same time, conflicted aesthetic accounts of art: historicism and naturalism. Since the notion of dramatization involves, and harmonizes two important moments: of putting something into a formalized frame (e.g. “the frame of a theatrical performance”) and of intense experiential content that is framed, it presents itself as a potential synthesizing formula for historicism and naturalism which, Shusterman argues, can be reduced to emphasizing the formal institutional frame of art (historicism) or experiential intensity that characterizes art as such (naturalism).\nBoth of Shusterman’s definitions have become the subject of many commentaries and criticisms.\n\n\n=== Interpretation ===\nOf the many debates that galvanize contemporary humanities, one of the most important one is devoted to the problem of interpretation. Shusterman has participated in it by co-editing a fundamental anthology “The Interpretive Turn”, as well as making his opinions known. Shusterman’s account of interpretation is constructed in opposition to both analytic aesthetics and deconstruction, which are often said to constitute the two opposite poles of contemporary interpretive theory. As he claims, both of them share “a picture of understanding as the recapturing or reproducing of a particular [...] [“separate and autonomous”] meaning-object”, yet they differ as to whether such act is possible. Deconstructionists, assuming their protean vision of language as “systematic play of differences”, claim it is not, and hence deem every reading a “misreading”, while analytic aestheticians think otherwise, usually construing the objective work-meaning as “metaphysically fixed in the artwork” and identifying it with the intention of the artist or “semantic features of the work itself”.\nTo avoid both these extremes Shusterman proposes a conception of textual meaning inspired by Wittgenstein(and his notion of language games) in which meaning is thought of as a correlate of understanding, the latter term being conceived as “an ability to handle or respond to [something] in certain accepted ways” which, although shared and legitimized by the community, can be quite different and constitute many diverse “interpretation games”. Interpretation, thus, is not an act (be it successful or inherently condemned to failure) of discovering the meaning of text, but rather of constructing it, or, as Shusterman would like to put it, of “making sense’” of text. One of the corollaries of this account is that correctness of interpretation is always relative to the “rules” (typically implicit) of a given interpretation game. Since there are many different incommensurable games existing at the same time and since some of them have undergone some significant changes over history (and some may even have disappeared from use), we can speak of a plurality of correct interpretations of the same text both in synchronic and diachronic dimensions. Another consequence of this theory is Shusterman’s logical pluralism which claims not only that there can be different (even contradictory), yet equally true interpretations (that would be only a cognitive pluralism), but also that there are legitimate forms of approaching texts which do not even aim at interpretational truth or plausibility, but rather aim at other useful goals (e.g., providing pleasure or making an old text more relevant to contemporary readers).\nAnother of Shusterman’s contributions to the theory of interpretation is his critique of a widely held view he calls ‘hermeneutic universalism’, and attributes to Hans-Georg Gadamer, Alexander Nehamas and Stanley Fish, among others. Agreeing with basic anti-foundationalist thrust of the hermeneutic universalists’ position, Shusterman simultaneously rejects their thesis that “to perceive, read, understand, or behave at all intelligently [...] must always be to interpret” and seeks to refute it with many original arguments. He also insists that the notion of interpretation needs a contrasting category to guarantee its own meaningfulness. If everything is interpretation then the concept loses its point. Shusterman argues that immediate, non-interpretive understanding can serve that role of contrast. Inspired by Wittgenstein and Heidegger’s theory of hermeneutic circle, Shusterman proposes:\n\n“the immediacy of uninterrupted understandings of language (as when I immediately understand simple and pertinent utterances of a language I know well) and the mediacy of interpretations (as when I encounter an utterance or text that I do not understand in terms of word-meaning or contextual relevance and then have to figure out what is meant)”.\n\nAmong Shusterman’s achievements in the theory of interpretation, there are also the accounts of literary criticism he created in his earlier, analytic period, as well as his pragmatist arguments against interpretational intentionalism and his genealogical critique of deconstructionist (Harold Bloom’s, Jonathan Culler’s), analytic (Joseph Margolis’) and neo-pragmatist (Richard Rorty’s, Stanley Fish’s, Walter Benn Michaels and Steven Knapp’s) literary theories which, as he claims, are all governed at their core by an ideology of professionalism.\n\n\n=== Popular art ===\nAccording to Shusterman, one of the most pressing sociocultural problems of today is the aesthetic legitimization of popular art. He feels that though popular art may now seem to be socially justified, its artistic value is still questioned which leads to the following problems:\npopular art is “deprived of artistic care and control” which could protect it against the negative influence of the market, and, as a result, it often becomes “brutally crude in sensibility”\nsatisfactions provided by this kind of art cannot be complete since they are diminished by a sense of humiliation which is induced in its audience by official art institutions’ explicit disapproval of popular art forms.\nthis situation in turn “intensifies painful divisions in society and even in ourselves”.\nA sincere advocate of popular aesthetics, Shusterman is careful to distinguish his stance from one-sided apologia and would rather characterize it as ‘melorism’ which “recognizes popular art’s flaws and abuses but also its merits [while also holding] that popular art should be improved because it can and often does achieve real aesthetic merits and serve worthy social ends”. Putting his meliorism into practice, Shusterman seeks to win aesthetic legitimation for popular art in two ways:\nOn a general theoretical level:\nhe promotes the definition of art as experience, assuming that it could “effect the artistic legitimation” of popular art (e.g., “rock music”) “which affords such frequent and intensely gratifying aesthetic experience to so many people from so many nations, cultures, and classes”;\nprovides counter arguments to the most influential criticisms of popular art (e.g., Theodor W. Adorno’s and Allan Bloom’s)\nanalyzes (both on conceptual-etymological as well as genealogical level) the phenomenon of entertainment to highlight the crucial positive role it plays in human existence.\n\nShusterman also engages in the aesthetic criticism of particular genres of popular arts and of its concrete works, arguing for artistic value of country music and rap. What is worth stressing is that Shusterman was probably the first art philosopher ever to write about rap, and despite the fact that the accuracy of his treatment of this music genre is sometimes questioned, his groundbreaking role in this area cannot be denied and has been appreciated worldwide.\n\n\n=== Somaesthetics ===\nMain Article : Somaesthetics\n'Somaesthetics’ is a term coined by Shusterman to denote a new philosophical discipline he has invented as a remedy for the following problems:\nAccording to Shusterman our culture’s growing preoccupation with the body has not yet found an appropriate response in the realm of philosophy, which simply neglects the somatic, textualizes it, or reduces it to gender or racial difference, and thus is unwilling or unable to counteract the negative aspects of the current body boom (such as the tendency that “contemporary aesthetic ideals of body remain enslaved by shallow and oppressive stereotypes that serve more to increase profits for the cosmetics industries than to enrich our experience of the varieties of bodily charms”).\nDespite the relative abundance of humanist disciplines devoted to the body they lack\na conceptual framework that could integrate their efforts (and also allow for their better cooperation with natural sciences and various somatic methods);\n“a clear pragmatic orientation, something that the individual can directly translate into a discipline of improved somatic practice”.\n\nPhilosophical aesthetics has paid very little attention to the body as a result of “the willful neglect of the body in Baumgarten’s founding text of modern aesthetics, an omission reinforced by subsequent intellectualist and idealist theories (from Kant through Hegel and Schopenhauer and on to contemporary theories that emphasize disinterested contemplation)”.\nThe above-mentioned conditions have determined the nature of somaesthetics as a grounded-in-philosophical-aesthetics yet interdisciplinary project of theory and practice which can be defined as:\n\n“the critical, meliorative study of the experience and the use of one’s body as a locus sensory-aesthetic appreciation (aisthesis) and creative self-fashioning [...], devoted [also] to the knowledge, discourses and disciplines that structure such somatic care or can improve it.”.\n\nTo clarify the terminological issues, one needs to mention that Shusterman has intentionally put the term ‘soma’ (instead of the more familiar ‘body’) in the name of his disciplinary proposal to emphasize one important feature of his conception of corporeality. For Shusterman, who is a true disciple of Dewey in this regard, bodily and mental (as well as cultural and biological) dimensions of human beings are essentially inseparable, and to signify this unity (this “sentient perceiving «body-mind»”) he prefers to use the term ‘soma’ which, unlike ‘body’, does not automatically connote passive flesh contrasted to dynamic soul or mind.\nAlthough Shusterman’s project may at first glance seem utterly innovatory and even iconoclastic, its various elements, as Shusterman himself admits, can be traced to many respected traditions: ancient Greek philosophy and the later Western philosophies (Michel de Montaigne, John Dewey, Michel Foucault), but also East-Asian wisdom such as Confucianism. Somaesthetics divides into three fundamental branches:\nanalytical somaesthetics which is a “descriptive and theoretical enterprise devoted to explaining the nature of our bodily perceptions and practices and their function in our knowledge and construction of the world. Besides the traditional topics in philosophy of mind, ontology, and epistemology that relate to the mind-body issue and the role of somatic factors in consciousness and action, analytic somaesthetics also includes the sort of genealogical, sociological, and cultural analyses advanced by Beauvoir, Foucault [and] Pierre Bourdieu”;\npragmatic somaesthetics which (in “contrast to analytic somaesthetics, whose logic is essentially descriptive”) “has a distinctly normative, often prescriptive, character because it involves proposing specific methods of somatic improvement or engaging in their comparison, explanation, and critique”;\npractical somaesthetics which “involves actually engaging in programs of disciplined, reflective, corporeal practice aimed at somatic self-improvement”.\nShusterman himself works in all three somaesthetic subdisciplines:\nwithin the analytic field he theorizes the body’s status as the basic medium of human existence and the fundamental role it plays in the realm of cognition, ethics, politics and aesthetics;\nin pragmatic somaesthetics\nhe analyzes different somatic disciplines (e.g., Feldenkrais method, Alexander Technique, Bioenergetics);\ncriticizes different thinkers, such as Edmund Burke, William James, Maurice Merleau-Ponty, Simone de Beauvoir and Michel Foucault, for either neglecting or misconceiving the value of various forms of somatic care;\nscrutinizes the issue of Asian erotic arts;\ndiscusses the value of somaesthetics for education in the humanities;\n\nAs a certified practitioner of the Feldenkrais Method and a somatic therapist, he gives workshops on somaesthetics that include practical exercises and demonstrations, and he also has experience in treating different cases of somatic disabilities.\nWhile undeniably a new phenomenon, somaesthetics, which by now forms the center of Shusterman’s philosophical inquiries, has already influenced many scholars working in fields as diverse as philosophy, art education, dance theory, health and fitness studies.\n\n\n== Selected Books by Richard Shusterman ==\nThe Object of Literary Criticism (Amsterdam: Rodopi, 1984).\nT. S. Eliot and Philosophy of Criticism (London and New York: Duckworth and Columbia University Press, 1988).\nAnalytic Aesthetics (Oxford: Blackwell, 1989) – editor.\nThe Interpretive Turn: Philosophy, Science, Culture (Ithaca: Cornell University Press, 1991) - edited with D. Hiley and J. Bohman.\nPragmatist Aesthetics: Living beauty, Rethinking Art (Oxford: Blackwell, 1992) – published in English and translated into 14 languages: Chinese, German, Portuguese, Japanese, Korean, Finnish, Spanish, Romanian, Hungarian, Slovakian, French, Italian, Russian and Polish.\nPracticing Philosophy: Pragmatism and the Philosophical Life (New York: Routledge,1997) – translated into German, French, Chinese and Polish.\nInterpretation, Relativism, and the Metaphysics of Culture (New York: Humanity Books, 1999) – edited with Michael Krausz.\nBourdieu: A Critical Reader (Oxford: Blackwell, 1999) – editor.\nLa fin de l’experience esthetique (Pau: Presse Universitaire de Pau, 1999).\nPerforming Live (Ithaca: Cornell University Press, 2000) - translated into German.\nPragmatist Aesthetics: Living Beauty, Rethinking Art, 2nd edition with a special introduction and a new chapter, (New York: Rowman and Littlefield, 2000).\nSurface and Depth: Dialectics of Criticism and Culture (Ithaca: Cornell University Press, 2002).\nThe Range of Pragmatism and the Limits of Philosophy (Oxford: Blackwell,2004) – editor.\nBody Consciousness: A Philosophy of Mindfulness and Somaesthetics (New York: Cambridge University Press, 2008) - translated into French, Polish, Chinese, Portuguese, and Korean.\nThinking through the Body: Essays in Somaesthetics (Cambridge: Cambridge University Press, 2012) - translated into Hungarian.\n\n\n== Secondary literature ==\n\n\n=== About Richard Shusterman ===\nMałecki, Wojciech. Embodying Pragmatism: Richard Shusterman's Philosophy and Literary Theory. Frankfurt: Peter Lang, 2010.\nKoczanowicz, Dorota, and Wojciech Małecki, eds.Shusterman’s Pragmatism: Between Literature and Somaesthetics. Amsterdam, New York: Rodopi, 2012.\nSalaverría, Heidi. Spielräume des Selbst. Pragmatimus und kreatives Handeln. Berlin: Akademie, 2007.\n\n\n=== Scholarly Articles ===\nAbrams, J.J. “Pragmatism, Artificial Intelligence, and Posthuman Bioethics: Shusterman, Rorty, Foucault.” Human Studies 27, 2004.\nAbrams, J.J. “Aesthetics and Ethics: Santayana, Nietzsche and Shusterman.” The Modern Schoolman 81:4 (2004).\nAltieri, C. “Practical Sense – Impractical Objects: Why Neo-Pragmatism Cannot Sustain an Aesthetics.” REAL: Yearbook of Research in English and American Literature 15 (1999).\nArnold, P.J. “Somaesthetics, Education, and the Art of Dance.” Journal of Aesthetic Education 39:1 (Spring 2005).\nBarnes, T.J. “American pragmatism: Towards a geographical introduction.” Geoforum 39 (2008).\nBourmeau, S. “Le corps au coeur.” Les Inrockuptibles 629 (18 Dec. 2007).\nGhosh, R.K. “Art as Dramatization and the Indian Tradition.” The Journal of Aesthetics and Art Criticism 61:3 (Summer 2003).\nGrabes, H. “The Revival of Pragmatist Aesthetics.” REAL: Yearbook of Research in English and American Literature 15 (1999).\nGuerra, G. “Practicing Pragmatism: Richard Shusterman’s Unbound Philosophy.” Journal of Aesthetic Education 36:4 (2002).\nHaskins, C, “Enlivened Bodies, Autheniticity, and Romanticism.” Journal of Aesthetic Education 36:4 (Winter 2002).\nHiggins, K. “Living and Feeling at Home: Shusterman’s Performing Live.” Journal of Aesthetic Education 36:4 (2002).\nJay, M. “Somaesthetics and Democracy: Dewey and Contemporary Body Art.” Journal of Aesthetic Education 36:4 (Winter 2002).\nJohnston, J.S. “Reflections on Shusterman’s Dewey.” Journal of Aesthetic Education 38:4 (Winter 2004).\nLeddy, T. “Moore and Shusterman on Organic Wholes.” Journal of Aesthetics and Art Criticism 49:1 (Winter 1991).\nLeddy, T. “Shusterman’s Pragmatist Aesthetics.” The Journal of Speculative Philosophy 16:1 (2002).\nMaher, G.C. “Brechtian Hip-Hop. Didactics and Self-Production in Post-Gangsta Political Mixtapes.” Journal of Black Studies 36:1 (September 2005).\nMaleuvre, D. “Art and Criticism: Must Understanding Be Interpretive?” Substance 30:3 (review of Pragmatist Aesthetics).\nMullis, E.C. “Performative Somaesthetics: Principles and Scope.” Journal of Aesthetic Education 40:4 (Winter 2006).\nNehamas, A. “Richard Shusterman on Pleasure and Aesthetic Experience.” The Journal of Aesthetics and Art Criticism 56:1 (Winter 1998).\nRorty, R. “Response to Richard Shusterman.” Richard Rorty. Critical Dialogues. Eds. M. Festenstein and S. Thompson. Cambridge: Polity Press, 2001.\nSalaverría, H. \"Enjoying the Doubtful. On Transformative Suspensions in Pragmatist Aesthetics.\" European Journal of Pragmatism and American Philosophy, Volume 4, Number 1, 2012. http://lnx.journalofpragmatism.eu/\nSäätelä, S. “Between Intellectualism and 'Somaesthetics.'” XIVth International Congress of Aesthetics, Proceedings Part II. Eds. A. Erjavec, L. Kreft and M. Bergamo, 'Filozofski Vestnik 2 (1999).\nSoulez, A. “Practice, Theory, Pleasure, and the Problems of Form and Resistance: Shusterman’s Pragmatist Aesthetics.” The Journal of Speculative Philosophy 16:1 (2002).\nTaylor, P.C. “The Two-Dewey Thesis, Continued: Shusterman’s Pragmatist Aesthetics.” The Journal of Speculative Philosophy 16:1 (2002).\nTupper, K.W. “Entheogens & education: Exploring the potential of psychoactives as educational tools.” Journal of Drug Education and Awareness 1:2 (2003).\nWelsch, W. “Rettung durch Halbierung? Zu Richard Shsutermans Rehabilitierung ästetischer Erfahrung.” DzPhil, Berlin 47 (1999).\nZerbib, D. “Richard Shusterman: les effets secondaires d'une philosophie douce.” LE MONDE DES LIVRES (29.11.07).\nZerbib, D. “Richard Shusterman: intelligence du corps.” LE MONDE DES LIVRES (29.11.07)- a review of Richard Shusterman's Conscience du corps: pour une soma-esthétique.\n\n\n=== Symposia on Shusterman's Work ===\n\"Author-Meets-Critics Symposium on Richard Shusterman's Thinking through the Body.\" Contemporary Pragmatism 12.1 (2015).\n\"Special Theme on 'Richard Shusterman's Somaesthetics'.\" Frontiers of Philosophy in China 10.2 (2015).\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== Notes ==\n\n\n== External links ==\nRichard Shusterman’s university sponsored site.\nhttp://wise.fau.edu/bodymindculture/ - The Center for Body, Mind, and Culture at FAU, directed by Richard Shusterman.\nA 45-50 minute radio interview (in French) with Richard Shusterman; it pertains mostly to Richard Shusterman's latest book Body Consciousness, translated into French as Conscience du corps: pour une soma-esthétique.\nhttp://www.lepoint.fr/content/debats/article?id=214541 - \"Richard Shusterman, philosophe nomade\", an interview (in French) with Richard Shusterman, published in Le Point (December 13, 2007).\nhttp://wise.fau.edu/humanitieschair/pdf/zerodeuxdef__Interview_from_Sommaire_2_no_48_Spring_2008.pdf - \"Biological Aesthetics\", an interview with Richard Shusterman, published in 02 (No. 46, Summer 2008).\nhttp://wise.fau.edu/humanitieschair/pdf/Soma_Holiday_complete_PDF.pdf - \"Soma Holiday\", an interview with Richard Shusterman, published in artUS(No. 21, 2008).\nhttp://www.fau.edu/humanitieschair/multimedia/francecultureshusterman_munier_091116.mp3 - radio interview (in French) with Richard Shusterman; it concerns the recent French translation of Shusterman's book The Object of Literary Criticism, but also the development of his philosophy in general (November 16, 2009).\nSomaesthetics Google Group - Membership is required, request through the link.\nSomaesthetics's channel on YouTube\nhttps://journals.aau.dk/index.php/JOS - The Journal of Somaesthetics.", "ns": 0, "pageid": 8978155, "title": "Richard Shusterman"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}