{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Lawson Vaught", "from": "Robert_Lawson_Vaught"}], "pages": {"3550212": {"extract": "Robert Lawson Vaught (April 4, 1926 – April 2, 2002) was a mathematical logician, and one of the founders of model theory.\n\n\n== Life ==\nVaught was a musical prodigy in his youth, in his case playing the piano. He began his university studies at Pomona College, at age 16. When World War II broke out, he enlisted into the US Navy which assigned him to the University of California's V-12 program. He graduated in 1945 with an AB in physics.\nIn 1946, he began a Ph.D. in mathematics at Berkeley. He initially worked under the supervision of the topologist John L. Kelley, writing on C* algebras. In 1950, in response to McCarthyite pressures, Berkeley required all staff to sign a loyalty oath. Kelley declined and moved his career to Tulane University for three years. Vaught then began afresh under the supervision of Alfred Tarski, completing in 1954 a thesis on mathematical logic, titled Topics in the Theory of Arithmetical Classes and Boolean Algebras. After spending four years at the University of Washington, Vaught returned to Berkeley in 1958, where he remained until his 1991 retirement.\nIn 1957, Vaught married Marilyn Maca; they had two children.\n\n\n== Work ==\nVaught's work is primarily focused on model theory. In 1957, he and Tarski introduced elementary submodels and the Tarski–Vaught test characterizing them. In 1962, he and M. D. Morley pioneered the concept of a saturated structure. His investigations on countable models of first order theories led him to the Vaught conjecture stating that the number of countable models of a complete first order theory (in a countable language) is always either finite, or countably infinite, or equinumerous with the real numbers. Vaught's \"Never 2\" theorem states that a complete first order theory cannot have exactly 2 nonisomorphic countable models.\nHe considered his best work was his paper \"Invariant sets in topology and logic\", introducing the Vaught transform. He is known for the Tarski–Vaught test for elementary substructures, the Feferman–Vaught theorem, the Łoś–Vaught test for completeness and decidability, the Vaught two-cardinal theorem, and his conjecture on the nonfinite axiomatizability of totally categorical theories (this work eventually led to geometric stability theory).\nVaught was a capable teacher of undergraduates, and his writing was reputed for elegance and clarity. His Set Theory: An Introduction (2001, 2nd ed.) attests to his abilities in this regard.\n\n\n== See also ==\nŁoś–Vaught test\n\n\n== Notes ==\n\n\n== References ==\nFeferman, Anita Burdman, and Solomon Feferman, 2004. Alfred Tarski: Life and Logic. Cambridge Univ. Press. 24 index entries for Vaught, especially pp. 185–88.\n\n\n== External links ==\nRobert Lawson Vaught at the Mathematics Genealogy Project\nAddison, J. W. (Fall 2002). \"In Memoriam: Robert Lawson Vaught\" (PDF). Berkeley Mathematics Newsletter. p. 13.", "ns": 0, "pageid": 3550212, "title": "Robert Lawson Vaught"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}