{"batchcomplete": "", "query": {"normalized": [{"to": "Robert M. Solovay", "from": "Robert_M._Solovay"}], "pages": {"3160110": {"extract": "Robert Martin Solovay (born December 15, 1938) is an American mathematician specializing in set theory.\nSolovay earned his Ph.D. from the University of Chicago in 1964 under the direction of Saunders Mac Lane, with a dissertation on A Functorial Form of the Differentiable Riemann–Roch theorem. Solovay has spent his career at the University of California at Berkeley, where his Ph.D. students include W. Hugh Woodin and Matthew Foreman.\nSolovay's theorems include:\nSolovay's theorem showing that, if one assumes the existence of an inaccessible cardinal, then the statement \"every set of real numbers is Lebesgue measurable\" is consistent with ZF without the axiom of choice;\nIsolating the notion of 0#;\nProving that the existence of a real valued measurable cardinal is equiconsistent with the existence of a measurable cardinal;\nProving that if \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n   is a strong limit singular cardinal, greater than a strongly compact cardinal then \n  \n    \n      \n        \n          2\n          \n            λ\n          \n        \n        =\n        \n          λ\n          \n            +\n          \n        \n      \n    \n    {\\displaystyle 2^{\\lambda }=\\lambda ^{+}}\n   holds;\nProving that if \n  \n    \n      \n        κ\n      \n    \n    {\\displaystyle \\kappa }\n   is an uncountable regular cardinal, and \n  \n    \n      \n        S\n        ⊆\n        κ\n      \n    \n    {\\displaystyle S\\subseteq \\kappa }\n   is a stationary set, then \n  \n    \n      \n        S\n      \n    \n    {\\displaystyle S}\n   can be decomposed into the union of \n  \n    \n      \n        κ\n      \n    \n    {\\displaystyle \\kappa }\n   disjoint stationary sets;\nWith Stanley Tennenbaum, developing the method of iterated forcing and showing the consistency of Suslin's hypothesis.\nOutside of set theory, developing (with Volker Strassen) the Solovay–Strassen primality test, used to identify large natural numbers that are prime with high probability. This method has had implications for cryptography.\nProving that GL (the normal modal logic which has the instances of the schema \n  \n    \n      \n        ◻\n        (\n        ◻\n        A\n        →\n        A\n        )\n        →\n        ◻\n        A\n      \n    \n    {\\displaystyle \\Box (\\Box A\\to A)\\to \\Box A}\n   as additional axioms) completely axiomatizes the logic of the provability predicate of Peano Arithmetic.\nWith Alexei Kitaev, proving that a finite set of quantum gates can efficiently approximate an arbitrary unitary operator on one qubit.\n\n\n== Selected publications ==\nSolovay, Robert M. (1970). \"A model of set-theory in which every set of reals is Lebesgue measurable\". Annals of Mathematics. Second Series. 92 (1): 1–56. doi:10.2307/1970696. \nSolovay, Robert M. (1967). \"A nonconstructible Δ13 set of integers\". Transactions of the American Mathematical Society. American Mathematical Society. 127 (1): 50–75. doi:10.2307/1994631. JSTOR 1994631. \nSolovay, Robert M. and Volker Strassen (1977). \"A fast Monte-Carlo test for primality\". SIAM Journal on Computing. 6 (1): 84–85. doi:10.1137/0206006. \n\n\n== See also ==\nProvability logic\n\n\n== External links ==\nRobert M. Solovay at the Mathematics Genealogy Project\nRobert M. Solovay at DBLP Bibliography Server", "ns": 0, "pageid": 3160110, "title": "Robert M. Solovay"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}