{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Paul Wolff", "from": "Robert_Paul_Wolff"}], "pages": {"689404": {"extract": "Robert Paul Wolff (born 1933) is a contemporary American political philosopher and professor emeritus at the University of Massachusetts Amherst. Wolff has written widely on many topics in political philosophy such as Marxism, tolerance (he wrote against liberalism and in favor of anarchism), political justification and democracy. Wolff is also well known for his work on Immanuel Kant.\n\n\n== Education ==\nRobert Wolff graduated from Harvard University with a B.A., M.A. and Ph.D. in Philosophy in 1953, 1954 and 1957 respectively.\nWolff was an Instructor in Philosophy and General Education at Harvard University, 1958–1961; Assistant Professor of Philosophy, University of Chicago, 1961–64; Associate Professor and then Professor of Philosophy, Columbia University, 1964–71; Professor of Philosophy, University of Massachusetts Amherst, 1971–1992, Professor of Afro-American Studies, 1992–2008, and Professor Emeritus, 2008–Present.\n\n\n== Scholarship ==\nAfter the enormous renewal of interest in normative political philosophy in the Anglo-American world after the publication of John Rawls's A Theory of Justice, Wolff made pointed criticisms of this work from a roughly Marxist perspective. In 1977, Wolff published Understanding Rawls: A Critique and Reconstruction of A Theory of Justice, which takes dead aim at the extent to which Rawls's theory is cued to existing practice, convention and status quo social science. Insofar as A Theory of Justice forecloses critiques of capitalist social relations, private property and the market economy, Wolff concludes that Rawls's project amounts to a form of apology for the status quo. According to Wolff, markets and capitalist social relations are founded on exploitation and injustice, and Rawls does not give arguments to defend his theory from these charges.\nIn The Poverty of Liberalism, Wolff pointed out the inconsistencies rife in twentieth century liberal and conservative doctrines. In this text, Wolff takes John Stuart Mill's seminal works, On Liberty and Principles of Political Economy as starting points.\nAlso widely read is his 1970 book In Defense of Anarchism (the first two editions sold more than 200,000 copies). The argument in this work is that if we accept a robust conception of individual autonomy, then it appears that there can be no de jure legitimate state. Wolff would later recall that he received all sorts of unlikely praise for this work, particularly from the likes of many on the political right such as libertarians and anarcho-capitalists.\nWolff extended his advocacy of radical participatory democracy to university governance in The Ideal of the University (Boston: Beacon, 1969), in which he argues, against rising marketization and external encroachment, that universities should be primarily governed by faculty and students.\nWithin the profession, Wolff is better known for his work on Kant, particularly his books Kant's Theory of Mental Activity: A Commentary on the Transcendental Analytic of the Critique of Pure Reason and The Autonomy of Reason: A Commentary on Kant's Groundwork of the Metaphysics of Morals. He is also a noted commentator on the works of Karl Marx, where his works include Understanding Marx: A Reconstruction and Critique of Capital and Moneybags Must Be So Lucky: On the Structure of Capital, an analysis of the rhetorical and literary techniques employed by Marx in Das Kapital. His textbook About Philosophy is used widely in introductory college philosophy courses.\nWolff is also distinguished as a white man who transitioned from the philosophy department to the department of Afro-American studies of the University of Massachusetts-Amherst, which is chronicled and discussed in his book Autobiography of an Ex-White Man: Learning a New Master Narrative for America (Rochester: University of Rochester Press, 2005).\nIn 1990, Wolff founded University Scholarships for South African Students, an organization devoted to promoting opportunities in higher education within South Africa for disadvantaged South African students. Since its creation, USSAS has assisted in providing funding and educational opportunities for thousands of students in South Africa. The program is, in many ways, a realization of the democratic values about which Wolff has written for much of his career.\n\n\n== Retirement ==\nWolff is married and currently divides his time between Chapel Hill, North Carolina and Paris, France. He maintains a popular blog, The Philosopher's Stone, in which he writes about both philosophy and political issues. He used this blog to publish an online autobiography in a series of posts, which is archived online.\n\n\n== Selected bibliography ==\nKant's Theory of Mental Activity (1962)\nA Critique of Pure Tolerance with Herbert Marcuse and Barrington Moore, Jr. (1965)\nThe Poverty of Liberalism (1968)\nThe Ideal of the University (1969)\nIn Defense of Anarchism (1970)\nThe Autonomy of Reason (1974)\nAbout Philosophy (1976)\nUnderstanding Marx (1985)\nMoneybags Must Be So Lucky (1988)\nAutobiography of an Ex-White Man (2005)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nWolff's main blog\nWolff's Archive of Essays and Tutorials\nWolff's blog about Formal Methods in Political Philosophy", "ns": 0, "pageid": 689404, "title": "Robert Paul Wolff"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}