{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Kowalski", "from": "Robert_Kowalski"}], "pages": {"1621364": {"extract": "Robert Anthony \"Bob\" Kowalski (born 15 May 1941) is a logician and computer scientist, who has spent most of his career in the United Kingdom.\n\n\n== Early life and education ==\nHe was educated at the University of Chicago, University of Bridgeport (BA in mathematics, 1963), Stanford University (MSc in mathematics, 1966), University of Warsaw and the University of Edinburgh (PhD in computer science, 1970).\n\n\n== Career ==\nHe was a research fellow at the University of Edinburgh (1970–75) and has been at Imperial College London since 1975, attaining a chair in Computational logic in 1982 and becoming Emeritus Professor in 1999. He was inducted as a Fellow of the American Association for Artificial Intelligence in 1991, of the European Co-ordinating Committee for Artificial Intelligence in 1999, and the Association for Computing Machinery in 2001.\nHe began his research in the field of automated theorem proving, developing both SL-resolution with Donald Kuehner and the connection graph proof procedure. However, he is best known for his contributions to the development of logic programming, starting with the procedural interpretation of Horn clauses.\nHe also developed the minimal model and the fixpoint semantics of Horn clauses with Maarten van Emden. With Marek Sergot, he developed both the event calculus and the application of logic programming to legal reasoning. With Fariba Sadri, he developed an agent model in which beliefs are represented by logic programs and goals are represented by integrity constraints.\nKowalski was one of the early developers of Abductive Logic Programming, in which logic programs are augmented with integrity constraints and with undefined, abducible predicates. This work led to the demonstration with Phan Minh Dung and Francesca Toni that most logics for default reasoning can be regarded as special cases of assumption-based argumentation.\n\n\n== Books ==\n\"Logic for Problem Solving\", North Holland, Elsevier, 1979.\n\"Computational Logic and Human Thinking: How to be Artificially Intelligent\", Cambridge University Press, 2011.\n\n\n== See also ==\nProlog\n\n\n== References ==\n\n\n== External links ==\nRobert Kowalski's home page\nBiography\nBiography (PDF)\nBiographical Essay", "ns": 0, "pageid": 1621364, "title": "Robert Kowalski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}