{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Stalnaker", "from": "Robert_Stalnaker"}], "pages": {"4050095": {"extract": "Robert C. Stalnaker (born 1940) is an American philosopher, who is Laurence S. Rockefeller Professor of Philosophy at the Massachusetts Institute of Technology. He is a Fellow of the American Academy of Arts and Sciences and a Corresponding Fellow of the British Academy.\n\n\n== Education and career ==\nHe earned his BA from Wesleyan University and earned his Ph.D. from Princeton University in 1965. His thesis advisor was Stuart Hampshire, though he was strongly influenced by another faculty member, Carl Hempel. Stalnaker taught briefly at Yale University and the University of Illinois, and then for many years at the Sage School of Philosophy at Cornell University before joining the MIT faculty in 1988. He plans to retire from MIT in 2016. His many students include Jason Stanley, Zoltan Szabo and Delia Graff Fara.\nIn 2007, Stalnaker delivered the John Locke Lectures at Oxford University on the topic of \"Our Knowledge of the Internal World.\"\n\n\n== Philosophical work ==\nHis work concerns, among other things, the philosophical foundations of semantics, pragmatics, philosophical logic, decision theory, game theory, the theory of conditionals, epistemology, and the philosophy of mind. But all of these interests are in the service of addressing the problem of intentionality, \"what it is to represent the world in both speech and thought\". In his work, he seeks to provide a naturalistic account of intentionality, characterizing representation in terms of causal and modal notions.\nAlong with Saul Kripke, David Lewis, and Alvin Plantinga, Stalnaker has been one of the most influential theorists exploring philosophical aspects of possible world semantics. According to his view of possible worlds, they are ways this world could have been, which in turn are maximal properties that this world could have had. This view distinguishes him from the influential modal realist Lewis, who argued that possible worlds are concrete entities just like this world.\nIn addition to his contributions to the metaphysics of possible worlds, he has used the apparatus of possible worlds semantics to explore many issues in the semantics of natural language, including counterfactual and indicative conditionals, and presupposition. His view of assertion as narrowing the conversational common ground to exclude situations in which the asserted content is false was a major impetus in recent developments in semantics and pragmatics, in particular, the so-called \"dynamic\" turn.\nStalnaker is the author of four books and dozens of articles in major philosophical journals.\n\n\n== Selected publications ==\n\"A Theory of Conditionals,\" in N. Rescher (ed.), Studies in Logical Theory (Oxford University Press, 1968).\n\"Pragmatics,\" Synthese 22 (1970): 272-289.\n\"Possible Worlds,\" Nous 10(1976): 65-75\nIfs: Conditionals, Belief, Decision, Chance, and Time, edited with William Harper and Glenn Pearce (Dordrecht: D. Reidel, 1981).\nInquiry (Bradford Books, MIT Press, 1984)\n\"On What's In the Head,\" in Philosophical Perspectives, 3: Philosophy of Mind and Action Theory (1989): 287-316\nContext and Content: Essays on Intentionality in Speech and Thought (Oxford University Press, 1999)\nWays a World Might Be: Metaphysical and Anti-Metaphysical Essays (Oxford University Press, 2003)\nOur Knowledge of the Internal World (Oxford University Press, 2008)\nMere Possibilities. Metaphysical Foundations of Modal Semantics (Princeton, N.J.: Princeton University Press, 2012).\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nBibliography\nWorks by or about Robert Stalnaker in libraries (WorldCat catalog)", "ns": 0, "pageid": 4050095, "title": "Robert Stalnaker"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}