{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Kilwardby", "from": "Robert_Kilwardby"}], "pages": {"153666": {"extract": "Robert Kilwardby OP (c. 1215 – 11 September 1279) was an Archbishop of Canterbury in England and a cardinal. Kilwardby was the first member of a mendicant order to attain a high ecclesiastical office in the English Church.\n\n\n== Life ==\nKilwardby studied at the University of Paris, then was a teacher of grammar and logic there. He then joined the Dominican Order and studied theology, and became regent at Oxford University before 1261, probably by 1245. He was named provincial prior of the Dominicans for England in 1261, and in October 1272 Pope Gregory X appointed him as Archbishop of Canterbury to end a dispute over the election. Kilwardby was provided to the archbishopric on 11 October 1272, given the temporalities on 12 December 1272, and consecrated on 26 February 1273.\nKilwardby crowned Edward I and his wife Eleanor as king and queen of England in August 1274, but otherwise took little part in politics. He instead concentrated on his ecclesiastical duties, including charity to the poor and donating to the Dominicans.\nIn 1278 Pope Nicholas III named Kilwardby Cardinal Bishop of Porto and Santa Rufina. He then resigned Canterbury and left England, taking with him papers, registers and documents belonging to the see. He also left the see deep in debt again, after his predecessor had cleared the debt. He died in Italy in 1279 and was buried in the Dominican convent in Viterbo, Italy. While in theory this was a promotion, probably it was not, as the pope was unhappy with Kilwardby's support of efforts to resist the payment of papal revenues and with the lack of effort towards the reforms demanded at the Second Council of Lyon in 1274.\nKilwardby's theological and philosophical views were summed up by David Knowles who said that he was a \"conservative eclectic, holding the doctrine of seminal tendencies and opposing...the Aristotelian doctrine of the unity of form in beings, including man.\" Some sources state that he was the author of Summa Philosophiae, a history and description of the schools of philosophical thought then current, but the writing style is not similar to his other works, and Knowles, for one, does not believe it was authored by Kilwardby.\nIt has been alleged that Kilwardby was an opponent of Thomas Aquinas. In 1277 he prohibited the teaching of thirty theses, some of which have been thought to touch upon Thomas Aquinas' teaching. Recent scholars, however, such as Roland Hissette, have challenged this interpretation.\n\n\n== Works ==\nWritings on Grammar\nCommentaria Priscianus minor (A Commentary on the books 17 and 18 of Priscian's Institutiones grammaticae)\nWrings on Logic\nNotulae super librum Praedicamentorum\nNotulae super librum Perihermeneias\nNotule libri Priorum\nNotule libri Posteriorum\nComentum super librum Topicorum\nNotulae super librum Porphyrii\nDe natura relationis\nPriorum Analyticorum expositio\nNotuale super librum Sex Principiorum\nWritings on Natural Philosophy\nDe spiritu fantastico sive de recptione specierum\nDe tempore\n+Writings on Ethics\nQuaestiones supra libros Ethicorum\nQuaestiones in librum primun Sententiarum\nQuaestiones in librum secundum Sententiarum\nQuaestiones in librum tertium Sententiarum\nQuaestiones in librum quartum Sententiarum\nDe ortu scientiarum\nDe tempore has been translated and edited by Alexander Broadie, and published as On Time and Imagination, Part 2: Introduction and Translation. A critical edition of De orto scientiarum was published by Albert G. Judy, for The Pontifical Institute of Mediaeval Studies in 1976.\nKilwardby was also the author of a summary of the writings of the Church Fathers, arranged alphabetically, Tabulae super Originalia Patrum, edited by Daniel A. Callus (Bruges: De Tempel, 1948).\n\n\n== Citations ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nSilva, José Filipe. \"Robert Kilwardby\". Stanford Encyclopedia of Philosophy. \nHistory of Medieval Philosophy by Jacques Maritain\nKilwardby, Robert: Tabula in librum sancti Augustini De civitate Dei (1464), digitized codex at Somni", "ns": 0, "pageid": 153666, "title": "Robert Kilwardby"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}