{"batchcomplete": "", "query": {"normalized": [{"to": "Robert Merrihew Adams", "from": "Robert_Merrihew_Adams"}], "pages": {"2033502": {"extract": "Robert Merrihew Adams (born September 8, 1937), known to intimates as \"Bob\", is an American analytic philosopher of metaphysics, religion and morality.\n\n\n== Biography ==\nAdams was born in Philadelphia, Pennsylvania. He taught for many years at UCLA before moving to Yale University in the early 1990s as the Clark Professor of Moral Philosophy and Metaphysics. As chairman, he helped revive the philosophy department after its near-collapse due to personal and scholarly conflicts between analytical and Continental philosophers. Adams retired from Yale in 2004 and taught part-time at the University of Oxford in England, where he was a senior research fellow of Mansfield College. In 2009 he became a Distinguished Research Professor of Philosophy at the University of North Carolina at Chapel Hill.\nAdams's wife, Marilyn McCord Adams, is also a philosopher, working on medieval philosophy and the philosophy of religion and was the Regius Professor of Divinity at Christ Church, Oxford. In 2013 both became visiting research professors at Rutgers University, in conjunction with the founding of the Rutgers Center for the Philosophy of Religion.\nAs a historical scholar, Adams has published on the work of the philosophers Søren Kierkegaard and Leibniz. His work in the philosophy of religion includes influential essays on the problem of evil and the relation between theism and ethics. In metaphysics, Adams defends actualism in metaphysics of modality and Platonism about nature of so-called possible worlds. He is a past president of the Society of Christian Philosophers. In 1999, he delivered the Gifford Lectures on \"God and Being.\" He was elected a Fellow of the British Academy in 2006 and was elected a Fellow of the American Academy of Arts and Sciences in 1991.\n\n\n== Selected works ==\n\"Must God Create the Best?\", Philosophical Review, LXXXI 317-332. 1972. Reprinted in The Virtue of Faith and Other Essay in Philosophical Theology below.\n\"A Modified Divine Command Theory of Ethical Wrongness\" in Religion and Morality: A Collection of Essays. eds. Gene Outka and John P. Reeder. New York: Doubleday. Reprinted in The Virtue of Faith.\n\"Theories of Actuality\", Noûs, VIII 211-231. 1974.\n\"Motive Utilitarianism\", Journal of Philosophy, LXXIII 467-481. 1976.\n\"Primitive Thisness and Primitive Identity\", Journal of Philosophy, LXXVI 5-26. 1979.\n\"Actualism and Thisness\", Synthèse, XLIX 3-41. 1981.\n\"Time and Thisness\", Midwest Studies in Philosophy, XI 315-329. 1986.\nThe Virtue of Faith and Other Essays in Philosophical Theology. New York: Oxford University Press. 1987.\n\"Involuntary Sins\", Philosophical Review, XCIV 3-31. 1985.\n\"Divine Commands and the Social Nature of Obligation\" Faith and Philosophy, 1987.\n\"The Knight of Faith\", Faith and Philosophy, 1990.\n\"Moral Faith\", Journal of Philosophy, 1995.\nLeibniz: Determinist, Theist, Idealist. New York: Oxford. 1994.\n\"Things in Themselves\", Philosophy and Phenomenological Research, 1997.\nFinite and Infinite Goods. New York: Oxford University Press. 1999.\nA Theory of Virtue: Excellence in Being for the Good. Oxford: Clarendon Press. 2006.\n\n\n== References ==\n\n\n== External links ==\nGifford Lecture Series\n\"Philosophy Takes Steps to Rebuild\", Yale Daily News]", "ns": 0, "pageid": 2033502, "title": "Robert Merrihew Adams"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}