{"batchcomplete": "", "query": {"normalized": [{"to": "Roberto Esposito", "from": "Roberto_Esposito"}], "pages": {"31471771": {"extract": "Roberto Esposito is an Italian philosopher, who is important for his work in biopolitics. He has been featured in the Summer 2006 and Fall 2009 issues of the journal Diacritics and the Fall 2013 special issue of Angelaki.\nRoberto Esposito was born in Naples where he graduated at the University of Naples 'Federico II'. He currently teaches Theoretical Philosophy at the Scuola Normale Superiore in Italy. He was Vice Director of the Istituto Italiano di Scienze Umane, Full Professor of Theoretical Philosophy, and the coordinator of the doctoral programme in Philosophy until 2013. For five years he was the only Italian member of the International Council of Scholars of the Collège International de Philosophie in Paris.\nHe was one of the founders of the European Political Lexicon Research Centre and of the International Centre for a European Legal and Political Lexicon, which was established by a consortium made up of the Universities of Bologna, Florence, Padua, Salerno, Naples L'Orientale and Naples S. Orsola Benincasa. He is co-editor of Filosofia Politica published by il Mulino, the series 'Per la Storia della Filosofia Politica' published by Franco Angeli, the series 'Storia e teoria politica' published by Bibliopolis, and the series 'Comunità e Libertà' published by Laterza. He is editor of the 'Teoria e Oggetti' series published by Liguori and also acts as a philosophy consultant for publishers Einaudi.\nHis 2012 monograph, Living Thought. The Origins and Actuality of Italian Philosophy (trans. Zakiya Hanafi, Stanford UP, 2012), is dedicated to Italian philosophical thought, and aims at creating a historical and theoretical background for the definition of the notion of \"Italian Theory\".\n\n\n== Bibliography ==\nVico e Rousseau e il moderno Stato borghese, De Donato, 1976 ;\nIdeologie della neo-avanguardia, Liguori, 1976 ;\nIl sistema dell’indifferenza: Moravia e il fascismo, Dedalo, 1978 ;\nLa politica e la storia. Machiavelli e Vico, Liguori, 1980 ;\nDivenire della ragione moderna. Cartesio, Spinoza, Vico, co-authored with Biagio De Giovanni and Giuseppe Zarone, Liguori, 1981 ;\nOrdine e conflitto. Machiavelli e la letteratura politica del Rinascimento italiano, Liguori, 1984 ;\nCategorie dell’impolitico, Il Mulino, 1988 ; new edition 1999 ;\nNove pensieri sulla politica, Il Mulino, 1993 ;\nL’origine della politica. Hannah Arendt o Simone Weil?, Donzelli, 1996 ;\nLo specchio del reame. Riflessioni su potere e comunicazione, Longo Angelo, 1997 ;\nCommunitas. Origine e destino della comunità, Einaudi, 1998; new edition 2006. English version: Communitas: the Origin and Destiny of Community, trans. Timothy Campbell, Stanford University Press, 2004.\nImmunitas. Protezione e negazione della vita, Einaudi, Torino, 2002. English version: Immunitas. The Protection and Negation of Life, trans. Zakiya Hanafi, Polity Press, 2011.\nBios. Biopolitica e filosofia, Einaudi, 2004. English version: Bìos: Biopolitics and Philosophy, Trans. Timothy Campbell, Minnesota University Press, 2008.\n\"The Immunization Paradigm,\" in Special Issue: Bios, Immunity, Life: The Thought of Roberto Esposito, edited by Timothy Campbell, Diacritics - Volume 36, Number 2, Summer 2006, pp. 2–22 The Johns Hopkins University Press.\nTerza persona. Politica della vita e filosofia dell'impersonale, Einaudi, Torino, 2007; English version: Third Person. Politics of Life and Philosophy of the Impersonal, trans. Zakiya Hanafi, Polity Press, 2012.\nTermini della Politica. Communità, immunitià, biopolitica, Mimesis, 2008. English version: Terms of the Political: Community, Immunity, Biopolitics, trans. Rhiannon Noel Welch, Fordham University Press, 2012.\n\"Pensiero vivente. Origine e attualità della filosofia italiana\", Einaudi, 2010. English version: Living Thought. The Origins and Actuality of Italian Philosophy, trans. Zakiya Hanafi, Stanford University Press, 2012.\n\"Politics and Human Nature\", in Bio-economy, Christianity, Human Nature, special issue of Angelaki: journal of the theoretical humanities, volume 16 number 3, September 2011, Routledge.\n\"Community, Immunity, Biopolitics”, in Greg Bird and Jon Short (eds.), Roberto Esposito, Community, and the Proper, Special Issue: Angelaki, Volume 18, Number 3, 2013, pp. pp. 83-90.\nPersons and Things: From the Body’s Point of View, trans. Zakiya Hanafi, Polity Books, forthcoming 2015.\nDue. La macchina della teologia politica e il posto del pensiero, Einaudi 2013. English version: Two. The machine of political theology and the place of thought, trans. Zakiya Hanafi, Fordham University Press, forthcoming 2015.\n\n\n== Works in English ==\nCommunitas: the Origin and Destiny of Community, trans. Timothy Campbell, Stanford University Press, 2004.\n\"The Immunization Paradigm,\" in Special Issue: Bios, Immunity, Life: The Thought of Roberto Esposito, trans./edited by Timothy Campbell, Diacritics - Volume 36, Number 2, Summer 2006, pp. 2–22 The Johns Hopkins University Press.\nImmunitas. The Protection and Negation of Life, trans. Zakiya Hanafi, Polity Press, 2011.\nBìos: Biopolitics and Philosophy, Trans. Timothy Campbell, Minnesota University Press, 2008.\nThird Person. Politics of Life and Philosophy of the Impersonal, trans. Zakiya Hanafi, Polity Press, 2012.\nTerms of the Political: Community, Immunity, Biopolitics, trans. Rhiannon Noel Welch, Fordham University Press, 2012.\nLiving Thought. The Origins and Actuality of Italian Philosophy, trans. Zakiya Hanafi, Stanford University Press, 2012.\n* \"Politics and Human Nature,\" in Bio-economy, Christianity, Human Nature, Special Issue: Angelaki: journal of the theoretical humanities, volume 16 number 3, September 2011, Routledge.\n\"Community, Immunity, Biopolitics,” in Greg Bird and Jon Short (eds.), Roberto Esposito, Community, and the Proper, Special Issue: Angelaki, Volume 18, Number 3, 2013, pp. pp. 83-90.\nPersons and Things: From the Body’s Point of View, trans. Zakiya Hanafi, Polity Books, forthcoming 2015.\nTwo. The machine of political theology and the place of thought, trans. Zakiya Hanafi, Fordham University Press, forthcoming 2015.\n\n\n== Notes ==\n\n\n== References ==\nRoberto Esposito - Istituto Italiano di Scienze Umane\n\n\n== External links ==\nInterpreting the 20th Century: Totalitarianism or Biopolitics? Barcelona Metropolis 2008.\nRoberto Esposito: from the Impolitical to the Impersonal by Matías Leandro Saidel Barcelona Metropolis 2011.\nRoberto Esposito, Community, and the Proper Special Issue of Angelaki. Edited by Greg Bird and Jon Short. Angelaki 18(3), 2013.", "ns": 0, "pageid": 31471771, "title": "Roberto Esposito"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}