{"batchcomplete": "", "query": {"normalized": [{"to": "Robert P. George", "from": "Robert_P._George"}], "pages": {"2610329": {"extract": "Robert Peter George (born July 10, 1955) is McCormick Professor of Jurisprudence at Princeton University, where he lectures on constitutional interpretation, civil liberties and philosophy of law and serves as director of the James Madison Program in American Ideals and Institutions. He serves as the Herbert W. Vaughan senior fellow of the Witherspoon Institute, a senior fellow at the Hoover Institution, and a Visiting Professor at Harvard Law School. He is the author of 16 books.\n\n\n== Education ==\nGeorge grew up in Morgantown, West Virginia, the grandson of immigrant coal miners. He was educated at Swarthmore College (BA), Harvard Law School (JD in Law), Harvard Divinity School (MTS in Social Policy), and Oxford University (DPhil in philosophy of law). At Oxford he studied under John Finnis and Joseph Raz.\n\n\n== Academic career ==\nGeorge joined the faculty of Princeton University as an instructor in 1985, and in the following year became an assistant professor (a tenure-track position). He spent 1988–89 on sabbatical leave as a Visiting Fellow in Law at Oxford University, working on his book Making Men Moral: Civil Liberties and Public Morality (1993, Oxford University Press). George was promoted to associate professor at Princeton in 1994, and to professor in 1999, being named to Princeton’s McCormick Chair of Jurisprudence, a celebrated endowed professorship previously held by Woodrow Wilson, Edward S. Corwin, Alpheus T. Mason, and Walter F. Murphy. George founded Princeton’s James Madison Program in American Ideals and Institutions in 2000 and continues to serve as its director. Since 2007, George has been teaching undergraduate seminars on leading thinkers in Western intellectual history with friend and colleague Cornel West, a leading left-wing public intellectual; readings have included Sophocles's Antigone, Plato's Gorgias, St. Augustine’s Confessions, Marx and Engels’s The Communist Manifesto, Du Bois’s The Souls of Black Folk, Hayek’s The Road to Serfdom, Gramsci’s Prison Notebooks, Strauss’s Natural Right and History, and King’s \"Letter from Birmingham Jail\". The George-West collaboration—allowing only 18 students, many fewer than want to attend — has drawn attention on campus. George is a Permanent Research Fellow of the Notre Dame Center for Ethics and Culture.\n\n\n== Other professional and public service activities ==\nGeorge is currently (December, 2015) of counsel to the law firm of Robinson & McElwee PLLC in Charleston, West Virginia.\nGeorge served from 1993-1998 as a presidential appointee to the United States Commission on Civil Rights, and from 2002-2009 as a member of the President's Council on Bioethics. George was appointed to the U.S. Commission on International Religious Freedom by the Speaker of the U.S. House of Representatives in 2012, and in the following year was elected to its Chair.\nHe is a former Judicial Fellow at the Supreme Court of the United States, receiving during his tenure there the Justice Tom C. Clark Award. He has served on UNESCO’s World Commission on the Ethics of Scientific Knowledge and Technology (COMEST), of which he remains a corresponding member. He is a member of the boards of the Ethics and Public Policy Center (where he is Vice-Chairman of the Board), the American Enterprise Institute, the Becket Fund for Religious Liberty, and the Lynde and Harry Bradley Foundation. George is a member of the Council on Foreign Relations.\nGeorge has served or serves on the editorial boards of Touchstone and the advisory council of First Things.\n\n\n== Political activity ==\nGeorge twice served as Governor of the West Virginia Democratic Youth Conference, and attended the 1976 Democratic National Convention as an alternate delegate. George moved to the right in the 1980s, largely due to his views on abortion, and left the Democratic Party as a result of what he saw as its increasingly strong commitment to legal abortion and its public funding, and his growing skepticism about the effectiveness of Great Society social welfare projects in Appalachia and other low income rural and urban areas. George founded the American Principles Project, which aims to create a grass-roots movement around his ideas. He is a past chairman of the National Organization for Marriage, an advocacy group opposed to same-sex marriage, and co-founder of the Renewal Forum, an organization fighting the sexual trafficking and commercial exploitation of women and children.\nGeorge drafted the Manhattan Declaration, a manifesto signed by Orthodox, Catholic and Evangelical leaders that \"promised resistance to the point of civil disobedience against any legislation that might implicate their churches or charities in abortion, embryo-destructive research or same-sex marriage.\".\nAlong with other public intellectuals, George played a key role in creating the \"theoconservative\" movement and integrating it into mainstream Republicanism. Much of George's work on religious liberty has centered on the idea that religion is a \"distinct human good,\" which he asserts allows people to \"live authentically by ordering one's life in line with one's best judgments of conscience.\"\nGeorge was threatened with death by pro-choice extremist Theodore Shulman, who also targeted Priests For Life director the Rev. Frank Pavone, saying that they would be killed if the accused killer of Dr. George Tiller (a Wichita abortion-provider) was acquitted.\n\n\n== Honors ==\nOn December 8, 2008, George was awarded the Presidential Citizens Medal by President George W. Bush.\n\n\n== Perspectives of colleagues ==\n\n\n=== Laudatory ===\nGeorge has been called America's \"most influential conservative Christian thinker\" by David Kirkpatrick of the New York TImes. Kirkpatrick goes on to state:\n\n\"George’s admirers say he is revitalizing a strain of Catholic natural-law thinking that goes back to St. Thomas Aquinas. His scholarship has earned him accolades from religious and secular institutions alike. In one notable week two years ago, he received invitations to deliver prestigious lectures at the Southern Baptist Theological Seminary and Harvard Law School.\"\n\nIn 2009, Supreme Court Justice and former Harvard Law School Dean Elena Kagan praised George as \"one of the nation’s most respected legal theorists\", saying that the respect he had gained was due to \"his sheer brilliance, the analytic power of his arguments, the range of his knowledge\", and \"a deeply principled conviction, a profound and enduring integrity\". In announcing his election to Chair the U.S. Commission on International Religious Freedom in 2013, outgoing Chairwoman Katrina Lantos Swett, a Democrat appointed by Senate Majority Leader Harry Reid, praised George as \"a true human rights champion whose compassion for victims of oppression and wisdom about international religious freedom shine through all we have accomplished.\" George was described by The New Yorker in 2014 as \"a widely respected conservative legal philosopher\" who has \"played [intellectual] godfather to right-leaning students on [the Princeton] campus.\"\n\n\n=== Critical ===\nGeorge's critics, including many Catholic scholars, have argued that he has neglected critical aspects of the Christian message, including \"the corruption of human reason through original sin, the need for forgiveness and charity and the chance for redemption,\" focusing instead on \"mechanics\" of morality, and—through his political associations and activism—turned the church \"into a tool of Republican Party\".\nM. Cathleen Kaveny, formerly of Notre Dame Law School, and as of 2014, Darald and Juliet Libby Professor at Boston College, a comparably credentialed scholar of law as well as theology, and like George, \"in the Thomistic tradition,\" has called George and his allies \"ecclesiastical bullies\" and \"Rambo Catholics\" for such statements as his comparison of Catholic scholars supporting abortion rights to \"defenders of chattel slavery.\"\n\n\n== Musical activity ==\nGeorge is a finger style guitarist and bluegrass banjo player. His guitar playing is in the style of Chet Atkins and Jerry Reed. His banjo playing mixes the styles of Earl Scruggs, Don Reno, and Bela Fleck. As a teenager, he performed with folk groups and bluegrass bands in coffee houses, rod and gun clubs, and at state and county fairs in West Virginia, Maryland, and Virginia. At Swarthmore he led \"Robby George and Friends\", a country and bluegrass band. He performs in New Jersey with the band \"Blue Heart\".\n\n\n== Works ==\n\n\n=== Books ===\nNatural Law Theory: Contemporary Essays, 1992. ISBN 0-19-823552-6\nMaking Men Moral, 1995. ISBN 0-19-826024-5\nNatural Law and Moral Inquiry: Ethics, Metaphysics, and Politics in the Work of Germain Grisez, 1998. ISBN 0-87840-674-3\nIn Defense of Natural Law, 1999. ISBN 0-19-826771-1\nThe Autonomy of Law: Essays on Legal Positivism, 1999. ISBN 0-19-826790-8\nNatural Law and Public Reason, 2000. ISBN 0-87840-766-9\nGreat Cases in Constitutional Law, 2000. ISBN 0-691-04952-1\nThe Clash of Orthodoxies, 2001. ISBN 1-882926-62-5\nNatural Law, Liberalism, and Morality, 2001. ISBN 0-19-924300-X\nConstitutional Politics: Essays on Constitution Making, Maintenance, and Change, 2001 ISBN 0-691-08869-1\nThe Meaning of Marriage: Family, State, Market, And Morals, 2006 ISBN 1-890626-64-3\nBody-Self Dualism in Contemporary Ethics and Politics, 2007 ISBN 978-0-521-88248-4\nEmbryo: A Defense of Human Life, 2008 ISBN 0-385-52282-7\nMoral Pública: Debates Actuales, 2009 ISBN 978-956-8639-05-1\nWhat Is Marriage? Man and Woman: A Defense, 2012 ISBN 978-1594036224\nConscience and Its Enemies: Confronting the Dogmas of Liberal Secularism, 2013 ISBN 978-1610170703\n\n\n=== Articles ===\n\"Law, Democracy, and Moral Disagreement\", Harvard Law Review, Vol. 110, pp. 1388–1406 (1997)\n\"Public Reason and Political Conflict: Abortion and Homosexual Acts\", Yale Law Journal, Vol. 106, pp. 2475–2504 (1997)\n\"The Concept of Public Morality\", American Journal of Jurisprudence, Vol. 45, pp. 17–31 (2000)\n\"Human Cloning and Embryo Research\", Journal of Theoretical Medicine and Bioethics, Vol. 25, No. 1, pp. 3–20 (2004)\nGeorge, Robert P. (20 March 2009). \"He Threw It All Away\". First Things. Retrieved 20 July 2009. \n\n\n== References and notes ==\n\n\n== External links ==\nFull text of \"Reauthorization of the U.S. Commission on Civil Rights: hearing...\"\nThe Conservative-Christian Big Thinker, New York Times, Dec. 16, 2009\n\"Online Resources,\" collected by RatzingerFanClub.com; lists links to articles, addresses and interviews, book reviews, etc.\nAppearances on C-SPAN\nArticles in Touchstone magazine\nRobert P. George's Robinson & McElwee profile\nencyclopedia.com entry", "ns": 0, "pageid": 2610329, "title": "Robert P. George"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}