{"batchcomplete": "", "query": {"normalized": [{"to": "Robin Gandy", "from": "Robin_Gandy"}], "pages": {"3155895": {"extract": "Robin Oliver Gandy (22 September 1919 – 20 November 1995) was a British mathematician and logician. He was a friend, student, and associate of Alan Turing, having been supervised by Turing during his PhD at the University of Cambridge (graduated 1953), where they worked together.\nRobin Gandy was born in the village of Peppard, Oxfordshire, England. He was the son of Thomas Hall Gandy (1876–1948) and Ida Caroline née Hony (1885–1977) and great-great-grandson of the architect and artist Joseph Gandy (1771–1843).\nEducated at Abbotsholme, Gandy took two years of the Mathematical Tripos, at King's College, Cambridge, before enlisting for military service in 1940. During World War II he worked on radio intercept equipment at Hanslope Park, where Alan Turing was working on a speech encipherment project, and he became one of Turing's lifelong friends and associates. In 1946, he completed Part III of the Mathematical Tripos, then began studying for a PhD under Turing's supervision. He completed his thesis, On axiomatic systems in mathematics and theories in Physics, in 1952. He was a member of the Apostles.\nGandy held positions at the Universities of Leicester, Leeds, and Manchester. Gandy was a visiting associate professor at Stanford from 1966 to 1967, and held a similar position at University of California, Los Angeles in 1968. In 1969, he moved to Wolfson College, Oxford, where he became Reader in Mathematical Logic. One of the residential buildings of the college is now named in his honour.\nHe is best known for his work in recursion theory. His contributions include the Spector–Gandy theorem, the Gandy Stage Comparison theorem, and the Gandy Selection Theorem. He also made a significant contribution to the understanding of the Church—Turing thesis, and his generalization of the Turing machine is called a Gandy machine.\nGandy died in Oxford, England.\n\n\n== References ==\n\n\n== Further reading ==\nHodges, Andrew (1983). Alan Turing: The Enigma. Simon & Schuster. ISBN 0-671-49207-1. \n\"Notices\". The Bulletin of Symbolic Logic. 2 (1): 121–125. March 1996. doi:10.1017/s1079898600007988. JSTOR 421052. \nMoschovakis, Yannis & Yates, Mike (September 1996). \"In Memoriam: Robin Oliver Gandy, 1919–1995\". The Bulletin of Symbolic Logic. 2 (3): 367–370. doi:10.1017/s1079898600007873. JSTOR 420996. \n\n\n== External links ==\nRobin Gandy — The Alan Turing Scrapbook, dead link] archived at Archive.Today\nRobin Gandy — The Mathematics Genealogy Project\nList of publications from Microsoft Academic Search", "ns": 0, "pageid": 3155895, "title": "Robin Gandy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}