{"batchcomplete": "", "query": {"normalized": [{"to": "Roger Crisp", "from": "Roger_Crisp"}], "pages": {"28365344": {"extract": "Roger Stephen Crisp (born 23 March 1961), is Fellow and Tutor in Philosophy at St. Anne’s College, Oxford. He holds the university posts of Professor of Moral Philosophy and Uehiro Fellow and Tutor in Philosophy. His work falls principally within the field of ethics, in particular metaethics, normative ethics, and applied ethics. In addition, he is Chairman of the Management Committee of the Oxford Uehiro Centre for Practical Ethics.\n\n\n== Education ==\nOriginally from Brentwood, Essex, Crisp began his higher education at St. Anne’s College, Oxford in 1979, where he read Literae Humaniores. He was amongst the first male cohort to study at this previously all-female college. He was taught by, amongst others, Margaret Howatson, Gabriele Taylor, Iris Murdoch, and Peter Derow. In 1983 he commenced the B.Phil, and from 1985 until 1988 he worked on his D.Phil, writing his thesis on utilitarianism.\n\n\n== Career ==\nIn 1986 Crisp began his first academic post, as a junior lecturer in philosophy at Magdalen College, Oxford; he returned to St. Anne’s for two years beginning 1987 as a lecturer in philosophy, before taking up a lecturing post at Hertford College, Oxford in 1988-1989. 1989-1991 saw Crisp move to University College, Oxford, as a British Academy Research Fellow and Honorary Junior Research Fellow. Finally, Crisp returned once more to St. Anne’s in 1991, to take up a permanent post as Fellow and Tutor in Philosophy, succeeding Gabriele Taylor. For the first time in his career, Crisp temporarily left Oxford and spent the academic year 2010-2011 at Boston University to explore his interest in the moral philosophy of Henry Sidgwick.\nArguably Crisp’s most significant work to date has been Reasons and the Good (Clarendon Press, 2006), in which he advances some novel approaches to the oldest questions in ethics. The central claim of this work is that a fundamental issue in normative ethics is what ultimate reasons might underlie our actions; Crisp argues that the best exposition of such reasons will not employ moral concepts. So far, Reasons and the Good  has generally been very well received.\nCrisp is currently editing an Oxford Handbook on the History of Ethics. Other major works include a translation of Aristotle’s Nicomachean Ethics, and the Routledge Guidebook to Mill on Utilitarianism.\n\n\n== Personal life ==\nCrisp is married with two daughters. Aside from his work, his interests include bluegrass guitar and wine tasting.\n\n\n== Select publications ==\nThis is a selection of Crisp's recent publications. For an exhaustive list download the PDF file on his page on the Oxford University Philosophy Faculty website.\n\n\n=== Books ===\nCrisp, Roger; Warner, Martin (1990). Terrorism, protest, and power. Aldershot, Hants, England Brookfield, Vermont, USA: Edward Elgar Gower Pub. ISBN 9781852782023. \nCrisp, Roger (1996). How should one live?: essays on the virtues. Oxford New York: Clarendon Press Oxford University Press. ISBN 9780198752349. \nCrisp, Roger (1997). Routledge philosophy guidebook to Mill on utilitarianism. London New York: Routledge. ISBN 9780415109789. \nCrisp, Roger; Slote, Michael Slote (1997). Virtue ethics. Oxford New York: Oxford University Press. ISBN 9780198751885. \nCrisp, Roger; Cowton, Christopher (1998). Business ethics: perspectives on the practice of theory. Oxford New York: Oxford University Press. ISBN 9780198290315. \nCrisp, Roger; Hooker, Brad (2000). Well-being and morality: essays in honour of James Griffin. Oxford New York: Clarendon Press Oxford University Press. ISBN 9780198235842. \nCrisp, Roger (2000). Aristotle: Nicomachean ethics. Cambridge, U.K. New York: Cambridge University Press: Cambridge Texts in the History of Philosophy. ISBN 9780521635462. \nCrisp, Roger (2006). Reasons and the good. Oxford New York: Oxford University Press. ISBN 9780199290338. \nCrisp, Roger (2013). The Oxford handbook of the history of ethics. Oxford, Oxfordshire: Oxford University Press. ISBN 9780199545971. \n\n\n=== Chapters in books ===\nCrisp, Roger (2005), \"Hume on virtue, utility, and morality\", in Gardiner, Stephen M., Virtue ethics, old and new, Ithaca, New York: Cornell University Press, pp. 159–178, ISBN 9780801489686 \nCrisp, Roger (2006), \"Aristotle on greatness of soul\", in Kraut, Richard, The Blackwell guide to Aristotle's Nicomachean ethics, Malden, Massachusetts Oxford: Blackwell Publishing, pp. 159–178, ISBN 9781405120210 \n\n\n=== Journal articles ===\nCrisp, Roger (Summer 2002). \"Aristotle's ethics: how being good can make you happy\" (PDF). The Richmond Journal of Philosophy. Twickenham, United Kingdom: Philosophy Department, Richmond upon Thames College. 1 (1): 11–16. \nCrisp, Roger (October 2004). \"How to allocate health care resources: QALYs or the virtues?\" (PDF). Journal of Death and Life Studies. Clinical Ethics Project, Death & Life Studies and Practical Ethics, Graduate School of Humanities and Sociology / Faculty of Letters, The University of Tokyo. 6: 147–156. \nCrisp, Roger (January 2005). \"Value, reasons and the structure of justification: how to avoid passing the buck\". Analysis. Wiley Online. 65 (285): 80–85. doi:10.1111/j.1467-8284.2005.00528.x. \n\n\n=== Podcast ===\nRoger Crisp (16 July 2007). Roger Crisp on utilitarianism (Podcast). Philosophy bites. Philosophy bites. \nRoger Crisp (12 October 2008). Roger Crisp on virtue (Podcast). Philosophy bites. Philosophy bites. \n\n\n=== Conference papers ===\nCrisp, Roger (editor); Schultz, Bart (editor); Bucolo, Placido (editor and translator); Mangion, Francesca (translator) (2007). Proceedings of the world congress on Henry Sidgwick - happiness and religion | Atti del congresso internazionale su Henry Sidgwick - felicità e religione - parallel translation. Catania, Italy: Universita degli Studi di Catania. OCLC 229411995. \n\n\n== References ==\n\n\n== External links ==\nRoger Crisp's page on the St. Anne's College website\nRoger Crisp's page on the Oxford University Philosophy Faculty website\n\"Philosophy bites\": a website where contemporary philosophers deliver podcasts on philosophical topics\nRoger Crisp's posts on an Oxford University practical ethics website", "ns": 0, "pageid": 28365344, "title": "Roger Crisp"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}