{"batchcomplete": "", "query": {"normalized": [{"to": "Rolf Schock", "from": "Rolf_Schock"}], "pages": {"228662": {"extract": "Rolf Schock (5 April 1933 – 5 December 1986), Swedish–American philosopher and artist, was born in Cap-d'Ail, France of German parents. His parents, who had left Germany in 1931, would eventually settle in the United States, where Rolf would go on to study geology and psychology, with mathematics as a minor, at the University of New Mexico. After completing a bachelor of arts in 1955, he pursued studies in philosophy and logic from 1956 to 1960 at the University of California, first in Berkeley and then in Los Angeles (UCLA), and in 1960 moved to Stockholm, Sweden, to specialize in theoretical philosophy at Stockholm University with a particular interest in free logic, logic free of existence assumptions. He was awarded an intermediate post-graduate degree in 1964 and a Ph.D. in 1968, which was followed by an appointment as associate professor at Uppsala University in the following year.\nDuring the period 1964–1969 he also studied at the University College of Arts, Crafts and Design in Stockholm and he dedicated a lot of his time to painting and photography in addition to conducting research. He led a simple life as an independent scholar who was devoted to researching the field of logic and related areas in philosophy, and never held a permanent position, earning a living by temporary teaching assignments at universities and night-schools. For some years he was affiliated with the Royal Institute of Technology in Stockholm, where he taught a series of courses.\nIn 1986 Rolf Schock was killed in an accident in Berlin. To much surprise he left a large estate. Schock bequeathed half of the funds for prizes in the arts and sciences, and beginning in 1993, Schock Prizes (schockprisen) instituted by his will are awarded every two or three years.\n\n\n== References ==\n\"Rolf Schock\". The Royal Swedish Academy of Sciences. Retrieved 2010-06-16.", "ns": 0, "pageid": 228662, "title": "Rolf Schock"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}