{"batchcomplete": "", "query": {"normalized": [{"to": "Rosalind Hursthouse", "from": "Rosalind_Hursthouse"}], "pages": {"298849": {"extract": "Mary Rosalind Hursthouse (born 10 November 1943) is a moral philosopher noted for her work on virtue ethics.\n\n\n== Biography ==\nBorn in Bristol, England, in 1943, Hursthouse spent her childhood in New Zealand. Her aunt Mary studied philosophy and when her father asked her what that was all about, he could not understand her answer. Rosalind Hursthouse, 17 at the time, knew immediately that she wanted to study philosophy, too, and enrolled the next year. She taught for many years at the Open University in England. She was head of the Department of Philosophy at the University of Auckland from 2002 to 2005. Though she had written a substantial amount previously, Hursthouse entered the international philosophical scene for the first time in 1990–91, with three articles:\n\nHursthouse is currently a professor of philosophy at the University of Auckland.\nHursthouse, who was mentored by Elizabeth Anscombe and Philippa Foot, is best known as a virtue ethicist. Her work is deeply grounded in the history of philosophy, and especially in Aristotle's ethics, about which she has written extensively. Hursthouse's article \"Virtue Theory and Abortion\" argues that whereas most discussions of abortion focus on the issue of who has rights to make decisions regarding the foetus, a decision made within one's rights could still be callous or cowardly, meaning that it would be ethically problematic and potentially devastating for the person making it, whatever the status of the foetus and the reproductive rights of women.\nHursthouse has also emphasised the practical nature of virtue ethics in her books Beginning Lives and Ethics, Humans, and Other Animals. Hursthouse's most substantial contribution to modern virtue ethics is her book On Virtue Ethics, which explores its structure as a distinctive action-guiding theory, the relationship between virtue, the emotions and moral motivation, and the place of the virtues within an overall account of human flourishing. It also expands her formulation of right action in terms of what a virtuous person would characteristically do.\n\n\n== Select publications ==\n'The Central Doctrine of the Mean' in The Blackwell Guide to Aristotle’s Nicomachean Ethics, ed. Richard Kraut, Blackwell, 2006, pp. 96–115.\n'Are Virtues the Proper Starting Point for Ethical Theory?' in Contemporary Debates in Moral Theory, ed. James Dreier, Blackwell, 2006, pp. 99–112.\n‘Virtue Ethics’ Stanford Encyclopedia of Philosophy Online, 2003\n'Virtue Ethics vs Rule-Consequentialism: A Reply to Brad Hooker', Utilitas Vol 14, March 2002 pp 41–53.\nEthics, Humans and Other Animals, Routledge, 2000 (written as a part of an Open University course).\nOn Virtue Ethics, Oxford University Press, 1999. For the author's account of how this book came to be written, go to OUP site\n'Virtue and Human Nature' in Hume Studies double issue, Nov.1999/Feb.2000.\n'Intention' in Logic, Cause and Action, ed. Roger Teichmann, Cambridge University Press, 2000.\n'Virtue Ethics and the Emotions' in Virtue Ethics, ed. Daniel Statman, Edinburgh University Press, 1997.\n'Hume's Moral and Political Philosophy' in History of Philosophy, Vol. 5, British Philosophy and the Enlightenment, ed. Stuart Brown, Routledge, 1996.\n'The Virtuous Agent's Reasons: a reply to Bernard Williams' in the Proceedings of the Keeling Colloquium on Aristotle on Moral Realism, ed. Robert Heinaman, UCL Press, 1995.\n'Normative Virtue Ethics' in How Should One Live? ed. Roger Crisp, OUP, 1995.\n'Applying Virtue Ethics' in Virtues and Reasons, Festschrift for Philippa Foot, eds. Rosalind Hursthouse, Gavin Lawrence, Warren Quinn, OUP, 1995.\n'Arational Actions' in The Journal of Philosophy, Vol. LXXXVIII 1991.\n'Virtue Theory and Abortion' in Philosophy and Public Affairs, Vol. 20, 1990–91.\n'After Hume's Justice' in Proceedings of the Aristotelian Society, Vol. XCL, 1990/91.\n\n\n== References ==\n\n\n== External links ==\n Media related to Rosalind Hursthouse at Wikimedia Commons\nUniversity of Auckland, Department of Philosophy, Profile of Rosalind Hursthouse\nHursthouse's entry in Stanford Encyclopedia of Philosophy on virtue ethics", "ns": 0, "pageid": 298849, "title": "Rosalind Hursthouse"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}