{"batchcomplete": "", "query": {"normalized": [{"to": "Ruth Barcan Marcus", "from": "Ruth_Barcan_Marcus"}], "pages": {"369743": {"extract": "Ruth Barcan Marcus (August 2, 1921 – February 19, 2012) was an American philosopher and logician who developed the Barcan formula. She was a pioneer in the quantification of modal logic and the theory of direct reference, and conducted seminal research on identity, essentialism, possibilia, belief, moral conflict as well as some critical historical studies. Timothy Williamson, the Wykeham Professor of Logic at Oxford University, sums up his celebration of Professor Marcus's career by stating that many of her \"main ideas are not just original, and clever, and beautiful, and fascinating, and influential, and way ahead of their time, but actually — I believe — true.\"\n\n\n== Academic appointments ==\nProfessor of philosophy and founding department chair, University of Illinois at Chicago (1962–1970)\nProfessor of philosophy, Northwestern University (1970–1973)\nHalleck professor of philosophy, Yale University (1973–1991)\nProfessor emerita and senior research scholar, Yale University (1992–2012); Visiting distinguished professor, University of California, Irvine (one quarter each year, 1992–97)\n\n\n== Professional offices and service (partial list) ==\nChair of the Board of Officers, American Philosophical Association (1976–83)\nPresident, Association for Symbolic Logic (1983–86)\nPresident, International Institut de Philosophie (1989–92) and Presidente Honoraire (continuing)\nServed on various visoring committees for programs and departments\nServes on various editorial boards\n\n\n== Philosophy ==\n\n\n=== Quantified Modal Logic ===\nRuth Barcan Marcus' earliest published work was the publication of the first axiomatic study of modal logic with quantifiers. These three ground-breaking articles were \"A Functional Calculus of First Order Based on Strict Implication\", Journal of Symbolic Logic (JSL, 1946), \"The Deduction Theorem in a Functional Calculus of First Order Based on Strict Implication\" (JSL, 1946), \"The Identity of Individuals in a Strict Functional Calculus of Second Order\", (JSL, 1947). The three articles are published under Marcus' maiden name: Ruth C. Barcan. The widely discussed Barcan formula is introduced as an axiom in QML. The papers of 1946 and 1947, were the first systems of quantified modal logic, which extended some propositional modal systems of Clarence Irving Lewis to first and second order; a major accomplishment in the development of 20th century logic. Lewis gives Marcus special recognition in his \"Notes on the Logic of Intension\", originally printed in Structure, Method, and Meaning: Essays in Honor of Henry M. Sheffer (New York, 1951). Here Lewis recognizes Barcan Marcus as the first logician to extend propositional logic as a higher order intensional logic.\n\n\n=== Direct Reference ===\nRuth Barcan Marcus proposed the view in the philosophy of language according to which proper names are what Marcus termed mere \"tags\". (\"Modalities and Intensional Languages\" (Synthese, 1961) and elsewhere). These \"tags\" are used to refer to an object, which is the bearer of the name. The meaning of the name is regarded as exhausted by this referential function. This view contrasts for example with late Bertrand Russell's description theory of proper names as well as John Searle's cluster description theory of names which prevailed at the time. This view of proper names (presented in 1962 with Quine as commentator) has been identified by Quentin Smith with the theory of reference given in Saul Kripke's Naming and Necessity. However, in a recent laudatio to Ruth Barcan Marcus, Professor Timothy Williamson says:\n\nOne of the ideas in them that resonates most with current philosophy of language is that of proper names as mere tags, without descriptive content. This is not Kripke's idea of names as rigid designators, designating the same object with respect to all relevant worlds, for ‘rigidified’ definite descriptions are rigid designators but still have descriptive content. Rather, it is the idea, later developed by David Kaplan and others, that proper names are directly referential, in the sense that they contribute only their bearer to the propositions expressed by sentences in which they occur.\n\nThe philosopher of language Stephen Neale has also argued against Professor Smith's claim in the Times Literary Supplement.\n\n\n=== Necessity of Identity ===\nMarcus formally proved the necessity of identity in 1946 and informally argued for it in 1961 and thereafter thus rejecting the possibility of contingent identity. See Journal of Symbolic Logic, (1947) 12: pp 12–15\n\n\n=== Semantics of QML ===\nMarcus prefers an interpretation where the domain of the interpretation comprises individual entities in the actual world. She also suggests that for some uses an alternative substitutional semantics is warranted (See below). She provides arguments against possibilia. See \"Dispensing with Possibilia\" (Proceedings of the American Philosophical Association, 1975–76); \"Possibilia and Possible Worlds\" (Grazer Philosophische Studien, 1985–86). T\n\n\n=== Moral Conflict ===\nMarcus defines a consistent set of moral principles as one in which there is some \"possible world \" in which they are all obeyable. That they may conflict in the actual world is not a mark of inconsistency. As in the case of necessity of identity, there was a resistance to this interpretation of moral conflict. Her argument counts against a widely received view that systems of moral rules are inevitably inconsistent.\n\n\n=== Belief ===\nIt is proposed that believing is a relationship of an agent to a possible state of affairs under specified internal and external circumstances. Assenting to a quoted sentence (the disquotation account of belief) is only one behavioral marker of believing. Betting behavior is another. The wholly language centered account of belief (e.g. Davidson) is rejected. Where an agent would traditionally be described as believing an impossibility until its impossibility was disclosed, Marcus proposes that under those circumstances the agent should say that she only claimed to believe an impossibility. In much the same way, when a mathematician discovers that one of his conjectures is false, and since if it is mathematically false it is impossible, he would say he only claimed that the conjecture was true. Odd as this proposal is, it is analogous to the widely accepted principle about knowing: if we claim to know P, and P turns out false, we do not say we used to know it, we say we were mistaken in so claiming.\n\n\n=== Essentialism ===\nAristotelian Essentialism is concerned with properties which Marcus defines in the context of a modal framework. One proposal is that a property is essential if something has it, not everything has it, if something has it then it has it necessarily, and it is not wholly individuating e.g. a natural kind property. It is otherwise claimed by Quine and others that modal logic or semantics is committed to essentialist truths. Marcus argues informally that there are interpretations of some modal systems in which all essentialist claims are false. Terence Parsons later formally proved this result.\n\n\n=== Substitutional Quantification ===\nAn alternative to Tarskian (model theoretic) semantics is proposed for some uses where \"the truth conditions for quantified formuli are given purely in terms of truth with no appeal to domains of interpretation\". (Later called by others \"truth value semantics\".) She shows that the claim that such a semantics leads to contradictions is false. Such a semantics may be of interest for mathematics e.g. Hartry Field, or for fictional discourse. Objectual quantification is required for interpretation of identity and other metaphysical categories.\n\n\n== Awards and recognitions ==\nGuggenheim Fellow (1952)\nNational Science Foundation Fellow (1963)\nRockefeller Foundation Residency (Bellagio, 1973 and 1990)\nCenter for Advanced Study in the Behavioral Sciences (1979)\nUniversity of Edinburgh Fellow, Humanities Institute (1983)\nWolfson College of Oxford University, Visiting Fellow (1985 and 1986)\nClare Hall of Cambridge University, Visiting Fellow (1988)\nNational Humanities Center, Mellon Fellow (1992–93)\nFellow of the American Academy of Arts and Sciences(1977)\nMedal of the Collège de France (1986)\nDoctor of Humane Letters, honoris causa, University of Illinois at Chicago (1995)\nWilbur Cross Medal, Yale University (2000)\nLauener Prize in Analytic Philosophy, Lauener Foundation, 2007–08.\nPermanent Member of the Common Room, Clare Hall (1986-)\nPhi Beta Kappa (1941)\nMembre, Institut International de Philosophie, Presidente 1989–92, President Honoraire 1992-\nQuinn Prize, American Philosophical Association 2007, for service to the profession\nDewey Lecture, APA, Dec 2009.\n\n\n== Books (written or edited) ==\nThe Logical Enterprise, ed. with A. Anderson, R. Martin, Yale, 1995\nLogic, Methodology and Philosophy of Science, VII, eds. R. Barcan Marcus et al., North Holland, 1986\nModalities: Philosophical Essays, Oxford University Press, 1993. Paperback; 1995 (contains many of Marcus's important papers)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References and notes ==\n\n\n== External links ==\nEncyclopedia of Jewish Women: Ruth Barcan Marcus\nNY Times Ruth Barcan Marcus, Philosopher-Logician, Dies at 90\nRuth Barcan Marcus at the Mathematics Genealogy Project", "ns": 0, "pageid": 369743, "title": "Ruth Barcan Marcus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}