{"batchcomplete": "", "query": {"normalized": [{"to": "S. Barry Cooper", "from": "S._Barry_Cooper"}], "pages": {"5573572": {"extract": "S. Barry Cooper (9 October 1943 – 26 October 2015) was a British mathematician and computability theorist. He was a Professor of Pure Mathematics at the University of Leeds.\n\n\n== Biography ==\nCooper grew up in Bognor Regis and attended Chichester High School for Boys, during which time he played scrum-half for the under-15s England rugby team.\nCooper graduated from Jesus College, Oxford in 1966, and in 1970 received his PhD from University of Leicester under the supervision of Reuben Goodstein and C.E.M. Yates, with a thesis entitled Degrees of Unsolvability. In the 1970s, he was also a leading figure in the Chile Solidarity Campaign, welcoming Chilean refugees to Leeds.\nCooper was appointed Lecturer in the School of Mathematics at the University of Leeds in 1969, where he remained for the rest of his career. He was promoted to Reader in Mathematical Logic in 1991 and to Professor of Pure Mathematics in 1996. In 2011, he was awarded an honorary doctorate at the University of Sofia \"St. Kliment Ohridski\".\nHis book Computability Theory made the technical research area accessible to a new generation of students. He was a leading mover of the return to basic questions of the kind considered by Alan Turing, and of interdisciplinary developments related to computability. He was President of the Association Computability in Europe, and Chair of the Turing Centenary Advisory Committee (TCAC) which co-ordinated the Alan Turing Year. The book Alan Turing: His Work and Impact, edited by Cooper and Jan van Leeuwen, won the Association of American Publishers’ R. R. Hawkins Award.\nHe was a keen long-distance runner, and was also interested in jazz and improvised music, founding Leeds Jazz and being involved in the Termite Club. Cooper died on 26 October 2015 after a short illness.\n\n\n== External links ==\nHome page of S. Barry Cooper\nS. Barry Cooper's Mathematics Genealogy Page\nComputability in Europe Homepage\nThe Alan Turing Centenary Homepage\n\n\n== Some books and papers ==\nS. B. Cooper, 2004. Computability Theory, Chapman & Hall/CRC. ISBN 1-58488-237-9\nS. B. Cooper; J. van Leeuwen (eds.), 2013. Alan Turing - His Work and Impact, New York: Elsevier, ISBN 978-0-123-86980-7\nS. B. Cooper, B. Löwe, A. Sorbi (eds.), 2008. New Computational Paradigms - Changing Conceptions of What is Computable, Springer. ISBN 978-1-58488-237-4\nCooper, S. B.; Harrington, L.; Lachlan, A. H.; Lempp, S.; Soare, R. I. (1991). \"The d.r.e. degrees are not dense\". Annals of Pure and Applied Logic. 55 (2): 125–151. doi:10.1016/0168-0072(91)90005-7. \nCooper, S. B. (2006). \"Definability as hypercomputational effect\" (PDF). Applied Mathematics and Computation. 178: 72–82. doi:10.1016/j.amc.2005.09.072. \nCooper, S. B. (2004). \"The incomputable Alan Turing\". British Computer Society, Electronic Workshops in Computing. Invited paper from 'Alan Mathison Turing 2004: A celebration of his life and achievements, Manchester University, 5 June 2004. \nCooper, S. B.; Odifreddi, P. (2003). \"Incomputability in Nature\". In S. B. Cooper and S. S. Goncharov. Computability and Models: Perspectives East and West (PDF). Plenum Publishers, New York, Boston, Dordrecht, London, Moscow. pp. 137–160.  CS1 maint: Uses editors parameter (link)\nCooper, S. B. (1999). \"Clockwork or Turing U/universe?\". In S. B. Cooper and J. K. Truss. Models and Computability (PDF). London Mathematical Society Lecture Notes Series 259, Cambridge University Press, Cambridge, New York, Melbourne. pp. 63–116.  CS1 maint: Uses editors parameter (link)\n\n\n== References ==", "ns": 0, "pageid": 5573572, "title": "S. Barry Cooper"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}