{"batchcomplete": "", "query": {"normalized": [{"to": "Saharon Shelah", "from": "Saharon_Shelah"}], "pages": {"331211": {"extract": "Saharon Shelah (Hebrew: שהרן שלח‎‎) is an Israeli mathematician. He is a professor of mathematics at the Hebrew University of Jerusalem and Rutgers University in New Jersey.\n\n\n== Biography ==\nShelah was born in Jerusalem on July 3, 1945. He is the son of the Israeli poet and political activist Yonatan Ratosh. He received his PhD for his work on stable theories in 1969 from the Hebrew University.\nShelah is married to Yael, and has three children.\nShelah wanted to be a scientist while at primary school, but initially was attracted to physics and biology, not mathematics. Later he found mathematical beauty in studying geometry: He said, \"But when I reached the ninth grade I began studying geometry and my eyes opened to that beauty—a system of demonstration and theorems based on a very small number of axioms which impressed me and captivated me.\" At the age of 15, he decided to become a mathematician, a choice cemented after reading Abraham Halevy Fraenkel's book \"An Introduction to Mathematics\".\nHe received a B.Sc. from Tel Aviv University in 1964, served in the Israel Defense Forces Army between 1964 and 1967, and obtained a M.Sc. from Tel Aviv University in 1967. He then worked as a Teaching Assistant at the Institute of Mathematics of the Hebrew University of Jerusalem while completing a Ph.D. there under the supervision of Michael Oser Rabin, on a study of stable theories.\nShelah was a Lecturer at Princeton University during 1969-70, and then worked as an Assistant Professor at the University of California, Los Angeles during 1970-71. He became a professor at Hebrew University in 1974, a position he continues to hold.\nHe has been a Visiting Professor at the following Universities: the university of Wisconsin (1977–78), the University of California, Berkeley (1978 and 1982), the University of Michigan (1984–85), at Simon Fraser University, Burnaby, British Columbia (1985), and Rutgers University, New Jersey (1985).\nHe has been a Distinguished Visiting Professor at Rutgers University since 1986.\n\n\n== Academic career ==\nAccording to the list of Shelah's papers, he had published 1044 mathematical papers up to 2014 (including joint papers with over 220 co-authors). His main interests lie in mathematical logic, model theory in particular, and in axiomatic set theory.\nIn model theory, he developed classification theory, which led him to a solution of Morley's problem. In set theory, he discovered the notion of proper forcing, an important tool in iterated forcing arguments. With PCF theory, he showed that in spite of the undecidability of the most basic questions of cardinal arithmetic (such as the continuum hypothesis), there are still highly nontrivial ZFC theorems about cardinal exponentiation. Shelah constructed a Kurosh monster, an uncountable group for which every proper subgroup is countable. He showed that Whitehead's problem is independent of ZFC. He gave the first primitive recursive upper bound to van der Waerden's numbers V(C,N). He extended Arrow's impossibility theorem on voting systems.\n\n\n== Awards ==\nThe first recipient of the Erdős Prize, in 1977;\nThe Karp Prize of the Association for Symbolic Logic in 1983\nThe Israel Prize, for mathematics, in 1998;\nThe Bolyai Prize in 2000;\nThe Wolf Prize in Mathematics in 2001.\nThe EMET prize in 2011.\nThe Leroy P. Steele Prize, for Seminal Contribution to Research, in 2013\nHonorary member of the Hungarian Academy of Sciences, in 2013.\nAdvanced Grant of the European Research Council (2013).\n\n\n== Selected works ==\nProper forcing, Springer 1982\nProper and improper forcing (2nd edition of Proper forcing), Springer 1998\nAround classification theory of models, Springer 1986\nClassification theory and the number of non-isomorphic models, Studies in Logic and the Foundations of Mathematics, 1978, 2nd edition 1990, Elsevier\nClassification Theory for Abstract Elementary Classes, College Publications 2009.\nClassification Theory for Abstract Elementary Classes, Volume 2, College Publications 2009.\nCardinal Arithmetic, Oxford University Press 1994\n\n\n== See also ==\nList of Israel Prize recipients\nSauer–Shelah lemma\nShelah cardinal\n\n\n== References ==\n\n\n== External links ==\nArchive of Shelah's mathematical papers, shelah.logic.at\nJohn T. Baldwin (July 7, 2006). \"Abstract Elementary Classes: Some Answers, More Questions\" (PDF). math.uic.ed.  A survey of recent work on AECs.", "ns": 0, "pageid": 331211, "title": "Saharon Shelah"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}