{"batchcomplete": "", "query": {"normalized": [{"to": "Sandra Harding", "from": "Sandra_Harding"}], "pages": {"1496291": {"extract": "This article is about the American philosopher, not the Australian sociologist and university administrator of the same name.\nSandra G. Harding (born 1935) is an American philosopher of feminist and postcolonial theory, epistemology, research methodology, and philosophy of science. She taught for two decades at the University of Delaware before moving to the University of California, Los Angeles in 1996. She directed the UCLA Center for the Study of Women from 1996 to 2000, and co-edited Signs: Journal of Women in Culture and Society from 2000 to 2005. She is currently a Distinguished Professor Emeritus of Education [2] and Gender Studies [3] at UCLA and a Distinguished Affiliate Professor of Philosophy at Michigan State University[4]. In 2013 she was awarded the John Desmond Bernal Prize by the Society for the Social Studies of Science (4S). (Earlier recipients of this prize include Robert Merton, Thomas S. Kuhn, Mary Douglas, and Joseph Needham.)\nShe has developed the research standard of “strong objectivity,” and contributed to the articulation of standpoint methodology. This kind of research process starts off from questions that arise in the daily lives of people in oppressed groups. To answer such questions, it “studies up”, examining the principles, practices and cultures of dominant institutions, from the design and management of which oppressed groups have been excluded. She has also contributed to the development of feminist, anti-racist, multicultural, and postcolonial studies of the natural and social sciences, asking the extent to which paradigms like feminist empiricism are useful for promoting to goals of feminist inquiry. She is the author or editor of many books and essays on these topics, and was one of the founders of the fields of feminist epistemology and philosophy of science. This work has been influential in the social sciences and in women/gender studies across the disciplines. It has helped to create new kinds of discussions about how best to relink scientific research to pro-democratic goals.\nShe has been a Visiting Professor at the University of Amsterdam, the University of Costa Rica, the Swiss Federal Institute of Technology [5], and the Asian Institute of Technology. She has been a consult to several United Nations organizations including the Pan American Health Organization, UNESCO, the U.N. Commission on Science and Technology for Development [6], and the U.N. Development Fund for Women. Phi Beta Kappa selected her as a national lecturer in 2007. She has lectured at over 300 colleges, universities, and conferences, on five continents.\nDuring what is known now as the \"Science Wars\", she was part of a debate regarding the value-neutrality of the sciences. This aspect of her work has been criticized by some scientists. Harding referred to Newton's Principia Mathematica as a \"rape manual\" in her 1986 book \"The Science Question in Feminism\", a characterization that she later said she regretted.\n\n\n== Education and career ==\nSandra Harding received her undergraduate degree from Douglass College of Rutgers University in 1956. After 12 years working as legal researcher, editor, and fifth-grade math teacher in New York City and Poughkeepsie, N.Y., she returned to graduate school and earned a doctorate from the Department of Philosophy at New York University in 1973.\nHer first university teaching job was at The Allen Center of the State University of New York at Albany, an experimental critical social sciences college which was “defunded” by the state of New York in 1976. She then joined the Department of Philosophy at the University of Delaware, with a joint appointment to the Women’s Studies Program. She was promoted to Associate Professor in 1979, and to full Professor in 1986. From 1981 until she left Delaware in 1996, she held a Joint Appointment to the Department of Sociology. She was Director of the Women’s Studies Program at Delaware 1985-91 and 1992-93.\nFrom 1994 to 1996 she was Adjunct Professor of Philosophy and Women’s Studies at UCLA on a half-time basis. In 1996 she was appointed Director of the UCLA Center for the Study of Women, which is a research institute. She held that position until 2000. Meanwhile, since 1996 she has been a Professor in the Graduate Department of Education and the Department of Gender Studies at UCLA. In 2012 she was appointed Distinguished Professor of Education and Gender Studies. From 2000 to 2005 she also was co-editor of Signs: Journal of Women in Culture and Society.\nShe has held Visiting Professor appointments at the University of Amsterdam (1987), University of Costa Rica (1990), the Swiss Federal Institute of Technology Zurich (ETH) (1987), and the Asian Institute of Technology, Bangkok (1994). In 2011 she was appointed a Distinguished Affiliate Professor in the Department of Philosophy at Michigan State University, East Lansing.\nShe has been a consultant to several United Nations organizations including the U.N. Commission on Science and Technology for Development, the Pan American Health Organization, UNESCO, and the U.N. Development Fund for Women. She was invited to co-edit a chapter of UNESCO’s World Science Report 1996 on “The Gender Dimension of Science and Technology:”[7] This 56 pp account was the first such attempt to bring gender issues in science and technology to such a global-scale and prestigious context. She was invited to contribute a chapter to UNESCO’s World Social Science Report 2010 on “Standpoint Methodologies and Epistemologies: a Logic of Scientific Inquiry for People.”[8]\nShe has served on the editorial boards of numerous journals in the fields of philosophy, women’s studies, science studies, social research methodology, and African philosophy. She has lectured at more than 300 colleges, universities, and conferences in North America as well as in Central America, Europe, Africa and Asia. Her books, essays and book chapters have been translated into dozens of languages and reprinted in hundreds of anthologies.\nThe gender, race, colonial and postcolonial issues on which she has focused have been controversial within scholarly circles. They have also reached popular awareness during several episodes of the “culture wars.” The John Birch Society wrote to the President of the University of Delaware in 1981 objecting to her employment there because she was sponsoring lectures that provided class perspectives on U.S. history. During the “Science Wars” of the 1990s, her work became a main target of criticisms of feminist, sociological, and postmodern approaches to understanding how the natural sciences and their particular historical surrounding social orders (pro- and anti- democratic) have provided intellectual and political resources for each other. Her essay on “Science is ‘Good to Think With’” was the lead article in the issue of the journal Social Text that also included the so-called “Sokal Hoax,” that focused on her work among others. Her work was also a main target of Paul Gross and Norman Levitt’s Higher Superstition.\n\n\n== Awards, honors, and fellowships ==\n2013. Awarded John Desmond Bernal Prize of Society for the Social Studies of Science (4S).\n2012. Appointed Distinguished Professor of Education and Gender Studies. UCLA\n2011. Appointed Distinguished Affiliate Professor of Philosophy, Michigan State University, East Lansing\n2009. Received American Education Research Association (AERA) Award for Distinguished Contributions to Gender Equity in Education Research.\n2007-08. Appointed as a Phi Beta Kappa National Lecturer.\n2007. Awarded The Douglass (College) Society Membership.\n2000-05 Co-editor of Signs: Journal of Women in Culture and Society.\n1990 Woman Philosopher of the Year, Eastern Division Society for Women in Philosophy.\n1989. Elected to membership in Sigma Xi.\n\n\n== Selected works ==\nBooks:\nThe Postcolonial Science and Technology Studies Reader. Edited. 2011\nSciences From Below: Feminisms, Postcolonialisms, and Modernities 2008.\nScience and Social Inequality: Feminist and Postcolonial Issues. 2006.\nThe Feminist Standpoint Theory Reader. Edited. 2004.\nScience and Other Cultures: co-edited with Robert Figueroa. 2003.\nDecentering the Center: Philosophies for a Multicultural, Postcolonial and Feminist World, co-edited with Uma Narayan. 2000.\nIs Science Multicultural? Postcolonialisms, Feminisms, and Epistemologies. 1998.\nThe ‘Racial’ Economy of Science: Toward a Democratic Future. Edited. 1993.\nWhose Science? Whose Knowledge: Thinking From Women’s Lives. 1991.\nFeminism and Methodology: Social Science Issues. Edited. 1987\nThe Science Question in Feminism. 1986.\nDiscovering Reality: Feminist Perspectives on Epistemology, Metaphysics, Methodology, and Philosophy of Science. Co-edited with Merrill Hintikka. 1983. Second edition 2003\nEssays:\n“Objectivity and Diversity” Encyclopedia of Diversity in Education, ed. James Banks. Thousand Oaks: Sage 2012.\n“Standpoint Methodologies and Epistemologies: A Logic of Scientific Inquiry for People,” UNESCO World Social Science Report, Paris: United Nations Education, Scientific, and Cultural Organization (UNESCO), 2010. 173-175.\n“Postcolonial and Feminist Philosophies of Science and Technology: Convergences and Dissonances,” in Postcolonial Studies, Vol 12, No. 4, p. 410-429, 2009.\n“Rethinking standpoint epistemology: What is \"strong objectivity\"?” in Cudd, Ann E.; Andreasen, Robin O. (2005). Feminist theory: a philosophical anthology. Oxford, UK Malden, Massachusetts: Blackwell Publishing. pp. 218–236. ISBN 9781405116619. \n“Women, Science, and Society”, Science September 11, 1998.\n“Rethinking Standpoint Epistemology: What is ‘Strong Objectivity’” in Feminist Epistemologies, ed. Linda Alcoff and Elizabeth Potter. New York: Routledge, 1992.\n“Feminism, Science, and the Anti-Enlightenment Critiques,” in Feminism/Postmodernism, ed. Linda Nicholson. New York: Methuen/Routledge and Kegan Paul, 1988. 83-106.\nSelected autobiographical accounts, interviews, and analyses of significance of work:\nCallahan, Joan and Nancy Tuana. “Feminist Philosophy Interview Project: Feminist Philosophers In Their Own Words.” Video available for purchase at Penn State Rock Ethics Institute webpage: http://rockethics.psu.edu/education/oral-history-feminist-philosophers.\nHarding, Sandra. 2002. “Philosophy as Work and Politics,” in The Philosophical I: Personal Reflections on Life in Philosophy, ed. George Yancy. Lanham Mass: Rowman & Littlefield Publishers. 23-42\nHinterberger, Amy. 2013. “Curating postcolonial critique”, Social Studies of Science 43(4) 619-627. (Review of The Postcolonial Science and Technology Studies Reader.)\nHirsch, Elizabeth and Gary A. Olson “Starting From Marginalized Lives A Conversation with Sandra Harding,” JAC 15:2. (1995).\nMarsan, Loren. 2008. ”Thinking from Women’s Lives: Sandra Harding, Standpoint, and Science.” Video available at http://women.ucla.edu/faculty/hammer/cm178/o87/ThinkingFromWomen’s Lives %20.Sandra.html\nRichardson, Sarah S. 2010. “Feminist philosophy of science: history, contributions, and challenges,” Synthese 177:337-362.\nRooney, Phyllis. 2007. “The Marginalization of Feminist Epistemology and What That Reveals About Epistemology ‘Proper’”. In Feminist Epistemology and Philosophy of Science Power in Knowledge., ed. Heidi Grasswick. Dordrecht: Springer.\nSteiner, Linda (2014), \"Sandra Harding: the less false accounts of feminist standpoint epistemology\", in Hannan, Jason, Philosophical profiles in the theory of communication, New York: Peter Lang, pp. 261–289, ISBN 9781433126345. \n\n\n== Bibliography ==\n(ed.), Can Theories be Refuted? Essays on the Duhem-Quine Thesis, 1976.\nThe Science Question in Feminism, 1986.\nwith Jean F. O'Barr (ed.), Sex and Scientific Inquiry, 1987.\n(ed.), Feminism and Methodology: Social Science Issues, 1987.\nWhose Science? Whose Knowledge?: Thinking from Women's Lives, 1991.\n(ed.), The ‘Racial’ Economy of Science: Toward a Democratic Future, 1993.\nIs Science Multicultural? Postcolonialisms, Feminisms, and Epistemologies, 1998.\nwith Uma Narayan (ed.), Decentering the Center: Philosophy for a Multicultural, Postcolonial, and Feminist World, 2000.\nwith Robert Figueroa (ed.), Science and Other Cultures: Issues in Philosophies of Science and Technology, 2003.\nwith Merrill B. Hintikka (ed.), Discovering Reality: Feminist Perspectives on Epistemology, Metaphysics, Methodology, and Philosophy of Science. Second Edition, 2003 (1983).\n(ed.), Feminist Standpoint Theory Reader, 2004.\nScience and Social Inequality: Feminist and Postcolonial Issues, 2006.\nSciences From Below: Feminisms, Postcolonialities, and Modernities, 2008.\n(ed.), The Postcolonial Science and Technology Studies Reader, Duke UP 2011\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\n\"Starting from Marginalized Lives: A Conversation with Sandra Harding\" by Elizabeth Hirsh and Gary A. Olson JAC 15.2, Spring 1995.\n\"Women, Science, and Society\" by Sandra Harding, Science, September 11, 1998.", "ns": 0, "pageid": 1496291, "title": "Sandra Harding"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}