{"batchcomplete": "", "query": {"normalized": [{"to": "Sedulius Scottus", "from": "Sedulius_Scottus"}], "pages": {"5689940": {"extract": "Sedulius Scotus or Scottus (fl. 840–860) was an Irish teacher, Latin grammarian and scriptural commentator who lived in the 9th century. During the reign of the Emperor Lothair (840–855), he was one of a colony of Irish teachers at Liège. Sedulius is sometimes called Sedulius the Younger, to distinguish him from Coelius Sedulius (a 5th-century poet). The usual Irish form of the name is Siadhal, but he appears to have been called Suadbar. It is quite probable that towards the end of his days he went to Milan, following the example of his countryman, Dungal, who established a school at Pavia. When and where he died is unknown.\n\n\n== Life ==\nIn search of warmer land to accommodate their growing population, the Norse Vikings made their way into Iceland during the mid-ninth century. Those already occupying the land, Irish monks, were driven out of their monasteries by force. A monk by the name of Sedulius Scottus was among them, and his search for refuge led him to the city of Liège He went on to document this journey in one of his poems, Flamina Nos Boreae or A Great Wind-Enter Sedulius. While in Liège, Sedulius Scottus is believed to have stayed with Bishop Hartgar, who would later be addressed in much of Sedulius' poetry. He would become so fond of Bishop Hartgar that after the man's death, Sedulius wrote a lament in his honor. Sedulius also wrote to other prominent figures of his time, including Empress Ermengarde, King Louis, and Charles the Bald. It appears from the manuscript records of the 9th century that there was a teacher at St. Lambert, Liège, who was known as Sedulius Scotus, and was a scribe and a poet.\nIn Liège, there was a plague during Sedulius' stay, which he would document in his poem Contra Plagam. Between this event, and the return of the Norse Vikings to Liège, several scholars such as George Whicher, author of The Goliard Poets, have assumed that Sedulius perished in Liège. However, it is also generally accepted that Sedulius moved from Liège to Milan later in his life, but no official date has been assigned to this move. This thought is attributed to the relationship developed between Sedulius and Archbishop Tado of Milan, for whom he wrote the poem Tado, Benigne Vide, or Easter's Greetings.\nAside from Christian literature and Biblical commentary, Sedulius held a passion for alcoholic beverages, especially beer. Sedulius liked the drink so much that he even wrote a lament to a small drought titled Nunc Viridant Segetes, or Drought in Spring. The poem ends with the line “Muse, ask our good father bishop: when do we drink again?\"\n\n\n== Works ==\nSedulius's most important works are his treatise De Rectoribus Christianis, a commentary on Porphyry's Isagoge, or introduction to the logic of Aristotle, and a scriptural commentary Collectanea in omnes beati Pauli Epistolas. The first of these is a noteworthy contribution to Christian ethics. It is the first, apparently, of a long line of treatises written during the Middle Ages for the instruction of Christian princes and rulers, a dissertation on the duties peculiar to that state of life, a Mirror for Princes, as such works came to be called at a much later period.\nWhile in Liège, Sedulius Scottus expanded his influence. He would later be known as the top literary figure in the city between 848 and 858, although the dates vary in regards to when his fame eventually settled. Sedulius Scottus was very interested in the spiritual formation of the royal leaders, asserting that they should possess knowledge to lead both clergy and council. To accomplish this, he wrote De rectoribus Christianis, or On Christian Rulers, for Emperor Lothar I's son, Lothar II. This was designed to be an aid in his princely duties, and fit into a popular category of literature, the Mirror for Princes. In this document, Sedulius highlighted eight pillars that he hoped all Christian rulers would abide by, and used both Theodosius I and Constantine as role models for aspiring Christian leaders. He also mentioned King David among the inspirational figures, commenting that even with sin, David still led the nation towards God.\nSedulius's work shows, among other traits, a deep moral feeling, a realization of the fact that the mission of the state is neither purely economic on the one hand nor exclusively ecclesiastical, on the other. The question of the relations between Church and State had, indeed, been raised, and Sedulius affirms the rights of the Church, to defend them. He is not on the side of those who, seeing in Charlemagne the ideal of a pontiff and ruler in one person, were in favor of the idea that the prince should in fact be supreme in matters religious. On the contrary, he is in favor of a division of temporal and spiritual powers and requires of the prince a careful observance of the Church's rights and privileges. The description of the qualifications of the Queen is not only Christian in feeling and tone, but also humanistic, in the best sense of the word.\nAmong his work, a mock epic is preserved known as De Quodam Verbece a Cane Discerpto or in English, “On a Ram Torn to Pieces by a Dog”. This was intended to be a paradoxical account of Aeneid, a contender to the Gospel accounts of Jesus Christ. His hope was to create a Christian hero in a time where most epics where written about figures that did not subscribe to the Christian doctrine. Sedulius is thought to have held his own copy of the Aenid, potentially sharing notes in the margins of the document that he made with the addition of comments made by Donatus on Virgil.\nThe commentary on the Isagoge was known in Western Europe in the Latin version only.\nNot the least interesting of the writings of Sedulius are his letters, some of which are published in the \"Neues Archiv\", II, 188, and IV, 315. In them are narrated the vicissitudes of the Irish exiles on the Continent, and an insight is given into the attitude towards those exiles by the authorities, civil and ecclesiastical, as well as by the people.\nSedulius, also known as John Scottus, was bilingual, speaking both Greek and Latin. This skill allowed him to translate a number of documents, most famously Greek Psalters. It is suggested by several sources that Sedulius may even have had an entire Bible translated for or by himself. He was a student of Greek, and, according to Bernard de Montfaucon, it was he who copied the Greek Psalter (now no. 8047 in the \"Bibliothèque de l'Arsenal\", Paris). His poems, to the number of ninety, are published by Traube in the Poetae Aevi Carolini, which is a portion of the Monumenta Germaniae Historica.\nAs of right now, there is only one full commentary on the Carmina by Sedulius Scottus, done by R. Duchting.\n\n\n=== List Of Works ===\nFlamina Nos Boreae (A Great Wind-Enter Sedulius)\nDe rectoribus Christianis (On Christian Rulers)\nDe Quodam Verbece a Cane Discerpto (On a Ram Torn to Pieces by a Dog)\nContra Plagam (Intercession Against the Plague)\nCollectaneum in Mattheum (Commentary on the Gospel of Matthew)\nDe certamine liliae et rosae (Debate between a Lily and a Rose.)\nNunc Viridant Segetes (Drought in Spring)\nNos Sitis Atque Fames (Small Beer)\nAut Lego Vel Scribo (A Scholar's Life)\nCollectaneum in omnes beati Pauli epistolas\nThe Standing Corn is Green\n“Shorter works include a commentary on the Eusebian Canons, Expositio in epistolam Hieronimi ad Damasam papam and the Expositio argumenti Hieron-imi in decem canones, as well as the Explanatiuncula in argumentum secundum Matthaeum, Marcum, Lucam. Another significant contribution to biblical studies is his autograph copy of the Greek psalter.”\n\n\n== \"The Scholars of Clonard\" ==\nThe poem, \"The Scholars of Clonard\", is attributed to Sedulius:\nLook on the marble columns surpassing the stars,\nwhich the sand of the saint-bearing land supports here\nhappy, famous Ailerán, Vinnau, Fergus,\nshining lights made by gift-carrying God.\nO He sent a great present of Scotia [i.e.Ireland],\nrich relics which Pictonia [i.e. Poitiers] wishes to be its own,\nwhence comes Titan and where night established the stars\nand where midday is hot with blazing hours\n[i.e. the east and the west and the south].\n(The Celtic Latin Tradition of Biblical Style, p. 129, edited and translated by David Howlett, Dublin, 1995)\n\n\n== See also ==\nAaron Scotus (died 1052)\nBlessed Marianus Scotus (died c. 1088)\nDavid Scotus (died 1139), chronicler\nJoseph Scottus (died near 800), Irish deacon, scholar, diplomat, poet, and ecclesiastic\nJohannes Scotus Eriugena (c. 815–877), Irish theologian\nMarianus Scotus (c. 1028–1082), Irish monk\n\n\n== References ==\n\nShanzer, Danuta. \"Sedulii Scotti Carmina.\" Medium Aevum 63, no. 1 (1994): 104-23. http://www.mod-langs.ox.ac.uk/ssmll/\nO'Donovan, Oliver, and Joan Lockwood O'Donovan. From Irenaeus to Grotius: A Sourcebook in Christian Political Thought, 100-1625. Grand Rapids, MI: William B. Eerdmans Pub., 1999.\nMacManus, Seumas. The Story of the Irish Race: A Popular History of Ireland. Old Greenwich, CT: Devin-Adair,1992, 1966.\n\"ANGLANDICUS: Celebrating Christmas with Wise Men from Ireland.\" ANGLANDICUS: Celebrating Christmas with Wise Men from Ireland. http://anglandicus.blogspot.com/2014/12/celebrating-christmas-with-wise-men.html.\nHellmann, Sedulius Scotus (Munich 1906); Cath. Univ. Bulletin (April, 1898, and July, 1907)\nMontague, John, ed. The Faber Book of Irish Verse (1974); Nune Viridant Segetes and Apologia Pro Vita Sua, p. 65.\n\n\n== External links ==\nOpera Omnia by Migne Patrologia Latina with analytical indexes (Latin)\nPoem: The Standing Corn is Green\nPoem: Intercession Against the Plague\nhttp://foundationsirishculture.ie/\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). \"Sedulius Scotus\". Catholic Encyclopedia. New York: Robert Appleton.", "ns": 0, "pageid": 5689940, "title": "Sedulius Scottus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}