{"batchcomplete": "", "query": {"normalized": [{"to": "Sergei Adian", "from": "Sergei_Adian"}], "pages": {"5028401": {"extract": "Sergei Ivanovich Adian, also Adyan (Armenian: Սերգեյ Իվանովիչ Ադյան; Russian: Серге́й Ива́нович Адя́н, born 1 January 1931), is a Soviet and Russian mathematician. He is a professor at the Moscow State University and is known for his work in group theory, especially on the Burnside problem.\n\n\n== Biography ==\nAdian was born near Elizavetpol. He grew up there in an Armenian family. He studied at Yerevan and Moscow pedagogical institutes. His advisor was Pyotr Novikov. He has been working at Moscow State University since 1965. Alexander Razborov was one of his students.\n\n\n== Mathematical career ==\nIn his first work as a student in 1950, Adian proved that the graph of a function f(x) of a real variable satisfying the functional equation f(x + y) = f(x) + f(y) and having discontinuities is dense in the plane. (Clearly, all continuous solutions of the equation are linear functions.) This result was not published at the time. It is curious that about 25 years later the American mathematician Edwin Hewitt from Seattle gave preprints of some of his papers to Adian during a visit to MSU, one of which was devoted to exactly the same result, which was published by Hewitt much later.\nBy the beginning of 1955 Adian had managed to prove the undecidability of practically all non-trivial invariant group properties, including the undecidability of being isomorphic to a fixed group G, for any group G. These results made up his Ph.D. thesis and his first published work. This is one of the most remarkable, beautiful, and general results in algorithmic group theory and is now known as the Adian–Rabin theorem. What distinguishes the first published work by Adian, is its completeness. In spite of numerous attempts, nobody has added anything fundamentally new to the results during the past 50 years. Adian’s result was immediately used by A. A. Markov in his proof of the algorithmic unsolvability of the classical problem of deciding when topological manifolds are homeomorphic.\n\n\n=== Burnside problem ===\nAbout the Burnside problem:\n\nVery much like Fermat’s Last Theorem in number theory, Burnside’s problem has acted as a catalyst for research in group theory. The fascination exerted by a problem with an extremely simple formulation which then turns out to be extremely difficult has something irresistible about it to the mind of the mathematician.\n\nBefore the work of Novikov and Adian an affirmative answer to the problem was known only for n 2 {2, 3, 4, 6} and the matrix groups. However, this did not hinder the belief in an affirmative answer for any period n. The only question was to find the right methods for proving it. As later developments showed, this belief was too naive. This just demonstrates that before their work nobody even came close to imagining the nature of the free Burnside group, or the extent to which subtle structures inevitably arose in any serious attempt to investigate it. In fact, there were no methods for proving inequalities in groups given by identities of the form X^n = 1.\nAn approach to solving the problem in the negative was first outlined by P. S. Novikov in his note, which appeared in 1959. However, the concrete realization of his ideas encountered serious difficulties, and in 1960, at the insistence of Novikov and his wife Lyudmila Keldysh, Adian settled down to work on the Burnside problem. Completing the project took intensive efforts from both collaborators in the course of eight years, and in 1968 their famous paper appeared, containing a negative solution of the problem for all odd periods n > 4381, and hence for all multiples of those odd integers as well.\nThe solution of the Burnside problem was certainly one of the most outstanding and deep mathematical results of the past century. At the same time, this result is one of the hardest theorems: just the inductive step of a complicated induction used in the proof took up a whole issue of volume 32 of Izvestiya, even lengthened by 30 pages. In many respects the work was literally carried to its conclusion by the exceptional persistence of Adian. In that regard it is worth recalling the words of Novikov, who said that he had never met a mathematician more ‘penetrating’ than Adian.\nIn contrast to the Adian–Rabin theorem, the paper of Adian and Novikov in no way ‘closed’ the Burnside problem. Moreover, over a long period of more than ten years Adian continued to improve and simplify the method they had created and also to adapt the method for solving some other fundamental problems in group theory.\nBy the beginning of the 1980s, when other contributors appeared who mastered the Novikov–Adian method, the theory already represented a powerful method for constructing and investigating new groups (both periodic and non-periodic) with interesting properties prescribed.\n\n\n== External links ==\n(Russian) On 75th birthday – an article by L. D. Beklemishev, I. G. Lysenok, S. P. Novikov, M. R. Pentus, A. A. Razborov, A. L. Semenov and V. A. Uspensky.\nDedicated to Adian Sergei Ivanovich in 2006 Moscow Symposium on Logic, Algebra and Computation.\nSergei Adian at the Mathematics Genealogy Project", "ns": 0, "pageid": 5028401, "title": "Sergei Adian"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}