{"batchcomplete": "", "query": {"normalized": [{"to": "Shelly Kagan", "from": "Shelly_Kagan"}], "pages": {"1461375": {"extract": "Shelly Kagan is the Clark Professor of Philosophy at Yale University and the former Henry R. Luce Professor of Social Thought and Ethics. He is best known for his writings about moral philosophy and normative ethics. In 2007, Kagan's course about death was offered for free online, and proved to be very popular. This led to his publishing a book on the subject in 2012.\n\n\n== Education and early career ==\nA native of Skokie, Illinois, Kagan received his B.A. from Wesleyan University in 1976 and his Ph.D. from Princeton University in 1982. He taught at the University of Pittsburgh and at the University of Illinois at Chicago before taking a position at Yale.\n\n\n== Philosophy ==\nKagan's first book The Limits of Morality is an extended critique of two key assumptions which underlie what Kagan calls \"ordinary morality\" - the \"common‐sense moral view that most of us accept.\" Specifically, the book questions the assumption that morality rules out certain actions (such as harming innocent people) even in situations where doing so might create greater good, and the assumption that individuals are \"not required to make our greatest possible contribution to the overall good.\" According to Kagan, these two assumptions are indefensible, despite their widespread appeal.\nIn 1997, Kagan published a textbook titled Normative Ethics, designed to provide a thorough introduction to the subject for upper-level undergraduate or graduates students. In the spring of 2007, his Yale course \"Death\" was recorded for Open Yale Courses, and the book Death is based on these lectures. In 2010, Yale University reported Kagan's \"Death\" course had made him one of the most popular foreign teachers in China.\nKagan also explored the concept of desert, which is a philosophical concept of what individuals do or do not deserve, in his 2012 book The Geometry of Desert.\nKagan has served as a member of the editorial board of the journal Ethics. In 2016, he was made a fellow of the American Academy of Arts and Sciences.\n\n\n== Bibliography ==\nThe Limits of Morality, Oxford University Press, 1989. ISBN 0-19-823916-5.\nNormative Ethics, Westview Press, 1997. ISBN 0-8133-0846-1.\nDeath, Yale University Press, 2012. ISBN 978-0-300-18084-8.\nThe Geometry of Desert, Oxford University Press, August 2012.ISBN 0199895597.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nKagan's personal website\nKagan's course \"Death\" at Open Yale Courses. Includes audio and video files of course lectures.", "ns": 0, "pageid": 1461375, "title": "Shelly Kagan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}