{"batchcomplete": "", "query": {"normalized": [{"to": "Sherrilyn Roush", "from": "Sherrilyn_Roush"}], "pages": {"1774443": {"extract": "Sherrilyn Roush is Professor of Philosophy at King's College London specializing in the Philosophy of Science and Epistemology. She joined KCL in 2014 after accepting the inaugural Peter Sowerby Chair in Philosophy and Medicine. Previously, she was an Associate Professor of Philosophy at U. C. Berkeley.\nHer book Tracking Truth presents a unified treatment of knowledge, evidence, and epistemological realism and anti-realism about science, based on the idea that knowing is responsiveness to the way the world is, and that this is an ability to follow the truth through time and changing circumstances. Responsiveness is defined for empirical knowledge by a reformulation of Robert Nozick’s tracking conditions—for example: if p were false, then S wouldn’t believe p—using conditional probability instead of counterfactuals. Roush argues that the new tracking view is superior to other externalist views of knowledge, including process reliabilism. Of particular interest are the new view’s fallibilist account of knowledge of logical truth, its treatment of reflective knowledge and lottery propositions, its solutions to the value problem and the generality problem, its implications about skepticism, and its explanation of why knowledge is power in the Baconian sense.\nIn the second half of the book it is argued that the tracking theory of evidence is best formulated and defended as a confirmation theory based on the Likelihood Ratio. The tracking theories of knowledge and evidence thereby fit together to provide a deep explanation of why having better evidence makes you more likely to know. Finally, the book argues that confirmation theory is relevant to debates about scientific realism, and defends a position intermediate between realism and anti-realism on the basis of a view about what having evidence requires.\n\n\n== External links ==\nRoush's page at King's College London\nRoush's website at U.C. Berkeley\n\n\n== References ==", "ns": 0, "pageid": 1774443, "title": "Sherrilyn Roush"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}