{"batchcomplete": "", "query": {"normalized": [{"to": "Siegfried Gottwald", "from": "Siegfried_Gottwald"}], "pages": {"21090353": {"extract": "Siegfried Johannes Gottwald (30 March 1943 – 20 September 2015) was a German mathematician, logician and historian of science.\n\n\n== Life and work ==\nGottwald was born in Limbach, Saxony in 1943. From 1961 to 1966, he studied mathematics at the University of Leipzig, where he was awarded his doctor title in 1969 and his habilitation in 1977.\nHe was tenured professor of non-classical and mathematical logic at University of Leipzig where he taught from 1972 to his retirement in 2008. His main research areas are fuzzy sets and fuzzy methodologies, many-valued logic and history of mathematics.\nHe published several books on many-valued logic, fuzzy sets and their applications, co-authored a textbook on calculus and a reader in the history of logic. He also contributed to the German biographical dictionary of mathematicians, Lexikon berühmter Mathematiker.\nProfessor Gottwald was Vice-Dean of the Faculty of Social Sciences and Philosophy at University of Leipzig for several years. He was married with three children.\n\n\n== Published books ==\nH. Bock, S. Gottwald, R.-P. Mühlig: Zum Sprachgebrauch in der Mathematik. Geest & Portig: Leipzig 1972 and Bagel: Düsseldorf / Vieweg: Braunschweig 1973.\nS. Gottwald, P. Günther, K. Beyer, V. Wünsch: Grundkurs Analysis. Parts 1–4, Math.-Naturwiss. Bibl., Vols. 53–56, Teubner: Leipzig 1972–74.\nK. Berka, S.Gottwald, L. Kreiser, W. Stelzner: Logik-Texte., Akademie-Verlag: Berlin and Wissensch. Buchgesellschaft: Darmstadt 1983.\nS. Gottwald: Mehrwertige Logik. Eine Einführung in Theorie und Anwendungen. Akademie-Verlag: Berlin 1989.\nS. Gottwald, H. Bandemer: Einführung in Fuzzy-Methoden. Theorie und Anwendungen unscharfer Mengen. Akademie-Verlag: Berlin 1989 (WTB Mathematik / Physik, Bd. 305). [also at Verlag Harri Deutsch: Thun – Frankfurt/Main 1990 (Deutsch Taschenbücher, Bd. 73)].\nS. Gottwald: Fuzzy Sets and Fuzzy Logic. Foundations of Application – from a Mathematical Point of View. Vieweg: Braunschweig/Wiesbaden and Teknea: Toulouse, 1993.\nS. Gottwald, H. Bandemer: Fuzzy Sets, Fuzzy Logic, Fuzzy Methods with Applications. John Wiley & Sons: Chichester, 1995.\nS. Gottwald: A Treatise on Many-Valued Logics. Studies in Logic and Computation, vol. 9, Research Studies Press: Baldock, Hertfordshire, England, 2001.\n\n\n== References ==\n\n\n== External links ==\nBiography", "ns": 0, "pageid": 21090353, "title": "Siegfried Gottwald"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}