{"batchcomplete": "", "query": {"normalized": [{"to": "Simone de Beauvoir", "from": "Simone_de_Beauvoir"}], "pages": {"62034": {"extract": "Simone Lucie Ernestine Marie Bertrand de Beauvoir (/də/ /boʊvˈwɑːr/; French pronunciation: [simɔn də bovwaʁ]; 9 January 1908 – 14 April 1986) was a French writer, intellectual, existentialist philosopher, political activist, feminist and social theorist. Though she did not consider herself a philosopher, she had a significant influence on both feminist existentialism and feminist theory.\nDe Beauvoir wrote novels, essays, biographies, autobiography and monographs on philosophy, politics and social issues. She is known for her 1949 treatise The Second Sex, a detailed analysis of women's oppression and a foundational tract of contemporary feminism; and for her novels, including She Came to Stay and The Mandarins. She is also known for her lifelong relationship with French philosopher Jean-Paul Sartre.\n\n\n== Early years ==\n\n\n=== Family ===\nSimone de Beauvoir was born in Paris on 9 January 1908. Her parents were Georges Bertrand de Beauvoir, a legal secretary who once aspired to be an actor, and Françoise de Beauvoir (née Brasseur), a wealthy banker's daughter and devout Catholic. Simone's sister, Hélène, was born two years later. The family struggled to maintain their bourgeois status after losing much of their fortune shortly after World War I, and Françoise insisted that the two daughters be sent to a prestigious convent school. De Beauvoir herself was deeply religious as a child, at one point intending to become a nun. She experienced a crisis of faith at age 14, after which she remained an atheist for the rest of her life.\n\n\n=== Education ===\nDe Beauvoir was intellectually precocious, fueled by her father's encouragement; he reportedly would boast, \"Simone thinks like a man!\" Because of her family's straitened circumstances, de Beauvoir could no longer rely on her dowry, and like other middle-class girls of her age, her marriage opportunities were put at risk. De Beauvoir took this opportunity to do what she always wanted to do while also taking steps to earn a living for herself.\nAfter passing baccalaureate exams in mathematics and philosophy in 1925, she studied mathematics at the Institut Catholique de Paris and literature/languages at the Institut Sainte-Marie. She then studied philosophy at the Sorbonne and after completing her degree in 1928, she wrote her diplôme d'études supérieures (roughly equivalent to an MA thesis) on Leibniz for Léon Brunschvicg (the topic was \"Le concept chez Leibniz\" [\"The Concept in Leibniz\"]). De Beauvoir was only the ninth woman to have received a degree from Sorbonne at the time, due to the fact that French women had only recently been allowed to join higher education.\nDe Beauvoir first worked with Maurice Merleau-Ponty and Claude Lévi-Strauss, when all three completed their practice teaching requirements at the same secondary school. Although not officially enrolled, she sat in on courses at the École Normale Supérieure in preparation for the agrégation in philosophy, a highly competitive postgraduate examination which serves as a national ranking of students. It was while studying for the agrégation that she met École Normale students Jean-Paul Sartre, Paul Nizan, and René Maheu (who gave her the lasting nickname \"Castor\", or beaver). The jury for the agrégation narrowly awarded Sartre first place instead of de Beauvoir, who placed second and, at age 21, was the youngest person ever to pass the exam.\nWriting of her youth in Memoirs of a Dutiful Daughter she said: \"...my father's individualism and pagan ethical standards were in complete contrast to the rigidly moral conventionalism of my mother's teaching. This disequilibrium, which made my life a kind of endless disputation, is the main reason why I became an intellectual.\"\n\n\n== Middle years ==\nFrom 1929 to 1943, De Beauvoir taught at the lycée level until she could support herself solely on the earnings of her writings. She taught at the Lycée Montgrand (Marseille), the Lycée Jeanne-d'Arc (Rouen), the Lycée Molière (Paris) (1936–39).\nDuring October 1929, Jean-Paul Sartre and De Beauvoir became a couple and, after they were confronted by her father, Sartre asked her to marry him. One day while they were sitting on a bench outside the Louvre, he said, \"Let's sign a two-year lease\". Near the end of her life, de Beauvoir said, \"Marriage was impossible. I had no dowry.\" So they entered a lifelong relationship. De Beauvoir chose never to marry and did not set up a joint household with Sartre. She never had children. This gave her time to earn an advanced academic degree, to join political causes, to travel, to write, to teach and to have lovers (both male and female; the latter often shared).[4]\n\nSartre and de Beauvoir always read each other's work. Debate continues about the extent to which they influenced each other in their existentialist works, such as Sartre's Being and Nothingness and de Beauvoir's She Came to Stay. However, recent studies of de Beauvoir's work focus on influences other than Sartre, including Hegel and Leibniz. The Neo-Hegelian revival led by Alexandre Kojève and Jean Hyppolite in the 1930s inspired a whole generation of French thinkers, including Beauvoir and Sartre, to discover Hegel's Phenomenology of Spirit.\n\n\n== Personal life ==\nNigel Rodgers and Mel Thompson in their 2005 book Philosophers Behaving Badly say de Beauvoir had a very turbulent, often scandalous life. Although de Beauvoir had a long time relationship with Sartre, she was known to have a number of female lovers. The nature of some of these relationships, some of which she began with underage students while working as a professor, later led to a biographical controversy. A former student, Bianca Lamblin (originally Bianca Bienenfeld), in her book, Mémoires d'une jeune fille dérangée, wrote that, while she was a student at Lycée Molière, she had been sexually exploited by her teacher de Beauvoir, who was in her thirties at the time. In 1943, de Beauvoir was suspended from her teaching job, due to an accusation that she had, in 1939, seduced her 17-year-old lycée pupil Natalie Sorokine. Sorokine's parents laid formal charges against de Beauvoir for debauching a minor and as a result she had her license to teach in France permanently revoked. She and Jean-Paul Sartre developed a pattern, which they called the “trio,” in which de Beauvoir would seduce her students and then pass them on to Sartre. De Beauvoir and Sartre would both take part in political campaigns to abolish the age of consent laws for sexual relationships in France.\n\n\n== Notable works ==\n\n\n=== She Came to Stay ===\nDe Beauvoir published her first novel She Came to Stay in 1943. It is a fictionalised chronicle of her and Sartre's sexual relationship with Olga Kosakiewicz and Wanda Kosakiewicz. Olga was one of her students in the Rouen secondary school where de Beauvoir taught during the early '30s. She grew fond of Olga. Sartre tried to pursue Olga but she denied him, so he began a relationship with her sister Wanda, instead. Upon his death, Sartre was still supporting Wanda. He also supported Olga for years, until she met and married Jacques-Laurent Bost, de Beauvoir's lover.\nIn the novel, set just before the outbreak of the Second World War, de Beauvoir creates one character from the complex relationships of Olga and Wanda. The fictionalised versions of Beauvoir and Sartre have a ménage à trois with the young woman. The novel also delves into de Beauvoir and Sartre's complex relationship and how it was affected by the ménage à trois.\nDe Beauvoir's metaphysical novel She Came to Stay was followed by many others, including The Blood of Others, which explores the nature of individual responsibility, telling a love story between two young French students participating in the Resistance in World War II.\n\n\n=== Existentialist ethics ===\nIn 1944 de Beauvoir wrote her first philosophical essay, Pyrrhus et Cinéas, a discussion of an existentialist ethics. She continued her exploration of existentialism through her second essay, The Ethics of Ambiguity, (1947); it is perhaps the most accessible entry into French existentialism. Its simplicity keeps it understandable. In the essay, de Beauvoir clears up some inconsistencies that many, Sartre included, have found in major existentialist works such as Being and Nothingness. In The Ethics of Ambiguity, de Beauvoir confronts the existentialist dilemma of absolute freedom vs. the constraints of circumstance.\n\n\n=== Les Temps modernes ===\n\nAt the end of World War II, de Beauvoir and Sartre edited Les Temps modernes, a political journal which Sartre founded along with Maurice Merleau-Ponty and others. De Beauvoir used Les Temps Modernes to promote her own work and explore her ideas on a small scale before fashioning essays and books. De Beauvoir remained an editor until her death.\n\n\n=== Sexuality, existentialist feminism and The Second Sex ===\nThe Second Sex, published in French, sets out a feminist existentialism which prescribes a moral revolution. As an existentialist, de Beauvoir believed that existence precedes essence; hence one is not born a woman, but becomes one. Her analysis focuses on the Hegelian concept of the Other. It is the (social) construction of Woman as the quintessential Other that de Beauvoir identifies as fundamental to women's oppression. The capitalised 'O' in \"other\" indicates the wholly other. De Beauvoir asserted that women are as capable of choice as men, and thus can choose to elevate themselves, moving beyond the 'immanence' to which they were previously resigned and reaching 'transcendence', a position in which one takes responsibility for oneself and the world, where one chooses one's freedom.\nChapters of Le deuxième sexe (translated as The Second Sex) were originally published in Les Temps modernes, in June 1949. The second volume came a few months after the first in France. It was very quickly published in America as The Second Sex, due to the quick translation by Howard Parshley, as prompted by Blanche Knopf, wife of publisher Alfred A. Knopf. Because Parshley had only a basic familiarity with the French language, and a minimal understanding of philosophy (he was a professor of biology at Smith College), much of de Beauvoir's book was mistranslated or inappropriately cut, distorting her intended message. For years Knopf prevented the introduction of a more accurate retranslation of de Beauvoir's work, declining all proposals despite the efforts of existentialist scholars. Only in 2009 was there a second translation, to mark the 60th anniversary of the original publication. Constance Borde and Sheila Malovany-Chevallier produced the first integral translation in 2010, reinstating a third of the original work.\nDe Beauvoir anticipated the sexually charged feminism of Erica Jong and Germaine Greer.\nIn the chapter \"Woman: Myth and Reality\" of The Second Sex, de Beauvoir argued that men had made women the \"Other\" in society by application of a false aura of \"mystery\" around them. She argued that men used this as an excuse not to understand women or their problems and not to help them, and that this stereotyping was always done in societies by the group higher in the hierarchy to the group lower in the hierarchy. She wrote that a similar kind of oppression by hierarchy also happened in other categories of identity, such as race, class and religion, but she claimed that it was nowhere more true than with gender in which men stereotyped women and used it as an excuse to organize society into a patriarchy.\nWomen who do not follow the domestic norm are looked down upon in society. Beauvoir is explaining that woman referred as “the other.” She states, “What is a woman?’ […] The fact that I ask it is in itself significant. A man would never get the notion of writing a book on the peculiar situation of the human male. But if I wish to define myself, I must first of all say: ‘I am a woman’; on this truth must be based all further discussion. A man never begins by presenting himself as an individual of a certain sex; it goes without saying that he is a man. […] It would be out of the question to reply: ‘And you think the contrary because you are a man,’ for it is understood that the fact of being a man is no peculiarity.” (34-5) As for man there is no need to define what is to be a man, there is no reason because they identified themselves as the superior part. Man represents both “the positive and the neutral,” which doesn’t need to be explained or defined, and it is self-explanatory. “Thus humanity is male and man defines woman not in relation to herself but as relative to him; she is not regarded as an autonomous being.” (35) Men are the default setting and women are considered a recessive gender. “He is the Subject, he is the Absolute—she is the Other.” (35) It is like an asymmetrical comparison, but masculine and feminine aren’t asymmetrical. De Beauvoir defines women as the “Second sex” because women are defined in relation to men. Aristotle referred that women are “female by virtue of a certain lack of qualities.” De Beauvoir also points out that St. Thomas referred to the woman as the “imperfect man\", the \"incidental” being.\n“Are there woman, really? Most assuredly the theory of the eternal feminine still has its adherents who will whisper in your ear: ‘Even in Russia women are still women’; and other erudite persons—sometimes the very same—say with a sigh, ‘Woman is losing her way, woman is lost.’” (34) De Beauvoir refers, to the “eternal feminine,” it can be what define some kind of spiritual being that connect all women to each other.\nDe Beauvoir argued that women have historically been considered deviant, abnormal. She said that even Mary Wollstonecraft considered men to be the ideal toward which women should aspire. De Beauvoir said that this attitude limited women's success by maintaining the perception that they were a deviation from the normal, and were always outsiders attempting to emulate \"normality\". She believed that for feminism to move forward, this assumption must be set aside.\nKey concepts of the 1970s feminist movement related directly to the ideas concerning gender as a social construct presented in de Beauvoir's The Second Sex\". Despite her contributions to the feminist movement, especially the French Women's Liberation Movement, and her beliefs in women's economic independence and equal education, de Beauvoir was initially reluctant to call herself a feminist. However, after observing the resurgence of the feminist movement in the late 1960s and early 1970s, de Beauvoir stated she no longer believed a socialist revolution to be sufficient enough to bring about women's liberation. She publicly declared herself a feminist in 1972, in an interview with Le Nouvel Observateur.\n\n\n=== The Mandarins ===\nPublished in 1954, The Mandarins is set just after the end of World War II and won her France's highest literary prize, the Prix Goncourt. The book follows the personal lives of philosophers and friends among Sartre's and de Beauvoir's intimate circle, including her relationship with American writer Nelson Algren, to whom the book was dedicated. Algren was outraged by the frank way de Beauvoir described their sexual experiences in both The Mandarins and her autobiographies.\n\nAlgren vented his outrage when reviewing American translations of de Beauvoir's work. Much material bearing on this episode in de Beauvoir's life, including her love letters to Algren, entered the public domain only after her death.\n\n\n== Later years ==\n\nDe Beauvoir wrote popular travel diaries about time spent in the United States and China and published essays and fiction rigorously, especially throughout the 1950s and 1960s. She published several volumes of short stories, including The Woman Destroyed, which, like some of her other later work, deals with aging.\n1980 saw the publication of When Things of the Spirit Come First, a set of short stories centred around and based upon women important to her earlier years. Though written long before the novel She Came to Stay, de Beauvoir did not at the time consider the stories worth publishing, allowing some forty years to pass before doing so.\nSartre and Merleau-Ponty had a longstanding feud, which led Merleau-Ponty to leave Les Temps Modernes. De Beauvoir sided with Sartre and ceased to associate with Merleau-Ponty. In de Beauvoir's later years, she hosted the journal's editorial meetings in her flat and contributed more than Sartre, whom she often had to force to offer his opinions.\nDe Beauvoir also notably wrote a four-volume autobiography, consisting of: Memoirs of a Dutiful Daughter; The Prime of Life; Force of Circumstance (sometimes published in two volumes in English translation: After the War and Hard Times); and All Said and Done.\nIn the 1970s de Beauvoir became active in France's women's liberation movement. She wrote and signed the Manifesto of the 343 in 1971, a manifesto that included a list of famous women who claimed to have had an abortion, then illegal in France. Some argue most of the women had not had abortions, including Beauvoir, but given the secrecy surrounding the issue, this cannot be known. Signatories were diverse as Catherine Deneuve, Delphine Seyrig and de Beauvoir's sister Poupette. In 1974, abortion was legalised in France.\nHer 1970 long essay La Vieillesse (The Coming of Age) is a rare instance of an intellectual meditation on the decline and solitude all humans experience if they do not die before about the age of 60.\nIn an interview with Betty Friedan, de Beauvoir said: \"No, we don’t believe that any woman should have this choice. No woman should be authorised to stay at home to bring up her children. Society should be totally different. Women should not have that choice, precisely because if there is such a choice, too many women will make that one. It is a way of forcing women in a certain direction.\"\nIn about 1976 de Beauvoir and Sylvie Le Bon made a trip to New York City in the USA to visit Kate Millett on her farm.\n\nIn 1981 she wrote La Cérémonie Des Adieux (A Farewell to Sartre), a painful account of Sartre's last years. In the opening of Adieux, de Beauvoir notes that it is the only major published work of hers which Sartre did not read before its publication.\nShe contributed the piece \"Feminism - alive, well, and in constant danger\" to the 1984 anthology Sisterhood Is Global: The International Women's Movement Anthology, edited by Robin Morgan.\nAfter Sartre died in 1980, de Beauvoir published his letters to her with edits to spare the feelings of people in their circle who were still living. After de Beauvoir's death, Sartre's adopted daughter and literary heir Arlette Elkaïm would not let many of Sartre's letters be published in unedited form. Most of Sartre's letters available today have de Beauvoir's edits, which include a few omissions but mostly the use of pseudonyms. De Beauvoir's adopted daughter and literary heir Sylvie Le Bon, unlike Elkaïm, published de Beauvoir's unedited letters to both Sartre and Algren.\nDe Beauvoir died of pneumonia in Paris, aged 78. She is buried next to Sartre at the Cimetière du Montparnasse in Paris.\n\n\n== Prizes ==\nPrix Goncourt, 1954\nJerusalem Prize, 1975\nAustrian State Prize for European Literature, 1978\n\n\n== Works ==\n\n\n=== List of publications (non-exhaustive) ===\nL'Invitée (1943) (English – She Came to Stay) [novel]\nPyrrhus et Cinéas (1944) [nonfiction]\nLe Sang des autres (1945) (English – The Blood of Others) [novel]\nWho Shall Die? (1945)\nTous les hommes sont mortels (1946) (English – All Men Are Mortal) [novel]\nPour une morale de l'ambiguïté (1947) (English – The Ethics of Ambiguity) [nonfiction]\nLe Deuxième Sexe (1949) (English – The Second Sex) [nonfiction]\nL'Amérique au jour le jour (1954) (English – America Day by Day)\nLes Mandarins (1954) (English - The Mandarins) [novel]\nMust We Burn Sade? (1955)\nThe Long March (1957) [nonfiction]\nMemoirs of a Dutiful Daughter (1958)\nThe Prime of Life (1960)\nForce of Circumstance (1963)\nA Very Easy Death (1964)\nLes Belles Images (1966) [novel]\nThe Woman Destroyed (1967) [novel]\nThe Coming of Age (1970) [nonfiction]\nAll Said and Done (1972)\nWhen Things of the Spirit Come First (1979) [novel]\nAdieux: A Farewell to Sartre (1981)\nLetters to Sartre (1990)\nJournal de guerre, Sept 1939–Jan 1941 (1990); English - Wartime Diary (2009)\nA Transatlantic Love Affair: Letters to Nelson Algren (1998)\nDiary of a Philosophy Student, 1926–27 (2006)\nCahiers de jeunesse, 1926–1930 (2008)\n\n\n=== Selected translations ===\nPatrick O'Brian was de Beauvoir's principal English translator, until he attained commercial success as a novelist.\nBeauvoir, Simone (1997), \"\"Introduction\" to The Second Sex\", in Nicholson, Linda, The second wave: a reader in feminist theory, New York: Routledge, pp. 11–18, ISBN 9780415917612. \nPhilosophical Writings (Urbana : University of Illinois Press, 2004, edited by Margaret A. Simons et al.) contains a selection of essays by de Beauvoir translated for the first time into English. Among those are: Pyrrhus and Cineas, discussing the futility or utility of action, two previously unpublished chapters from her novel She Came to Stay and an introduction to Ethics of Ambiguity.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Sources ==\nAppignanesi, Lisa, 2005, Simone de Beauvoir, London: Haus, ISBN 1-904950-09-4\nBair, Deirdre, 1990. Simone de Beauvoir: A Biography. New York: Summit Books, ISBN 0-671-60681-6\nRowley, Hazel, 2005. Tête-a-Tête: Simone de Beauvoir and Jean-Paul Sartre. New York: HarperCollins.\nSuzanne Lilar, 1969. Le Malentendu du Deuxième Sexe (with collaboration of Prof. Dreyfus). Paris, University Presses of France (Presses Universitaires de France).\nFraser, M., 1999. Identity Without Selfhood: Simone de Beauvoir and Bisexuality, Cambridge and New York: Cambridge University Press.\nAxel Madsen, Hearts and Minds: The Common Journey of Simone de Beauvoir and Jean-Paul Sartre, William Morrow & Co, 1977.\nHélène Rouch, 2001–2002, Trois conceptions du sexe: Simone de Beauvoir entre Adrienne Sahuqué et Suzanne Lilar, Simone de Beauvoir Studies, n° 18, pp. 49–60.\nSeymour-Jones, Carole (2008). A Dangerous Liaison. Arrow Books. ISBN 978-0-09-948169-0. \nSimone de Beauvoir, Marguerite Yourcenar, Nathalie Sarraute, 2002. Conférence Élisabeth Badinter, Jacques Lassalle & Lucette Finas, ISBN 2717722203.\n\n\n=== Bibliographic sources ===\nBeauvoir, Simone de. Woman: Myth & Reality\nin Jacobus, Lee A. (ed.). A World of Ideas. Bedford/St. Martins, Boston 2006. 780–795.\nin Prince, Althea, and Susan Silva Wayne. Feminisms and Womanisms: A Women's Studies Reader. Women's Press, Toronto 2004 p. 59–65.\n\n\n== Further reading ==\n\"Le Malentendu du Deuxième Sexe\", by Suzanne Lilar, 1969\n\"Feminist theory & Simone de Beauvoir,\" by Toril Moi, 1990\nde Beauvoir, Simone (2005), \"Introduction from The Second Sex\", in Cudd, Ann E.; Andreasen, Robin O., Feminist theory: a philosophical anthology, Oxford, UK Malden, Massachusetts: Blackwell Publishing, pp. 27–36, ISBN 9781405116619. \n\n\n== External links ==\nBergoffen, Debra. \"Simone de Beauvoir\". Stanford Encyclopedia of Philosophy. \n\"Simone de Beauvoir\". Internet Encyclopedia of Philosophy. \nWorks by or about Simone de Beauvoir at Internet Archive\nMadeleine Gobeil (Spring–Summer 1965). \"Simone de Beauvoir, The Art of Fiction No. 35\". Paris Review. \nGuardian Books \"Author Page\", with profile and links to further articles.\nPetri Liukkonen. \"Simone de Beauvoir\". Books and Writers (kirjasto.sci.fi). Archived from the original on 4 July 2013.\nVictoria Brittain et al discuss Simone de Beauvoir's lasting influence, ICA 1989\nMim Udovitch – a contributing editor for Esquire (6 December 1988). \"Hot and Epistolary: 'Letters to Nelson Algren', by Simone de Beauvoir\". The New York Times. Retrieved 9 June 2012. \nLouis Menand (26 September 2005). \"Stand By Your Man: The strange liaison of Sartre and Beauvoir (Book review of the republished The Second Sex by Simone de Beauvoir)\". newyorker.com. Retrieved 9 June 2012. \nMurray, Jenni (22 January 2008). \"Simone de Beauvoir\". Woman's Hour. BBC Radio 4. \n\"Simone De Beauvoir\", Great Lives, BBC Radio 4, 22 April 2011", "ns": 0, "pageid": 62034, "title": "Simone de Beauvoir"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}