{"batchcomplete": "", "query": {"normalized": [{"to": "Simplicius of Cilicia", "from": "Simplicius_of_Cilicia"}], "pages": {"80442": {"extract": "Simplicius of Cilicia (/sɪmˈplɪʃiəs/; Greek: Σιμπλίκιος; c. 490 – c. 560) was a disciple of Ammonius Hermiae and Damascius, and was one of the last of the Neoplatonists. He was among the pagan philosophers persecuted by Justinian in the early 6th century, and was forced for a time to seek refuge in the Persian court, before being allowed back into the empire. He wrote extensively on the works of Aristotle. Although his writings are all commentaries on Aristotle and other authors, rather than original compositions, his intelligent and prodigious learning makes him the last great philosopher of pagan antiquity. His works have preserved much information about earlier philosophers which would have otherwise been lost.\n\n\n== Life ==\nSimplicius was a disciple of Ammonius Hermiae, and Damascius, and was consequently one of the last members of the Neoplatonist school. The school had its headquarters in Athens. It became the centre of the last efforts to maintain Hellenistic religion against the encroachments of Christianity. Imperial edicts enacted in the 5th century against paganism gave legal protection to pagans against personal maltreatment. In the year 528 the emperor Justinian ordered that pagans should be removed from government posts. Some were robbed of their property, some put to death. The order specified that if they did not within three months convert to Christianity, they were to be banished from the Empire. In addition, it was forbidden any longer to teach philosophy and jurisprudence in Athens. Probably also the property of the Platonist school, which in the time of Proclus was valued at more than 1000 gold pieces, was confiscated; at least, Justinian deprived the physicians and teachers of the liberal arts of the provision-money which had been assigned to them by previous emperors, and confiscated funds which the citizens had provided for spectacles and other civic purposes.\nSeven philosophers, among whom were Simplicius, Eulamius, Priscian, and others, with Damascius, the last president of the Platonist school in Athens at their head, resolved to seek protection at the court of the famous Persian king Chosroes, who had succeeded to the throne in 531. But they were disappointed in their hopes. Chosroes, in a peace treaty concluded with Justinian c. 533 stipulated that the philosophers should be allowed to return without risk and to practise their rites, after which they returned. Of the subsequent fortunes of the seven philosophers we learn nothing.\nWe know little about where Simplicius lived and taught. That he not only wrote, but taught, is proved by the address to his hearers in the commentary on the Physica Auscultatio of Aristotle, as well as by the title of his commentary on the Categories. He had received his training partly in Alexandria, under Ammonius, partly in Athens, as a disciple of Damascius; and it was probably in one of these two cities that he subsequently took up his abode; for, with the exception of these cities and Constantinople, it would have been difficult to find a town which possessed the collections of books he needed, and he is unlikely to have gone to Constantinople. As to his personal history, especially his migration to Persia, no definite allusions are to be found in the writings of Simplicius. Only at the end of his explanation of the treatise of Epictetus, Simplicius mentions, with gratitude, the consolation which he had found under tyrannical oppression in such ethical contemplations; which might suggest that it was composed during, or immediately after, the above-mentioned persecutions.\n\n\n== Writings ==\n\nThe works which have survived are his commentaries upon Aristotle's de Caelo, Physica Auscultatio, and Categories, as well as a commentary upon the Enchiridion of Epictetus. There is also a commentary on Aristotle's de Anima under his name, but it is stylistically inferior and lacks the breadth of historical information usually used by Simplicius. It has been suggested that it was written by Priscian of Lydia, but other scholars see it as authentic.\nThe commentary on de Caelo was written before that on the Physica Auscultatio, and probably not in Alexandria, since he mentions in it an astronomical observation made during his stay in that city by Ammonius. Simplicius wrote his commentary on the Physica Auscultatio after the death of Damascius, and therefore after his return from Persia. When it was that he wrote his explanations of the Categories, whether before or after those on the above-mentioned Aristotelian treatises, it is impossible to ascertain. Besides these commentaries of Simplicius which have been preserved, the de Anima commentary mentions explanations on the metaphysical books, and an epitome of the Physica of Theophrastus.\nSimplicius, as a Neoplatonist, endeavoured to show that Aristotle agrees with Plato even on those points which he controverts, so that he may lead the way to their deeper, hidden meaning. In his view not only Plotinus, but also Syrianus, Proclus, and Ammonius, are great philosophers, who have penetrated into the depths of the wisdom of Plato. Many of the more ancient Greek philosophers he also brings into a connection with Platonism. He is, however distinguished from his predecessors, whom he so admires, in making less frequent application of Orphic, Hermetic, Chaldean, and other Theologumena of the East; partly in proceeding carefully and modestly in the explanation and criticism of particular points, and in striving with diligence to draw from the original sources a thorough knowledge of the older Greek philosophy. His commentaries can, therefore, be regarded as the richest in their contents of any that have come down to us concerning Aristotle. But for them, we should be without the most important fragments of the writings of the Eleatics, of Empedocles, Anaxagoras, Diogenes of Apollonia, and others, which were at that time already very scarce, as well as without many extracts from the lost books of Aristotle, Theophrastus and Eudemus: but for them we should hardly be able to unriddle the doctrine of the Categories, so important for the system of the Stoics. It is true he himself complains that in his time both the school and the writings of the followers of Zeno had perished. But where he cannot draw immediately from the original sources, he looks round for guides whom he can depend upon, who had made use of those sources. In addition, we have to thank him for such copious quotations from the Greek commentaries from the time of Andronicus of Rhodes down to Ammonius and Damascius, that, for the Categories and the Physics, the outlines of a history of the interpretation and criticism of those books may be composed. With a correct idea of their importance, Simplicius made the most diligent use of the commentaries of Alexander of Aphrodisias and Porphyry; and although he often enough combats the views of the former, he knew how to value, as it deserved, his (in the main) sound critical sense. He has also preserved for us intelligence of several more ancient readings, which now, in part, have vanished from the manuscripts without leaving any trace, and in the paraphrastic sections of his interpretations furnishes us with valuable contributions for correcting or settling the text of Aristotle. Not less valuable are the contributions towards a knowledge of the ancient astronomical systems for which we have to thank him in his commentary on the books de Caelo. We even find in his writings some traces of a disposition for the observation of nature.\nAlthough averse to Christianity he abstains from assailing Christian doctrines, even when he combats expressly the work of his contemporary, John Philoponus, directed against the Aristotelian doctrine of the eternity of the universe. In Ethics he seems to have abandoned the mystical pantheistic purification-theory of the Neoplatonists, and to have found full satisfaction in the ethical system of the later Stoics, however little he was disposed towards their logical and physical doctrines.\nWhile some sources attribute to Simplicius the coining of the phrase πάντα ῥεῖ (panta rhei), meaning \"everything flows/is in a state of flux\", to characterize the concept in the philosophy of Heraclitus, the essential phrasing \"everything changes\" and variations on it, in contexts where Heraclitus's thought is being alluded to, was current in both Plato and Aristotle's writings.\n\n\n== Works in English translation ==\n\n\n=== On Aristotle's Categories ===\nSimplicius: On Aristotle, Categories 1-4, translated by Michael Chase (2003). Cornell University Press: ISBN 0-8014-4101-3, and Duckworth, London: ISBN 0-7156-3197-7\nSimplicius: On Aristotle, Categories 5-6, translated by Frans A.J. de Haas and Barrie Fleet (2001). Cornell University Press: ISBN 0-8014-3838-1, and Duckworth, London: ISBN 0-7156-3037-7\nSimplicius: On Aristotle, Categories 7-8, translated by Barrie Fleet (2002). Cornell University Press: ISBN 0-8014-3839-X, and Duckworth, London: ISBN 0-7156-3038-5\nSimplicius: On Aristotle, Categories 9-15, translated by Richard Gaskin (2000). Cornell University Press: ISBN 0-8014-3691-5, and Duckworth, London: ISBN 0-7156-2900-X\n\n\n=== On Aristotle's On the Heavens ===\nSimplicius: On Aristotle, On the Heavens 1.1-4, translated by Robert J. Hankinson (2001). Cornell University Press: ISBN 0-8014-3907-8, and Duckworth, London: ISBN 0-7156-3070-9\nSimplicius: On Aristotle, On the Heavens 1.3-4, translated by Ian Mueller (2011). Duckworth, London: ISBN 0-7156-4063-1\nSimplicius: On Aristotle, On the Heavens 1.5-9, translated by Robert J. Hankinson (2004). Cornell University Press: ISBN 0-8014-4212-5, and Duckworth, London: ISBN 0-7156-3231-0\nSimplicius: On Aristotle, On the Heavens 1.10-12, translated by Robert J. Hankinson (2006). Cornell University Press: ISBN 0-8014-4216-8, and Duckworth, London: ISBN 0-7156-3232-9\nSimplicius: On Aristotle, On the Heavens 2.1-9, translated by Ian Mueller (2004). Cornell University Press: ISBN 0-8014-4102-1, and Duckworth, London: ISBN 0-7156-3200-0\nSimplicius: On Aristotle, On the Heavens 2.10-14, translated by Ian Mueller (2005). Cornell University Press: ISBN 0-8014-4415-2, and Duckworth, London: ISBN 0-7156-3342-2\nSimplicius: On Aristotle, On the Heavens 3.1-7, translated by Ian Mueller (2009). Duckworth, London: ISBN 0-7156-3843-2\nSimplicius: On Aristotle, On the Heavens 3.7-4.6, translated by Ian Mueller (2009). Duckworth, London: ISBN 0-7156-3844-0\n\n\n=== On Aristotle's Physics ===\nSimplicius: On Aristotle, Physics 1.3-4, translated by Pamela M. Huby and C. C. W. Taylor (2011). Duckworth, London: ISBN 0-7156-3921-8\nSimplicius: On Aristotle, Physics 1.5-9, translated by Han Baltussen (2011). Duckworth, London: ISBN 0-7156-3857-2\nSimplicius: On Aristotle, Physics 2, translated by Barrie Fleet (1997). Cornell University Press: ISBN 0-8014-3283-9, and Duckworth, London: ISBN 0-7156-2732-5\nSimplicius: On Aristotle, Physics 3, translated by James O. Urmson (2002). Cornell University Press: ISBN 0-8014-3903-5, and Duckworth, London: ISBN 0-7156-3067-9\nSimplicius: On Aristotle, Physics 4.1-5, 10-14, translated by James O. Urmson (1992). Cornell University Press: ISBN 0-8014-2817-3, and Duckworth, London: ISBN 0-7156-2434-2\nSimplicius: On Aristotle, Physics 5, translated by James O. Urmson (1997). Cornell University Press: ISBN 0-8014-3407-6, and Duckworth, London: ISBN 0-7156-2765-1\nSimplicius: On Aristotle, Physics 6, translated by David Konstan (1989). Cornell University Press: ISBN 0-8014-2238-8, and Duckworth, London: ISBN 0-7156-2217-X\nSimplicius: On Aristotle, Physics 7, translated by Charles Hagen (1994). Cornell University Press: ISBN 0-8014-2992-7, and Duckworth, London: ISBN 0-7156-2485-7\nSimplicius: On Aristotle, Physics 8.6-10, translated by Richard McKirahan (2001). Cornell University Press: ISBN 0-8014-3787-3, and Duckworth, London: ISBN 0-7156-3039-3\n\n\n=== On Aristotle's On the Soul ===\nSimplicius: On Aristotle, On the Soul 1.1-2.4, translated by James O. Urmson (1995). Cornell University Press: ISBN 0-8014-3160-3, and Duckworth, London: ISBN 0-7156-2614-0\nPriscian: On Theophrastus on Sense-Perception, with \"Simplicius\": On Aristotle, On the Soul 2.5-12, translated by Carlos Steel (1997). Cornell University Press: ISBN 0-8014-3282-0, and Duckworth, London: ISBN 0-7156-2752-X\n\"Simplicius\": On Aristotle, On the Soul 3.1-5, translated by Henry J. Blumenthal (2000). Cornell University Press: ISBN 0-8014-3687-7, and Duckworth, London: ISBN 0-7156-2896-8\n\n\n=== On Epictetus' Handbook ===\nSimplicius: On Epictetus, Handbook 1-26, translated by Tad Brennan and Charles Brittain (2002). Cornell University Press: ISBN 0-8014-3904-3, and Duckworth, London: ISBN 0-7156-3068-7\nSimplicius: On Epictetus, Handbook 27-53, translated by Tad Brennan and Charles Brittain (2002). Cornell University Press: ISBN 0-8014-3905-1, and Duckworth, London: ISBN 0-7156-3069-5\n\n\n=== Other works ===\nSimplicius: Corollaries on Place and Time, translated by James O. Urmson (1992). Cornell University Press: ISBN 0-8014-2713-4, and Duckworth, London: ISBN 0-7156-2252-8\nPhiloponus: Corollaries on Place and Void, with Simplicius: Against Philoponus On the Eternity of the World, translated by David Furley and Christian Wildberg (1991). Cornell University Press: ISBN 0-8014-2634-0, and Duckworth, London: ISBN 0-7156-2250-1\nPhiloponus: On Aristotle, Physics 5-8, with Simplicius: On Aristotle on the Void, translated by Paul Lettinck and J. O. Urmson (1994). Cornell University Press: ISBN 0-8014-3005-4, and Duckworth, London: ISBN 0-7156-2493-8\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Smith, William, ed. (1870). \"Simplicius\". Dictionary of Greek and Roman Biography and Mythology. \nBarnes, Jonathan (1982). The Presocratic Philosophers [Revised Edition]. London & New York: Routledge Taylor & Francis Group. ISBN 0-415-05079-0. \n\n\n== Further reading ==\nIlsetraut Hadot (ed.), Simplicius, sa vie, son œuvre, sa survie. Actes du Colloque international de Paris (28 septembre - 1 octobre 1985) / organised by the Centre de recherche sur les œuvres et la pensée de Simplicius (RCP 739-CNRS), Berlin & New York, Walter de Gruyter, 1987, X-406 p. ISBN 3-11-010924-7\nIlsetraut Hadot: The life and work of Simplicius in Greek and Arabic sources. In: Richard Sorabji (Ed.): Aristotle Transformed. Duckworth, London 1990, pp. 275–303. ISBN 0-7156-2254-4\nHan Baltussen: Philosophy and Exegesis in Simplicius. The methodology of a commentator. Duckworth, London 2008, 292 p. ISBN 978-0-7156-3500-1\n\n\n== External links ==\nSimplicius, Commentary on the Enchiridion of Epictetus, translated by George Stanhope, 1722\nFalcon, Andrea. \"Commentators on Aristotle\". Stanford Encyclopedia of Philosophy. \nExtract from Taylor's translation of Aristotle's Physics with Simplicius' Commentary", "ns": 0, "pageid": 80442, "title": "Simplicius of Cilicia"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}