{"batchcomplete": "", "query": {"normalized": [{"to": "Sol Garfunkel", "from": "Sol_Garfunkel"}], "pages": {"5233980": {"extract": "Solomon \"Sol\" Garfunkel born 1943, in Brooklyn, New York, is an American mathematician who has dedicated his career to mathematics education. Since 1980, he has served as the executive director of the award winning non-profit organization \"Consortium for Mathematics and Its Applications\", working with teachers, students, and business people to create learning environments where mathematics is used to investigate and model real issues in our world.\nGarfunkel is best known for hosting the 1987 PBS series titled \"For All Practical Purposes: An Introduction to Contemporary Mathematics\", followed by the 1991 series, \"Algebra: In Simplest Terms\", both often used in classrooms.\nAt the age of 24, Garfunkel received his PhD in Mathematical Logic from the University of Wisconsin–Madison. While in attendance he worked with Howard Jerome Keisler, Michael D. Morley, and Stephen Kleene. Garfunkel then worked at Cornell University and the University of Connecticut at Storrs.\nGarfunkel continued his work advocating for the improvement of mathematics in public school systems. He coauthored the article \"How to Fix Our Math Education\" with David Mumford, emeritus professor of mathematics at Brown University. Since published, this article has been credited with successfully bringing new awareness to the topic. The article has become a topic for a vast number of blogs, and has been translated into several languages. Garfunkel has served as project director for several National Science Foundation curriculum projects, and in 2009 was awarded the Glenn Gilbert National Leadership Award from the National Council of Supervisors of Mathematics.\nMost recently, Garfunkel co-founded the International Mathematical Modeling Challenge.\n\n\n== References ==\n\n\n== External links ==\nhttp://itech.fgcu.edu/faculty/fmaa/1998program/plenary.html\nhttp://www.comap.com/product/?idx=746 For All Practical Purposes hosted by Sol\nhttp://www.learner.org/resources/series66.html Algebra Video Course hosted by Sol", "ns": 0, "pageid": 5233980, "title": "Sol Garfunkel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}