{"batchcomplete": "", "query": {"normalized": [{"to": "Solomon Passy", "from": "Solomon_Passy"}], "pages": {"924723": {"extract": "Solomon Isaac Passy (Bulgarian: Соломон Исак Паси) (born December 22, 1956) is a Bulgarian scientist, statesman, and innovator, founder and President of the Atlantic Club of Bulgaria (since 1990), Foreign Minister in the Government of King Simeon II (2001-2005), Chairman-in-Office of the Organization for Security and Co-operation in Europe (OSCE) in 2004. He represented Bulgaria at UN Security Council and was its Chairman (September 2002 and December 2003), and was nominated by Bulgaria for Secretary General of NATO (2009).\nAs Foreign Minister he negotiated and signed Bulgaria's accessions to NATO (2004) and EU (2005) - projects which he initiated as Member of Parliament back in 1990.\nPassy served as Chairman of the Parliamentary Committees on Foreign Affairs (2005-2009) and Foreign Affairs, Defense and Security (2001). He was a Member of Parliament in three legislations (1990-1991, 2001-2005, 2005–2009) and the first CEE Vice-President of the Atlantic Treaty Association (ATA), Paris (1996-1999) and Chair of the Transparency and Accountability Committee of the Parliamentary Assembly of OSCE (2006-2009).\nIn the 1980s Passy was active in anti-establishment and pro-democratic movements. He holds a Ph.D., entitling him to the honorific title Dr Passy, and was a computer scientist at Sofia University and the Bulgarian Academy of Sciences (1979-1994). Passy and his wife Gergana are co-authors of the EU Universal USB charger for GSM (2008-2014) and he is a pioneer of Bulgaria's Antarctic presence and membership in the Antarctic Treaty.\n\n\n== Summary ==\nSolomon Passy was born in Plovdiv. He is the son of Bulgarian philosopher Prof. Isaac Passy and physician, inventor and endocrinologist Lily Passy. He is a mathematician and holds a Ph.D. (1985) in Mathematical Logic and Computer Science from Sofia University. In the 1980s he was involved in the dissident movements opposing the communist regime. In 1990 Passy became the founding President and CEO of the Atlantic Club of Bulgaria (ACB), the only NGO operating within Warsaw Pact countries vocally advocating its dissolution, and the accession of New Europe to NATO and the EU. He also co-founded the Green Party serving as its spokesman (1989), the Union of Democratic Forces (1989), the Club for Support of Glasnost and Perestroika of Zhelyu Zhelev (1989), as well as the National Movement Simeon II (2001).\n\n\n== Atlantic and European integration ==\nIn August 1990 Passy, as a Member of Parliament, appealed to the Grand National Assembly and drafted the Parliamentary Bill for the withdrawal from the Warsaw Pact and Bulgaria's accession to NATO.\nPassy and others founded the ACB, which was succeeded by dozens of other Atlantic NGOs in Central and Eastern Europe (CEE), Asia, and Africa. The logo of the Atlantic Club – the NATO compass rose encircled by the 12 EU stars – became the symbol of unity of the Euro-Atlantic area adopted by number of the emerging Atlantic NGOs.\nIn November 1990 the future ACB founders led by Passy made the first visit of an East European delegation to NATO HQ by invitation of NATO SG Manfred Wörner and the US Permanent Representative to NATO Ambassador William Taft IV, who supported the Bulgarian idea to establish ACB on a Warsaw Pact territory. Subsequently, the Bulgarian know-how was replicated in a joint statement by US Secretary of State James Baker and the Foreign Minister of Germany Hans-Dietrich Genscher in May 1991 who advocated the creation of Atlantic councils in other Warsaw Pact countries.\nIn June 1991 NATO SG Manfred Wörner agreed to be \"kidnapped\" in Sofia by Solomon Passy in his East German car Trabant. Manfred Wörner became a supporter of ACB and personally endorsed in 1992 ACB's accession as first CEE member of ATA. ACB erected a monument in Sofia of him in 1996, which was inaugurated by his successor Javier Solana.\nFor 14 years Solomon Passy worked on Bulgaria's membership of NATO, which was finalized on April 2, 2004 when Minister Passy raised the Bulgarian flag over NATO HQ in Brussels.\nPassy co-authored the bill concerning Bulgaria’s membership in the EU, adopted by the Grand National Assembly in December 1990. He signed as Foreign Minister the EU Accession Treaty of Bulgaria was signed on April 25, 2005. The Bulgarian Cyrillic alphabet was adopted as the third official EU alphabet.\nIn September 1990 Passy became co-author of the draft of the Parliamentary Bill for Bulgaria's participation in the US-led coalition that liberated Kuwait from Saddam Hussein's occupation.\nPassy proposed in 2003 the creation of joint US-Bulgarian defense facilities in Bulgaria - a project he ratified in 2006 as Chairman of the Foreign Affairs Parliamentary Committee.\n\n\n== Global affairs ==\nIn 2001 Bulgaria was elected for rotational member of the UN Security Council (2002-2003); Passy represented Bulgaria on UNSC and chaired the Council in September 2002 and December 2003.\nIn 2004 Passy became the OSCE Chairman-in-Office. During his chairmanship the frozen conflict in Ajaria (Georgia) was solved, and Mongolia joined OSCE network.\nPassy, Joschka Fischer, and Colin Powell hosted the OSCE Berlin Conference on Antisemitism (April 2004).\nWhile Passy was part of King Simeon's Government, constructive and pragmatic relations with Russia were formed, following 45 years of de facto Soviet occupation of Bulgaria. Bilateral relations with China were refreshed and the Bulgarian diplomatic network with the Arab countries restored.\nSee also: Dr. Solomon Passy and China, Dr. Solomon Passy: Central Asia, Caucasus and Post-Soviet Space (as CiO of the OSCE – 2004), and Memorandum about Relationships between the Holy See and the Atlantic Club of Bulgaria.\n\n\n== Mediation and diplomatic action ==\nAs Minister, Passy was responsible for the strategy of the EU-US-BG negotiating Troika with Libya’s dictator col. Gaddafi for the successful release (July 2007) of six Bulgarian medics held by Libya as hostages in 1999.\nOn behalf of the Western Allies Passy, as MP, undertook successful mediation missions in North Korea (July–August 2007), which eventually contributed to the destruction of the cooling tower for heavy water at the Yongbyon Nuclear Scientific Research Center (North Korea) - agreed upon the Six-Party Talks in September 27–30, 2007 - and to Summit meeting between North and South Korea. He mediated for the release of US citizen collaborators of George Soros detained in Iran in May 2007.\nIn 2007 Passy assumed a one-year assignment as an advisor to the Macedonian Government on NATO accession. In 2008 the Bucharest Summit of NATO agreed on Macedonia's membership of NATO, conditional on resolving the bilateral dispute with Greece.\nIn 2008 the government of Bulgaria nominated Solomon for Secretary General of NATO.\n\n\n== Globalization of Bulgaria ==\nACB is the first non-NATO NGO invited to join the Atlantic Treaty Association, in 1992. Passy is the first non-NATO Vice-President of ATA (1996-1999). Bulgaria is the first non-NATO member state to host an ATA General Assembly (1997).\nPassy and ACB in November 1994, invited Pope John Paul II to Bulgaria. The visit, the first papal visit to Bulgaria, took place in 2002 when Passy was Foreign Minister; the Pope announced in Sofia that Bulgaria – contrary to widespread allegations — had not been involved in the 1981 attempt to assassinate the Pope.\nPassy co-chaired the host committee of the ACB-Tibetan Friendship Society for the visit to Bulgaria of the XIV Dalai Lama of Tibet in October 1991.\nPassy's ACB hosted Ecumenical Patriarch Bartholomew in 1993, subsequent dialogue between the Bulgarian Orthodox Church and the Vatican eventually made the Bulgarian visit of Pope John Paul II possible.\nIn 1999 Passy became co-chair of the Host Committee for the first US presidential visit to Bulgaria, by President Bill Clinton.\nIn 1993 Passy and ACB were involved in establishing the Bulgarian Antarctic Institute and the annual Antarctic Expedition as part of the national Antarctic Program. Bulgaria became the 28th Consultative Party to the Antarctic Treaty in 1998.\n\n\n== Futuristic visions ==\nIn 2007 Solomon Passy visited China by invitation of the Chinese Parliament and launched the creation of NATO-China Council and membership of China in OSCE.\nIn 2007 during a visit to Lhasa (Tibet) Passy launched the Theory of e-Democracy (Link): a computerized simulator replacing elections and manned governments by optimizational algorithms guaranteeing sustainable increase of quality of life.\n\n\n== Scientific ==\nSolomon Passy holds a PhD (1985) and M.Sc. (1979) in Mathematical Logic and Computer Sciences from Sofia University St. Kliment Ohridski.\nHe has published dozens of academic papers on mathematical logic and computer sciences. The Combinatory Dynamic Logic (Modal Logic with Nominals) was developed in Bulgaria by Solomon Passy and Professors Tinko Tinchev, George Gargov, Valentin Goranko, and Dimitar Vakarelov. Solomon’s scientific publications from 1980-1990s are widely cited.\nToday Solomon is a frequent commentator on international affairs, defense and security, and innovations for national and world media.\n\n\n== The Berlin Wall era ==\nIn the 1980s Passy was an activist of various opposition, underground and ecological movements opposing communist regime for freedom and human rights, including in defense of the oppressed Turkish minority in Bulgaria; in solidarity with them he assumed the Turkish pseudonym Syuleyman Tehlikeli when publishing mathematical papers and graphics art in the 1980s.\nHe attended the Solidarity Trade Union Congress in Gdansk in the fall of 1981. In May 1987 Passy was the co-host-organizer of the first public opposition happening in Sofia University. After his efforts in communist Bulgaria, in 1990-1991, as MP in the Grand National Assembly, he co-authored the first democratic Constitution of the Republic of Bulgaria and tabled the bill for abolishment of the death penalty in Bulgaria.\n\n\n== Awards ==\nBadge of Honor “Bulgaria-NATO” 1st Degree (2014), awarded by the Minister of Defense of Bulgaria\nWorthy Bulgarians Award (along with his wife Gergana), for their idea for a common USB charger for the GSM in EU (2010)\nDoctor Honoris Causa of the South-West University \"Neofit Rilski\" in Blagoevgrad (2005)\nHonorary citizen of the State of Texas (2004)\nHonorary citizen of the town of Nedelino (2003)\nEvent of the Year, awarded about the invitation for the accession of Bulgaria to NATO (2002)\n\n\n=== International State Awards ===\n\n\n=== Boardships ===\nBoard of Directors, American Chamber of Commerce in Bulgaria (2011–present)\nBoard of Trustees, AUBG, American University in Bulgaria (2006-2015)\nBoard of Trustees, Member of the Burgas Free University (2006–present)\n\n\n== Personal life ==\nSolomon and Gergana Passy have four children from their three marriages. The Passys run a consulting business Passy Experience Ltd., serving governmental and corporate clients from various sectors of business: pharmaceuticals, agriculture, nuclear energy, defense. Solomon Passy is a partner in a start-up company developing iSOSu mobile application for the Indian market and other innovations.\n\n\n== References ==\n\n\n== External links ==\nFor personal and family details:\nPersonal website\nFor business and public activities:\nThe Atlantic Club of Bulgaria\nDigital National Alliance\nAtlantic Digital Network", "ns": 0, "pageid": 924723, "title": "Solomon Passy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}