{"batchcomplete": "", "query": {"normalized": [{"to": "Spencer Heath", "from": "Spencer_Heath"}], "pages": {"3959773": {"extract": "Spencer Heath (born 1876, Vienna, Virginia – died 1963, Leesburg, Virginia) was an American engineer, attorney, inventor, manufacturer, horticulturist, poet, philosopher of science and social thinker. A dissenter from the prevailing Georgist views, he pioneered the theory of proprietary governance and community in his book Citadel, Market and Altar. His grandson, Spencer Heath MacCallum, popularized and expounded on his ideas, most notably in his book The Art of Community.\n\n\n== Life and technical career ==\nHeath graduated from the Corcoran Scientific School in Washington, D.C., studying electrical and mechanical engineering. While working for the Navy Department he earned law degrees at National University Law School. In 1898 he married Johanna Maria Holm, a suffragist and friend of Susan B. Anthony. They had three daughters.\nAs a patent lawyer and engineering consultant his clients included Simon Lake, inventor of the even-keel-submerging submarine, and Emile Berliner, inventor of the flat-disk phonograph record. Heath helped Berliner design and build the first rotary engine blades used in helicopters. Heath founded the American Propeller Manufacturing Company in 1909 and developed and first mass-produced airplane propellers, including 70 percent of the propellers used by Americans in World War I. In 1922 he demonstrated the first engine-powered and controlled, variable and reversible pitch propeller.\nIn 1929 he sold his patents and facilities to Bendix Aviation Corporation and retired to work on projects in horticulture and the natural and social sciences, including research with the aim of establishing the basis for an authentic natural science of society.\nHis articles on aeronautical engineering were published by the Journal of the American Society of Naval Engineers, the Journal of the Franklin Institute and other technical journals. International Who's Who listed him in 1947-1949 and Who's Who in the East in 1948-1951.\n\n\n== Economic and political views ==\n\nAround 1898, attracted by the Georgists' free-trade stance, Spencer Heath became recording secretary for the Chicago Single Tax Club and participated in the movement for 40 years. He assisted in the formation of the Henry George School in New York City and conducted public seminars there on community organization in the early 1930s. School Director Frank Chodorov later fired him for straying from the Georgist line. Heath had rejected the Georgist antipathy toward landlords and had come to believe that society only could outgrow its subservience to the state through a particular use of land. In 1936, he self-published his views in a monograph entitled \"Politics versus Proprietorship.\" It was the first statement of the proprietary community principle. In 1952, The Freeman published Heath’s polemic “Progress and Poverty Reviewed”, a critique of Henry George's tax argument.\nHeath completed his major work, Citadel, Market and Altar, in 1946, publishing it through his Science of Society Foundation, Inc. in 1957. In a review of the book Manas journal wrote:\n\nMr. Heath returns to the socio-economic relationships of pre-Norman England for the foundation of an ideal society which will combine freedom and justice. This is a serious book with carefully worked-out plans and precise definitions. Mr. Heath's notion of ownership is very like Gandhi's conception of the stewardship of wealth: “In its Anglo-Saxon meaning, now only dimly realized, to own was to owe. Ownership was inclusive of others, not exclusive. What was owned, chiefly land, was held in trust, as it were.”\n\nHeath wrote:\n\nTo obviate the essential tyranny (coercion) of political administration the proprietary authority, suitably organized, must extend its jurisdiction, and thus its revenues, by itself supplying police and other community services without coercion, out of its own revenues and properties, and thus raise its own values and voluntary incomes.\n\nThe model for Heathian anarchism is proprietary communities, multi-tenant properties such as hotels, shopping centers, industrial parks, and apartment buildings. Multi-tenant properties are the opposite of traditional real-estate developments; the developers would lease the homes rather than sell them, and thus be responsible for providing community services to maintain rental income and land value.\n\n\n== Influence ==\nMurray Rothbard based much of his criticism of Henry George on Spencer Heath’s writings. These in turn have influenced many libertarians. He also mentioned Heath’s views on community a number of times in his book Man, Economy and State.\nHeath's system has been the model for intentional community and \"new country\" projects such as Werner K. Stiefel’s 1970s motel community and “Atlantis” projects.\nHeath's grandson Spencer Heath MacCallum holds Heath’s papers in the Heather Foundation, of which MacCullum is director. Heath was good friends with, and exchanged free market insights with, alternative monetary theorist E.C. Riegel whose papers also are held by the Foundation.\nSpencer MacCallum built upon and promoted his grandfather's ideas of proprietary community in his 1970 booklet The Art of Community and many articles, including \"The Enterprise of Community: Market Competition, Land, and Environment\" (2003) and \"Looking Back and Forward\" (which describes the influence of his grandfather) and \"From Upstate New York to the Horn of Africa\" (2005).\nHeath's views on rent were discussed in John Chamberlain's 1959 book, The Roots of Capitalism and Gus Dizerega’s year 2000 book Persuasion, Power, and Polity: A Theory of Democratic Self-Organization. His views on community were discussed in John McClaughrey's 1995 article “Private Idahoes” in Reason Magazine, a chapter of the 2001 book City and Country, called \"The Completely Decentralized City: The Case for Benefits Based Public Finance\" and Gabriel Joseph Roth's 2006 book, Street Smart: Competition, Entrepreneurship, and the Future of Roads.\nHeathians suggest that the most practical way to create an entrepreneurial community may be using leasehold rather than freehold. They point out that private single-family housing is historically quite new, and see an evolutionary trend toward the leasehold type of ownership. The term \"multi-tenant income property\" and the very existence of shopping malls is a phenomenon of the last 50 years. Heathians generally believe that the multi-tenant property approach will, over time, evolve to take over traditional public services such as water, sewer, and street maintenance from municipal governments. They see the Heathian landlord as protecting the individual from two different sources of aggression: criminals and governments. Land-holding firms would compete on how well they can protect their tenants from crime and taxation, a distinct improvement over monopoly government.\nHeath's system differs from the standard anarcho-capitalist private defense agency (PDA) model. Heath himself eschewed the term, and did not refer to himself as an anarchist. The PDA model envisions competing security agencies in the same geographical area rather than a proprietary zone. Citing Spencer MacCallum, economist Edward Stringham discusses how a system composed of many proprietary communities would encourage landlords to provide police in a way that their tenants value most, even if there were one provider of law in a given area. Stringham contrasts that vision with one that focuses on having multiple law enforcement agencies.\n\n\n== Bibliography ==\n“The Inspiration of Beauty, Human Emergence into the Divine by Creative Artistry,” 16 page pamphlet, August 1960.\nCitadel, Market, and Altar, published by the Science of Society Foundation, Baltimore, 1957\n“Progress & Poverty Reviewed & its Fallacies Exposed,” 1952, 23 page updated pamphlet with supplementary material.\n\"Private property in land explained: Some new light on the social order and its mode of operation,\", published by The Freeman, 1952, ASIN: B0007FFNX2.\n\"Private property in land explained: Some new light on the social order and its mode of operation,\" 22 page pamphlet later published by The Freeman, 1939, ASIN: B0008BV2JE.\n\"Politics versus proprietorship;: A fragmentary study of social and economic phenomena with particular reference to the public administrative functions belonging to proprietorship as a creative social agency,\" 71 page pamphlet; reprinted by The Freeman, 1936, ASIN: B0008C4IDU.\n\n\n== See also ==\nAmerican philosophy\nSpencer MacCallum\nE.C. Riegel\nPrivate community\nVoluntary community\nIntentional community\nGeorgism\nAnarchism\nLibertarianism\nList of American philosophers\n\n\n== References ==\n\n\n== External links ==\nSite devoted to the life and thought of the social philosopher, Spencer Heath", "ns": 0, "pageid": 3959773, "title": "Spencer Heath"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}