{"batchcomplete": "", "query": {"normalized": [{"to": "Stanisław Jaśkowski", "from": "Stanisław_Jaśkowski"}], "pages": {"4304907": {"extract": "Stanisław Jaśkowski (April 22, 1906, Warsaw – November 16, 1965, Warsaw) was a Polish logician who made important contributions to proof theory and formal semantics. He was a student of Jan Łukasiewicz and a member of the Lwów–Warsaw School of Logic. Upon his death his name was added to the Genius Wall of Fame. He was the President (rector) of the Nicolaus Copernicus University in Toruń.\nJaśkowski is considered to be one of the founders of natural deduction, which he discovered independently of Gerhard Gentzen in the 1930s. (Gentzen's approach initially became more popular with logicians because it could be used to prove the cut-elimination theorem. But Jaśkowski's is closer to the way that proofs are done in practice.) He was also one of the first, if not the first, to propose a formal calculus of inconsistency-tolerant (or paraconsistent) logic. Furthermore, Jaśkowski was a pioneer in the investigation of both intuitionistic logic and free logic.\n\n\n== Works ==\nOn the Rules of Suppositions in Formal Logic Studia Logica 1, 1934 pp. 5–32 (reprinted in: Storrs McCall (ed.), Polish logic 1920-1939, Oxford University Press, 1967 pp. 232–258\nInvestigations into the System of Intuitionist Logic 1936 (translated in: Storrs McCall (ed.), Polish logic 1920-1939, Oxford University Press, 1967 pp. 259–263\nA propositional Calculus for Inconsistent Deductive Systems 1948 (reprinted in: Studia Logica, 24 1969, pp 143–157 and in: Logic and Logical Philosophy 7, 1999 pp. 35–56)\nOn the Discussive Conjunction in the Propositional Calculus for Inconsistent Deductive Systems 1949 (reprinted in: Logic and Logical Philosophy 7, 1999 pp. 57–59)\nOn Formulas in which no Individual Variable occurs more than Twice, Journal of Symbolic Logic, 31, 1966, pp. 1–6)\nin Polish\nO symetrii w zdobnictwie i przyrodzie - matematyczna teoria ornamentów (English title: On Symmetry in Art and Nature), PWS, Warszawa, 1952 (book 168 pages)\nMatematyczna teoria ornamentów (English title: Mathematical Theory of Ornaments), PWN, Warszawa, 1957 (book 100 pages)\n\n\n== References ==\nJerzy Perzanowski (1999). \"Fifty Years of Parainconsistent Logics\" (PDF). Logic and Logical Philosophy. 7: 21–24. \nWoleński, Jan (2003). \"Lvov-Warsaw School\". The Stanford Encyclopedia of Philosophy (Summer 2003 Edition). Retrieved 2006-03-11. \nJerzy Kotas, August Pieczkowski. Scientific works of Stanisław Jaśkowski, Studia Logica 21, 1967, 7-15\n\n\n== External links ==\nPolish Logic of the Postwar Period", "ns": 0, "pageid": 4304907, "title": "Stanisław Jaśkowski"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}