{"batchcomplete": "", "query": {"normalized": [{"to": "Stanley Cavell", "from": "Stanley_Cavell"}], "pages": {"685947": {"extract": "Stanley Louis Cavell (/kəˈvɛl/; born September 1, 1926) is an American philosopher. He is the Walter M. Cabot Professor of Aesthetics and the General Theory of Value, Emeritus, at Harvard University.\n\n\n== Life ==\nCavell was born to a Jewish family in Atlanta, Georgia. His mother, a locally renowned pianist, trained him in music from his earliest days. During the Depression, Cavell’s parents moved several times between Atlanta and Sacramento, California.\nAs a teenager, Cavell played lead alto saxophone as the youngest and sole white member of a black jazz band in Sacramento. At 16, he entered the University of California, Berkeley, where he majored in music, studying with, among others, Roger Sessions and Ernest Bloch. After graduation, he began studies in composition at the Juilliard School of Music in New York City, only to discover that music was no longer his aspiration. He eventually began to study philosophy at UCLA, and then transferred as a graduate student to Harvard University. As a student there he came under the influence of the visiting J. L. Austin, whose teaching and methods \"knocked him off ... [his] horse.\" In 1954 he was awarded a Junior Fellowship at the Harvard Society of Fellows. Before completing his Ph.D., he became an Assistant Professor of Philosophy at the University of California, Berkeley, in 1956. From 1962–1963 Cavell was a Fellow at the Institute for Advanced Study in Princeton, New Jersey, where he became a lifelong friend of the British philosopher Bernard Williams. In 1963 he returned to the Harvard Philosophy Department, where he became the Walter M. Cabot Professor of Aesthetics and the General Theory of Value.\nIn the summer of 1964, Cavell joined a group of Harvard faculty and graduate students, who taught at Tougaloo College, a historically black college in Mississippi, as part of what became known as the Freedom Summer. In April 1969, during the time of student protests arising from, among other things, the Vietnam War, Cavell, together with his colleague John Rawls, worked with a group of African-American students to draft language for a vote by the faculty that established the Department of African and African-American Studies at Harvard.\nIn 1979, along with the documentary filmmaker Robert Gardner, Cavell helped establish the Harvard Film Archive, to preserve and present the history of film. Cavell received a MacArthur Fellowship in 1992. From 1996-1997 Cavell was President of the American Philosophical Association (Eastern Division). He remained on the Harvard faculty until his retirement in 1997. After retiring, he taught courses at Yale University and the University of Chicago. He also held the Spinoza Chair of Philosophy at the University of Amsterdam in 1998.\nCavell’s first marriage, to Marcia (Schmid) Cavell, ended in divorce in 1961; their daughter, Rachel Lee Cavell, was born in 1957. He and Cathleen (Cohen) Cavell were married in 1967 and live in Brookline, Massachusetts; they have two sons, Benjamin (born 1976) and David (born 1984).\n\n\n== Philosophy ==\nAlthough trained in the Anglo-American analytic tradition, Cavell often interacts with the continental tradition. He is well known for his inclusion of film and literary study in philosophical inquiry. Cavell has written extensively on Ludwig Wittgenstein, J. L. Austin, and Martin Heidegger, as well as on the American transcendentalists Henry Thoreau and Ralph Waldo Emerson. He has been associated with an approach toward interpreting Wittgenstein sometimes known as the New Wittgenstein. Much of Cavell's writing incorporates autobiographical elements concerning how his movement between and within the ideas of these thinkers influenced and influences his own thinking.\n\n\n== Selected works ==\nCavell first established his distinct philosophical identity with a collection of essays, entitled Must We Mean What We Say? (1969), a work which addresses topics such as language use, metaphor, skepticism, tragedy, and literary interpretation, from the point of view of ordinary language philosophy, of which he is a practitioner and ardent defender. One of the essays discusses Søren Kierkegaard's work on revelation and authority, The Book on Adler, in an effort to help re-introduce the book to modern philosophical readers. In The World Viewed (1971) Cavell looks at photography and film. He also writes on modernism in art, and the nature of media, where he mentions the importance to his work of the writing of art critic Michael Fried.\nCavell is perhaps best known for his book, The Claim of Reason: Wittgenstein, Skepticism, Morality, and Tragedy (1979), which forms the centerpiece of his work, and which has its origins in his doctoral dissertation. The book was republished in 1999. In Pursuits of Happiness (1981), Cavell describes his experience of seven prominent Hollywood comedies: The Lady Eve, It Happened One Night, Bringing Up Baby, The Philadelphia Story, His Girl Friday, Adam’s Rib, and The Awful Truth. Cavell argues that these films, from the years 1934–1949, form part of what he calls the genre of \"The Comedy of Remarriage,\" and he finds in them great philosophical, moral, and indeed political significance. Specifically, Cavell argues that these Hollywood comedies show that \"the achievement of happiness requires not the [...] satisfaction of our needs [...] but the examination and transformation of those needs.\" According to Cavell, the emphasis that these movies place on \"remarriage\" draws attention to the fact that, within a relationship, happiness requires \"growing up\" together with one's partner.\nIn Cities of Words (2004) Cavell traces the history of moral perfectionism, a mode of moral thinking spanning the history of Western philosophy and literature. Having previously used Emerson to define the concept, this book suggests ways we might want to understand philosophy, literature, and film as preoccupied with features of perfectionism. In his collection of essaysPhilosophy the Day After Tomorrow (2005), Cavell makes the case that J. L. Austin's concept of performative utterance requires the supplementary concept of \"passionate utterance\": \"A performative utterance is an offer of participation in the order of law. And perhaps we can say: A passionate utterance is an invitation to improvisation in the disorders of desire.\" The book also contains extended discussions of Friedrich Nietzsche, Jane Austen, George Eliot, Henry James, and Fred Astaire, as well as familiar Cavellian subjects such as Shakespeare, Emerson, Thoreau, Wittgenstein, and Heidegger. Cavell's most recent book as of 2016, Little Did I Know: Excerpts from Memory (2010), is an autobiography written in the form of a diary. In a series of consecutive, dated entries, Cavell inquires about the origins of his philosophy by telling the story of his life.\n\n\n== Honorary degrees ==\nDoctor of Humane Letters, Kalamazoo College, 1980\nDoctor of Letters, Iona College, 1985\nDoctor of Humane Letters, University of Chicago, 1987\nDocteur, Honoris Causa, Université de Strasbourg, 1996\nDoctor Philosophiae Honoris Causa, Hebrew University, 1997\nDoctor of Letters, Honoris Causa, University of East Anglia, 2009\nDocteur, Honoris Causa, Ecole Normale Superieure, Lyon, 2010\nDoctor of Letters, Wesleyan University, 2010\nDoctor of Theology, Institut Protestant de Théologie de Paris, 2010\n\n\n== Selected honors ==\nJunior Fellow, Society of Fellows, Harvard University, 1953-56\nFellow, Institute for Advanced Study, Princeton, New Jersey, 1962-1963\nDistinguished Teaching Award, University of California, Berkeley, 1961\nFellow, Wesleyan University Center for the Humanities, 1970-1971\nFellow, American Academy of Arts and Sciences, 1978-\nPresident, American Philosophical Association (Eastern Division), 1996-97\n2000 Centennial Medalist, Harvard University Graduate School of Arts and Sciences\nRomanell Phi Beta Kappa Professorship, 2004-05\n\n\n== Selected special lectureships ==\nPatricia Wise Lecture, American Film Institute, 1982\nMrs. William Beckman Lectures, University of California, Berkeley, 1983\nTanner Lecture, Stanford University, April 1986\nCarus Lectures, American Philosophical Association, 1988\nPlenary Address, Shakespeare World Congress, Los Angeles, 1996\nPresidential Address, American Philosophical Association, Atlanta, 1996\nHowison Lectures, University of California, Berkeley, February, 2002\n\n\n== Bibliography ==\nMust We Mean What We Say? (1969)\nThe Senses of Walden (1972) Expanded edition San Francisco: North Point Press, 1981.\nThe World Viewed: Reflections on the Ontology of Film (1971); 2nd enlarged edn. (1979)\nThe Claim of Reason: Wittgenstein, Skepticism, Morality, and Tragedy (1979) New York: Oxford University Press.\nPursuits of Happiness: The Hollywood Comedy of Remarriage (1981) ISBN 978-0-674-73906-2\nThemes Out of School: Effects and Causes (1984)\nDisowning Knowledge: In Six Plays of Shakespeare (1987); 2nd edn.: Disowning Knowledge: In Seven Plays of Shakespeare (2003)\nIn Quest of the Ordinary: Lines of Scepticism and Romanticism (1988) Chicago: Chicago University Press.\nThis New Yet Unapproachable America: Lectures after Emerson after Wittgenstein (1988)\nConditions Handsome and Unhandsome: The Constitution of Emersonian Perfectionism (1990)\nA Pitch of Philosophy: Autobiographical Exercises (1994)\nPhilosophical Passages: Wittgenstein, Emerson, Austin, Derrida (1995)\nContesting Tears: The Melodrama of the Unknown Woman (1996)\nEmerson's Transcendental Etudes (2003)\nCities of Words: Pedagogical Letters on a Register of the Moral Life (2004)\nPhilosophy the Day after Tomorrow (2005)\nLittle Did I Know: Excerpts from Memory (2010)\n\n\n== References ==\n\n\n== Further reading ==\nBooks\nMichael Fischer, Stanley Cavell and Literary Criticism, Chicago U.P., 1989\nRichard Fleming and Michael Payne (eds), The Senses of Stanley Cavell, Bucknell U.P., 1989\nTed Cohen, Paul Guyer, and Hilary Putnam, eds., Pursuits of Reason: Essays in Honor of Stanley Cavell, Texas Tech U.P., 1993\nStephen Mulhall, Stanley Cavell: Philosophy’s Recounting of the Ordinary, Clarendon Press, 1994\nTimothy Gould, Hearing Things: Voice and Method in the Writing of Stanley Cavell, Chicago U.P., 1998\nEspen Hammer, Stanley Cavell: Skepticism, Subjectivity, and the Ordinary, Polity Press/Blackwell’s, 2002\nRichard Eldridge (ed.), Stanley Cavell, Cambridge U.P., 2003\nSandra Laugier, Une autre pensée politique américaine: La démocratie radicale d’Emerson á Stanley Cavell, Michel Houdiard Ēditeur, 2004\nRussell Goodman (ed.), Contending with Stanley Cavell, Oxford U.P., 2005.\nArticles\nThe Stanley Cavell Special Issue: Writings and Ideas on Film Studies, An Appreciation in Six Essays, Film International, Issue 22, Vol. 4, No. 4 (2006), Jeffrey Crouse, guest editor. The essays include those by Diane Stevenson, Charles Warren, Anke Brouwers and Tom Paulus, William Rothman, Morgan Bird, and George Toles.\n\"Why Not Realize Your World?\" Philosopher/Film Scholar William Rothman Interviewed by Jeffrey Crouse\" in Film International, Issue 54, Vol. 9, No. 6 (2011), pp. 59–73.\nSpecial Section on Stanley Cavell. Film-Philosophy Vol. 18 (2014): 1-171.\n\n\n== External links ==\nHarvard Philosophy Department website\nConversations: The Journal of Cavellian Studies\nA Philosopher Goes to the Movies: Conversation with Stanley Cavell\nDaniel Ross, Review of Cavell, Philosophy the Day after Tomorrow\nA study (in French) on Cavell's idea of perfectionism\nStanley Cavell\nPennSound page with audio and video links\nRadio interview by Charles Bernstein", "ns": 0, "pageid": 685947, "title": "Stanley Cavell"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}