{"batchcomplete": "", "query": {"normalized": [{"to": "Stanley Hauerwas", "from": "Stanley_Hauerwas"}], "pages": {"1451835": {"extract": "Stanley Hauerwas (born July 24, 1940) is an American theologian, ethicist, and public intellectual. Hauerwas is a longtime professor at Duke University, serving as the Gilbert T. Rowe Professor of Theological Ethics at Duke Divinity School with a joint appointment at the Duke University School of Law. In the fall of 2014, he also assumed a chair in Theological Ethics at the University of Aberdeen. Before coming to Duke, Hauerwas taught at the University of Notre Dame. Hauerwas is considered by many to be one of the world's most influential living theologians and was named \"America's Best Theologian\" by Time Magazine in 2001. He was also the first American theologian to deliver the prestigious Gifford Lectures at St. Andrew's in Scotland in over forty years. His work is frequently read and debated by scholars in fields outside of religion, theology, or ethics, such as political philosophy, sociology, history, and literary theory. Hauerwas has achieved notability outside of academia as a public intellectual, even appearing on The Oprah Winfrey Show.\nThough Hauerwas is most well known for his work related to Christian ethics, the relationship between Christianity and politics, and ecclesiology, he has written widely on a diverse range of subjects, such as systematic theology, philosophical theology, political philosophy, the philosophy of social science, law, education, bioethics, and medical ethics. Hauerwas is known for his outspoken advocacy of pacifism, as well of his fierce criticism of liberal democracy, capitalism, and militarism. He is also a critic of both Christian fundamentalism and liberal Christianity and American civil religion. Among his most important contributions to modern theology are his advocacy of and work related to virtue ethics and postliberal theology.\nHauerwas's work draws from a number of theological perspectives, including Methodism, Anabaptism, Anglicanism, and Catholicism. He is commonly cited as a member of the evangelical left. Hauerwas's book, A Community of Character: Toward a Constructive Christian Social Ethic, was named as one of the one hundred most important books on religion in the 20th century by Christianity Today. His most widely known book, however, is likely Resident Aliens: Life in the Christian Colony, which was co-written with William Willimon.\n\n\n== Early life and education ==\nStanley Hauerwas was raised in Pleasant Grove, Texas, in a working-class family. He attended both Pleasant Grove High School (1954–56) and W. W. Samuell High School (1956–58). As the son of a bricklayer, Hauerwas was early on apprenticed to the craft of bricklaying under his father. The experience was extremely formative for his later life, as he himself has often compared the skill and hard work that bricklaying requires with both his own approach to theological work and the challenges of living a fully Christian life.\nHauerwas's family attended Pleasant Mound Methodist Church, where he experienced Baptism, Confirmation and Communion. At the age of 15, he presented himself for ministry at a Sunday night worship service, presuming then that he would be saved.\nAfter leaving Pleasant Grove, Hauerwas matriculated at Southwestern University, a liberal arts college affiliated with the United Methodist Church. He received a B.A. there in 1962. He was also a member of Phi Delta Theta while at Southwestern University. He went on to earn the B.D., M.A., M.Phil and PhD degrees from Yale University. Upon delivering the Gifford Lectures in 2001, Hauerwas was also awarded an honorary D.D. from the University of Edinburgh.\nFollowing his graduation from Yale University, Hauerwas taught first at Augustana College in Rock Island, Illinois, before joining the faculty at the University of Notre Dame in 1970. He was later invited to assume a faculty position at the Divinity School of Duke University in 1983, where he taught in the area of theological ethics until his retirement in 2013, though he continues to write and speak at Duke as a senior research fellow. In 2014 he was appointed to a Chair in Theological Ethics at the University of Aberdeen.\nHauerwas' influences are wide-ranging, including figures as diverse as Aristotle, Thomas Aquinas, Søren Kierkegaard, Karl Barth, Ludwig Wittgenstein, John Howard Yoder, Alasdair MacIntyre, Michel Foucault, and William James.\n\n\n== Honors ==\nTime Magazine in 2001 named him \"America's Best Theologian\". He responded by saying, \"'Best' is not a theological category.\"\nIn 2001 Hauerwas was also invited to give the Gifford Lectures at St. Andrews in Scotland, which were published as With the Grain of the Universe, a text in which Hauerwas argued that Karl Barth was the foremost \"natural theologian\" of the Gifford Lectures. Such an argument is controversial since Karl Barth is well known as an enemy of natural theology. For Hauerwas, however, Barth argued that Christian convictions about the world describe God's good creation as it is while emphasizing that such convictions cannot be understood apart from Christian witness. This, according to Hauerwas, is what makes Barth a proper natural theologian in comparison to Reinhold Niebuhr and William James, who were also featured in the lectures.\nEarlier in 1997 he gave the Scottish Journal of Theology lectures at Aberdeen, published as Sanctify Them in Truth (1998).\n\n\n== Basic theological and philosophical views ==\nHauerwas has long been associated with narrative theology and postliberal theology (which are closely related but not necessarily synonymous movements). Both of these movements are attached to Yale biblical scholars Brevard Childs, Hans Frei, and George Lindbeck. His Reforming Christian Social Ethics: Ten Theses, published in 1981, serves to summarize the key presuppositions of his alternative to what was the dominant account in Christian ethics at that time. The ten theses are listed as follows:\nThe social significance of the Gospel requires the recognition of the narrative structure of Christian convictions for the life of the church.\nEvery social ethic involves a narrative, whether it is concerned with the formulation of basic principles of social organization and/or with concrete policy alternatives.\nThe ability to provide an adequate account of our existence is the primary test of the truthfulness of a social ethic.\nCommunities formed by a truthful narrative must provide the skills to transform fate into destiny so that the unexpected, especially as it comes in the form of strangers, can be welcomed as gift.\nThe primary social task of the church is to be itself - that is, a people who have been formed by a story that provides them with the skills for negotiating the danger of this existence, trusting in God's promise of redemption.\nChristian social ethics can only be done from the perspective of those who do not seek to control national or world history but who are content to live \"out of control.\"\nChristian social ethics depends on the development of leadership in the church that can trust and depend on the diversity of gifts in the community.\nFor the church to be, rather than to have, a social ethic means we must recapture the social significance of common behavior, such as acts of kindness, friendship, and the formation of families.\nIn our attempt to control our society Christians in America have too readily accepted liberalism as a social strategy appropriate to the Christian story.\nThe church does not exist to provide an ethos for democracy or any other form of social organization, but stands as a political alternative to every nation, witnessing to the kind of social life possible for those that have been formed by the story of Christ.\nHauerwas writes of narrative as \"the necessary grammar of Christian convictions\" in that Christian claims are inextricably linked to what God has done in history and to the ongoing story of God's people as they move through time. This sense of a \"hypertemporal God\" Hauerwas claims to have gotten from John Howard Yoder, who impressed upon him the need of always locating God's actions in the \"timeliness\" of the created order as witnessed by the Bible. He has explained this understanding of a people (i.e., church) constituted by their ongoing story with God in terms of a pointed and oft-repeated aphorism:\n\nMy claim, so offensive to some, that the first task of the church is to make the world the world, not to make the world more just, is a correlative of this theological metaphysics. The world simply cannot be narrated - the world cannot have a story - unless a people exist who make the world the world. That is an eschatological claim that presupposes we know there was a beginning only because we have seen the end ... [C]reation names God's continuing action, God's unrelenting desire for us to want to be loved by that love manifest in Christ's life, death, and resurrection.\n\nAs indicated in the quotation above, Hauerwas believes that the strong distinction between the church and the world is a necessary mark of the Christian life. He collaborated with William H. Willimon (now a retired bishop in the United Methodist Church) in 1989 to offer an accessible version of his vision of the Christian life in the book Resident Aliens: Life in the Christian Colony. This understanding of the church is based on both his narrative and postliberal approach to theology, as well as his reading of Ludwig Wittgenstein's understanding of language and language games.\nHauerwas works from within the tradition of virtue ethics, having been deeply influenced by Alasdair MacIntyre and his work After Virtue.\nHauerwas is also known as an ardent critic of liberal democracy. In recent years, however, Hauerwas has become conversant with the tradition of radical democracy. In 2007 he collaborated on a book on the subject with political theorist and ethicst Romand Coles entitled Christianity, Democracy, and the Radical Ordinary: Conversations Between a Radical Democrat and a Christian.\nAmong Hauerwas's most well-known critics are Jeffrey Stout of Princeton and Nicholas Wolterstorff of Yale, though both have often praised his work as well.\n\n\n== Interaction with the thought of the Niebuhrs ==\nHauerwas's theological views may be best illuminated by his engagement with the work of Reinhold Niebuhr and H. Richard Niebuhr, often considered two of the most influential American theologians of the 20th century. Hauerwas frequently discusses the work of both Niebuhr brothers, mentioning them in some form in most of his books. Reinhold was also one of the primary subjects of Hauerwas' 2000–2001 Gifford Lectures, which were later republished in book form under the title With the Grain of the Universe.\nIn the early years of his career Hauerwas was deeply influenced by the work of both brothers. However, later, primarily as a result of encountering the work of John Howard Yoder, he came to disagree with fundamental elements of their theology, while continuing to affirm other elements of their work that he finds important.\nWhile many believe that the Niebuhrs' advocacy of Christian realism represents a rejection of liberal Christianity, Hauerwas argues that the brothers actually belong to that theological tradition. For him, while they both placed a strong emphasis on the sinfulness of humanity (which stood in stark contrast to most liberal thinkers), he believes that the Niebuhrs based their theologies on the presuppositions of secular philosophy rather than those of Christianity, thus placing them in the liberal tradition of modern Christian thought. In particular, Hauerwas argues that Reinhold Niebuhr was deeply influenced by William James, accepting a pragmatist epistemology. (It should be noted that some of Reinhold Niebuhr's supporters, perhaps most notably Gabriel Fackre, argue that Hauerwas is wrong on this point and that during Niebuhr's career his theology evolved to being strongly neo-orthodox rather than liberal.)\nFor Hauerwas, the Niebuhrs are important figures in part because the flaws in their thinking represent the same flaws which are endemic to much of modern Christianity, with the Church often being shaped more by the culture of liberal democracy than the message of Jesus. In Hauerwas' view, this has led the Church (and Christians in general) to compromise their values and place too much faith in secular political ideologies, often leading to a misplaced passion for political power. This represents the thesis of Hauerwas in his most popular book, Resident Aliens (which was co-written by William Willimon). In the book, Hauerwas and Willimon argue that the Church's accommodation to secular culture has led to tragedies like the dropping of the atomic bomb on Hiroshima Hauerwas, therefore, believes that the Niebuhrs' thinking is subject to the same flaws as Jerry Falwell, with Hauerwas and Willimon stating that \"few books have been a greater hindrance to an accurate assessment of [the Church's] situation\" than H. Richard Niebuhr's famous book Christ and Culture. Thus according to Hauerwas, while they may have disagreed when it comes to policy, both the Niebuhrs and Falwell fell prey to the notion Christians have a duty to use the political process as a means to enact \"Christian\" legislation or pursue justice.\nIn his book The Peaceable Kingdom Hauerwas offers commentary on two classic essays written by the Niebuhrs for The Christian Century on the subject of the Conflict in Manchuria. In the first essay, entitled \"The Grace of Doing Nothing\", H. Richard Niebuhr argues that humans are self-interested and egoistic and that Christians, because they are subject to these same flaws, should remain non-violent even in a time of war. In his essay in response, entitled \"Must We Do Nothing?\", Reinhold Niebuhr argues that Christians must have a self-awareness about their own sinfulness and self-interestedness, but must sometimes use force to protect certain ideals and people. In his commentary Hauerwas acknowledges that both brothers make important points, but critiques Reinhold's view, ultimately agreeing with H. Richard Niebuhr.\n\n\n== Views on human experimentation ==\n\n\n=== Deontological and utilitarian thought ===\nThe basic utilitarian rationalization for research on human beings is the ends justify the means. This means that any sort of research on a human being is justified by the possibility of successfully saving others. For example, all cancer research would be justified by the possibility of finding a cure for cancer, which would inevitably save the life of many others. The utilitarian argument focuses on the greatest good for the greatest amount of people or the greater good. Under the utilitarian justification it is a person's duty to sacrifice himself or herself if it would save others as long as the individual person's societal worth is less than the combined societal worth of the others. Therefore, if either a doctor or a homeless person must die to save the lives of many others, the homeless person must sacrifice himself since he is worth less to society than the doctor.\nThe deontological argument against research on human beings is that persons are an ends in themselves. This means we cannot use people for any purpose. The deontological argument relies on the belief that we should treat others as we would like to be treated. If someone was suffering from a terminal illness and they were likely to die shortly, under deontological assumptions research could not be done on them even if it meant saving the lives of millions.\n\n\n=== Understanding of experimentation ===\nHauerwas finds these two moral theories very limiting because they are quandary ethics, cases that rely on extreme situations. He believes that there needs to be a third reasoning that falls somewhere in between these two. He believes that the basic doctor-patient relationship should be built on trust and caring. This characterizes him as more of deontological thinker; however, he does believe in research on human beings. Hauerwas’s perspective is that there needs to be a middle ground between these two perspectives. The patient becomes dehumanized through research; however, without this research there would be little medical improvement. Hauerwas therefore believes this middle ground should focus on caring for the patient instead of curing. With this, Hauerwas believes we do not have the moral understanding to handle current medicine.\nAs mentioned above, Hauerwas believes that the moral issue of experimentation on humans cannot be answered from a utilitarianism versus deontological perspective. He believes that society lacks a cohesive understanding of the notions of “the good of mankind” and “the rights of the individual.” Only when this issue is solved can society come to a conclusive decision on how science should be used to serve humans needs. Therapeutic and nontherapeutic experimentation on humans are differentiated by the intent of the procedure. Therapeutic experimentation is meant to help the patient with their current needs, while nontherapeutic experimentation has no intention of helping the patient, but to collect research for the benefit of future patients. The issue becomes: should medical progress be helping the current patient or the future patient? Stanley Hauerwas believes society has no consensus of the meanings of health and illness, which contributes to the issue of how patients should be treated. Only when society comes to a universal understanding of these issues can the moral dilemma of experimentation on humans be resolved.\n\n\n=== Informed consent ===\nHauerwas finds little justification for human experimentation through informed consent. He argues that a patient’s understanding of an experimental procedure will never approach that of his or her physician. He questions even the possibility of a patient reaching a state of “informed consent.” He further believes that if individuals reach such a state of “informed consent”, this does not mean individuals should consent, or fully understand the meaning of their consent. “For persons can misuse themselves even if they do so voluntarily and with full knowledge.” Individuals consenting to experimentation through the justification of the human good, turn themselves into objects for the use of the experimentation. The issue is further complicated for Hauerwas as to whom should be considered for medical experimentation. The use of prisoners only proliferates social stereotypes and denigration. He believes that informed consent is necessary for human experimentation, but it does not provide justification for our willingness to submit and participate in experimentation.\n\n\n=== Language of rights ===\nHauerwas finds the language of “rights” to be disturbing as it assumes that people relate to others as strangers, and lends even the understanding of the family to that of a contractual society. He argues that being part of a family, however, is not a voluntary undertaking. As such, when one is part of a family, the kinds of responsibilities each member holds are in relation to each other. Hauerwas finds that as a parent, you have a duty to your children, not just because you brought them into existence, but because the role of parent is to ensure the children are brought up in a way that is conducive to the community’s values. Thus, the issue with “rights” language is that it attempts to prevent maltreatment of individuals to the point of exclusion of familial and communal responsibility. Hauerwas’s bottom line is that there can be no real society if its members only relate in terms of noninterference. The language of rights destroys society because we regard people as strangers instead of assuming the responsibility towards them as family and members of the community that we share.\n\n\n== Views on death and dying well ==\nHauerwas believes that there is a difference between the concept of death and the criteria for death. The concept of death “involves a philosophical judgment of a significant change that has happened in a person” and therefore “is a correlative of what one takes to be the necessary condition of human life, e.g., … the potential for consciousness”. The criteria of death, however, are “those empirical measurements that can be made to determine whether a person is dead, such as cessation of respiration or a flat EEG”. Thus, brain death is a criterion of death that may serve “as a symbol of when it is time to die”. A person must not delay death so long that it is no longer possible to die a good death.\nOn the subject of suicide, Hauerwas challenges the claim that autonomous suicide is morally acceptable, but also wants to distinguish himself from the position that denies rational suicide. He believes that suicide can be and often is a rational decision of an “autonomous” agent, but does not agree with the notion that it is justified. He contends that suicide as an institution must be considered morally doubtful, as the life that we are given should be considered a gift bestowed upon us by God. To many, the term \"rational suicide\" is based on the assumption that the decision to live or die depends on whether life has a meaning or purpose. Hauerwas, however, contends that the reason we should live on, is because our lives are not ours, and as such, reminds us that there is a commitment to keep on living. Yet, while there may be times in our lives where suicide may seem rational, mere existence allows us to enjoy certain joys, such as helping another, or healing the sick, that should be enough to sustain our commitment to living.\nAccording to Hauerwas, a “good death is a death that we can prepare for through living because we are able to see that death is but a necessary correlative to a good life.\" A long life may give a person more of a chance to have a good death because he may be able to get himself morally in line during that time period, but it is also possible to die well quickly if you have lived morally. A good death also requires that the death be morally in proportion with the way one lived and was sustained, and occurs in a way that allows those caring for us to see that they are sustaining us.\n\n\n== Views of patience and courage ==\nAccording to his essay, \"Practicing Patience: How Christians Should Be Sick\", in Christians Among the Virtues, he said that Christians are called to be patient patients in sickness and in health because \"patience is integral to the Christian life\". Patience cannot be first learned while being a patient. To learn patience, Christians are to exercise the virtue through deeds, truth, practice, and living it. Hauerwas also says that patience is a virtue we have in common with God. \"In Him, patience has its beginning, and from Him as its source it takes its splendor and dignity.\" He also says that God showed us the best example of patience when it comes to the life of Jesus. Because God is the foundation, Hauerwas stated that “only patience shaped by Christ is true patience\". As well as this, he later emphasized that patience is not developed by human will, but given through the Holy Spirit, who gives us the capacity to love, for “without [love] in us there cannot be patience because in good men it is the [love] of God which endures all things.” In the author’s essay, he gave people a framework of how to learn to practice patience when we are not sick: 1. We have been given one another to learn to live with one another. 2. We’ve been given time and space to develop habits from activities that require patience.\nHauerwas speaks about courage in his essay \"Courage Exemplified\", in Christians Among the Virtues. He first looked to Aristotle, who firmly believed soldiers could only show courage. He also said that courage is acquired through imitation of action and emotion, and virtue required practice before it was mastered. Hauerwas indicated that to Aristotle, “without war, courage could not be fully known.\" The philosopher also spoke of Aquinas’ view of courage. To begin, he expressed that to Aquinas, charity is the central trunk from which all the other virtues branch out, which includes courage. In contrast to Aristotle, courage isn’t just for battlefield; it adds any situation one might face danger and death, such as tending to the sick bed of loved one or going on a walk into the unknown with a friend. According to the essay, Aquinas “treats fortitude in such a way that its ends are transformed by charity.” Even though a situation might be dangerous, the individual is courageous because they possess love for the person they are helping. Courage, then, is more accessible opposed to Aristotle’s view. To transition, Hauerwas added the Christian to the mix when he narrated that Christianity requires courage which is “a kind of endurance in the face of difficulty, danger, or oppression.\" To tie in the first essay, he went on to say that patience and perseverance are “integral to the very meaning of virtue.\" All of this is to say that the Christian must have the patience to get through tough times. To him, the ultimate display of courage is through the martyr, who is “required to patiently persevere, since they have the confidence that enduring wrong is the gift of charity.\" The philosopher also highlighted that true courage is a gift of the Holy Spirit when he said that “courage is a gift of the Spirit that protects the martyr from the ‘dread of danger.’\" The martyr is the best example because they believe that “God will complete God’s work in [them] even if [their] lives are taken by [the] enemies.\" In the eyes of both Aquinas the Hauerwas, “those formed by the courage necessary to face death well will be more easily led to the fuller amount of courage offered by Christians.\"\nOverall, Hauerwas believes that America is not courageous because it does not act out of charity. He believes that the church can do it, but he questions whether America as a whole is able to. His answer is that it cannot. “We in America have lost our moral vision precisely as we have lost our courage to fight for what is right and good.\" \n\n\n== Bibliography ==\nHauerwas is a prolific writer. Many of his books are collections of essays; some are structured monographs.\n\n\n=== Books by Hauerwas ===\nVision and Virtue: Essays in Christian Ethical Reflection (1974)\nCharacter and the Christian Life: A Study in Theological Ethics (1975)\nTruthfulness and Tragedy: Further Investigations into Christian Ethics (with Richard Bondi and David Burrell) (1977)\nA Community of Character: Toward A Constructive Christian Social Ethic (1981) ISBN 0-268-00735-7\nResponsibility for Devalued Persons: Ethical Interactions Between Society, Family, and the Retarded (1982)\nThe Peaceable Kingdom: A Primer in Christian Ethics (1983) ISBN 0-268-01554-6\nRevisions: Changing Perspectives in Moral Philosophy (with Alasdair MacIntyre) (1983)\nShould War Be Eliminated? Philosophical and Theological Investigations (1984)\nAgainst the Nations: War and Survival in a Liberal Society (1985) ISBN 0-86683-957-7\nSuffering Presence: Theological Reflections on Medicine, the Mentally Handicapped, and the Church (1986)\nChristian Existence Today: Essays on Church, World, and Living in Between (1988)\nResident Aliens: Life in the Christian Colony (with William Willimon) (1989) ISBN 0-687-36159-1\nNaming the Silence: God, Medicine and the Problem of Suffering (1990)\nAfter Christendom: How the Church Is to Behave If Freedom, Justice, and a Christian Nation Are Bad Ideas (1991) ISBN 0-687-00929-4\nSchooling Christians: Holy Experiments in American Education (with John Westerhoff) (1992)\nUnleashing the Scripture: Freeing the Bible from Captivity to America (1993) ISBN 0-687-31678-2\nCharacter and the Christian Life: A Study in Theological Ethics (1994)\nGod, Medicine, and Suffering (1994)\nTheology Without Foundations: Religious Practice and the Future of Theological Truth (with Nancey Murphy and Mark Nation) (1994)\nDispatches from the Front: Theological Engagements with the Secular (1994)\nIn Good Company: The Church as Polis (1995)\nLord, Teach Us: The Lord's Prayer and the Christian Life (with William Willimon) (1996)\nWhere Resident Aliens Live (with William Willimon) (1996)\nChristians Among the Virtues: Theological Conversations with Ancient and Modern Ethics (with Charles Pinches) (1997)\nWilderness Wanderings: Probing Twentieth Century Theology and Philosophy (1997)\nSanctify Them in Truth: Holiness Exemplified (1998)\nPrayers Plainly Spoken (1999)\nThe Truth About God: The Ten Commandments in Christian Life (with William Willimon) (1999)\nA Better Hope: Resources for a Church Confronting Capitalism, Democracy and Postmodernity (2000)\nThe Hauerwas Reader (2001) ISBN 0-8223-2691-4\nWith the Grain of the Universe: The Church's Witness and Natural Theology (2001) ISBN 1-58743-016-9\nDissent from the Homeland: Essays after September 11 (2002) (Co-Editor with Frank Lentricchia)\nGrowing Old in Christ (2003)\nThe Blackwell Companion to Christian Ethics (with Samuel Wells) (2004)\nPerforming the Faith: Bonhoeffer and the Practice of Non-Violence (2004) ISBN 1-58743-076-2\nThe Wisdom of the Cross: Essays in Honor of John Howard Yoder (co-edited with Chris Huebner and Harry Huebner) (2005)\nThe State of the University: Academic Knowledges and the Knowledge of God (2007)\nMatthew (Brazos Theological Commentary on the Bible) (2007)\nChristianity, Democracy, and the Radical Ordinary: Conversations between a Radical Democrat and a Christian (with Romand Coles) (2007)\nLiving Gently in a Violent World: The Prophetic Witness of Weakness (with Jean Vanier) (2008)\nA Cross-Shattered Church: Reclaiming the Theological Heart of Preaching (2009)\nHannah's Child: A Theologian's Memoir (2010)\nCross-Shattered Christ: Meditations on the Seven Last Words (2011)\nWorking with Words: On Learning to Speak Christian (2011)\nWar and the American Difference: Theological Reflections on Violence and National Identity (2011)\nWithout Apology: Sermons for Christ's Church (2013)\nApproaching the End: Eschatological Reflection on Church, Politics, and Life (2013)\nThe Holy Spirit (with Will Willimon) (2015)\nThe Work of Theology (2015)\nSeries co-editor (with Peter Ochs) of Radical Traditions: Theology in a Postcritical Key, published by Westview Press/Harper Collins and SCM Press/Eerdmans\nSeries co-editor (with Peter Ochs and Ibrahim Moosa) of Encountering Traditions, published by Stanford University Press.\n\n\n=== Books about Hauerwas ===\nThe Church as Polis: From Political Theology to Theological Politics as Exemplified by Jurgen Moltmann and Stanley Hauerwas by Arne Rasmussen (1995)\nTransforming Fate into Destiny: The Theological Ethics of Stanley Hauerwas by Samuel Wells (1998)\nFaithfulness & Fortitude: In Conversation with the Theological Ethics of Stanley Hauerwas edited by Mark Thiessen Nation and Samuel Wells (2000)\nBeyond Universal Reason: The Relation between Religion and Ethics in the Work of Stanley Hauerwas by Emmanuel Katongole (2000)\nThe Ecclesiology of Stanley Hauerwas: A Christian Theology of Liberation by John Bromilow Thompson (2003)\nCritical Reflections on Stanley Hauerwas' Theology of Disability: Disabling Society, Enabling Theology by John Swinton (2005)\nGod, Truth, and Witness: Engaging Stanley Hauerwas edited by L. Gregory Jones, Reinhard Hutter, and C. Rosalee Velloso Ewell (2005)\nUnsettling Arguments: A Festschrift on the Occasion of Stanley Hauerwas's 70th Birthday edited by Charles R. Pinches, Kelly S. Johnson, and Charles M. Collier (2010)\nPostliberal Theology and the Church Catholic: Conversations with George Lindbeck, David Burrell, and Stanley Hauerwas by John Wright (2012)\nHauerwas: A (Very) Critical Introduction by Nicholas M. Healy (2014)\nThe Difference Christ Makes: Celebrating the Life, Work, and Friendship of Stanley Hauerwas. Edited by Charlie M. Collier. Cascade Books. (2015)\n\n\n== References ==\n\n\n== External links ==\nWunderkammer Magazine Interview, 2010\nInterview with Hauerwas, 2004\nInterview with Hauerwas, 2008\nStanley Hauerwas Reading Room at Tyndale Seminary\nA few articles and one audio lecture by Hauerwas at Jesus Radicals", "ns": 0, "pageid": 1451835, "title": "Stanley Hauerwas"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}