{"batchcomplete": "", "query": {"normalized": [{"to": "Stanley Grenz", "from": "Stanley_Grenz"}], "pages": {"1600197": {"extract": "Stanley James Grenz (born January 7, 1950 in Alpena, Michigan; died on March 12, 2005 in St. Paul's Hospital (Vancouver)) was an American Christian theologian and ethicist in the Baptist tradition.\n\n\n== Early years ==\nGrenz graduated from the University of Colorado in 1973. He then earned a M.Div. from Denver Seminary in 1976. Grenz earned his Doctor of Theology degree at University of Munich in Germany under the supervision of theologian Wolfhart Pannenberg. He was ordained to pastoral ministry on June 13, 1976. He later worked within the local church context as youth director and assistant pastor (Northwest Baptist Church, Denver, Colorado, 1971-1976), pastor (Rowandale Baptist Church, Winnipeg, Manitoba 1979-1981), and interim pastor on several occasions. He served on many Baptist boards and agencies and also as a consulting editor of Christianity Today.\n\n\n== Educator ==\nWhile in the pastorate (1979-1981), Grenz taught courses both at the University of Winnipeg and at Winnipeg Theological Seminary (now Providence Seminary). He served as Professor of Systematic Theology and Christian Ethics at the North American Baptist Seminary, Sioux Falls, South Dakota from 1981-1990.\nFor twelve years (1990-2002), Grenz held the position of Pioneer McDonald Professor of Baptist Heritage, Theology and Ethics at Carey Theological College and at Regent College in Vancouver. After a one-year sojourn as Distinguished Professor of Theology at Baylor University and George W. Truett Theological Seminary in Waco, Texas (2002-2003), he returned to Carey in August 2003 to resume his duties as Pioneer McDonald Professor of Theology.\nFrom 1996 to 1999 he carried an appointment as Professor of Theology and Ethics (Affiliate) at Northern Baptist Theological Seminary in Lombard, Illinois.\nIn fall 2004, he assumed an appointment as Professor of Theological Studies at Mars Hill Graduate School in Seattle, Washington.\nGrenz' primary contributions were made discussing how evangelical Christianity ought to relate to the world. He wrote on a wide range of subjects, from sexuality to history to basic apologetics, and was one of North America's leading evangelical voices in the late 20th century and early 21st century.\n\n\n== Personal ==\nMarried to Edna Grenz, a church musician, Grenz was the father of two children, Joel Grenz and Corina Kuban, and was grandfather to one grandchild, Anika Grace Kuban. Included in two editions of Who's Who in Religion, as well as in the 2002 edition of Who's Who in U.S. Writers, Editors and Poets, Grenz died in his sleep March 12, 2005 from a brain aneurysm in Vancouver.\n\n\n== Selected works ==\n\nPrayer: The Cry for the Kingdom, 1988 (2005 Revised Edition) (ISBN 0-913573-92-2)\nSexual Ethics: A Biblical Perspective, 1990 (ISBN 0-664-25750-X)\nRevisioning Evangelical Theology: A Fresh Agenda for the 21st Century, 1993 (ISBN 0-8308-1772-7)\nWomen in the Church: A Biblical Theology of Women in Ministry, with Denise Muir Kjesbo, 1995 (ISBN 0-8308-1862-6)\nA Primer on Postmodernism, 1996, (ISBN 0-8028-0864-6)\nCreated for Community: Connecting Christian Belief With Christian Living, 1996 (1998 Second Edition) (ISBN 0-8010-2125-1)\n20th Century Theology: God & the World in a Transitional Age with Roger Olson, 1997 (ISBN 0-8308-1525-2)\nWho Needs Theology?: An Invitation to the Study of God's Word - (Olson & Grenz) (1996) ISBN 0-8308-1878-2\nWelcoming but Not Affirming: An Evangelical Response to Homosexuality, 1998, (ISBN 0-664-25776-3)\nTheology for the Community of God, 2000, (ISBN 0-8028-4755-2)\nThe Moral Quest: Foundation of Christian Ethics, 2000, (ISBN 0-8308-1568-6)\nRenewing the Center: Evangelical Theology in a Post-Theological Era, 2000 (ISBN 0-8010-2239-8)\nBeyond Foundationalism: Shaping Theology in a Postmodern Context, with John Franke, 2000 (ISBN 0-664-25769-0)\nThe Social God and the Relational Self: A Trinitarian Theology of the Imago Dei, 2001, (ISBN 0-664-22203-X)\nRediscovering the Triune God: The Trinity in Contemporary Theology, 2004 (ISBN 0-8006-3654-6)\n\n\n== See also ==\nAmillennialism\nChristian ethics\nChristian theology\nEvangelical left\n\n\n== References ==\n\n\n== External links ==\nOfficial Web site", "ns": 0, "pageid": 1600197, "title": "Stanley Grenz"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}