{"batchcomplete": "", "query": {"normalized": [{"to": "Stephen Cole Kleene", "from": "Stephen_Cole_Kleene"}], "pages": {"28805": {"extract": "Stephen Cole Kleene /ˈkliːniː/ KLEE-nee (January 5, 1909 – January 25, 1994) was an American mathematician. One of the students of Alonzo Church, Kleene, along with Alan Turing, Emil Post, and others, is best known as a founder of the branch of mathematical logic known as recursion theory, which subsequently helped to provide the foundations of theoretical computer science. Kleene's work grounds the study of which functions are computable. A number of mathematical concepts are named after him: Kleene hierarchy, Kleene algebra, the Kleene star (Kleene closure), Kleene's recursion theorem and the Kleene fixpoint theorem. He also invented regular expressions, and made significant contributions to the foundations of mathematical intuitionism.\nAlthough his last name is commonly pronounced /ˈkliːniː/ KLEE-nee or /ˈkliːn/ kleen, Kleene himself pronounced it /ˈkleɪniː/ KLAY-nee. His son, Ken Kleene, wrote: \"As far as I am aware this pronunciation is incorrect in all known languages. I believe that this novel pronunciation was invented by my father.\"\n\n\n== Biography ==\nKleene was awarded the BA degree from Amherst College in 1930. He was awarded the Ph.D. in mathematics from Princeton University in 1934. His thesis, entitled A Theory of Positive Integers in Formal Logic, was supervised by Alonzo Church. In the 1930s, he did important work on Church's lambda calculus. In 1935, he joined the mathematics department at the University of Wisconsin–Madison, where he spent nearly all of his career. After two years as an instructor, he was appointed assistant professor in 1937.\nWhile a visiting scholar at the Institute for Advanced Study in Princeton, 1939–40, he laid the foundation for recursion theory, an area that would be his lifelong research interest. In 1941, he returned to Amherst College, where he spent one year as an associate professor of mathematics.\nDuring World War II, Kleene was a lieutenant commander in the United States Navy. He was an instructor of navigation at the U.S. Naval Reserve's Midshipmen's School in New York, and then a project director at the Naval Research Laboratory in Washington, D.C.\nIn 1946, Kleene returned to Wisconsin, becoming a full professor in 1948 and the Cyrus C. MacDuffee professor of mathematics in 1964. He was chair of the Department of Mathematics and Computer Science, 1962–63, and Dean of the College of Letters and Science from 1969 to 1974. The latter appointment he took on despite the considerable student unrest of the day, stemming from the Vietnam War. He retired from the University of Wisconsin in 1979. In 1999 the mathematics library at the University of Wisconsin was renamed in his honor.\nKleene's teaching at Wisconsin resulted in three texts in mathematical logic, Kleene (1952, 1967) and Kleene and Vesley (1965), often cited and still in print. Kleene (1952) wrote alternative proofs to the Gödel's incompleteness theorems that enhanced their canonical status and made them easier to teach and understand. Kleene and Vesley (1965) is the classic American introduction to intuitionist logic and mathematics.\nKleene served as president of the Association for Symbolic Logic, 1956–58, and of the International Union of History and Philosophy of Science, 1961. In 1990, he was awarded the National Medal of Science.\nKleene and his wife Nancy Elliott had four children. He had a lifelong devotion to the family farm in Maine. An avid mountain climber, he had a strong interest in nature and the environment, and was active in many conservation causes.\n\n\n== Important publications ==\n1936. « General recursive functions of natural numbers », Math. Ann., 112, 727–742.\n1952. Introduction to Metamathematics. New York: Van Nostrand. (Ishi Press: 2009 reprint).\n1956. \"Representation of Events in Nerve Nets and Finite Automata\" in Automata Studies. Claude Shannon and John McCarthy, eds.\n1965 (with Richard Eugene Vesley). The Foundations of Intuitionistic Mathematics. North-Holland.\n1967. Mathematical Logic. John Wiley. Dover reprint, 2002. ISBN 0-486-42533-9.\n1981. \"Origins of Recursive Function Theory\" in Annals of the History of Computing 3, No. 1.\n\n\n== See also ==\nKleene star\nKleene hierarchy\nKleene's smn theorem\nRealizability\nIntuitionism\nKleene–Rosser paradox\nKleene's algorithm\nKleene's theorem\nRegular expressions\n\n\n== References ==\nThis article is based on material taken from the Free On-line Dictionary of Computing prior to 1 November 2008 and incorporated under the \"relicensing\" terms of the GFDL, version 1.3 or later.\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Stephen Cole Kleene\", MacTutor History of Mathematics archive, University of St Andrews .\nStephen Cole Kleene at the Mathematics Genealogy Project\nBiographical memoir – by Saunders Mac Lane\nKleene bibliography.\nInterview with Kleene and John Barkley Rosser about their experiences at Princeton\nStephen Cole Kleene at DBLP Bibliography Server", "ns": 0, "pageid": 28805, "title": "Stephen Cole Kleene"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}