{"batchcomplete": "", "query": {"normalized": [{"to": "Stephen Bronner", "from": "Stephen_Bronner"}], "pages": {"992876": {"extract": "Stephen Eric Bronner (born 19 August 1949) is a political philosopher and Board of Governors Professor of Political Science at Rutgers University in New Brunswick, New Jersey, United States, and a member of the Democratic Socialists of America. Bronner has published over 25 books and 200 journal articles.\n\n\n== Early life and education ==\nBorn in New York City, New York, United States on 19 August 1949, Bronner earned a Bachelor of Arts (B.A.) at City College of New York, spent a year at the Universität Tübingen in Germany on a Fulbright-Hays Fellowship in 1973, and completed his Master of Arts (M.A.) and Doctor of Philosophy (Ph.D.) in Political Science from the University of California, Berkeley in 1976, after submitting a dissertation titled \"Authenticity and Potentiality: A Marxian Inquiry into the Role of the Subject.\"\n\n\n== Career ==\nBronner has been employed at Rutgers University since 1976, and has held visiting professor positions at the New School for Social Research (1989) the Universität Leipzig (1998).\nBronner is Director of Global Relations at the Center for the Study of Genocide and Human Rights at Rutgers University, and the Executive Chair of US Academics for Peace and an advisor to Conscience International. His activities in civic diplomacy led him to visit Iran, Iraq, Palestine, Syria, Sudan, and Darfur. His experiences are discussed in his books dealing with internal relations including Blood in the Sand (2005) and Peace out of Reach (2007).\nBronner is Senior Editor of Logos and on the editorial board of other journals. His various works include studies of contemporary political theory, political history, and cultural politics.\n\n\n== Theoretical contributions ==\nInfluenced by critical theory, existentialism, and liberal socialism, Bronner is best known his reinterpretation of tradition and a host of concepts like the class ideal and the cosmopolitan sensibility. He is perhaps the foremost contemporary proponent of developing the linkage of political theory, which has become increasingly academic and metaphysical in orientation, with practical and progressive political concerns. His work is discussed in Rational Radicalism and Political Theory: Essays in Honor of Stephen Eric Bronner, ed. by Michael J. Thompson (Lanham: Lexington Books, 2010).\n\n\n== Awards and honors ==\nBronner was the recipient of the MEPeace Award by the Network for Middle Eastern Politics in 2011. Along with various teaching awards, he received the Michael A. Harrington Prize for Moments of Decision (1991) and Honorable Mention for the David Easton Prize, which honored the best work of political theory of the last five years, for Reclaiming the Enlightenment. Bronner received the Charles McCoy Lifetime Achievement Prize from the American Political Science Association in 2005.\n\n\n== Bibliography ==\n\n\n=== Scholarly works ===\nThe Bigot: Why Prejudice Persists (Yale University Press, 2014) ISBN 978-0300162516\nModernism at the Barricades: Aesthetics, Politics, Utopia (Columbia University Press, 2012) ISBN 978-0231158220\nCritical Theory: A Very Short Introduction (Oxford University Press, 2011) ISBN 978-0199730070\nPeace Out of Reach: Middle Eastern Travels and the Search for Reconciliation (The University Press of Kentucky, 2007) ISBN 978-0813124469\nBlood in the Sand: Imperial Fantasies, Right-Wing Ambitions, and the Erosion of American Democracy (The University Press of Kentucky, 2005) ISBN 0-8131-2367-4\nSketch for a New Critical Theory (Zurich: Diaphanes Verlag, publication pending)\nReclaiming the Enlightenment: Toward a Politics of Radical Engagement (New York: Columbia University Press, 2004). ISBN 0-231-12608-5. Translation into Spanish: Reivindicación de la Ilustración, Pamplona, Laetoli, 2008. ISBN 978-84-935661-7-3.\nA Rumor about the Jews: Anti-Semitism. Conspiracy, and the Protocols of Zion (Paperback Edition–New York: Oxford University Press, 2004; Hardcover Edition–New York: St. Martin’s Press, 2000; Translation into German–Berlin: Propylaen Verlag, 2000). ISBN 0-19-516956-5; Translation into Spanish: Un rumor sobre los judíos, Pamplona, Laetoli, 2009. ISBN 978-84-92422-06-7.\nImagining the Possible: Radical Politics for Conservative Times (New York: Routledge, 2002). ISBN 0-415-93260-2\nOf Critical Theory and Its Theorists (2nd Edition–New York: Routledge, 2002; 1st Edition–London: Basil Blackwell, 1994; Translation into Portuguese–Rio de Janeiro: Papirus, 1997). ISBN 0-415-93263-7\nSocialism Unbound (2nd Edition:–Boulder, Colorado: Westview Press, 2000; 1st edition–New York: Routledge, 1990). ISBN 0-8133-6776-X\nIdeas in Action: Political Tradition in the Twentieth Century (Lanham, Maryland: Rowman & Littlefield, 1999; Translation into Korean–Seoul, Korea: Ingansarang Publishers, 2003). ISBN 0-8476-9387-2\nCamus: Portrait of a Moralist (Minneapolis: University of Minnesota Press, 1999; Translation into German–Berlin: Verlag Vorwerk 8, 2002). ISBN 0-8166-3283-9\nMoments of Decision: Political History and the Crises of Radicalism (New York: Routledge, 1992; Translation into German–Frankfurt am Main: Suhrkamp Verlag, 2000). ISBN 0-415-90465-X\nRosa Luxemburg: A Revolutionary for Our Times (3rd printing– Pennsylvania State University Press, 1997; 2nd printing–New York: Columbia University Press, 1987; 1st printing–London: Pluto Press, 1980). ISBN 0-271-02505-0\n\n\n=== Popular works ===\nAlbert Camus: The Thinker, The Artist, The Man (New York: Franklin Watts, 1996). ISBN 0-531-11305-1\nLeon Blum (New York: Chelsea House Publishing Co., 1986). ISBN 0-87754-511-1\nA Beggar’s Tales (New York: Pella Press, 1978). NO ISBN.\nAfterword for Will Eisner's graphic novel, The Plot (New York: W. W. Norton, 2005). ISBN 0-393-06045-4\n\n\n=== Edited works ===\nThe Logos Reader: Rational Radicalism And the Future of Politics (with Michael J. Thompson) (University Press of Kentucky, 2005). ISBN 0-8131-9148-3\nPlanetary Politics: Human Rights, Terror, and Global Society (Lanham, Maryland: Rowman & Littlefield, 2005). ISBN 0-7425-4199-1\nTwentieth Century Political Theory: A Reader (Revised 2nd Edition–New York: Routledge, publication pending 2004; 1st Edition, 1996). ISBN 0-415-94899-1\nRe-Framing the International: Law, Politics and Culture, co-edited with Lester Edwin J. Ruiz and R. B. J. Walker (Editor) (New York: Routledge, 2002). ISBN 0-415-93175-4\nVienna: The World of Yesterday 1889-1914, co-edited with F. Peter Wagner, (Atlantic Highlands, New Jersey: Humanities Press International, 1997). ISBN 0-391-03987-3\nTelevision and the Crisis of Democracy, co-edited with Douglas Kellner (Boulder, Colorado: Westview Press, 1990). ISBN 0-8133-0549-7\nThe Letters of Rosa Luxemburg, edited, translated, and with an introduction (2nd edition–Atlantic Highlands, New Jersey: Humanities Press International, 1993; 1st edition–Boulder, Colorado: Westview Press, 1979). ISBN 1-57392-581-0\nCritical Theory and Society, co-edited with Douglas Kellner,(New York: Routledge, 1989). ISBN 0-415-90041-7\nSocialism in History: Political Essays of Henry Patcher (New York: Columbia University Press, 1984). ISBN 0-231-05660-5\nPassion and Rebellion: The Expressionist Heritage co-edited with Douglas Kellner (2nd printing–New York: Columbia University Press, 1988; 1st printing– South Hadley, Massachusetts: Bergin & Garvey; New York: Universe Books; and London: Croom Helm, 1983). ISBN 0-87663-356-4\n\n\n=== Series editor ===\n\"Critical Political Theory and Radical Practice\" (New York, NY: Palgrave/Macmillan).\n\"Genocide, Atrocity, and Human Rights\" (New Brunswick, NJ: Rutgers University Press).\n\"Polemics\" (Lanham, Maryland: Rowman & Littlefield).\n\"Interventions: Social Theory and Contemporary Politics\" (Boulder, Colorado: Westview Press).\n\n\n== References ==\n\n\n== External links ==\nDepartment of Political Science at Rutgers, The State University of New Jersey\nIlluminations - The Critical Theory Project\n\"Enlightenment Now\" Interview by Gragory Zucker, The Brooklyn Rail (Winter 2005)", "ns": 0, "pageid": 992876, "title": "Stephen Bronner"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}