{"batchcomplete": "", "query": {"normalized": [{"to": "Steven Poole", "from": "Steven_Poole"}], "pages": {"1886024": {"extract": "Steven Poole (born in 1972) is a British author and journalist. He particularly concerns himself with the abuse of language and has written two books on the subject: Unspeak (2006) and Who Touched Base In My Thought Shower? (2013).\n\n\n== Biography ==\nPoole studied English at Emmanuel College, Cambridge, and has subsequently written for publications including The Independent, The Guardian, The Times Literary Supplement, The Sunday Times, and the New Statesman. He has published two books and currently writes a weekly nonfiction book-review column in the Saturday Guardian called Et Cetera, as well as regular longer book reviews, plus a monthly column in Edge magazine. Poole was invited to deliver the opening keynote address at the 2006 Sydney Writers' Festival, and also gave a keynote at the 2008 Future and Reality of Gaming conference in Vienna.\n\n\n== Books ==\n\n\n=== Trigger Happy ===\nTrigger Happy was published in 2000 by 4th Estate in the UK (with the subtitle \"The Inner Life of Videogames\") and by Arcade Publishing in the US (with the subtitle \"Videogames and the Entertainment Revolution\"). It is an investigation of the aesthetics of videogames, that notes similarities and differences with other artforms such as cinema, painting and literature, and finally offers a description of games as semiotic systems that may provoke \"aesthetic wonder\". In 2007, Poole released a PDF version of the book for free download on his website, calling it an \"experiment\" in the tip-jar model for writers. In 2013 collection of Poole's Edge columns was published as \"Trigger Happy 2.0\".\n\n\n=== Unspeak ===\nUnspeak was published in 2006 by Little, Brown in the UK, and by Grove Press in the US. The second UK edition (2007) has the subtitle \"Words Are Weapons\". It is a book about language in contemporary politics, structured around buzzphrases such as \"community\", climate change/global warming, and \"war on terror\". The book was shortlisted for Index on Censorship's T.R. Fyvel Award in 2006. According to the author, \"unspeak\" is related to framing: it is a rhetorical way of naming an issue so as to avoid having to argue one's position, and to render the opposing position inexpressible. Unspeak received a hostile review in the Guardian from former British government communications chief Alastair Campbell, who wrote: \"I am not quite sure what Poole is trying to say.\"  Since publication of the book, the author has continued to discuss new examples of unspeak at the book's dedicated blog.\n\n\n=== Who Touched Base In My Thought Shower? ===\nWho Touched Base In My Thought Shower? was released in October 2013 by Sceptre, an imprint of Hodder & Stoughton. The book was expanded from an article written for The Guardian and ridicules workplace jargon. The Spectator thought it \"does show occasional signs of having been written in a rush, but it's a valuable glossary to corporate life and demonstrates the empty-headed arrogance of what passes for management style.\"\n\n\n=== Rethink: the Surprising History of Ideas ===\nRethink: the Surprising History of Ideas is slated for release 15 November 2016 by Scribner. Among other subjects, it takes up the life-cycle of bad ideas.\n\n\n== Journalism ==\nPoole writes book reviews and literary and cultural essays for numerous publications, including a long obituary of Jean Baudrillard for The Guardian, and a critique of the work of Alain de Botton.\n\n\n== Media ==\nIn 2004, Poole presented a television documentary for BBC Four called Trigger Happy: The Invincible Rise of the Video Game, based on his book. He also appeared in the documentary Thumb Candy, and has guested on BBC Radio 4 and other outlets in numerous discussions about language, including an appearance on the Today programme in 2009 talking about the term \"swine flu\".\n\n\n== Other activities ==\nPoole is also a composer of music for documentary and short films, including the short film EVOL.\n\n\n== References ==\n\n\n== External links ==\nSteven Poole's official website\nSteven Poole at the Internet Movie Database\nSteven Poole's articles for The Guardian\nReview of Unspeak in The Washington Post\nReview of Unspeak at Slate", "ns": 0, "pageid": 1886024, "title": "Steven Poole"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}