{"batchcomplete": "", "query": {"pages": {"78402": {"extract": "Joannes Stobaeus (/dʒoʊˈænᵻs stoʊˈbiːəs/; Greek: Ἰωάννης ὁ Στοβαῖος; fl. 5th-century CE), from Stobi in Macedonia, was the compiler of a valuable series of extracts from Greek authors. The work was originally divided into two volumes containing two books each. The two volumes became separated in the manuscript tradition, and the first volume became known as the Extracts (also Eclogues) and the second volume became known as the Anthology (also Florilegium). Modern editions now refer to both volumes as the Anthology. The Anthology contains extracts from hundreds of writers, especially poets, historians, orators, philosophers and physicians. The subjects covered range from natural philosophy, dialectics, and ethics, to politics, economics, and maxims of practical wisdom. The work preserves fragments of many authors and works who otherwise might be unknown today.\n\n\n== Life ==\nOf his life nothing is known. He derived his surname apparently from being a native of Stobi in Macedonia Salutaris. The age in which he lived cannot be fixed with accuracy. He quotes no writer later than the early 5th century, and he probably lived around this time. From his silence in regard to Christian authors, it has been inferred that he was not a Christian. His name, though, would rather indicate a Christian, or at least the son of Christian parents.\n\n\n== Work ==\nHis anthology is a very valuable collection of extracts from earlier Greek writers, which he collected and arranged, in the order of subjects, as a repertory of valuable and instructive sayings. In most of the manuscripts there is a division into three books, forming two distinct works; the first and second books forming one work under the title Physical and Moral Extracts (also Eclogues; Greek: Ἐκλογαὶ φυσικαὶ καὶ ἠθικαί), the third book forming another work, called Florilegium or Sermones (or Anthology; Ἀνθολόγιον). The extracts were intended by Stobaeus for his son Septimius, and were preceded by a letter briefly explaining the purpose of the work and giving a summary of the contents. It is evident from this summary, preserved in Photius's Bibliotheca (9th century), that the work was originally divided into four books and two volumes, and that surviving manuscripts of the third book consist of two books which have been merged.\nAs each of the four books is sometimes called Anthologion, it is probable that this name originally belonged to the entire work. The full title, according to Photius, was Four Books of Extracts, Sayings and Precepts (Ἐκλογῶν, ἀποφθεγμάτων, ὑποθηκῶν βιβλία τέσσαρα [Eklogon, apophthegmaton, hypothekon biblia tessara]). At some time subsequent to Photius the two volumes were separated, and the two volumes became known to Latin Europe as the Eclogae and the Florilegium respectively. Modern editions have dropped these two titles and have reverted to calling the entire work the Anthology (Latin: Anthologium).\nThe introduction to the whole work, treating of the value of philosophy and of philosophical sects, is lost, with the exception of the concluding portion; the second book is little more than a fragment, and the third and fourth have been amalgamated by altering the original sections. Each chapter of the four books is headed by a title describing its matter. Stobaeus quoted more than five hundred writers, generally beginning with the poets, and then proceeding to the historians, orators, philosophers, and physicians. The works of the greater part of these have perished. It is to him that we owe many of our most important fragments of the dramatists. He has quoted over 500 passages from Euripides, 150 from Sophocles, and over 200 from Menander.\n\n\n=== Books 1 and 2 ===\nThe first two books (\"Eclogues\") consist for the most part of extracts conveying the views of earlier poets and prose writers on points of physics, dialectics, and ethics. We learn from Photius that the first book was preceded by a dissertation on the advantages of philosophy, an account of the different schools of philosophy, and a collection of the opinions of ancient writers on geometry, music, and arithmetic. The greater part of this introduction is lost. The close of it only, where arithmetic is spoken of, is still extant. The first book was divided into sixty chapters, the second into forty-six, of which the manuscripts preserve only the first nine. Some of the missing parts of the second book (chapters 15, 31, 33, and 46) have, however, been recovered from a 14th-century gnomology. His knowledge of physics — in the wide sense which the Greeks assigned to this term — is often untrustworthy. Stobaeus betrays a tendency to confound the dogmas of the early Ionian philosophers, and he occasionally mixes up Platonism with Pythagoreanism. For part of the first book and much of the second, it is clear that he depended on the (lost) works of the Peripatetic philosopher Aetius and the Stoic philosopher Arius Didymus.\n\n\n=== Books 3 and 4 ===\nThe third and fourth books (\"Florilegium\") are devoted to subjects of a moral, political, and economic kind, and maxims of practical wisdom. The third book originally consisted of forty-two chapters, and the fourth of fifty-eight. These two books, like the larger part of the second, treat of ethics; the third, of virtues and vices, in pairs; the fourth, of more general ethical and political subjects, frequently citing extracts to illustrate the pros and cons of a question in two successive chapters.\n\n\n=== Editions ===\nThe first edition of books 1 and 2 was that by G. Canter (Antwerp, 1575). There were subsequent editions made by A. H. L. Heeren (Göttingen, 1792–1801, in 4 vols. 8vo.), and Thomas Gaisford (Oxford, 1850). The first edition of books 3 and 4 was that edited by Trincavelli (Venice, 4to. 1536). Three editions were published by Conrad Gessner (Zurich, 1543; Basle, 1549; Zurich; 1559), and another by Gaisford (Oxford, 1822, 4 vols. 8vo.). The first edition of the whole of Stobaeus together was one published at Geneva in 1609. The next major edition of the whole corpus was that by Augustus Meineke (Leipzig, 1855–1864). The modern edition is that by Curt Wachsmuth and Otto Hense (Berlin, 1884–1912, 5 volumes). Wachsmuth and Hense's edition attempts, as far as possible, to restore the text of the Anthology as it was written by Stobaeus.\n\n\n== Bibliography ==\nThomas Gaisford (1822), Ioannis Stobaei Florilegium, ad manuscriptorum fidem emendavit et supplevit Thomas Gaisford, Volume 3, Oxford: Clarendon.\nThomas Gaisford (1822), Ioannis Stobaei Florilegium, ad manuscriptorum fidem emendavit et supplevit Thomas Gaisford, Volume 4, Oxford: Clarendon. [Latin transl.]\nThomas Gaisford (1823), Iōannou Stobaiou Anthologion – Ioannis Stobæi Florilegium, Volume 1, in bibliopolio Kuehniano.\nThomas Gaisford (1823), Iōannou Stobaiou Anthologion – Ioannis Stobæi Florilegium, Volume 2, in bibliopolio Kuehniano.\nThomas Gaisford (1824), Iōannou Stobaiou Anthologion – Ioannis Stobæi Florilegium, Volume 3, in bibliopolio Kuehniano.\nThomas Gaisford (1824), Iōannou Stobaiou Anthologion – Ioannis Stobæi Florilegium, Volume 4, in bibliopolio Kuehniano.\nStereotype Edition, Florilegium: ad optimorum librorum fidem editum, Volume 1, Tauchnitz, 1838.\nStereotype Edition, Florilegium: ad optimorum librorum fidem editum, Volume 2, Tauchnitz, 1838.\nStereotype Edition, Florilegium: ad optimorum librorum fidem editum, Volume 3, Tauchnitz, 1838.\nAugust Meineke (1855), Ioannis Stobaei Florilegium, Volumes 1–2, Leipzig: B. G. Teubner.\nAugust Meineke (1856), Ioannis Stobaei Florilegium, Volumes 3–4, Leipzig: B. G. Teubner.\nAugust Meineke (1860), Ioannis Stobaei Eclogarum Physicarum et Ethicarum, Volume 1, Leipzig: B. G. Teubner.\nAugust Meineke (1864), Ioannis Stobaei Eclogarum Physicarum et Ethicarum, Volume 2, Leipzig: B. G. Teubner.\nCurtius Wachsmuth, Otto Hense (1884), Ioannis Stobaei Anthologium, Volumes 1–2, Berlin: Weidmannsche Buchhandlung.\nCurtius Wachsmuth, Otto Hense (1894), Ioannis Stobaei Anthologium, Volume 1, Berlin: Weidmannsche Buchhandlung.\nCurtius Wachsmuth, Otto Hense (1909), Ioannis Stobaei Anthologium, Volume 2, Berlin: Weidmannsche Buchhandlung.\nCurtius Wachsmuth, Otto Hense (1912), Ioannis Stobaei Anthologium, Volume 3, Berlin: Weidmannsche Buchhandlung.\nCurtius Wachsmuth, Otto Hense (1923), Appendix – Index of Authors, Berlin: Weidmannsche Buchhandlung.\n\n\n== Citations ==\n\n\n== References ==\nCharles Peter Mason, \"Stobaeus\" entry, in William Smith (1870), Dictionary of Greek and Roman Biography and Mythology. Volume 3, pp. 914–5.\nWalter Scott, Alexander Stewart Ferguson (1936), Hermetica, Volume 1. Clarendon press.\nPeck, Harry Thurston. Harpers Dictionary of Classical Antiquities: \"Stobaeus\". New York. Harper and Brothers. 1898.\n\n\n== External links ==\n Works written by or about Joannes Stobaeus at Wikisource\nStobaeus – Perseus Catalog\nExcerpt from the Florilegium (original Ancient Greek text) (Greek)", "ns": 0, "pageid": 78402, "title": "Stobaeus"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}