{"batchcomplete": "", "query": {"normalized": [{"to": "Stuart Wilde", "from": "Stuart_Wilde"}], "pages": {"21405185": {"extract": "Stuart Wilde (24 September 1946 – 1 May 2013) was a British writer. Best known for his works on New Age, self-empowerment, and spirituality, he was also a lecturer, teacher, humorist, essayist, scriptwriter, lyricist, and music producer. He was the author of twenty books including the popular series The Taos Quintet: Miracles, The Force, Affirmations, The Quickening, and The Trick to Money is Having Some.\n\n\n== Early life ==\nWilde was born in Farnham, England. He has a twin sister, Dee Dee, who became well known in Britain for her weekly appearances on Top of the Pops with the dance troupe Pan's People. He was educated at St. George's College, Weybridge, Surrey. After his schooling he joined the English Stage Company in Sloane Square, London. A year later he opened a jeans business in Carnaby Street London, at the height of the Swinging Sixties where he enjoyed considerable commercial success.\n\n\n== Career ==\nHe studied alternative religions and Taoist philosophy for five years from the age of twenty-eight, and when he was thirty-three, he emigrated to the United States of America where he lived in Laguna Beach, California with his first wife Cynthia. He wrote his first book, Miracles, in 1983.\nShortly thereafter he began a career as a lecturer appearing mainly in New Thought Churches and at New Age conferences. In the 1990s he toured regularly with Deepak Chopra, Dr. Wayne Dyer and Louise Hay, appearing at venues such as the Sydney Entertainment Centre.\nWilde's London street slang and comedic way of presenting self-empowerment and spiritual ideas continue to attract a wide and diverse audience. He's been called ahead of his time,\" 'the teacher's teacher' because of the influence he has had on other writers and lecturers in the field\", provocative, poignant, controversial, funny, and his writing \"timeless\".\nHe remains a recognized figure for progressive thought in metaphysics and the field of human potential, and is often quoted with references to his work appearing across a wide swath of international cultural, business, and educational forums from the Kennedy Center for the Arts', interviews with American hip-hop artists and slam poets, international investment conferences, and the pages of international media such as CNET's \"Top 10 List: Human Development Gurus\" and The Times of India's \"Sunday Life\" section.\n\n\n== Death ==\nOn 1 May 2013, Wilde suffered a heart attack while driving through Ireland. He was 66 years old.\n\n\n== Principal philosophy ==\n\n\n=== Early Work ===\nWilde's principal philosophy states that, while many citizens may seem to be normal, acquiescing to the status quo, there exists, in fact, a vast population of what he calls Fringe Dwellers whose mind and soul do not align to the constraints of life in regular society that Wilde called Tick-Tock. Wilde believed through use of the theta state of meditation (4–7 cycles per second), humans can better control their emotional life and their bio-rhythms, and begin to see visions, and that those visions and extrasensory feeling will lead to a greater balance and more freedom.\nTo that end, he emphasized the importance of going beyond the habit of struggling, and advocated the need for financial freedom, themes stated in his books Life was Never Meant to be a Struggle (1987), The Trick to Money is Having Some (1989), and The Little Money Bible (1998).\nIn Affirmations (1986), Wilde laid out systems of self-talk that empower an individual to change their core beliefs. His book Sixth Sense (2000) discusses practical techniques for developing extrasensory perception.\n\n\n=== Later Work ===\nHe earned both praise and criticism for his later works which advance controversial concepts such as other dimensions, dematerialization, and Morph worlds.\nHis most avant garde philosophy is based on the idea that Paul Dirac's hypothesis of parallel antiparticle worlds is, in fact, correct, and that humans adept at trance meditation can become aware of spiritual dimensions placed at 90° from them left and right—dimensions, Wilde said, that follow Hawking's theory of transverse waves of light. Wilde acknowledged there was no empirical data to support his claim, but anecdotal evidence, gathered from more than two-thousand people whom he taught, stated they had experienced such transcendental 90° perception which led him to conclude these worlds exist.\nGrace, Gaia, and the End of Days (2009) maps out coordinates for these spiritual dimensions and offers \"a twenty-first century understanding of grace and spiritual evolution\"—and tools to activate it in one's life. In a 2009 interview Wilde said, \"Grace is a golden light, pure love, a divine energy, seen coming from these inner spiritual worlds. It is data-driven and laced with trillions of bits of fractal information that will guide you and help you evolve. The human system is configured to read this fractal data through visions and extra sensory intuitive feelings.\" Serenity and balance developed through regular trance meditation enable access this 'pure information', which he called stream of consciousness from a 'Higher Knowing', 'The Source', 'God'.\nWhile Wilde believed humans are multi-dimensional beings who possess both the celestial light and the dark, he posited they gravitate to one or the other based on inner feelings, thoughts, and actions. The quality of these feelings, moreover, determine the spiritual dimension an aspect of oneself will reside in any moment. Redemption (and a life of love and serenity) is possible for all by choosing the ways of the celestial. On the larger plane, he believed the light will eventually overcome the dark and advised aligning with the forces of light, the forces of God. He laid out techniques for doing so through cultivation of tenderness, generosity, respect, \"the soft eye\", mindfulness, meditation, time in nature and with animals, and avoidance of dark places, people, and media that sell specialness, fear, degradation, and greed. Move from the cold cerebral mind into the warmth of heart and feeling. \"There is strength in softness. Remember, It's all backwards,\" he was oft quoted.\n\n\n=== Additional Themes ===\nWilde was a staunch supporter of peace in the world, the philosophy of live and let live, animal rights and vegetarianism. Tom Lishman eulogised him this way—\n\nWe must remember that just because he has gone back to the non-physical realm he is still very much with us, we should not forget that his time here was set and agreed upon and he has completed his mission, that being said all fringe dwellers must now rise above the despair and confusion they feel and turn it into positive energy and by doing this they will honour his work in the best possible way. Stuart will be remembered for making a huge contribution towards the new golden age of peace and love that is fast approaching, his followers will indeed take up his torch and light up planet earth like never before. We must ponder this question...What if by him leaving his body at this time he can contribute even more to world peace ?, anyone that knows him will know that he will be doing just that.\"\n\n\n== Writings and music ==\nWilde was a prolific writer with 20 books appearing in more than 27 languages. A total of 95 unique titles (books, audio works, music) are in circulation, with several hundred essays and articles in syndication across digital media.\nHe was executive producer and lyricist on the music album Voice of the Feminine Spirit, which sold several hundred-thousand copies. He later produced and was the lyricist on two albums of Celtic music, Voice of the Celtic Myth (1997), and Creation (1999), and wrote the book and libretto for Tim Wheater's oratorio Heartland (1995). In 2010, his collaboration with Richard Tyler produced the ambient release The Mystery of the Sacred O, an homage \"to the earth spirit Gaia and the masculine (Ka), and feminine (Om) creative energies of the Universe.\"\n\n\n== Works ==\n\n\n=== Books ===\nMiracles, (Carlsbad: Hay House, 1983), ISBN 978-1-4019-1790-6, 1-56170-829-1 (PB Rev)\nThe Force, (Carlsbad: Hay House, 1984), ISBN 978-1-56170-166-7, 1-56170-166-1 (PB)\nAffirmations, (Carlsbad: Hay House, 1986), ISBN 978-1-56170-167-4, 1-56170-167-X (PB), ISBN 978-0-930603-02-1 (HC)\nLife Was Never Meant to Be a Struggle, (Carlsbad: Hay House, 1987), ISBN 978-1-56170-829-1 (PB)\nThe Quickening, (Carlsbad: Hay House, 1988), ISBN 978-1-56170-165-0 (PB)\nThe Trick to Money is Having Some, (Carlsbad: Hay House, 1989), ISBN 978-1-56170-168-1, 1-56170-168-8 (PB)\nThe Secrets of Life, (Carlsbad: Hay House, 1990) ISBN 978-1-4019-0736-5, 1-4019-0736-9 (PB)\nWhispering Winds of Change: Perceptions of a New World, (Carlsbad: Hay House 1993), ISBN 978-1-56170-160-5, 1-56170-537-3 (PB)\nWeight Loss for the Mind, (Carlsbad: Hay House, 1994), ISBN 978-1-56170-537-5 (PB)\nInfinite Self: 33 Steps to Reclaiming Your Inner Power, (Carlsbad: Hay House, 1995), ISBN 978-1-56170-349-4, 1561703494 (PB)\nSilent Power, (Carlsbad: Hay House, 1996), ISBN 978-1-56170-536-8, 1561705365 (PB), ISBN 978-1-4019-0511-8 (HC)\nThe Little Money Bible: The Ten Laws of Abundance, (Carlsbad: Hay House, 1998), ISBN 978-1-56170-829-1, 1561708291 (PB)\nSimply Wilde: Discover the Wisdom that Is, (written with Leon Nacson), (Carlsbad: Hay House, 1999), ISBN 978-1-56170-620-4 (PB)\nSixth Sense: Including the Secrets of the Etheric Subtle Body, (Carlsbad: Hay House, 2000), ISBN 978-1-56170-501-6 (PB)\nWilde Unplugged: A Dictionary of Life (written with Brooke Claussen) (2002)(ebook)\nGod's Gladiators, (Brookemark, 2003), ISBN 978-0-9714396-3-4 (PB), (ebook)\nThe Three Keys to Self-Empowerment, (Carlsbad: Hay House, 2004), ISBN 978-1-4019-0350-3\nThe Art of Redemption, (Carlsbad: Hay House, 2007), ISBN 978-1-4019-1754-8 (PB)\nGrace, Gaia and the End of Days (with essay by Khris Krepcik), (Carlsbad: Hay House, 2009), ISBN 978-1-4019-2006-7 (PB)\nPlum Red: Taoist Tales of Old China (Tolemac Canada, 2010), ISBN 978-0-9867300-0-9\n\n\n=== Audio works ===\n\n\n=== Music ===\n(Partial list)\nVoice of the Feminine Spirit, (Preston/Wheater/Wilde featuring Cecelia) (1994)\nHeartland, (Lord/Wheater/Wilde) (1995)\nVoice of Violet 19, (Lord/Wilde featuring Cecelia) (1996)\nVoice of the Celtic Myth, (Greenwood/Wilde featuring Cecelia) (1997)\nCreation (1999)\nWhere the Raven Lands (2006)\nThe Mystery of the Sacred O, (Tyler/Wilde featuring Sarah Leonard) (2010)\n\n\n=== Film ===\nFive Walking, (Tolemac Films Ltd) (2011)\nSnowball, (Constantin Film AG) (2011)\n\n\n=== Video ===\nSelected lectures, music and tone poems. (Partial list)\nThe Hand, (Tyler/Wilde) (2:10 mins)\nPerception & Sensuality, (Tyler/Wilde) (2:31 mins)\nGayatri Mantra Honouring the Gods (Tyler/Wilde) (3:00 min)\nThe Tears of Gaia (4:59 mins)\nSpiritual Evolution of Dogs (1:53 mins)\nThe Love of Trees (3:17 mins)\nStuart Wilde: The Mastery of Money (70:37 mins) on YouTube\n\n\n=== Articles and teachings ===\nSelected writings from collections of articles and essays at stuartwilde.com, thesacredtearsofgaia.com, thehoodedsage.com, and zenhaven.com:\n\n\n== See also ==\nTaoism\nEckhart Tolle\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nOfficial YouTube Channel\nStuart Wilde at Hay House\nPress and interviews\nWith Patty Kovacs, wsradio.com, 08-09. (Part 1) (Part 2) (Part 3) The power of humility, how to lead a life of true meaning and peace.\nWith Jeff Brady, \"In Other News\", Sky Watch Radio, 05-06-12 On 'Silent Power'\", fringe dwellers, the Tao.\nWIth Nicole Whitney on News for the Soul Radio Show, 09-19-12, 2010, and additional guest spots.\nWith the Kerry O'Connor Show, 08-12.\nStuart Wilde on Radio Archive, \"Stuie Media Appearances\" (playlist), and collected interviews.\nInterview with Veronica Haye, \"On Money, Energy and Empowerment'\".\nKhris Krepcik, \"In Tribute to Stuart Wilde\", 07-22-13", "ns": 0, "pageid": 21405185, "title": "Stuart Wilde"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}