{"batchcomplete": "", "query": {"normalized": [{"to": "Sun Yat-sen", "from": "Sun_Yat-sen"}], "pages": {"88483": {"extract": "Sun Yat-sen (/ˈsʊn ˈjɑːtˈsɛn/; 12 November 1866 – 12 March 1925) was a Chinese revolutionary, first president and founding father of the Republic of China, and medical practitioner. As the foremost pioneer of the Republic of China, Sun is referred to as the \"Father of the Nation\" in the Republic of China (ROC), and the \"forerunner of democratic revolution\" in the People's Republic of China (PRC). Sun played an instrumental role in the overthrow of the Qing dynasty during the years leading up to the Double Ten Revolution. He was appointed to serve as Provisional President of the Republic of China when it was founded in 1912. He later co-founded the Kuomintang (KMT), serving as its first leader. Sun was a uniting figure in post-Imperial China, and he remains unique among 20th-century Chinese politicians for being widely revered amongst the people from both sides of the Taiwan Strait.\nAlthough Sun is considered to be one of the greatest leaders of modern China, his political life was one of constant struggle and frequent exile. After the success of the revolution, he quickly resigned, due to Beiyang Clique pressure, from his post as President of the newly founded Republic of China, and led successive revolutionary governments as a challenge to the warlords who controlled much of the nation. Sun did not live to see his party consolidate its power over the country during the Northern Expedition. His party, which formed a fragile alliance with the Communists, split into two factions after his death.\nSun's chief legacy resides in his developing of the political philosophy known as the Three Principles of the People: nationalism (non-ethnic, independence from imperialist domination), democracy, and the people's livelihood (free trade and Georgist tax reform).\n\n\n== Names ==\n\nSun was born as Sun Wen (Cantonese: Syūn Màhn; 孫文), and his genealogical name was Sun Deming (Syūn Dāk-mìhng; 孫德明). As a child, his \"milk name\" was Dixiang (Dai-jeuhng; 帝象). Sun's courtesy name was Zaizhi (Jai-jī; 載之), and his baptized name was Rixin (Yaht-sān; 日新). While at school in Hong Kong he got the name Yat-sen (Chinese: 逸仙; pinyin: Yìxiān). Sūn Zhōngshān (孫中山), the most popular of his Chinese names, came from the \"Nakayama\" (中山) of Nakayama Shō (中山樵), the Japanese name given to him by Tōten Miyazaki.\n\n\n== Early years ==\n\n\n=== Birthplace and early life ===\nSun Yat-sen was born on 12 November 1866. His birthplace was the village of Cuiheng, Xiangshan County (now Zhongshan City), Guangdong Province. He had a cultural background of Hakka and Cantonese. After finishing primary education, he moved to Honolulu in the Kingdom of Hawaii, where he lived a comfortable life of modest wealth supported by his elder brother Sun Mei.\n\n\n=== Education years ===\n\nAt the age of 10, Sun Yat-sen began seeking schooling. It is also at this point where he met childhood friend Lu Haodong. By age 13 in 1878 after receiving a few years of local schooling, Sun went to live with his elder brother, Sun Mei (孫眉) in Honolulu.\nSun Yat-sen then studied at ʻIolani School where he learned English, British history, mathematics, science, and Christianity. Originally unable to speak the English language, Sun Yat-sen picked up the language so quickly that he received a prize for outstanding achievement from King David Kalākaua. Sun graduated from Iolani in 1882. He then attended Oahu College (now known as Punahou School) for one semester. In 1883 he was soon sent home to China as his brother was becoming afraid that Sun Yat-sen would embrace Christianity.\nWhen he returned home in 1883 at age 17, Sun met up with his childhood friend Lu Haodong at Beijidian (北極殿), a temple in Cuiheng Village. They saw many villagers worshipping the Beiji (literally North Pole) Emperor-God in the temple, and were dissatisfied with their ancient healing methods. They broke the statue, incurring the wrath of fellow villagers, and escaped to Hong Kong. While in Hong Kong in 1883 he studied at the Diocesan Boys' School, and from 1884 to 1886 he was at the Government Central School.\nIn 1886 Sun studied medicine at the Guangzhou Boji Hospital under the Christian missionary John G. Kerr. Ultimately, he earned the license of Christian practice as a medical doctor from the Hong Kong College of Medicine for Chinese (the forerunner of The University of Hong Kong) in 1892. Notably, of his class of 12 students, Sun was one of only two who graduated.\n\n\n== Christian baptism ==\nIn the early 1880s, Sun Mei sent his brother to ʻIolani School, which was under the supervision of British Anglicans and directed by an Anglican prelate called Alfred Willis. The language of instruction was English. Although Bishop Willis emphasized that no one was forced to accept Christianity, the students were required to attend chapel on Sunday. At Iolani School, young Sun Wen first came in contact with Christianity, and it made a deep impression on him. Schriffin writes that Christianity was to have a great influence on Sun's whole future political life.\nSun was later baptized in Hong Kong by an American missionary of the Congregational Church of the United States to his brother's disdain. The minister would also develop a friendship with Sun. Sun attended To Tsai Church (道濟會堂), founded by the London Missionary Society in 1888, while he studied Western Medicine in Hong Kong College of Medicine for Chinese. Sun pictured a revolution as similar to the salvation mission of the Christian church. His conversion to Christianity was related to his revolutionary ideals and push for advancement.\n\n\n== Transformation into a revolutionary ==\n\n\n=== Four Bandits ===\nDuring the Qing Dynasty rebellion around 1888, Sun was in Hong Kong with a group of revolutionary thinkers who were nicknamed the Four Bandits at the Hong Kong College of Medicine for Chinese. Sun, who had grown increasingly frustrated by the conservative Qing government and its refusal to adopt knowledge from the more technologically advanced Western nations, quit his medical practice in order to devote his time to transforming China.\n\n\n=== Furen and Revive China Society ===\nIn 1891, Sun met revolutionary friends in Hong Kong including Yeung Ku-wan who was the leader and founder of the Furen Literary Society. The group was spreading the idea of overthrowing the Qing. In 1894, Sun wrote an 8,000 character petition to Qing Viceroy Li Hongzhang presenting his ideas for modernizing China. He traveled to Tianjin to personally present the petition to Li but was not granted an audience. After this experience, Sun turned irrevocably toward revolution. He left China for Hawaii and founded the Revive China Society, which was committed to revolutionizing China’s prosperity. Members were drawn mainly from Chinese expatriates, especially the lower social classes. The same month in 1894 the Furen Literary Society was merged with the Hong Kong chapter of the Revive China Society. Thereafter, Sun became the secretary of the newly merged Revive China society, which Yeung Ku-wan headed as president. They disguised their activities in Hong Kong under the running of a \"Qianheng Company\" (乾亨行).\n\n\n=== First Sino-Japanese War ===\nIn 1895, China suffered a serious defeat during the First Sino-Japanese War. There were two types of responses. One group of intellectuals contended that the Manchu Qing government could restore its legitimacy by successfully modernizing. Stressing that overthrowing the Manchu would result in chaos and would lead to China being carved up by imperialists, intellectuals like Kang Youwei and Liang Qichao supported responding with initiatives like the Hundred Days' Reform. In another faction, Sun Yat-sen and others like Zou Rong wanted a revolution to replace the dynastic system with a modern nation-state in the form of a republic. The Hundred Days' reform turned out to be a failure by 1898.\n\n\n== From uprising to exile ==\n\n\n=== First Guangzhou uprising ===\nIn the second year of the establishment of the Revive China society on 26 October 1895, the group planned and launched the First Guangzhou uprising against the Qing in Guangzhou. Yeung Kui-wan directed the uprising starting from Hong Kong. However, plans were leaked out and more than 70 members, including Lu Haodong, were captured by the Qing government. The uprising was a failure. Sun received financial support mostly from his brother who sold most of his 12,000 acres of ranch and cattle in Hawaii.\n\n\n=== Exile in Japan ===\nSun Yat-sen spent time living in Japan while in exile. He befriended and was financially aided by a democratic revolutionary named Miyazaki Toten. Most Japanese who actively worked with Sun were motivated by a pan-Asian fear of encroaching Western imperialism. While in Japan, Sun also met and befriended Mariano Ponce, then a diplomat of the First Philippine Republic. During the Philippine Revolution and the Philippine–American War, Sun helped Ponce procure weapons salvaged from the Imperial Japanese Army and ship the weapons to the Philippines. By helping the Philippine Republic, Sun hoped that the Filipinos would win their independence so that he could use the archipelago as a staging point of another revolution. However, as the war ended in July 1902, America emerged victorious from a bitter 3-year war against the Republic. Therefore, the Filipino dream of independence vanished with Sun's hopes of collaborating with the Philippines in his revolution in China.\n\n\n=== Huizhou uprising in China ===\nOn 22 October 1900, Sun launched the Huizhou uprising to attack Huizhou and provincial authorities in Guangdong. This came five years after the failed Guangzhou uprising. This time, Sun appealed to the triads for help. This uprising was also a failure. Miyazaki who participated in the revolt with Sun wrote an account of this revolutionary effort under the title \"33-year dream\" (三十三年之夢) in 1902.\n\n\n=== Further exile ===\nSun was in exile not only in Japan but also in Europe, the United States, and Canada. He raised money for his revolutionary party and to support uprisings in China. In 1896 he was detained at the Chinese Legation in London, where the Chinese Imperial secret service planned to kill him. He was released after 12 days through the efforts of James Cantlie, The Times, and the Foreign Office, leaving Sun a hero in Britain. James Cantlie, Sun's former teacher at the Hong Kong College of Medicine for Chinese, maintained a lifelong friendship with Sun and would later write an early biography of Sun.\n\n\n=== Heaven and Earth Society, overseas travel ===\nA \"Heaven and Earth Society\" sect known as Tiandihui had been around for a long time. The group has also been referred to as the \"three cooperating organizations\" as well as the triads. Sun Yat-sen mainly used this group to leverage his overseas travels to gain further financial and resource support for his revolution.\nAccording to Lee Yun-ping, chairman of the Chinese historical society, Sun needed a certificate to enter the United States at a time when the Chinese Exclusion Act of 1882 would have otherwise blocked him. However, on Sun's first attempt to enter the US, he was still arrested. He was later bailed out after 17 days. In March 1904, while residing in Kula, Maui, Sun Yat-sen obtained a Certificate of Hawaiian Birth, issued by the Territory of Hawaii, stating that \"he was born in the Hawaiian Islands on the 24th day of November, A.D. 1870.\" He renounced it after it served its purpose to circumvent the Chinese Exclusion Act of 1882. Official files of the United States show that Sun had United States nationality, moved to China with his family at age 4, and returned to Hawaii 10 years later.\n\n\n== Revolution ==\n\n\n=== Tongmenghui ===\n\nIn 1904, Sun Yat-sen came about with the goal \"to expel the Tatar barbarians (i.e. Manchu), to revive Zhonghua, to establish a Republic, and to distribute land equally among the people.\" (驅除韃虜, 恢復中華, 創立民國, 平均地權). One of Sun's major legacies was the creation of his political philosophy of the Three Principles of the People. These Principles included the principle of nationalism (minzu, 民族), of democracy (minquan, 民權), and of welfare (minsheng, 民生).\nOn 20 August 1905, Sun joined forces with revolutionary Chinese students studying in Tokyo, Japan to form the unified group Tongmenghui (United League), which sponsored uprisings in China. By 1906 the number of Tongmenghui members reached 963 people.\n\n\n=== Malaya support ===\n\nSun's notability and popularity extends beyond the Greater China region, particularly to Nanyang (Southeast Asia), where a large concentration of overseas Chinese resided in Malaya (Malaysia and Singapore). While in Singapore, he met local Chinese merchants Teo Eng Hock, Tan Chor Nam and Lim Nee Soon, which mark the commencement of direct support from the Nanyang Chinese. The Singapore chapter of the Tongmenghui was established on 6 April 1906. Though some records claim the founding date to be end of 1905. The villa used by Sun was known as Wan Qing Yuan. At this point Singapore was the headquarters of the Tongmenghui.\nThus, after founding the Tong Meng Hui, Dr Sun advocated the establishment of The Chong Shing Yit Pao as the alliance’s mouthpiece to promote revolutionary ideas. Later, he initiated the establishment of reading clubs across Singapore and Malaysia, in order to disseminate revolutionary ideas among the lower class through public readings of newspaper stories. The United Chinese Library, founded on 8 August 1910, was one such reading club, first set up at leased property on the second floor of the Wan He Salt Traders in North Boat Quay.\nThe first actual United Chinese Library building was built between 1908 and 1911 below Fort Canning - 51 Armenian Street, commenced operations in 1912. The library was set up as a part of the 50 reading rooms by the Chinese Republicans to serve as an information station and liaison point for the revolutionaries. In 1987, the library was moved to its present site at Cantonment Road. But the Armenian Street building is still intact with the plaque at its entrance with Sun Yat Sen's words. With an initial membership of over 400, the library has about 180 members today. Although the United Chinese Library, with 102 years of history, was not the only reading club in Singapore during the time, today it is the only one of its kind remaining.\n\n\n=== Zhennanguan uprising ===\nOn 1 December 1907, Sun led the Zhennanguan uprising against the Qing at Friendship Pass, which is the border between Guangxi and Vietnam. The uprising failed after seven days of fighting. In 1907 there were a total of four uprisings that failed including Huanggang uprising, Huizhou seven women lake uprising and Qinzhou uprising. In 1908 two more uprisings failed one after another including Qin-lian uprising and Hekou uprising.\n\n\n=== Anti-Sun movements ===\nBecause of these failures, Sun's leadership was beginning to be challenged by elements from within the Tongmenghui who wished to remove him as leader. In Tokyo 1907–1908 members from the recently merged Restoration society raised doubts about Sun's credentials. Tao Chengzhang (陶成章) and Zhang Binglin publicly denounced Sun with an open leaflet called \"A declaration of Sun Yat-sen's criminal acts by the revolutionaries in Southeast Asia\". This was printed and distributed in reformist newspapers like Nanyang Zonghui Bao. Their goal was to target Sun as a leader leading a revolt for profiteering gains.\nThe revolutionaries were polarized and split between pro-Sun and anti-Sun camps. Sun publicly fought off comments about how he had something to gain financially from the revolution. However, by 19 July 1910, the Tongmenghui headquarters had to relocate from Singapore to Penang to reduce the anti-Sun activities. It is also in Penang that Sun and his supporters would launch the first Chinese \"daily\" newspaper, the Kwong Wah Yit Poh in December 1910.\n\n\n=== 1911 revolution ===\n\nTo sponsor more uprisings, Sun made a personal plea for financial aid at the Penang conference held on 13 November 1910 in Malaya. The leaders launched a major drive for donations across the Malay Peninsula. They raised HK$187,000.\nOn 27 April 1911, revolutionary Huang Xing led a second Guangzhou uprising known as the Yellow Flower Mound revolt against the Qing. The revolt failed and ended in disaster; the bodies of only 72 revolutionaries were found. The revolutionaries are remembered as martyrs.\nOn 10 October 1911, a military uprising at Wuchang took place led again by Huang Xing. At the time, Sun had no direct involvement as he was still in exile. Huang was in charge of the revolution that ended over 2000 years of imperial rule in China. When Sun learned of the successful rebellion against the Qing emperor from press reports, he immediately returned to China from the United States accompanied by his American military advisor, \"General\" Homer Lea, on 21 December 1911.\nThe uprising expanded to the Xinhai Revolution also known as the \"Chinese Revolution\" to overthrow the last Emperor Puyi. After this event, 10 October became known as the commemoration of Double Ten Day.\n\n\n== Republic of China with many governments ==\n\n\n=== Provisional government ===\n\nOn 29 December 1911 a meeting of representatives from provinces in Nanking (Nanjing) elected Sun Yat-sen as the \"provisional president\" (臨時大總統). January 1, 1912 was set as the first day of the First Year of the Republic. Li Yuanhong was made provisional vice-president and Huang Xing became the minister of the army. The new Provisional Government of the Republic of China was created along with the Provisional Constitution of the Republic of China. Sun is credited for the funding of the revolutions and for keeping the spirit of revolution alive, even after a series of failed uprisings. His successful merger of minor revolutionary groups to a single larger party provided a better base for all those who shared the same ideals. A number of things were introduced such as the republic calendar system and new fashion like Zhongshan suits.\n\n\n=== Beiyang government ===\n\nYuan Shikai, who controlled the Beiyang Army, the military of northern China, was promised the position of President of the Republic of China if he could get the Qing court to abdicate. On 12 February 1912 Emperor Puyi did abdicate the throne. Sun stepped down as President, and Yuan became the new provisional president in Beijing on 10 March 1912. The provisional government did not have any military forces of its own, its control over elements of the New Army that had mutinied was limited and there were still significant forces which still had not declared against the Qing.\nSun Yat-sen sent telegrams to the leaders of all provinces requesting them to elect and to establish the National Assembly of the Republic of China in 1912. In May 1912 the legislative assembly moved from Nanjing to Beijing with its 120 members divided between members of Tongmenghui and a Republican party that supported Yuan Shikai. Many revolutionary members were already alarmed by Yuan's ambitions and the northern based Beiyang government.\n\n\n=== Nationalist party and Second Revolution ===\nTongmenghui member Song Jiaoren quickly tried to control the parliament. He mobilized the old Tongmenghui at the core with the merger of a number of new small parties to form a new political party called the Kuomintang (Chinese nationalist party, commonly abbreviated as \"KMT\") on 25 August 1912 at Huguang Guild Hall Beijing. The 1912–1913 National assembly election was considered a huge success for the KMT winning 269 of the 596 seats in the lower house and 123 of the 274 senate seats. The Second Revolution took place where Sun and KMT military forces tried to overthrow Yuan's forces of about 80,000 men in an armed conflict in July 1913. The revolt against Yuan was unsuccessful. Sun was forced to seek asylum in Japan with politician and industrialist Fusanosuke Kuhara. In retaliation the national party leader Song Jiaoren was assassinated, almost certainly by a secret order of Yuan, on 20 March 1913.\n\n\n=== Political chaos ===\nIn 1915 Yuan Shikai proclaimed the Empire of China (1915–1916) with himself as Emperor of China. Sun took part in the Anti-Monarchy war of the Constitutional Protection Movement, while also supporting bandit leaders like Bai Lang during the Bai Lang Rebellion. This marked the beginning of the Warlord Era. In 1915 Sun wrote to the Second International, a socialist-based organization in Paris, asking it to send a team of specialists to help China set up the world's first socialist republic. At the time there were many theories and proposals of what China could be. In the political mess, even when Sun Yat-sen was announced as President, Xu Shichang was also announced as President of the Republic of China.\n\n\n== Path to Northern Expedition ==\n\n\n=== Guangzhou militarist government ===\nChina had become divided between different military leaders without a proper central government. Sun saw the danger of this and returned to China in 1917 to advocate Chinese reunification. In 1921 he started a self-proclaimed military government in Guangzhou and was elected Grand Marshal. Between 1912 and 1927 three governments had been set up in South China: the Provisional government in Nanjing (1912), the Military government in Guangzhou (1921–1925), and the National government in Guangzhou and later Wuhan (1925–1927). The southern separatist government in the South was established to rival the Beiyang government in the north. Yuan Shikai had banned the KMT. The short lived Chinese Revolutionary Party was a temporary replacement for the KMT. On 10 October 1919 Sun resurrected the KMT with the new name Chung-kuo Kuomintang (simplified Chinese: 中国国民党; traditional Chinese: 中國國民黨; pinyin: Zhōngguó guómíndǎng), or the \"Nationalist Party of China\".\n\n\n=== KMT–CPC cooperation ===\nBy this time Sun had become convinced that the only hope for a unified China lay in a military conquest from his base in the south, followed by a period of political tutelage that would culminate in the transition to democracy. In order to hasten the conquest of China, he began a policy of active cooperation with the Communist Party of China (CPC). Sun and the Soviet Union's Adolph Joffe signed the Sun-Joffe Manifesto in January 1923. Sun received help from the Comintern for his acceptance of communist members into his KMT. Revolutionary and socialist leader Vladimir Lenin praised Sun and the KMT for their ideology and principles. Lenin praised Sun and his attempts at social reformation, and also congratulated him for fighting foreign Imperialism. Sun also returned the praise, calling him a \"great man\", and sent his congratulations on the revolution in Russia.\nWith the Soviets' help, Sun was able to develop the military power needed for the Northern Expedition against the military at the north. He established the Whampoa Military Academy near Guangzhou with Chiang Kai-shek as the commandant of the National Revolutionary Army (NRA). Other Whampoa leaders include Wang Jingwei and Hu Hanmin as political instructors. This full collaboration was called the First United Front.\n\n\n=== Finance concerns ===\nIn 1924 Sun appointed his brother-in-law T. V. Soong to set up the first Chinese Central bank called the Canton Central Bank. To establish national capitalism and a banking system was a major objective for the KMT. However Sun was not without some opposition as there was the Canton volunteers corps uprising against him.\n\n\n=== Final speeches ===\nIn February 1923 Sun made a presentation to the Students' Union in Hong Kong University and declared that it was the corruption of China and the peace, order and good government of Hong Kong that turned him into a revolutionary. This same year, he delivered a speech in which he proclaimed his Three Principles of the People as the foundation of the country and the Five-Yuan Constitution as the guideline for the political system and bureaucracy. Part of the speech was made into the National Anthem of the Republic of China.\nOn 10 November 1924, Sun traveled north to Tianjin and delivered a speech to suggest a gathering for a \"National conference\" for the Chinese people. It called for the end of warlord rules and the abolition of all unequal treaties with the Western powers. Two days later, he traveled to Beijing to discuss the future of the country, despite his deteriorating health and the ongoing civil war of the warlords. Among the people he met was the Muslim General Ma Fuxiang, who informed Sun that they would welcome the leadership of Dr. Sun. On 28 November 1924 Sun traveled to Japan and gave a speech on Pan-Asianism at Kobe, Japan.\n\n\n=== Death ===\nSun died of liver cancer on 12 March 1925 at the age of 58 at the Rockefeller-financed Peking Union Medical College. In keeping with common Chinese practice, his remains were placed in the Temple of Azure Clouds, a Buddhist shrine in the Western Hills a few miles outside of Beijing. He also left a short political will (總理遺囑) penned by Wang Jingwei to address the mass, which had a widespread influence in the subsequent development of the Republic of China and Taiwan.\nA mausoleum was built and completed in 1929. On 1 June 1929, Sun's remains were relocated from Beijing and buried in Sun Yat-sen Mausoleum in Nanjing.\n\n\n== Legacy ==\n\n\n=== Power struggle ===\nAfter Sun's death, a power struggle between his young protégé Chiang Kai-shek and his old revolutionary comrade Wang Jingwei split the KMT. At stake in this struggle was the right to lay claim to Sun's ambiguous legacy. In 1927 Chiang Kai-shek married Soong Mei-ling, a sister of Sun's widow Soong Ching-ling, and subsequently he could claim to be a brother-in-law of Sun. When the Communists and the Kuomintang split in 1927, marking the start of the Chinese Civil War, each group claimed to be his true heirs, a conflict that continued through World War II. Sun's widow, Soong Ching-ling, sided with the Communists during the Chinese Civil War and served from 1949 to 1981 as Vice-President (or Vice-Chairwoman) of the People's Republic of China and as Honorary President shortly before her death in 1981.\n\n\n=== Cult of personality ===\nA personality cult in the Republic of China was centered on Sun and his successor, Generalissimo Chiang Kai-shek. Chinese Muslim Generals and Imams participated in this cult of personality and one party state, with Muslim General Ma Bufang making people bow to Sun's portrait and listen to the national anthem during a Tibetan and Mongol religious ceremony for the Qinghai Lake God. Quotes from the Quran and Hadith were used by Muslims to justify Chiang Kai-shek's rule over China.\nThe Kuomintang's constitution designated Sun as party president. After his death, the Kuomintang opted to keep that language in its constitution to honor his memory forever. The party has since been headed by a director-general (1927-1975) and a chairman (since 1975), which discharge the functions of the president.\n\n\n=== Father of the Nation ===\nSun Yat-sen remains unique among 20th-century Chinese leaders for having a high reputation both in mainland China and in Taiwan. In Taiwan, he is seen as the Father of the Republic of China, and is known by the posthumous name Father of the Nation, Mr. Sun Zhongshan (Chinese: 國父　孫中山先生, where the one-character space is a traditional homage symbol). His likeness is still almost always found in ceremonial locations such as in front of legislatures and classrooms of public schools, from elementary to senior high school, and he continues to appear in new coinage and currency.\n\n\n=== \"Forerunner of the revolution\" ===\nOn the mainland, Sun is seen as a Chinese nationalist and proto-socialist, and is highly regarded as the Forerunner of the Revolution (革命先行者). He is even mentioned by name in the preamble to the Constitution of the People's Republic of China. In recent years, the leadership of the Communist Party of China has increasingly invoked Sun, partly as a way of bolstering Chinese nationalism in light of Chinese economic reform and partly to increase connections with supporters of the Kuomintang on Taiwan which the PRC sees as allies against Taiwan independence. Sun's tomb was one of the first stops made by the leaders of both the Kuomintang and the People First Party on their pan-blue visit to mainland China in 2005. A massive portrait of Sun continues to appear in Tiananmen Square for May Day and National Day.\n\n\n=== Religious veneration ===\nSun is venerated as a Saint in Đạo Cao Đài, a religion established in Vietnam in 1926. He, along with the two other Saints Victor Hugo and Nguyễn Bỉnh Khiêm, represented mankind to declare the Alliance (peaceful treaty) with God.\n\n\n== Family ==\n\nSun Yat-sen was born to Sun Dacheng (孫達成) and his wife, lady Yang (楊氏) on 12 November 1866. At the time his father was age 53, while his mother was 38 years old. By the time he was born, he already had an older brother Sun Dezhang (孫德彰), an older sister Sun Jinxing (孫金星) who died at the early age of 4. Another older brother Sun Deyou (孫德祐) also died at the age of 6. He had two other sisters Sun Miaoxi (孫妙茜), who was older and Sun Qiuqi (孫秋綺) who was younger.\nSun had an arranged marriage with fellow villager Lu Muzhen at the age of 20. She bore him a son Sun Fo and two daughters, Sun Jinyuan (孫金媛) and Sun Jinwan (孫金婉). Sun Fo was the father of Leland Sun, who spent 37 years working in Hollywood as an actor and stuntman. Sun Yat-sen was also the godfather of American author and poet Cordwainer Smith.\nSun subsequently married Soong Ching-ling, one of the Soong sisters. They were married in Japan on 25 October 1915.\nSoong Ching-Ling's father was the American-educated Methodist minister Charles Soong, who made a fortune in banking and printing of Bibles; though he had been a personal friend of Sun's, he was enraged when Sun announced his intention to marry Ching-ling because Sun was himself a Christian yet kept two wives, Lu Muzhen and Kaoru Otsuki; Soong viewed Sun's actions as running directly against their shared religion.\nSoong Ching-Ling's sister, Soong Mei-ling, later married Chiang Kai-shek.\n\n\n== Cultural references ==\n\n\n=== Memorials and structures in Asia ===\nIn most major Chinese cities one of the main streets is named Zhongshan Lu (中山路) to celebrate his memory. There are also numerous parks, schools, and geographical features named after him. Xiangshan, Sun's hometown in Guangdong, was renamed Zhongshan in his honor, and there is a hall dedicated to his memory at the Temple of Azure Clouds in Beijing. There are also a series of Sun Yat-sen stamps.\nOther references to Sun include the Sun Yat-sen University in Guangzhou and National Sun Yat-sen University in Kaohsiung. Other structures include Sun Yat-sen Mausoleum, Sun Yat-sen Memorial Hall subway station, Sun Yat-sen house in Nanjing, Dr. Sun Yat-sen Museum in Hong Kong, Chung-Shan Building, Sun Yat-sen Memorial Hall in Taipei and Sun Yat Sen Nanyang Memorial Hall in Singapore. Zhongshan Memorial Middle School has also been a name used by many schools. Zhongshan Park is also a common name used for a number of places named after him. The first highway in Taiwan is called the Sun Yat-sen expressway. Two ships are also named after him, the Chinese gunboat Chung Shan and Chinese cruiser Yat Sen. The old Chinatown in Calcutta (now known as Kolkata), India has a prominent street by the name of Sun Yat-sen street.\nIn Penang, Malaysia, the Penang Philomatic Union had its premises at 120 Armenian Street in 1910, during the time when Sun spent more than four months in Penang, convened the historic \"Penang Conference\" to launch the fundraising campaign for the Huanghuagang Uprising and founded the Kwong Wah Yit Poh; this house, which has been preserved as the Sun Yat-sen Museum Penang (formerly called the Sun Yat Sen Penang Base), was visited by President designate Hu Jintao in 2002. The Penang Philomatic Union subsequently moved to a bungalow at 65 Macalister Road which has been preserved as the Sun Yat-sen Memorial Centre Penang.\n\nAs dedication, the 1966 Chinese Cultural Renaissance was launched on Sun's birthday on 12 November.\nThe Nanyang Wan Qing Yuan in Singapore have since been preserved and renamed as the Sun Yat Sen Nanyang Memorial Hall. A Sun Yat-sen heritage trail was also launched on 20 November 2010 in Penang.\nSun's US citizen Hawaii birth certificate that show he was not born in the ROC, but instead born in the US was on public display at the American Institute in Taiwan on US Independence day 4 July 2011.\nA street in Medan, Indonesia is named \"Jalan Sun Yat-Sen\" in honour of him.\n\n\n=== Memorials and structures outside of Asia ===\nSt. John's University in New York City has a facility built in 1973, the Sun Yat-Sen Memorial Hall, built to resemble a traditional Chinese building in honor of Dr. Sun. Dr. Sun Yat-Sen Classical Chinese Garden is located in Vancouver, the largest classical Chinese gardens outside of Asia. There is the Dr. Sun Yat-sen Memorial Park in Chinatown, Honolulu. In Sacramento, California there is a bronze statue of Sun in front of the Chinese Benevolent Association of Sacramento. Another statue of Sun Yat-sen can be found at Riverdale Park in Toronto, Canada. There is also the Moscow Sun Yat-sen University. In Chinatown, San Francisco, there is a 12-foot statue of him on St. Mary's Square. In Chinatown, Los Angeles, there is a seated statue of him in Central Plaza.\nIn late 2011, the Chinese Youth Society of Melbourne, in celebration of the 100th anniversary of the founding of the Republic Of China, unveiled, in a Lion Dance Blessing ceremony, a memorial statue of Dr. Sun Yat-Sen outside the Chinese Museum in Melbourne's Chinatown, on the spot where their traditional Chinese New Year Lion Dance always ends.\nIn 1993 Lily Sun, one of Sun Yat-sen's granddaughters, donated books, photographs, artwork and other memorabilia to the Kapi`olani Community College library as part of the \"Sun Yat-sen Asian collection\". During October and November every year the entire collection is shown. In 1997 the \"Dr Sun Yat-sen Hawaii foundation\" was formed online as a virtual library. In 2006 the NASA Mars Exploration Rover Spirit labeled one of the hills explored \"Zhongshan\".\nThe plaque shown earlier in this article is by Dora Gordine, and is situated on the site of Sun's lodgings in London in 1896, 8 Grays Inn Place. There is also a blue plaque commemorating Sun at The Kennels, Cottered, Hertfordshire, the country home of the Cantlies where Sun came to recuperate after his rescue from the legation in 1896.\nA street named Sun Yat-Sen Avenue is located in Markham. This is the first such street name outside of Asia.\nA statue of Dr. Sun Yat-Sen was made by Canadian artist Una Mavis Ehlert. The statue is part of a private collection owned by Juliet Margaret Gordon in Hamilton, Ontario, Canada.\n\n\n== In popular culture ==\n\n\n=== Opera ===\nDr. Sun Yat-sen (中山逸仙; ZhōngShān yì xiān) is a 2011 Chinese-language western-style opera in three acts by the New York-based American composer Huang Ruo who was born in China and is a graduate of Oberlin College's Conservatory as well as the Juilliard School. The libretto was written by Candace Mui-ngam Chong, a recent collaborator with playwright David Henry Hwang. It was performed in Hong Kong in October 2011 and will be given its North American premiere on 26 July 2014 at The Santa Fe Opera.\n\n\n=== TV series and films ===\nThe life of Sun is portrayed in various films, mainly The Soong Sisters and Road to Dawn. A fictionalized assassination attempt on his life was featured in Bodyguards and Assassins. He is also portrayed during his struggle to overthrow the Qing dynasty in Once Upon a Time in China II. The TV series Towards the Republic features Ma Shaohua as Sun Yat-sen. In the 100th anniversary tribute of the film 1911, Winston Chao played Sun.\n\n\n=== Performances ===\nIn 2010 a theatrical play Yellow Flower on slopes (斜路黃花) was made. In 2011 there is also a mandopop group called \"Zhongsan Road 100\" (中山路100號) known for singing the song \"Our father of the nation\" (我們國父).\n\n\n== Controversy ==\n\n\n=== New Three Principles of the People ===\nAt one time CPC General secretary and PRC president Jiang Zemin claimed Sun Yat-sen had a \"New Three Principles of the People\" (新三民主義) which consisted of \"working with the soviets, working with the communists and helping the farmers\" (聯俄, 聯共, 扶助工農). Lily Sun said the CPC was distorting Sun's legacy in 2001. She then voiced her displeasure in 2002 in a private letter to Jiang about the distortion of history. In 2008 Jiang Zemin was willing to offer US$10 million to sponsor a Xinhai Revolution anniversary celebration event. According to Ming Pao she could not take the money because she would no longer have the freedom to communicate the revolution. This concept is still currently available on Baike Baidu.\n\n\n=== KMT emblem removal case ===\nIn 1981 Lily Sun took a trip to Sun Yat-sen mausoleum in Nanjing, People's Republic of China. The emblem of the KMT had been removed from the top of his tomb. On another visit in May 2011, she was surprised to find the four characters \"General Rules of Meetings\" (會議通則), a document that Sun wrote in reference to Robert's Rules of Order had been removed from a stone carving.\n\n\n=== Father of Independent Taiwan issue ===\n\nIn November 2004 the ROC Ministry of Education proposed that Sun Yat-sen was not the father of Taiwan. Instead Sun was a foreigner from mainland China. Taiwanese Education minister Tu Cheng-sheng and Examination Yuan member Lin Yu-ti, both of whom supported the proposal, had their portraits pelted with eggs in protest. At a Sun Yat-sen statue in Kaohsiung, a 70-year-old ROC retired soldier slit his own throat to commit suicide as a way to protest the ministry proposal on the anniversary of Sun's birthday 12 November.\n\n\n== See also ==\nChiang Kai-shek\nChinese Anarchism\nHistory of the Republic of China\nPolitics of the Republic of China\nUnited States Constitution and worldwide influence\n\n\n== References ==\n\n\n== Further reading ==\nSoong, Irma Tam (1997). Sun Yat-sen's Christian Schooling in Hawai'i. Hawai'i: The Hawaiian Journal of History, vol. 31. \nSun Yat-sen's vision for China / Martin, Bernard, 1966.\nSun Yat-sen, Yang Chu-yun, and the early revolutionary movement in China / Hsueh, Chun-tu\nBergère, Marie-Claire (2000). Sun Yat-sen. Stanford University Press. ISBN 0-8047-4011-9. \nSun Yat-sen 1866–1925 / The Millennium Biographies / Hong Kong, 1999\nSun Yat-sen and the origins of the Chinese revolution Schiffrin, Harold Z. /1968.\nSun Yat-sen; his life and its meaning; a critical biography. Sharman, Lyon, / 1968, c. 1934\nSun Yat Sen in Penang. Khoo Salma Nasution, Areca Books / 2008, c. 2010\n\"Sun Yat Sen Nanyang memorial hall\". Retrieved 7 May 2015. \n\"Doctor Sun Yat Sen memorial hall\". Retrieved 1 July 2005. \n\"A detailed talk about Sun Zhongshan\" (in Chinese). Retrieved September 2005.  \n\"Toten Miyazaki bio\". \nPearl S. Buck, The Man Who Changed China: The Story of Sun Yat-sen (1953)\nLawrence M. Kaplan, Homer Lea: American Soldier of Fortune (University Press of Kentucky, 2010).\n\n\n== External links ==\nROC Government Biography (English) (Chinese)\nSun Yat-sen in Hong Kong University of Hong Kong Libraries, Digital Initiatives\nContemporary views of Sun among overseas Chinese\nYokohama Overseas Chinese School established by Dr. Sun Yat-sen\nNational Dr. Sun Yat-sen Memorial Hall Official Website (English) (Chinese)\nDr. Sun Yat Sen Middle School 131, New York City\nDr. Sun Yat Sen Museum, Penang, Malaysia\nHomer Lea Research Center\nWas Yung Wing Dr. Sun's supporter? The Red Dragon scheme reveals the truth!\nMiyazaki Toten He devoted his life and energy to the Chinese people.\nMY GRANDFATHER, DR. SUN YAT-SEN – By Lily Sui-fong Sun\n浓浓乡情系中原—访孙中山先生孙女孙穗芳博士 – 我的祖父是客家人\nDr. Sun Yat-Sen Foundation of Hawaii A virtual library on Dr. Sun in Hawaii including sources for six visits\nWho is Homer Lea? Sun's best friend. He trained Chinese soldiers and prepared the frame work for the 1911 Chinese Revolution.\nWorks by Sun Yat-sen at Project Gutenberg\nWorks by or about Sun Yat-sen at Internet Archive", "ns": 0, "pageid": 88483, "title": "Sun Yat-sen"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}