{"batchcomplete": "", "query": {"normalized": [{"to": "Susanna Siegel", "from": "Susanna_Siegel"}], "pages": {"42584452": {"extract": "Susanna Siegel is the Edgar Pierce Professor of Philosophy at Harvard University, a chair held in the past by B.F. Skinner, Willard van Orman Quine, and Charles Parsons. Siegel’s primary research is in the philosophy of mind and epistemology. Her work in the philosophy of perception and perceptual epistemology is widely cited. In 2011 she was Walter Channing Cabot Fellow. She has held visiting appointments at Birmingham, where she is Distinguished Visiting Researcher from 2014-2017, and the University of Oslo, where she holds a part-time appointment as a visiting researcher. She has also given the Gareth Evans Memorial Lecture at Oxford, The Tamara Horowitz Memorial Lecture at Pittsburgh, and the Burman Lectures in Umea, Sweden.\n\n\n== Education and career ==\nSiegel received her baccalaureate in philosophy from Swarthmore College in 1991, before going on to receive a master's degree in philosophy from Yale University in 1993, a master's degree in philosophy from Cornell University in 1996, and a doctorate in philosophy from Cornell in 2000. From 1999 to 2004, Siegel served as assistant professor of philosophy at Harvard University, receiving a secondary appointment as the John L. Loeb Associate Professor of the Humanities before being promoted to full professor in 2005. In 2011, she was appointed the Edgar Pierce Professor of Philosophy. She has also held a number of temporary or nonprofessorial appointments during her career, including serving as the Walter Channing Cabot Fellow at Harvard University for the 2011-2012 school year, as a Distinguished Visiting Research Professor at the University of Birmingham from 2013 to 2016, and as Professor II at the Centre for the Study of Mind in Nature at the University of Oslo from 2013 to 2016.\n\n\n== Research area and publications ==\nSiegel is best known for her work in the philosophy of perception and epistemology. Her work is discussed critically and influenced many subsequent discussions of the contents of experience.\nShe has authored one monograph titled The Contents of Visual Experience, and has edited an anthology titled The Elements of Philosophy: Readings from Past and Present, in addition to publishing a number of chapters and peer reviewed journal articles. She also writes and maintains the Stanford Encyclopedia of Philosophy's article The Contents of Perception. Her monograph was well received, and her papers have been widely cited. Siegel has been photographed by the American Photographer Steve Pyke and she appears on the cover of Steven Pyke's photographic anthology of important contemporary philosophers\nNed Block described Siegel's The Contents of Visual Experience as \"one of the most significant books in philosophy of mind for many years.\" James Genone hailed The Contents of Visual Experience as \"an important contribution to the contemporary literature on the nature and structure of perception,\" and lauded Siegel for beyond one of the first recent philosophers to challenge the prevailing view that perceptual experiences have representational contents, suggesting that if Siegel is correct in her views, the result would be a sea change that would effect not only the philosophy of perceptual experiences, but also have broad implications for many other areas of philosophy.\nThe early portion of Siegel's book constructs and contrasts two opposing views, one that she deems the \"Content View,\" and one that she describes as the \"Rich Content View.\" The \"Content View\" represents a situation in which there is precision in the way in which perceptual experiences have meaningful contents, whereas in the \"Rich Content View\" perceptual experiences consist of simple and complex properties that humans extrapolate meaning from. Having established this framework, Siegel uses it to examine three major philosophical points: first, that humans are able to determine content from sensory cues (in what Siegel describes as 'the method of phenomenal contrast,\") second, that the method of phenomenal contrast supports the idea of the Rich Content model as an enhancement over the Content model, and lastly that while ordinary visual experiences involve seeing things that pertain to objects in addition to seeing things that do not pertain to objects, hallucinations differ from standard visual experiences by only perceiving things that do not pertain to particular objects.\n\n\n== External links ==\nPersonal Homepage\nInterview with 3am\nInterview with Harvard Gazette\nDiscussion between Professor Siegel and Professor Pinker re the interaction between the Sciences and the Humanities. [1]\n\n\n== References ==", "ns": 0, "pageid": 42584452, "title": "Susanna Siegel"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}