{"batchcomplete": "", "query": {"normalized": [{"to": "Susanna Schellenberg", "from": "Susanna_Schellenberg"}], "pages": {"39035529": {"extract": "Susanna Schellenberg is a philosopher specializing in epistemology, philosophy of mind, and philosophy of language. She is best known for her work on perceptual experience, evidence, capacities, mental content, and imagination. She is professor of philosophy at Rutgers University, where she holds a secondary appointment at the Rutgers Center for Cognitive Science. In 2016, Schellenberg was awarded the Friedrich Wilhelm Bessel Research Award of the Humboldt Foundation. Her work has been published in journals such as Noûs, The Journal of Philosophy, Mind, and Philosophy and Phenomenological Research.\n\n\n== Education and employment ==\nSchellenberg was born in Beirut, Lebanon, and raised in Lebanon, Pakistan, and Switzerland. After having received a mathematical-scientific Matura (Typus C) from the Gymnasium Köniz-Lebermatt, Switzerland, she studied mathematics, economics, philosophy, and history at the Universität Basel, Université Paris I Panthéone-Sorbonne, Johann-Wolfgang Goethe Universität, and Oxford University. She received a doctorate in philosophy from the University of Pittsburgh in 2007, where her thesis dealt with conceptual content and inference.\nSchellenberg held a Mellon postdoctoral fellowship at the University of Toronto from 2006 to 2008 which was curtailed when she chose to move to a postdoctoral position at the Australian National University, where she subsequently became an assistant professor in 2008, and an associate professor in 2010. Schellenberg was the first woman to hold a permanent academic appointment in Philosophy at the Australia National University's Research School of Social Sciences. In 2011, Schellenberg moved to Rutgers University, as an associate professor in the Department of Philosophy with a secondary appointment at Rutgers Center for Cognitive Science. Brian Weatherson and Jonathan L. Kvanvig regarded Schellenberg's move to Rutgers as buttressing Rutgers' reputation as having one of the pre-eminent epistemology departments in the world.\n\n\n== Research areas ==\nSchellenberg's work has centered around developing a comprehensive account of the epistemological and phenomenological role of perception. Her view shows how the epistemic force of experience is grounded in employing perceptual capacities that we possess by virtue of being perceivers Schellenberg has also developed an account of the nature of perceptual content that suggests a new way to understand singular modes of presentation, arguing that perceptual experience is at root both relational and representational. In addition to her main areas of interest, Schellenberg has also written papers on topics such as inferential semantics, the philosophy of Gottlob Frege, and imagination. Much of Schellenberg's work to-date has focused on reconcilling apparently contradictory viewpoints on topics in the philosophy of mind.\n\n\n== Publications ==\nSchellenberg has published a number of peer-reviewed papers in journals such as The Journal of Philosophy, Mind, Noûs, and Philosophy and Phenomenological Research. She has also contributed five book chapters, including chapters about perceptual experience, externalism and hallucination, and Sellarsian perspectives on perception.\n\n\n== References ==\n\n\n== External links ==\nSusanna Schellenberg on PhilPapers\nSusanna Schellenberg website", "ns": 0, "pageid": 39035529, "title": "Susanna Schellenberg"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}