{"batchcomplete": "", "query": {"normalized": [{"to": "T. M. Scanlon", "from": "T._M._Scanlon"}], "pages": {"3957449": {"extract": "Thomas Michael \"Tim\" Scanlon (/ˈskænlən/; born 1940), usually cited as T. M. Scanlon, is an American philosopher. He was the Alford Professor of Natural Religion, Moral Philosophy, and Civil Polity in Harvard University's Department of Philosophy until his retirement at the end of the 2015-16 academic year.\n\n\n== Life and Career ==\nScanlon grew up in Indianapolis, Indiana; obtained his undergraduate degree from Princeton University in 1962; earned his Ph.D. in philosophy from Harvard under Burton Dreben; studied for a year at Oxford University on a Fulbright Scholarship; and returned to Princeton University, where he taught from 1966 until 1984.\nHis dissertation and some of his first papers were in mathematical logic, where his main concern was in proof theory, but he soon made his name in ethics and political philosophy, where he developed a version of contractualism in the line of John Rawls, Immanuel Kant, and Jean-Jacques Rousseau. Scanlon has also published important work on freedom of speech, equality, tolerance, foundations of contract law, human rights, conceptions of welfare, theories of justice, as well as on foundational questions in moral theory.\nHis teaching in the department has included courses on theories of justice, equality, and recent ethical theory. His book, What We Owe to Each Other, was published by Harvard University Press in 1998; a collection of papers on political theory, The Difficulty of Tolerance, was published by Cambridge University Press in 2003.\nScanlon is the father-in-law of philosopher and scholar of African American studies Tommie Shelby.\n\n\n== Contractualism ==\nContractualism is an attempt at providing a unified account of the subject matter of a central part of morality which Scanlon calls ‘what we owe to each other’. The normative domain of what we owe to each other is meant to encompass those duties to other people which we bear in virtue of their standing as rational creatures. A broader conception of morality includes whatever else we may owe to specific people, such as the special obligations we bear in relations with friends and family, or whatever else morality may require of us, such as the way in which we treat ourselves or nature. Scanlon believes that what we owe to each other, or what we could loosely call ‘the morality of right and wrong’, is distinct from this broader conception of morality in that contractualism provides a unified account of its content \nWe can begin our description of Scanlon’s contractualism by noting that judgements about right and wrong, unlike empirical judgements, are not theoretical claims about the nature of the spatiotemporal world but rather practical claims about what we have reason to do. Further, they are a particularly important class of practical claims in that the judgement that an action is wrong is taken to provide reasons to not do that action which are most often considered to be decisive against competing reasons. Following this point, Scanlon takes questions about the reason-giving force of moral judgements to be prior to questions about the subject matter of the morality of right and wrong. More explicitly, he thinks that if we provide an account of the extraordinary reason-giving force of moral judgements then this account could largely form the basis for a characterisation of the subject matter of what we owe to each other.\nScanlon grounds the reason-giving force of judgements about right and wrong in ‘the positive value of a way of living with others’. A way of living with others which is typified by an ideal of mutual recognition between rational agents, where mutual recognition demands that moral agents acknowledge the value of human life and respond to this value in the right ways.\nHow ought we to value human, or rational, life? Scanlon argues persuasively that different valuable things require different ways of valuing. In contrast to teleological accounts of value, often to take something to be of value is not only to see reason to bring about a maximal amount of that thing. This is especially true when we come to consider the value of human life. When we value human life we do not see this as a reason to create as much human life as we can. Rather, we tend to see reason to respect other human beings, to protect them from death and other forms of harm and, in general, to want their lives to go well. More important for Scanlon, to value rational life is to recognise the features which distinguish rational life from other valuable things, specifically, the ability of rational creatures to assess reasons and judgements, and to govern their lives in accordance with these assessments. Scanlon asserts that the proper response to the recognition of these distinctive features is to treat rational creatures in terms of principles which they could not reasonably reject.\nFrom this point, Scanlon’s account of the value of rational life provides a locus around which his account of the reason-giving force of moral judgements dovetails quite neatly with a characterisation of the method of reasoning which we use to arrive at judgements of right and wrong, a method, moreover, which seems to be phenomenologically plausible. The reason-giving force of moral judgements is grounded in an ideal of mutual recognition which requires treating others in accordance with principles that they could not reasonably reject. Because mutual recognition requires that these other people are also appropriately motivated, this entails Scanlon’s formulation of wrongness: ‘An act is wrong if and only if any principle that permitted it would be one that could reasonably be rejected by people moved to find principles for the general regulation of behaviour that others, similarly motivated, could not reasonably reject’. I will call this the contractualist formulation. An act is right, quite simply, if a principle permitting it could not reasonably be rejected in terms of the aforementioned formulation.\nA few, rather discordant, summary comments are needed regarding how moral principles are derived from the contractualist formulation. When considering whether a principle can be rejected we must take into account the consequences, in general, of its being accepted, not only the consequences of the particular actions that it allows. Because we cannot be sure about who will be affected by a principle, and how they will be affected, we must draw on our experience of life and consider the ‘generic reasons’ which individuals are likely to have, as a result of their general circumstances, to reject a principle. In order to determine whether a principle is reasonably rejectable, we must impartially weigh these generic reasons against each other, and exercising our judgement, draw a conclusion about what the weight of reasons support. Given the motivation of finding principles for the general regulation of society that no-one could reasonably reject, if the weight of reasons support a certain conclusion then it would be unreasonable to reject that conclusion. Importantly, principles can only be rejected by individuals; aggregation of reasons across individuals is not allowed. So if the generic reasons of an individual carry more weight then any other individual’s generic reasons then his generic reasons are (for the most part)decisive in determining principles.\nThe generic reasons which are open to consideration under the contractualist formulation are any reasons which we judge as relevant to reasonable rejectability. This requires that we exercise our judgement in determining whether such reasons would be suitable grounds for mutual recognition. Therefore, that a principle would negatively affect a person’s well-being is not the only kind of reason which may be brought against a principle. Other considerations, such as how a burden would be imposed by a principle, can serve as reasonable grounds for rejection.\nFinally, while contractualism only provides an account of that central part of morality which deals with what we owe to each other, Scanlon observes that this part of morality is related to the broader realm of morality in complex ways. There is pressure for the morality of what we owe to each other to acknowledge the values included in the broader realm of morality insofar as principles which don’t make room for these values could be reasonably rejected. In turn, these values must accommodate the dictates of what we owe to each other to the extent that they involve relations with others, who have separate moral standing.\n\n\n== Selected works ==\n\n\n=== Books ===\nScanlon, T.M. (1998). What we owe to each other. Cambridge, Massachusetts: Belknap Press of Harvard University Press. ISBN 9780674950894. \nScanlon, T.M. (2003). The difficulty of tolerance: essays in political philosophy. Cambridge New York: Cambridge University Press. ISBN 9780511615153. \nScanlon, T.M. (2008). Moral dimensions: permissibility, meaning, blame. Cambridge, Massachusetts: Belknap Press of Harvard University Press. ISBN 9780674043145. \nScanlon, T.M. (2014). Being realistic about reasons. Oxford: Oxford University Press. ISBN 9780199678488. \n\n\n=== Chapters in books ===\nScanlon, T.M. (1977), \"Due process\", in Pennock, J. Roland; Chapman, John W., Due process, Nomos Series no. 18, New York: New York University Press, pp. 93–125, ISBN 9780814765692.  Preview.\nScanlon, Thomas M. (1977), \"Liberty, contract, and contribution\", in Dworkin, Gerald; Bermant, Gordon; Brown, Peter G., Markets and morals, Washington New York: Hemisphere Pub. Corp. Distributed solely by Halsted Press, pp. 43–67, ISBN 9780470991695. \nScanlon, Thomas M. (1979), \"Human rights as a neutral concern\", in Brown, Peter; McLean, Douglas, Human rights and U.S. foreign policy: principles and applications, Lexington, Massachusetts: Lexington Books, pp. 83–92, ISBN 9780669028072. \nScanlon, Thomas M. (1981), \"Ethics and the control of research\", in Gaylin, Willard; Macklin, Ruth; Powledge, Tabitha M., Violence and the politics of research, New York: Plenum Press, pp. 225–256, ISBN 9780306407895. \nScanlon, T.M. (1982), \"Contractualism and utilitarianism\", in Sen, Amartya; Williams, Bernard, Utilitarianism and beyond, Cambridge: Cambridge University Press, pp. 103–128, ISBN 9780511611964. \nScanlon, T.M. (1988), \"The significance of choice\", in Sen, Amartya; McMurrin, Sterling M., The Tanner lectures on human values VIII, Salt Lake City: University of Utah Press, pp. 149–216, ISBN 9780874803020.  Pdf.\nScanlon, T.M. (1991), \"The moral basis of interpersonal comparisons\", in Elster, Jon; Roemer, John E., Interpersonal comparisons of well-being, Cambridge England New York: Cambridge University Press, pp. 17–44, ISBN 9780521457224. \nScanlon, T.M. (1997). The diversity of objections to inequality. The Lindley Lecture, 1996. Lawrence, Kansas: Dept. of Philosophy, University of Kansas.  Pdf.\n\nReprinted as: Scanlon, T.M. (2000), \"The diversity of objections to inequality\", in Clayton, Matthew; Williams, Andrew, The ideal of equality, Houndmills, Basingstoke, Hampshire New York: Macmillan Press St. Martin's Press, pp. 41–59, ISBN 9780333686980. \nAlso available as: Scanlon, T.M. (1996). \"La varietà delle obiezioni alla disegualianza\". Filosofia e Questioni Pubbliche (Philosophy and Public Issues) (in Italian). Roma Luiss Management. 2 (2): 3–19. \n\nScanlon, T.M. (1999), \"Punishment and the rule of law\", in Koh, Harold Hongju; Slye, Ronald, Deliberative democracy and human rights, New Haven, Connecticut: Yale University Press, pp. 257–271, ISBN 9780300081671. \nScanlon, T.M. (2001), \"Promises and contracts\", in Benson, Peter, The theory of contract law: new essays, Cambridge Studies in Philosophy and Law Series, Cambridge England New York: Cambridge University Press, pp. 86–117, ISBN 9780521041324. \nScanlon, T.M. (2002), \"Reasons and passions\", in Buss, Sarah; Overton, Lee, Contours of agency: essays on themes from Harry Frankfurt, Cambridge, Massachusetts: MIT Press, pp. 165–188, ISBN 9780262025133. \nScanlon, T.M. (2004), \"Reasons: a puzzling duality?\", in Wallace, R. Jay; Pettit, Philip; Scheffler, Samuel; Smith, Michael, Reason and value: themes from the moral philosophy of Joseph Raz, New York: Oxford University Press, pp. 231–246, OCLC 648260069. \nScanlon, T.M. (2006), \"Justice, responsibility, and the demands of equality\", in Sypnowich, Christine, The egalitarian conscience: essays in honour of G.A. Cohen, New York: Oxford University Press, pp. 70–87, ISBN 9780199281688. \nScanlon, T.M. (2009), \"Rights and interests\", in Kanbur, Ravi; Basu, Kaushik, Arguments for a better world: essays in honor of Amartya Sen | Volume I: Ethics, welfare, and measurement, Oxford New York: Oxford University Press, pp. 68–79, ISBN 9780199239115. \nScanlon, T.M. (2011), \"How I am not a Kantian\", in Parfit, Derek; Scheffler, Samuel, On what matters (volume 2), Oxford: Oxford University Press, pp. 116–139, ISBN 9781283160179. \nScanlon, T.M. (2012), \"The appeal and limits of constructivism\", in Lenman, James; Shemmer, Yonatan, Constructivism in practical philosophy, Oxford: Oxford University Press, pp. 226–242, ISBN 9780191631191. \nScanlon, T.M. (2013), \"Interpreting blame\", in Coates, D. Justin; Tognazzini, Neal A., Blame: its nature and norms, Oxford New York: Oxford University Press, pp. 84–100, ISBN 9780199860821. \n\n\n=== Articles ===\nScanlon, Thomas (Winter 1972). \"A theory of freedom of expression\". Philosophy & Public Affairs. Wiley. 1 (2): 204–226. JSTOR 2264971. \nScanlon, Thomas (Summer 1975). \"Thomson on privacy\". Philosophy & Public Affairs. Wiley. 4 (4): 315–322. JSTOR 2265076. \nScanlon, T.M. (November 1975). \"Preference and urgency\". The Journal of Philosophy, special issue: Seventy-Second Annual Meeting American Philosophical Association, Eastern Division. Journal of Philosophy, Inc. 72 (19): 655–669. doi:10.2307/2024630. \nScanlon, Thomas (Autumn 1976). \"Nozick on rights, liberty, and property\". Philosophy & Public Affairs. Wiley. 6 (2): 3–25. JSTOR 2265059. \nScanlon, T.M. (1977). \"Due process\". Nomos. American Society for Political and Legal Philosophy, special issue: Due Process. 18: 93–125. JSTOR 24219202. \nScanlon, T.M. (May 1977). \"Rights, goals, and fairness\". Erkenntnis, special issue: Social Ethics, Part 1. Springer. 11 (1): 81–95. doi:10.1007/BF00169845. JSTOR 20010534. \nScanlon, T.M. (October 1986). \"Equality of resources and equality of welfare: a forced marriage?\". Ethics, special issue: Symposium on Explanation and Justification in Social Theory. Chicago Journals. 97 (1): 111–118. doi:10.1086/292820. JSTOR 2381409.  Pdf.\nScanlon, Thomas (Summer 1990). \"Promises and practices\". Philosophy & Public Affairs. Wiley. 19 (3): 199–226. JSTOR 2265394. \nScanlon, T.M. (Spring 1992). \"The aims and authority of moral theory\". Oxford Journal of Legal Studies. Oxford Journals. 12 (1): 1–23. doi:10.1093/ojls/12.1.1. JSTOR 764567. \nScanlon, T.M. (June 1995). \"Moral theory: understanding and disagreement: Reviewed work: The Viability of Moral Theory by Allan Gibbard, Alasdair MacIntyre\". Philosophy and Phenomenological Research. Wiley. 55 (2): 343–356. doi:10.2307/2108551. JSTOR 2108551. \nScanlon, Thomas (Spring 1997). \"The status of well-being\". Michigan Quarterly Review. University of Michigan. XXXVI (2): 290–310.  See also Tanner lecture pdf.\nScanlon, T.M. (July 2000). \"Intention and permissibility: T. M. Scanlon\". Aristotelian Society, Supplementary Volume. 74 (1): 301–317. doi:10.1111/1467-8349.00073.  Pdf.\n\nSee also: Dancy, Jonathan (July 2000). \"Intention and permissibility: Jonathan Dancy\". Aristotelian Society, Supplementary Volume. 74 (1): 319–338. doi:10.1111/1467-8349.00074. \n\nScanlon, T.M. (2003). \"Individualism, equality, and rights\". University of Miami Law Review. University of Miami School of Law. 58 (1): 359–368.  Pdf.\nScanlon, T.M. (January 2003). \"Reply to Gauthier and Gibbard: Précis of What We Owe to Each Other\". Philosophy and Phenomenological Research. Wiley. 66 (1): 176–189. doi:10.1111/j.1933-1592.2003.tb00249.x. JSTOR 20140523. \n\nSee also: Gauthier, David (January 2003). \"Are we moral debtors?: Reviewed work: What We Owe to Each Other by T. M. Scanlon\". Philosophy and Phenomenological Research. Wiley. 66 (1): 162–168. doi:10.1111/j.1933-1592.2003.tb00250.x. JSTOR 20140521. \nSee also: Gibbard, Allan (January 2003). \"Reasons to reject allowing: Reviewed work: What We Owe to Each Other by T. M. Scanlon\". Philosophy and Phenomenological Research. Wiley. 66 (1): 169–175. doi:10.1111/j.1933-1592.2003.tb00251.x. JSTOR 20140522. \n\nScanlon, T.M. (November 2003). \"Metaphysics and morals\". Proceedings and Addresses of the American Philosophical Association. American Philosophical Association. 77 (2): 7–22. doi:10.2307/3219738. JSTOR 3219738. \nScanlon, T.M. (December 2003). \"Replies\". Ratio. Wiley. 16 (4): 424–439. doi:10.1046/j.1467-9329.2003.00231.x. \n\nSee also: O'Neill, Onora (December 2003). \"Constructivism vs. contractualism\". Ratio. Wiley. 16 (4): 319–331. doi:10.1046/j.1467-9329.2003.00226.x. \nSee also: Wolff, Jonathan (December 2003). \"Scanlon on well-being\". Ratio. Wiley. 16 (4): 332–345. doi:10.1046/j.1467-9329.2003.00227.x. \nSee also: Raz, Joseph (December 2003). \"Numbers, with and without contractualism\". Ratio. Wiley. 16 (4): 346–367. doi:10.1046/j.1467-9329.2003.00228.x. \nSee also: Parfit, Derek (December 2003). \"Justifiability to each person\". Ratio. Wiley. 16 (4): 368–390. doi:10.1046/j.1467-9329.2003.00229.x. \nSee also: Timmons, Mark (December 2003). \"The limits of moral constructivism\". Ratio. Wiley. 16 (4): 391–423. doi:10.1046/j.1467-9329.2003.00230.x. \n\nScanlon, T.M. (May 2011). \"Why not base free speech on autonomy or democracy?\". Virginia Law Review. The Virginia Law Review Association via JSTOR. 97 (3): 541–548. JSTOR 41261520.  Pdf.\nScanlon, T.M. (October 2011). \"Forum: libertarianism and liberty\". Boston Review. Boston Critic, Inc. \nScanlon, T.M. (June 2012). \"Provocation: everyone is a philosopher!\". Harvard Law Review Forum. The Harvard Law Review Association. 125: 228–235. \nScanlon, T.M. (Spring 2013). \"Responsibility and the value of choice\". Think. Cambridge Journals. 12 (33): 9–16. doi:10.1017/S1477175612000280. \nScanlon, Thomas M. (June 2013). \"Giving desert its due\". Philosophical Explorations, special issue: Basic Desert, Reactive Attitudes and Free Will. Taylor and Francis. 16 (2): 101–116. doi:10.1080/13869795.2013.787437. \nScanlon, T.M. (June 2015). \"Kamm on the disvalue of death\". Journal of Medical Ethics. BMJ Group. 41 (6): 490. doi:10.1136/medethics-2014-102037. \n\nSee also: Kamm, Frances (June 2015). \"Summary of Bioethical Prescriptions\". Journal of Medical Ethics. BMJ Group. 41 (6): 488–489. doi:10.1136/medethics-2014-102018. \n\n\n== References ==\n\n\n== Sources ==\nInterviews with Scanlon\n'The Kingdom of Ends on the Cheap' in Alex Voorhoeve Conversations on Ethics. Oxford University Press, 2009. ISBN 978-0-19-921537-9\n\"Ethics of Blame\"\nAn Interview with T. M. Scanlon by Yascha Mounk, 2012-07-07.\n\n\n== External links ==\nThe Department of Philosophy at Harvard", "ns": 0, "pageid": 3957449, "title": "T. M. Scanlon"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}