{"batchcomplete": "", "query": {"normalized": [{"to": "Takis Fotopoulos", "from": "Takis_Fotopoulos"}], "pages": {"2951290": {"extract": "Takis Fotopoulos (Greek: Τάκης Φωτόπουλος born October 14, 1940) is a political philosopher and economist who founded the Inclusive Democracy movement. He is noted for his synthesis of classical democracy with libertarian socialism and the radical currents in the new social movements. He was an academic, and has written many books and over 900 articles,. He is the editor of The International Journal of Inclusive Democracy (which succeeded Democracy & Nature) and author of Towards An Inclusive Democracy (1997) in which the foundations of the Inclusive Democracy project were set. Fotopoulos is Greek and lives in London.\n\n\n== Early life ==\nFotopoulos was born on the Greek island of Chios and his family moved to Athens soon afterwards. After earning degrees in Economics and Political Science and in Law from the University of Athens, he moved to London in 1966 for postgraduate study at the London School of Economics on a Varvaressos scholarship from Athens University. He was a student syndicalist and activist in Athens and then a political activist in London, taking an active part in the 1968 student protests in London, and in organisations of the revolutionary Greek Left during the struggle against the Greek military junta of 1967–1974. During this period, he was a member of the Revolutionary Socialist Groups in London, which published the newspaper Μαμή (\"Midwife\", from the Marxian dictum, \"violence is the midwife of revolution\"), for which he wrote several articles.\nFotopoulos is married since 1966 with Sia Mamareli (a former lawyer); they have a son, Costas, (born in 1974), he is a Composer and Pianist.\n\n\n== Academia and afterwards ==\nHe was Senior Lecturer in Economics at the Polytechnic of North London from 1969 to 1989, until he started editing the journal Society & Nature, later Democracy & Nature and subsequently the online International Journal of Inclusive Democracy. He was also a columnist of Eleftherotypia, the second-biggest newspaper in Greece.\n\n\n== Inclusive Democracy ==\n\nFotopoulos developed the political project of Inclusive Democracy (ID) in 1997 (an exposition can be found in Towards An Inclusive Democracy). The first issue of Society & Nature declared that:\n\"our ambition is to initiate an urgently needed dialogue on the crucial question of developing a new liberatory social project, at a moment in History when the Left has abandoned this traditional role.\"\nand specified that the new project should be seen as the outcome of a synthesis of the democratic, libertarian socialist and radical Green traditions. Since then, a dialogue has followed in the pages of the journal, in which supporters of the automony project like Cornelius Castoriadis, social ecology supporters including its founder Murray Bookchin, and Green activists and academics like Steven Best have taken part.\nThe starting point for Fotopoulos' work is that the world faces a multi-dimensional crisis (economic, ecological, social, cultural and political) which is caused by the concentration of power in elites, as a result of the market economy, representative democracy and related forms of hierarchical structure. An inclusive democracy, which involves the equal distribution of power at all levels, is seen not as a utopia (in the negative sense of the word) or a \"vision\" but as perhaps the only way out of the present crisis, with trends towards its creation manifesting themselves today in many parts of the world. Fotopoulos is in favor of market abolitionism, although he would not identify himself as a market abolitionist as such because he considers market abolition as one aspect of an inclusive democracy which refers only to the economic democracy component of it. He proposes a model of economic democracy for a stateless, marketless and moneyless economy but he considers that the economic democracy component is equally significant to the other components of ID, i.e. political or direct democracy, economic democracy, ecological democracy and democracy in the social realm. Fotopoulos' work has been critically assessed by important activists, theorists and scholars.\n\n\n== Selected Bibliography ==\n\n\n=== Original English ===\nTowards An Inclusive Democracy. The Crisis of the Growth Economy and the Need for a New Liberatory Project (London/New York: Cassell Continuum, 1997), 401 pp. ISBN 0-304-33627-0 and 0-304-33628-9.\nEducation, Culture and Modernization, ed. by Peter Alheit et al. (Roskide University, 1995). (Takis Fotopoulos contribution: \"The crisis of the growth economy, the withering away of the nation-state and the community-based society\").\nDefending Public Schools, ed. by David A. Gabbard & E. Wayne Ross (Praeger, 2004). (Takis Fotopoulos contribution: \"The State, the Market and (Mis-)education\").\nThe pink revolution in Iran and the “Left” A Special E-Book Issue of the International Journal of Inclusive Democracy (Vol. 5, No. 3, Summer 2009), PDF Version\nCritical Perspectives on Globalisation, ed. by Robert Hunter Wade, Marina Della Giusta and Uma Kambhampati (Chelthenham, UK & Northampton, MA US: Edward Elgar publishing, 2006). (Takis Fotopoulos contribution: \"The global 'war' of the transnational elite\").\nEco-socialism as Politics: Rebuilding the Basis of Our Modern Civilisation ed. by Qingzhi Huan (Springer, 1st Edition, 2010, XI), 224 p., Hardcover, ISBN 978-90-481-3744-2. (Takis Fotopoulos contribution: \"The De-growth Utopia: The Incompatibility of De-growth within an Internationalised Market Economy\").\nAcademic Repression: Reflections from the Academic Industrial Complex ed. by A.J.Nocella, Steven Best, Peter McLaren (AK Press, Oakland, CA & Edinburgh, 2010), 590 p, paperback, ISBN 978-1-904859-98-7. (Takis Fotopoulos contribution: \"Systemic Aspects of Academic Repression in the New World Order\". A full version of this essay is published in The International Journal of Inclusive Democracy, Vol. 4, No. 4 (October 2008).\nCritical Pedagogy in the new dark ages: challenges and possibilities, ed by Maria Nikolakaki (Peter Lang Publishing, 2012), ISBN 978-1433114274. (Takis Fotopoulos contribution: \"From (mis)education to Paedeia,\" pp. 81–119.)\nKarl Marx, The Communist Manifesto, ed by Frederic L. Bender (second revised edition; New York: W.W. Norton & Co, 2013), ISBN 978-0393935608. (Takis Fotopoulos & A. Gezerlis contribution: \"Hardt & Negri's Empire: A new Communist Manifesto or a reformist Welcome to Neoliberal Globalization?,” (extract), pp. 232–34.)\n\n\n=== Selected translations of works by Fotopoulos ===\n(Italian) Complessità sistemica e svillupo eco-sostenibile, ed. by I. Spano and D. Padovan (Sapere 2001). (Takis Fotopoulos contribution: \"La crisi dell 'economia di crescita. Societa ecologica e democrazia\".)\n(Italian) Per Una Democrazia Globale (Milano: Eleuthera, 1999), 254 pp. ISBN 88-85060-37-4\n(Spanish) Hacia Una Democracia Inclusiva: Un nuevo proyecto liberador (Montevideo: Nordan, 2002), 325 pp. ISBN 9974-42-098-9\n(French) Vers Une Démocratie Générale (Paris: Seuil, 2002), 250 pp. ISBN 2-02-052846-0\n(German) Umfassende Demokratie, Die Antwort auf die Krise der Wachstums-und Marktwirtschaft (Grafenau: Trotzdem Verlag, 2003), 445 pp. ISBN 3-931786-23-4\n(Chinese) The Multidimensional Crisis and Inclusive Democracy (Entire English E-book publication [2005] of the book with the same title published in Athens, 2005 by Gordios, 334 pp. ISBN 960-7083-69-5. Published in Chinese (Shandong University Press, 2008). ISBN 978-7-5607-3533-7)\n(Greek) Critical Pedagogy in the New Middle Age, ed. by Maria Nikolakaki (Sideris, October 2011), ISBN 978-960-08-0581-9. (Takis Fotopoulos' Contribution: \"From Education to Paedeia\".)\n\n\n=== Original Greek ===\nStudies on the contemporary Greek Economy, ed. by S.Papaspiliopoulos (Athens: Papazisis, 1978). (Takis Fotopoulos' contribution: \"Dependent development and industrialisation\").\nDependent Development: The Case of Greece (Athens: Exantas, 1985 & 1987), ISBN 960-256-040-1.\nThe Gulf War: The First Battle in the North-South Conflict (Athens: Exantas, 1991), ISBN 960-256-081-9.\nThe Neo-Liberal Consensus (Athens: Gordios, 1993).\nThe New World Order and Greece (Athens: Kastaniotis, 1997).\nInclusive Democracy (Athens: Kastaniotis, 1999).\nDrugs: Beyond the Demonology of Penalisation and the 'Progressive' Mythology of Liberalisation (Athens: Eleftheros Typos, 1999).\nThe New Order in the Balkans and the First War of the Internationalised Market Economy (Athens: Staxy, 1999).\nReligion, Autonomy and Democracy (Athens: Eleftheros Typos, 2000).\nGlobalisation, the Left and Inclusive Democracy (Athens: Ellinika Grammata, 2002).\nFrom the Athenian Democracy to Inclusive Democracy (Athens: Eleftheros Typos, 2002).\nThe War against 'Terrorism': the Elites Generalised Attack (Athens: Gordios, 2003), ISBN 960-7083-57-1.\nChomsky's capitalism, Albert's post-capitalism and Inclusive Democracy (Athens: Gordios, 2004).\nGlobalisation, Technology and Paideia in the New Cosmopolis (Atrapos, 2004). (Takis Fotopoulos' contribution: \"Contrasting views on globalisation and the myth about the end of globalisation\").\nThe Multidimensional Crisis and Inclusive Democracy (Athens: Gordios, 2005).\nInclusive Democracy: 10 Years Afterwards (Περιεκτική Δημοκρατία: 10 Χρόνια Μετά) (Athens: Eleftheros Typos, 2008), 591 pp.\nGlobalised Capitalism, The Eclipse of the Left and Inclusive Democracy, ed. by Steven Best (Athens: Koukkida, 2008), ISBN 978-960-98038-5-4. And as Special Issue of \"The International Journal of Inclusive Democracy\", Winter 2009, in English: Online/PDF (with two contributions by Takis Fotopoulos, \"Recent Theoretical Developments on the Inclusive Democracy Project\" & \"Is Inclusive Democracy Feasible and Desirable?\").\nGlobal Crisis, Greece, and the anti-systemic movement (Athens: Koukida, 2009), 318 pages, ISBN 978-960-94100-0-7.\nGreece as a protectorate of the transnational elite (Athens: Gordios, November 2010), 412 pages, ISBN 978-960-6826-18-4.\nThe Chronicle of the Catastrophe 2010-2015: From the Memoranda of the systemic PASOK / ND to SYRIZA's \"Left\" Memorandum (Το χρονικό της καταστροφής 2010-2015) (Athens: Gordios, September 2015), 470 pages, ISBN 978-960-6826-66-5.\n\n\n== See also ==\nAnarchist economics\n\n\n== References ==\n\n\n== Further reading ==\n\"Inclusive Democracy\" entry in the Routledge Encyclopedia of International Political Economy (ed. by Barry Jones), Vol. 2 (2001), pp. 732–740.\n“The Inclusive Democracy project – six years on“ (essays on the ID project by Michael Levin, Arran Gare, David Freeman, Serge Latouche, Jean-Claude Richard, Takis Nikolopoulos, Rafael Spósito, Guido Galafassi, Takis Fotopoulos and others), Democracy & Nature, Vol. 9, No. 3 (November 2003).\n“Debate on the Inclusive Democracy project (Parts I & II)“, The International Journal of Inclusive Democracy, Vol. 1, No. 2 (January 2005) and Vol. 1, No. 3 (May 2005).\nTakis Fotopoulos, \"Inclusive Democracy\" in Alternative Economies, Alternative Societies ed. by Oliver Ressler & Aneta Szylak, 240 pages (20 pages in color), languages: English and Polish, ISBN 978-83-924665-0-5 (Gdansk: Wyspa Institute of Art, Poland, 2007). [Published in German/Hungarian by Promedia Verlag, Vienna 2008. ISBN 978-3-85371-291-7.]\n\n\n== External links ==\n\n\n=== Overviews ===\n\"Inclusive Democracy\" entry in the Routledge Encyclopedia of International Political Economy (ed. by Barry Jones), Vol. 2 (2001), pp. 732–740.\nTakis Fotopoulos' Archive\n\n\n=== Selected interviews ===\n\"What is Inclusive Democracy? on YouTube. Takis Fotopoulos' Interview about Inclusive Democracy\". Interview taken by Oliver Ressler for his video series Alternative Economics, Alternative Societies (2003-2008) (July 19, 2003). Retrieved 21 April 2014.\nInclusive Democracy - A transcript of the video interview given by Takis Fotopoulos to Oliver Ressler for the project Alternative Economics, Alternative Societies (2003-2008) (Recorded in London, 2003). Retrieved 9 October 2015.\nInterview with Galina Tichinskaya for Pravda.ru: \"Is there a way out of the crisis within EU? The case of Greece\" on YouTube and transcript: \"Is there a way out of the crisis within EU? The case of Greece\" (26 February 2015).\n\"On the rise of Neoliberalism: An Interview with Takis Fotopoulos\" (8 May 2009). Retrieved 21 April 2014.\nInterview for Equal Time for Freethought radio show, [original aired as Show 247: Takis Fotopoulos, 30 December 2007; later due to its poor audio quality replaced and renamed Show 289: 1-Hour Special: A Prescription for Real Social Change.] (WBAI radio 99.5 FM, New York City, USA). transcript, audio (1:00:48 min).\n\n\n=== Selected talks ===\n\"Inclusive Democracy as a political project for a new libertarian synthesis: rationale, proposed social structure and transition\" talk given by Takis Fotopoulos at the CNT centenary conference on self-management (Barcelona, 10 April 2010). Retrieved 21 April 2014.\nTakis Fotopoulos talk on the Multidimensional Crisis and Inclusive Democracy (Exeter College, University of Oxford, 12 November 2008). Video in 3 parts: Part 1 (talk), part 2 (talk/discussion), part 3 (discussion). Retrieved 21 April 2014.\nA talk given by Takis Fotopoulos about the Internationalization of the Capitalist Market Economy and the project of Inclusive Democracy (University of Vermont (US), 19 April 1996), followed by a discussion with Murray Bookchin, Dan Chodorkoff and others. Video in 3 parts: Part 1, Part 2, Part 3. Retrieved 21 April 2014.", "ns": 0, "pageid": 2951290, "title": "Takis Fotopoulos"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}