{"batchcomplete": "", "query": {"normalized": [{"to": "Tan Sitong", "from": "Tan_Sitong"}], "pages": {"2102240": {"extract": "Tan Sitong (Chinese: 譚嗣同, March 10, 1865 – September 28, 1898), courtesy name Fusheng (复生), pseudonym Zhuangfei (壮飞), was a well-known Chinese politician, thinker and reformist in the late Qing Dynasty (1636–1911); he was however, finally executed at the age of 33 when the Reformation Movement failed. He was one of the \"Six gentlemen of the Hundred Days' Reform\" (戊戌六君子). He occupies a place of tremendous importance in modern Chinese history. To many contemporaries, his execution symbolised the political failure of Qing Dynasty's reformation from within itself and turned the intellectual class to seek violent and hostile means, through revolution, to overthrow the Qing Dynasty.\n\n\n== His family ==\nTan Sitong was born in Beijing though his family came from Liuyang, Hunan Province. His father, Tan Jixun (谭继洵), was the governor of Hubei Province. His mother, Xu Wuyuan (徐五缘), a traditional Chinese housewife, was quite strict with her children. Tan Sitong had nine siblings in total.\nUnfortunately, at the age of 12, Tan Sitong lost his mother, his eldest brother and his second eldest sister died one after another within a span of 5 days due to diphtheria contracted from one of his cousins when they went to visit her. He himself also fell gravely ill and only recovered three days later which was deemed to be a miracle. This event struck him so much that his outlook in life completely changed. Ever since he lost his mother, his father’s concubine treated him badly. He was married to Li Run (李闰) at the age of 19 and together had a son named Tan Lansheng (谭兰生) who died within a year. His wife was known to be extremely devoted to him even years after his execution. She established a special school for girls in his hometown. Schools dedicated to the education of girls/women were almost unheard of at that time in rural China.\n\n\n== His life ==\nTan Sitong spent his childhood in Beijing and his youth in Liuyang. He began to study at the age of 5. He learned from a famous scholar called Ouyang Zhonggu (欧阳中鹄) when he was 10. Though he was talented in writing essays, he objected to the conventional form of the essay which was required in every exam at that time. As a result, he was only titled \"mandarin scholar\" (Xiu Cai), a very low educational level.\nIn 1879, he learned from another scholar, Xu Qixian (徐启先), with whom he began a systematic study of representative works in Chinese and was exposed to natural science.\nIn 1884, he left his home and began a long trip which expanded his outlook. He traveled to several different provinces of China including Hebei, Gansu, Xinjiang, Shaanxi, Henan, Hubei, Jiangxi, Jiangsu, Anhui, Zhejiang, Shangdong, Shanxi, and wrote more than 200 poems during the trip.\nIn 1895, through a war of aggression against China, Japan forced the Qing Government to sign the unequal Treaty of Shimonoseki, and forcibly occupied Taiwan. Tan Sitong was astonished by the news. He was disappointed with how impotent state authority was and felt indignant about such foreign aggression. He and his colleagues began to search for new ways to change the current situation.\nDuring 1896 and 1897, he finished a famous book called Ren Xue, which was considered to be the first philosophical work of the reformation clique. In this book, he pointed out that absolute monarchy greatly oppressed human nature and was the fountain head of every sort of evil. In 1897, Tan Sitong helped the governor of Hunan province with the new policy. In 1898, he founded a new academy called the “South Academy” which aimed at combining the power of reformation in the South. Later, he also created “Hunan Reporter” (湘报) to give publicity to the advantage of new policies.\nAn officer introduced Tan Sitong to the Guangxu Emperor, and he was soon appointed a member of the Grand Council in April 1898. The Hundred Days Reform began with the issuing of a new memorial which contained a series of new policies on June 11, 1898. However, the new policies greatly harmed the existing interests of many government officials and Manchu noblemen and soon ran into serious oppositions. When Tan heard that the Empress Dowager Cixi was brewing a scheme of putting the emperor under house arrest for initiating the new policies, he immediately visited general [Yuan Shikai] on September 18, in the hope that Yuan's army might support the Reformation Movement and prevail over the opposition forces headed by Empress Cixi.\nAfter Yuan Shikai came back to Tianjin on September 20, he betrayed them immediately by divulging all the conspiracy to overthrow Cixi and regaining the power by the emperor from Cixi. Cixi soon launched a coup and issued the command to arrest all those people who were involved in the reform on September 21. In total, their reform failed after a mere 103 days. Tan Sitong was arrested at the \"Guild Hall of Liuyang\" (浏阳会馆) in Beijing on September 24. Before that, someone had tried to persuade him to escape to Japan, which had expressed support of the movement, but he refused to do so, hoping his death and blood would awaken the masses to take up arms against the corrupt Qing government and continue his unfinished dreams of a strong China. On September 27 he was tried for treason and attempting a military coup, but the process was interrupted at four o'clock by an order (most likely from the Empress Dowager) for his immediate execution. Finally, he was beheaded in the Caishikou Execution Grounds outside Xuanwu Gate on September 28, 1898, along with five others. In 1899, his remains were sent back and buried in Liuyang.\nSome of his last words have become famous in China and translate as follows:\n\nI wanted to kill the robbers, but lacked the strength to transform the world. This is the place where I should die. Rejoice, rejoice!\n\n\n== See also ==\nTan Sitong's Former Residence\nSix gentlemen of the Hundred Days' Reform\nHundred Days' Reform\nLin Xu\nTang Caichang\n\n\n== References ==\n仁学 谭嗣同年谱 http://baike.baidu.com/view/1655.htm\n\"T'an Ssu-t'ung,\" in Hummel, Arthur William, ed. Eminent Chinese of the Ch'ing Period (1644-1912). (Washington: United States Government Printing Office, 1943), Vol II, pp. 701–705. Online at Qing Studies Workshop (link at left).\n\n\n== Notes ==", "ns": 0, "pageid": 2102240, "title": "Tan Sitong"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}