{"batchcomplete": "", "query": {"normalized": [{"to": "Theodor Zwinger", "from": "Theodor_Zwinger"}], "pages": {"38866": {"extract": "Theodor Zwinger the Elder (2 August 1533 – 10 March 1588) was a Swiss physician and humanist scholar. He made significant contributions to the emerging genres of reference and travel literature. He was the first distinguished representative of a prominent early modern Basel academic family.\n\n\n== Life and work ==\nZwinger was the son of the furrier Leonhard Zwinger who had become Basel citizen in 1526. His mother was Christina Herbster, the sister of Johannes Oporinus (Herbster) the famed humanist printer. After Zwinger’s father’s death, Christina married the noted humanist Conrad Lycosthenes (Wolffhart).\nZwinger studied at universities in Basel, Lyon, and Paris before taking a doctorate in medicine at the University of Padua with Bassiano Landi, the successor of Johannes Baptista Montanus. In Paris he studied with the iconoclastic philosopher Petrus Ramus. He joined the faculty of the University of Basel as a member of the consilium facultatis medicae from 1559. At Basel he held successively chairs in Greek (1565), Ethics (1571), and finally theoretical medicine (1580). While originally hostile to Paracelsus, in his later career he took an interest in Paracelsian medical theory for which he experienced some hostility. He associated with Paracelsians such as Thomas Moffet and Petrus Severinus.\nZwinger was the editor of the early encyclopedia Theatrum Humanae Vitae (editions 1565, 1571, 1586, 1604). The work is considered \"perhaps the most comprehensive collection of knowledge to be compiled by a single individual in the early modern period.\" He was able to draw on the knowledge base of his stepfather Conrad Lycosthenes in compiling the Theatrum Humanae Vitae.\nZwinger’s son, Jakob Zwinger, briefly served as his successor as editor of the Theatrum. His descendant Theodor Zwinger the Younger (1597–1654) was a prominent preacher and theology professor.\n\n\n== Zwinger's works ==\nTheatrum Vitae Humanae — an early encyclopedia\nMethodus Apodemica — an early example of travel literature\nSpecimen Materiae medicae : cum subjunctis ubique Remediorum Formulis in Gratiam & Usum Philiatrorum ac Juniorum Practicorum tumultuaria methodo inter plurimas Mentis Distractiones fideli tamen Opera adornatum. - Basileae : Thurnisius, 1722. Digital edition of the University and State Library Düsseldorf.\nTheodori Zuingeri Theatrum botanicum, das ist: Vollkommenes Kräuter-Buch : worinnen allerhand Erdgewächse, Bäume, Stauden und Kräuter, welche in allen vier Theilen der Welt, sonderlich aber in Europa, hervorkommen, beschrieben. Itzo auf das Neue übersehen / durch Friedrich Zwinger. Basel : Bischoff, 1744. Digital edition of the University and State Library Düsseldorf.\n\n\n== References ==\n\n\n== Further reading ==\nGilly, Carlos. \"Zwischen Erfahrung und Spekulation: Theodor Zwinger und die religiöse und kulturelle Krise seiner Zeit.\" Basler Zeitschrift für Geschichte und Altertumskunde 77 (1977): 57–137 & 79 (1979): 125–233 (German).\nHerzog, J. W. (1778). Athenae rauricae: Sive catalogus professorum Academiae Basiliensis ab A. MCCCCLX ad A. MDCCLXXVIII. Cum brevi singulorum biographia. Adjecta est recensio omnium eiusdem Academiae rectorum. Basel: Car. Aug. Serini. p. 208. OCLC 43215846. \n\n\n== External links ==\nLatin biography by Melchior Adam, 1620\nWorks of Theodor Zwinger at the Munich Digitization Center", "ns": 0, "pageid": 38866, "title": "Theodor Zwinger"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}