{"batchcomplete": "", "query": {"pages": {"499358": {"extract": "Thiruvalluvar is a celebrated Tamil poet and philosopher whose contribution to Tamil literature is the Thirukkural, a work on ethics. It is believed that he was born either in Thiru Mylai (Mylapore) Chennai in Tamil Nadu or in ThirunainarKuruchi, a village in Kanyakumari District of Tamil Nadu.Thiruvalluvar is thought to have lived sometime between the 4th century BC and the 1st century BC. The Tamil poet Mamulanar of the Sangam period mentioned that Thiruvalluvar was the greatest Tamil scholar and Mamulanar also mentioned the Nanda Dynasty of northern which ruled until the 4th century BC. This estimate is based on linguistic analysis of his writings, as there is no historical evidence for when and where he lived.\n\n\n== Traditional accounts ==\n\nThirukkuṛal itself does not name its author or authors. The name Thiruvalluvar is first mentioned in the 10th century in a text called Thiruvalluvarmaalai (\"Thiruvalluve traditions of Thiruvalluvar\" appeared after this text had been written. It is generally believed that the name Thiruvalluvar consists of Thiru\nHe has been said to have been a weaver and the supposed house he lived is now converted to a temple. His wife's name is Vaasuki. There are lots of legends about the pair Thiruvalluvar and Vaasuki. Two of them are: 1) Once Vaasuki Ammaiyar was drawing water from well and Thiruvalluvar called her and she left the water and ran in immediately, but the water pot stayed in mid air. Such was her austerity and dedication towards her husband Thiruvalluvar; 2) Thiruvalluvar used to sit every day for meal with a cup of water and a wooden tooth pick. He did this to pick any grain of rice spilled out from his leaf when Vaasuki Ammaiyar served food. It was said that Thiruvalluvar could not even pick a grain of rice every day. Such was the dedication in serving meal by Vaasuki Ammaiyar. Thiruvalluvar may have spent part of his life in Madurai because it was under the Pandiya rulers that many Tamil poets flourished. There is also the recent claim by Kanyakumari Historical and Cultural Research Centre (KHCRC) that Valluvar was a king who ruled Valluvanadu in the hilly tracts of the Kanyakumari District of Tamil Nadu. \n\n\n== Thirukkural ==\n\nThirukkural is one of the most revered ancient works in the Tamil language. It is considered a 'common creed', providing a guide for human morals and betterment in life. Thirukkural has been translated into several languages, including a translation into Latin by Constanzo Beschi in 1730, which helped make the work known to European intellectuals.\n\n\n== Other books ==\nOther than the Thirukkuṛaḷ, Thiruvalluvar is alleged to be the author of two Tamil texts on medicine, Gnana Vettiyan and Pancharathnam; although many scholars claim that they were by a later author with the same name, since they appear to have been written in the sixteenth and seventeenth centuries.these books panchae raethnaem and gnana veatiaen contributes to the Tamil,science, literature and other ayur veda medicines\n\n\n== Memorials ==\n\nA temple-like memorial to Thiruvalluvar, Valluvar Kottam, was built in Chennai in 1976. This monument complex consists of structures usually found in Dravidian temples, including a temple car carved from three blocks of granite, and a shallow, rectangular pond. The auditorium adjoining the memorial is one of the largest in Asia and can seat up to 4000 people.\nThere is a 133-foot tall statue of Thiruvalluvar erected at Kanyakumari at the southern tip of the Indian subcontinent, where the Arabian Sea, the Bay of Bengal, and the Indian Ocean converge. The 133 feet denote Tirukkuṛaḷ's 133 Chapters or athikarams and the show of three fingers denote the three themes Aram, Porul, and Inbam, i.e. the sections on Morals, Wealth and Love. The statue was designed by V. Ganapati Sthapati, a temple architect from Tamil Nadu. His statue was unveiled in Ulsoor, near Bengaluru, on 9 August 2009, also making it the first of its kind for a poet of a local language to be installed in its near states other than his own home land at India. There is also a statue of Thiruvalluvar outside the School of Oriental and African Studies in Russell Square, London.\nThe government of Tamil Nadu celebrates the 15th (16th On Leap Years) of January as (as Per Tamil Calendar தை-2) Thiruvalluvar Day as part of the Pongal celebrations in his honour.\n\n\n== See also ==\n\nStatue of Thiruvalluvar\nSarvajna\nVemana\nSarvajna and Tiruvalluvar statue installation\nValluvar Kottam\nAvvaiyar\nValluvan\nParayi petta panthirukulam\n\n\n== References ==\n\n\n== External links ==\nWorks by or about Thiruvalluvar at Internet Archive\nWorks by Thiruvalluvar at LibriVox (public domain audiobooks)", "ns": 0, "pageid": 499358, "title": "Thiruvalluvar"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}