{"batchcomplete": "", "query": {"normalized": [{"to": "Thomas Bradwardine", "from": "Thomas_Bradwardine"}], "pages": {"153676": {"extract": "Thomas Bradwardine (c. 1290 – 26 August 1349) was an English cleric, scholar, mathematician, physicist, courtier and, very briefly, Archbishop of Canterbury. As a celebrated scholastic philosopher and doctor of theology, he is often called Doctor Profundus, (medieval epithet, meaning \"the Profound Doctor\").\n\n\n== Life ==\nBradwardine was born in Sussex either at Hartfield or at Chichester, where his family were settled, members of the smaller gentry or burghers.\nBradwardine was a precocious student, educated at Balliol College, Oxford where he was a fellow by 1321; he took the degree of doctor of divinity, and acquired the reputation of a profound scholar, a skillful mathematician and an able theologian. He was also a gifted logician with theories on the insolubles and in particular the liar paradox.\nBradwardine subsequently moved to Merton College, Oxford on a fellowship. He was afterwards raised to the high offices of chancellor of the university and professor of divinity. Bradwardine (like his contemporary William of Occam) was a culminating figure of the great intellectual movement at Oxford that had begun in the 1240s.\nBradwardine was an ordinary secular cleric, which gave him intellectual freedom but deprived him of the security and wherewithal that the Preaching Orders would have afforded; instead he turned to royal patronage. From being chancellor of the diocese of London as Dean of St Paul's, he became chaplain and confessor to Edward III, whom he attended during his wars in France at the Battle of Crécy, where he preached at the victory Mass, and at the subsequent siege of Calais. Edward repeatedly entrusted him with diplomatic missions. On his return to England, he was successively appointed prebendary of Lincoln and dean (1348). In 1349 the canons of the chapter at Canterbury elected him Archbishop following the death of Archbishop John Stratford, but Edward III withheld his consent, preferring his chancellor John de Ufford, perhaps loth to lose his trusted confessor. After Ufford died of the Black Death, 2 May, Bradwardine went to receive confirmation from Pope Clement VI at Avignon, but on his return he died of the plague at Rochester on 26 August 1349, forty days after his consecration. He was buried at Canterbury.\nChaucer in The Nun's Priest's Tale (line 476) ranks Bradwardine with Augustine and Boethius. His great theological work, to modern eyes, is a treatise against the Pelagians, entitled De causa Dei contra Pelagium et de virtute causarum. Bradwardine's major treatise argued that space was an infinite void in which God could have created other worlds, which he would rule as he ruled this one. The \"causes of virtue\" include the influences of the planets, not as predestining a human career, but influencing a subject's essential nature. This astrophysical treatise was not published until it was edited by Sir Henry Savile and printed in London, 1618; its circulation in manuscript was very limited. The implications of the infinite void were revolutionary; to have pursued them would have threatened the singular relationship of man and this natural world to God (Cantor 2001); in it he treated theology mathematically. He wrote also De Geometria speculativa (printed at Paris, 1530); De Arithmetica practica (printed at Paris, 1502); De proportionibus velocitatum in motibus (1328) (printed at Paris, 1495; Venice, 1505); De Quadratura Circuli (Paris, 1495); and an Ars Memorative, Sloane manuscripts. No. 3974 in the British Museum—earning from the Pope the title of the Profound Doctor. Another text, De Continuo is more tenuously credited to him and thought to be written sometime between 1328 and 1325.\n\n\n== Science ==\n\nMerton College sheltered a group of dons devoted to natural science, mainly physics, astronomy and mathematics, rivals of the intellectuals at the University of Paris. Bradwardine was one of these Oxford Calculators, studying mechanics with William Heytesbury, Richard Swineshead, and John Dumbleton. The Oxford Calculators distinguished kinematics from dynamics, emphasising kinematics, and investigating instantaneous velocity. They first formulated the mean speed theorem: a body moving with constant velocity travels the same distance as an accelerated body in the same time if its velocity is half the final speed of the accelerated body. They also demonstrated this theorem — the foundation of \"The Law of Falling Bodies\" — long before Galileo, who is generally credited with it.\nThe mathematical physicist and historian of science Clifford Truesdell, wrote:\n\nThe now published sources prove to us, beyond contention, that the main kinematical properties of uniformly accelerated motions, still attributed to Galileo by the physics texts, were discovered and proved by scholars of Merton college.... In principle, the qualities of Greek physics were replaced, at least for motions, by the numerical quantities that have ruled Western science ever since. The work was quickly diffused into France, Italy, and other parts of Europe. Almost immediately, Giovanni di Casale and Nicole Oresme found how to represent the results by geometrical graphs, introducing the connection between geometry and the physical world that became a second characteristic habit of Western thought ...\n\nIn Tractatus de proportionibus (1328), Bradwardine extended the theory of proportions of Eudoxus of Cnidus to anticipate the concept of exponential growth, later developed by the Bernoulli and Euler, with compound interest as a special case. Arguments for the mean speed theorem (above) require the modern mathematical concept of limit, so Bradwardine had to use arguments of his day. Mathematician and mathematical historian Carl Benjamin Boyer writes, \"Bradwardine developed the Boethian theory of double or triple or, more generally, what we would call 'n-tuple' proportion\".\nBoyer also writes that \"the works of Bradwardine had contained some fundamentals of trigonometry gleaned from Muslim sources\". Yet \"Bradwardine and his Oxford colleagues did not quite make the breakthrough to modern science\" (Cantor 2001, p. 122). The most essential missing tool was calculus.\n\n\n== Art of memory ==\nBradwardine was also a practitioner and exponent of the art of memory, a loosely associated group of mnemonic principles and techniques used to organise memory impressions, improve recall, and assist in the combination and 'invention' of ideas. His De Memoria Artificiali (c. 1335) discusses memory training current during his time.\n\n\n== Legacy ==\nBradwardine's theories on the insolubles including the liar paradox were a great influence on the work of Jean Buridan and therefore in turn of the more recent philosopher A. N. Prior. Bradwardine's work on kinematics was also influential to Buridan.\nHis De Causa Dei influenced the theology of John Wycliffe on grace and predestination.\n\n\n== Latin works and English translations ==\nInsolubilia (Insolubles), Latin text and English translation by Stephen Read, Leuven, Peeters Editions (Dallas Medieval Texts and Translations, 10), 2010.\nDe insolubilibus (On Insolubles), edited by Marie Louise Roure in 'La problématique des propositions insolubles du XIIIe siècle et du début du XIVe, suivie de l'édition des traités de William Shyreswood, Walter Burleigh et Thomas Bradwardine', Archives d'histoire doctrinale et littéraire du moyen Age 37, 1970: 205–326.\nDe incipit et desinit (On 'It Begins' and 'It Ceases'), ed. Lauge O. Nielsen, Cahiers de l'Institut du moyen Age grec et Latin 42, 1982: 1-83.\nGeometria speculativa (Speculative Geometry), Latin text and English translation with an introduction and a commentary by George Molland, Stuttgart: Steiner Verlag, 1989.\nArithmetica speculativa (Speculative Arithmetic) Parisiis: G. Marchant, 1495\nDe proportionibus velocitatum in motibus (On the Ratios of Velocities in Motions) Latin text and English translation by H. Lamar Crosby, Jr. in: 'Thomas of Bradwardine: His Tractatus de Proportionibus: Its Significance for the Development of Mathematical Physics', Madison, WI: University of Wisconsin Press, 1955.\nDe continuo (On the Continuum), edited by John Emery Murdoch in 'Geometry and the Continuum in the Fourteenth Century: A Philosophical Analysis of Thomas Bradwardine's Tractatus de continuo', Ph.D. thesis, University of Wisconsin, 1957.\nDe futuris contingentibus (On Future Contingents), edited by Jean-François Genest, Recherches augustiniennes 14, 1979: 249-336.\nDe causa Dei contra Pelagium et de virtute causarum ad suos Mertonenses, libri tres (In Defense of God Against the Pelagians and On the Power of Causes, in three books), edited by Henry Savile, London: 1618; reprinted at Frankfurt: Minerva, 1964.\nCommentary on the Sentences of Peter Lombard: some questions found in a manuscript at the Bibliothèque Nationale de Paris are published in: J.-F. Genest and Katherine Tachau, 'La lecture de Thomas Bradwardine sur les Sentences', Archives d'histoire doctrinale et littéraire du Moyen Age 57, 1990: 301-6.\nDe memoria artificiali adquirenda (On Acquiring a Trained Memory), ed. Mary Carruthers, Journal of Medieval Latin, 2, (1992): 25–43; translated in Carruthers M., The Book of Memory: A Study of Memory in Medieval Culture, New York: Cambridge Univ. Press. 1990, p. 281-8; Carruthers M. and Ziolkowski J., The Medieval Craft of Memory, Philadelphia: Univ. of Pennsylvania Press, 2002, pp. 205–14.\nGillmeister H. (ed.), An intriguing fourteenth-century document: Thomas Bradwardine’s De arte memorativa. Archiv für das Studium der neueren Sprachen und Literaturen 220, 1983, pp. 111-114.\nGreen-Pedersen N.-J. (ed.), Bradwardine (?) on Ockham’s doctrine of consequences: an edition. Cahiers de l’Institute de moyen age grec et latin, 42, 1982, pp. 85-150.\nLamar Crosby H. (ed.), Thomas of Bradwardine: his Tractatus de Proportionibus: its significance for the development of mathematical physics. Madison, University of Wisconsin Press, 1955.\n\n\n== See also ==\nList of Roman Catholic scientist-clerics\n\n\n== Citations ==\n\n\n== References ==\nA History of Mathematics (pp. 288, 302), Carl O. Boyer, Princeton University Press, Princeton, 1984.\nThe Science of Mechanics in the Middle Ages, Marshall Claggett, University of Wisconsin Press, Madison, 1960.\nTractatus de Proportionibus, Its Significance for the Development of Mathematical Physics, H. L. Crosby, University of Wisconsin Press, Madison, 1955.\nFryde, E. B.; Greenway, D. E.; Porter, S.; Roy, I. (1996). Handbook of British Chronology (Third revised ed.). Cambridge: Cambridge University Press. ISBN 0-521-56350-X. \nEssays in The History of Mechanics, Clifford Truesdell, Springer-Verlag, New York, 1968, QC122.T7.\nSee Quétif–Échard, Script. Praedic. (1719), i. 744\nW. F. Hook, Lives of the Archbishops of Canterbury, vol. iv.\nIn the Wake of the Plague, Norman F. Cantor, Simon & Schuster, 2001. \"Death comes to the Archbishop\": a chapter sets Bradwardine's political and intellectual career in his Oxford milieu, in the context of the Black Death.\n This article incorporates text from a publication now in the public domain: Cousin, John William (1910). A Short Biographical Dictionary of English Literature. London: J. M. Dent & Sons. Wikisource \n\n\n== Further reading ==\nHeiko Oberman, Archbishop Thomas Bradwardine, a Fourteenth Century Augustinian: A Study of His Theology in Its Historical Perspective, Utrecht: Kemink & Zoon, 1957.\nGordon Leff, Bradwardine and the Pelagians: A Study of His \"De Causa Dei\" and Its Opponents, Cambridge, England: Cambridge University Press, 1957.\nRead, Stephen, \"Paradox, Closure and Indirect Speech Reports\", Logica Universalis, 2015. doi:10.1007/s11787-014-0115-3\n\n\n== External links ==\nThomas Bradwardine at The MacTutor History of Mathematics archive\nThomas Bradwardine. Geometria speculativa at Somni", "ns": 0, "pageid": 153676, "title": "Thomas Bradwardine"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}