{"batchcomplete": "", "query": {"normalized": [{"to": "Théodore Simon Jouffroy", "from": "Théodore_Simon_Jouffroy"}], "pages": {"174358": {"extract": "Théodore Simon Jouffroy (6 July 1796 – 4 February 1842) was a French philosopher.\n\n\n== Biography ==\nHe was born at Les Pontets, Franche-Comté, département of Doubs. In his tenth year, his father, a tax-gatherer, sent him to an uncle at Pontarlier, under whom he began his classical studies. At Dijon his compositions attracted the attention of an inspector, who had him placed (1814) in the normal school, Paris. There he came under the influence of Victor Cousin, and in 1817 he was appointed assistant professor of philosophy at the normal and Bourbon schools.\nThree years later, being thrown upon his own resources, he began a course of lectures in his own house, and formed literary connexions with Le Courrier français, Le Globe, L'Encyclopédie moderne, and La Revue européenne. The variety of his pursuits at this time carried him over the whole field of ancient and modern literature. But he was chiefly attracted to the philosophical system represented by Thomas Reid and Dugald Stewart. The application of \"common sense\" to the problem of substance supplied a more satisfactory analytic for him than the scepticism of David Hume which reached him through a study of Kant.\nHe thus threw in his lot with the Scottish philosophy, and his first dissertations are adaptations from Reid's Inquiry. In 1826 he wrote a preface to a translation of Stewart's Moral Philosophy, demonstrating the possibility of a scientific statement of the laws of consciousness; in 1828 he began a translation of the works of Reid, and in his preface estimated the influence of Scottish criticism upon philosophy, giving a biographical account of the movement from Francis Hutcheson onwards. In the following year he was returned to parlement by the arrondissement of Pontarlier; but the work of legislation was ill-suited to him. Yet he attended to his duties conscientiously, and ultimately broke his health in their discharge. In 1833 he was appointed professor of Greek and Roman philosophy at the college of France and a member of the Academy of Sciences; he then published the Mélanges philosophiques (4th ed. 1866; Eng. trans. G Ripley, Boston, 1835 and 1838), a collection of fugitive papers in criticism and philosophy and history. In them is foreshadowed all that he afterwards worked out in metaphysics, psychology, ethics and aesthetics.\nHe had already demonstrated, in his prefaces, the possibility of a psychology apart from physiology, of a science of the phenomena of consciousness distinct from the perceptions of sense. He now classified the mental faculties, premising that they must not be confounded with capacities or properties of mind. They were, according to his analysis, personal will, primitive instincts, voluntary movement, natural and artificial signs, sensibility and the faculties of intellect; on this analytic he founded his scheme of the universe.\nIn 1835 he published Cours de droit naturel (4th ed. 1866), one of his most important works. From the conception of a universal order in the universe he reasons to a Supreme Being, who has created it and who has conferred upon every man in harmony with it the aim of his existence, leading to his highest good. Good, he says, is the fulfilment of man's destiny, evil the thwarting of it. Every man being organized in a particular way has, of necessity, an aim, the fulfilment of which is good; and he has faculties for accomplishing it, directed by reason. The aim is good, however, only when reason guides it for the benefit of the majority, but that is not absolute good. When reason rises to the conception of universal order, when actions are submitted, by the exercise of a sympathy working necessarily and intuitively to the idea of the universal order, the good has been reached, the true good, good in itself, absolute good. But he does not follow his idea into the details of human duty, though he passes in review fatalism, mysticism, pantheism, scepticism, egotism, sentimentalism and rationalism.\nIn 1835 Jouffroy's health failed and he went to Italy, where he continued to translate the Scottish philosophers. On his return he became librarian to the university, and took the chair of recent philosophy at the faculty of letters. He died in Paris. After his death were published Nouveaux mélanges philosophiques (3rd ed. 1872) and Cours d'esthetique (3rd ed. 1875). The former contributed nothing new to the system except a more emphatic statement of the distinction between psychology and physiology. The latter formulated his theory of beauty.\nJouffroy's claim to distinction rests mainly on his ability as an expositor of other men's ideas. His enthusiasm, and his command over the language of popular exposition, made him a great international medium for the transfusion of ideas. He stood between Scotland and France and Germany and France; and, though his expositions are vitiated by loose reading of the philosophers he interpreted, he did some memorable work.\n\n\n== Works ==\nEsquisses De Philosophie Morale. 1826. OCLC 422237300. \nIntroduction to Ethics Including a Critical Survey of Moral Systems. Vol. 1. 1848. OCLC 515416140. \nIntroduction to Ethics Including a Critical Survey of Moral Systems. Vol. 2. 1848. OCLC 515415726. \nMélanges Philosophiques. 1860. OCLC 2183553. \nNouveaux Mélanges Philosophiques. 1842. OCLC 568402. \nCours de droit naturel. 1866. \nRoyer-Collard, Paul, 1763-1843; Stewart, Dugald, 1753-1828; Jouffroy, Théodore, 1796-1842 (1828/1836). Œuvres Complètes De Thomas Reid, Chef De L'école Écossaise, Publiées Par M. Th. Jouffroy, Avec Des Fragments De M. Royer-Collard Et Une Introduction De L'éditeur .. OCLC 2943985.   CS1 maint: Multiple names: authors list (link)\n\n\n== External links ==\nIntroduction to Ethics, including a critical survey of moral systems (Volume 1)\n\n\n== References ==\nLucien Lévy-Bruhl: History of modern philosophy in France: with portraits of the leading French philosophers, pp. 349–357. Chicago, Ill.: Open Court, 1899.\nClaude Joseph Tissot: Th. Jouffroy, sa vie et ses écrits. Paris 1876.\nJean Philibert Damiron: Essai sur l'histoire de la philosophie en France au XVIIe siècle. Paris, 1846.\nAdolphe Lair (1901). Correspondance De Théodore Jouffroy Publiée Avec Une Étude Sur Jouffroy. OCLC 489768527. \nGeorge Ripley (1838). Philosophical Miscellanies, Translated from the French of Cousin, Jouffroy, and B. Constant. With Introductory and Critical Notices. OCLC 3262645. \nSerge Nicolas (2007). Cours De Philosophie De 1830 À L'École Normale ; Suivi De Du Suicide. OCLC 470646158. \n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Jouffroy, Théodore Simon\". Encyclopædia Britannica (11th ed.). Cambridge University Press.", "ns": 0, "pageid": 174358, "title": "Théodore Simon Jouffroy"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}