{"batchcomplete": "", "query": {"normalized": [{"to": "Toju Nakae", "from": "Toju_Nakae"}], "pages": {"4522155": {"extract": "Toju Nakae (中江 藤樹, Nakae Tōju, 21 April 1608 – 11 October 1648) was a Japanese Confucian philosopher known as \"the sage of Ōmi\".\nNakae was a feudal retainer who lived during the Tokugawa shogunate. He taught that the highest virtue was filial piety (kō), and acted upon this, giving up his official post in 1634 in order to return to his home in Takashima, Ōmi to care of his mother. He distinguished, however, between sho-kō and dai-kō: lesser and greater filial piety. Sho-kō involves the normal care owed by children to their parents; dai-kō involves the notion that our human parents are themselves the children of the divine parents — thus, if one's parents are wrong, then one should encourage them to return to virtue.\nHe was unusual in believing that his teaching would be useful to women as well as men. While accepting the then standard view of women as usually lacking such virtues as compassion and honesty, he argued: \"if a wife's disposition is healthy and pious, obedient, sympathetic and honest, then ... every member of her family will be at peace and the entire household in perfect order.\"\nNakae originally followed the teachings of the Chinese neo-Confucian philosopher Zhu Xi, but eventually became more influenced by Wang Yangming (1472–1529), who argued for the primacy of human intuition or conscience over intellect: moral improvement arises out of conscience-based action (compare Aristotle's ethics). Nakae added a more religious aspect to Wang's \"School of Intuition of Mind\", calling the human conscience the \"divine light of heaven\". Nakae's works also supplied his followers (such as Kumazawa Banzan [1619–1691]) with \"the moral foundation for political action\".\n\n\n== Selected works ==\nIn a statistical overview derived from writings by and about Toju Nakae, OCLC/WorldCat encompasses roughly 130+ works in 200 publications in 5 languages and 740+ library holdings.\n\n1650 -- Dialogue with the elder (Okina mondō).\n藤樹遺稿 (1795)\n翁問答 (1831)\n藤樹全書: 中江藤樹先生遺稿 (1893)\n中江藤樹文集 (1914)\n孝經五種 (1925)\nNakae Tōju sensei zenshu (1928)\n鑑草; 附・春風; 陰騭 (1939)\n藤樹先生全集 (1940)\n中江藤樹・熊沢蕃山集 (1966)\n中江藤樹 (1974)\n中江藤樹・熊沢蕃山 (1976)\n\n\n== Notes ==\n\n\n== References ==\nBodart-Bailey, Beatrice. (1997). \"Confucianism in Japan\" in Companion Encyclopedia of Asian Philosophy (Brian Carr and Indira Mahalingam, eds). London: Routledge. ISBN 9780415035354; OCLC 35049601\nde Bary, William Theodore. (1981). Neo-Confucian Orthodoxy and the Learning of the Mind-and-Heart. New York: Columbia University Press. ISBN 9780231052283; OCLC 7461831\nNauman, St. Elmo. (1979). Dictionary of Asian Philosophies. London: Routledge. ISBN 9780710002136; OCLC 470939937\nShirane, Haruo. (2002). Early Modern Japanese Literature. New York: Columbia University Press. ISBN 9780231109901; ISBN 9780231109918; OCLC 48084101\nNakae Tōju Britannica Concise Encyclopedia 2006. Retrieved: March 26, 2006.\n\n\n== External links ==\nIntellectual Currents in Tokugawa Japan — by Jason Chan; includes extracts from Toju's writings\nTakashima City web site: Toju Nakae and Toju shoin national historical site\nToju's hometown in Japan — set of (stereo) photographs\nEast Asia Institute, University of Cambridge: Further reading/bibliography", "ns": 0, "pageid": 4522155, "title": "Toju Nakae"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}