{"batchcomplete": "", "query": {"normalized": [{"to": "Tom Beauchamp", "from": "Tom_Beauchamp"}], "pages": {"20688926": {"extract": "Tom L. Beauchamp is an American philosopher specializing in philosophy of David Hume, moral philosophy, bioethics, and animal ethics. He is Professor of Philosophy at Georgetown University, and Senior Research Scholar at the University's Kennedy Institute of Ethics.\nBeauchamp is the author or co-author of several books on ethics, and on the philosophy of David Hume, including Hume and the Problem of Causation (1981, with Alexander Rosenberg), Principles of Biomedical Ethics (1985, with James F. Childress), and The Human Use of Animals (1998, with F. Barbara Orlans et al). He is the co-editor with R.G. Frey of The Oxford Handbook of Animal Ethics (2011). He is also the co-editor of the complete works of Hume, The Critical Edition of the Works of David Hume (1999), published by Oxford University Press.\n\n\n== Education ==\nHe earned his BA from Southern Methodist University in 1963, a BD from Yale Divinity School, and PhD in philosophy from Johns Hopkins University in 1970. He is a fellow of the Hastings Center.\n\n\n== Career ==\nBeauchamp worked on the staff of the National Commission for the Protection of Human Subjects of Biomedical and Behavioral Research, where he co-wrote the Belmont Report in 1978. He later joined with James Childress to write Principles of Biomedical Ethics (1985), the first major American bioethics textbook. Beauchamp is also an expert on the philosophy of David Hume. He is the coeditor of the complete works of Hume published by Oxford University Press, and together with Alexander Rosenberg is the author of Hume and the Problem of Causation (1981), in which Hume's regularity theory of causation is defended, along with a nonskeptical interpretation of Hume's arguments against induction.\nHe has also written extensively about animal rights, and has defended a theory of animal rights which would significantly alter, though would not end, the ways in which non-human animals are currently used.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\nList of animal rights advocates\nPrinciplism\n\n\n== Notes ==\n\n\n== External links ==\nHomepage, Georgetown University.", "ns": 0, "pageid": 20688926, "title": "Tom Beauchamp"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}