{"batchcomplete": "", "query": {"normalized": [{"to": "Tony Honoré", "from": "Tony_Honoré"}], "pages": {"5974393": {"extract": "Anthony Maurice (Tony) Honoré (born 30 March 1921) is a British lawyer and jurist, known for his work on ownership, causation and Roman law.\nHonoré was born in London but was brought up in South Africa. He served in the army during the Second World War and was severely wounded in the Battle of Alamein. After the war he continued his studies at New College, Oxford, and he has lived and taught in Oxford for the last fifty-five years, including periods as a Fellow of The Queen's College and then of New College. Between 1971 and 1988 he was Regius Professor of Civil Law at Oxford and a Fellow of All Souls College, Oxford; though retired from his Chair, he teaches seminars in Jurisprudence for the BCL jointly with John Gardner.\nHonoré was a close associate of H. L. A. Hart. They jointly wrote Causation in the Law (Oxford, 1st ed. 1959, 2nd 1985) in 1953-8 and Honoré had some influence on Hart's The Concept of Law (Oxford, 1st ed. 1961, 2nd 1994). A number of his philosophical papers are collected in Making Law Bind (Oxford, 1987) and Responsibility and Fault (Oxford, 1999) and his contributions to legal philosophy and Roman law, which range widely, include sixteen books and more than a hundred articles published over the last six decades.\nHonoré is an honorary Q.C. and Bencher of Lincoln's Inn, a member of the British and Bavarian Academies and of the International Academy of Comparative Law. In South Africa, where he made a contribution to the setting up of the new Constitutional Court in 1995, his standing has been recognised by the award of honorary degrees from the Universities of South Africa, Stellenbosch and Cape Town. He has delivered the Hamlyn lectures (1982), the Blackstone and H. L. A. Hart lectures, the J. H. Gray lectures at Cambridge and the Maccabaean lecture in Jurisprudence at the British Academy. Three Festschriften have been published in his honour.\nNeil MacCormick and Peter Birks (eds., 1985) The Legal Mind: Essays for Tony Honoré;\nPeter Cane and John Gardner (eds., 2001) Relating to Responsibility: Essays in Honor of Tony Honoré on his 80th Birthday.\nDaniel Visser and Max Loubser (eds., 2011) Thinking about Law: Essays for Tony Honore;\n\n\n== List of publications ==\nBooks\nGaius: a biography (Oxford, 1962)\nTribonian (London, 1978)\nSex Law in England (London: Duckworth, 1978)\nEmperor and Lawyers: with a paligenesia of third-century imperial rescripts 193-305 AD (London, 1st ed. 1981; Oxford, 2nd ed. 1994)\nUlpian: pioneer of human rights (Oxford, 1st ed. 1982; 2nd ed. 2002)\nThe Quest for Security: Employees, Tenants, Wives (London: Stevens, 1982)\nCausation in the Law (Oxford, 1st ed. 1959; 2nd 1985) - with H. L. A. Hart\nMaking Law Bind (Oxford, 1987)\nConcordance to the Digest Jurists (Oxford: OMP, 1980) - with J. Menner\nAbout Law: an introduction (Oxford, 1995)\nLaw in the Crisis of the Empire 379-455 AD: the Theodosian dynasty and its quaestors (Oxford, 1998)\nResponsibility and Fault (Oxford, 1999)\nJustinian's Digest: character and compilation (Oxford, 2010)\nArticles\n\"Responsibility and luck: the moral basis of strict liability\" (1988) 104 Law Quarterly Review 530\n\n\n== References ==\n\n\n== External links ==\nTony Honoré's web site. Includes several online papers and brief biographical details.", "ns": 0, "pageid": 5974393, "title": "Tony Honoré"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}