{"batchcomplete": "", "query": {"normalized": [{"to": "Tripp York", "from": "Tripp_York"}], "pages": {"20951019": {"extract": "Fred \"Tripp\" York is an activist, a professor of religious studies, and a prolific Mennonite writer (B.A., Trevecca Nazarene University; M.T.S., Duke University; Ph.D., Garrett-Evangelical Theological Seminary). His writings span a wide range of genres and subjects including: animals, martyrdom, politics, violence, religious satire and comics. His most popular work is his satirical search for Satan in The Devil Wears Nada.\nHe is the co-creator and co-editor of The Peaceable Kingdom Series.\nYork belongs to the Mennonite tradition that has a 500-year history of Christian pacifism. He has written extensively on the North American Christians' complicity with power and suggests a return to a more diasporic understanding of Christian practice. He emphasizes the lives of Christian anarchists such as Dorothy Day, and Daniel and Philip Berrigan.\nHe teaches at Virginia Wesleyan College in Norfolk, VA. He previously taught at Elon University and Western Kentucky University.\n\n\n== Works ==\nThe End of Captivity? A Primate's Reflections on Zoos, Conservation, and Christian Ethics. Cascade Books, 2015.\nA Faith Encompassing All Creation. Cascade Books, 2014.\nA Faith Embracing All Creatures. Cascade Books, 2013.\nA Faith Not Worth Fighting For. Cascade Books, 2012.\nThe Devil Wears Nada. Cascade Books, 2011.\nThird Way Allegiance: Christian Witness in the Shadow of Religious Empire. Cascadia Publishing, 2011.\nThe Gift of Difference: Radical Orthodoxy, Radical Reformation, with Chris K. Huebner, CMU Press, 2010.\nDonkeys and Kings. Resource Publications, 2010.\nLiving on Hope While Living in Babylon: The Christian Anarchists of the 20th Century. Wipf & Stock, 2009.\nAnesthesia: A Brief Reflection on Contemporary Aesthetics. Seaburn Press, 2008.\nThe Purple Crown: The Politics of Martyrdom. Herald Press, 2007.\nCalculated Futures: Theology, Ethics and Economics, with D. Stephen Long and Nancy Ruth Fox. Baylor University Press, 2007.\n\n\n== References ==\n\n\n== External links ==\nAuthor's articles at Christian Ethics Today", "ns": 0, "pageid": 20951019, "title": "Tripp York"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}