{"batchcomplete": "", "query": {"normalized": [{"to": "Tudor Vianu", "from": "Tudor_Vianu"}], "pages": {"938950": {"extract": "Tudor Vianu (Romanian: [ˈtudor viˈanu]; January 8, 1898 – May 21, 1964) was a Romanian literary critic, art critic, poet, philosopher, academic, and translator. Known for his left-wing and anti-fascist convictions, he had a major role on the reception and development of Modernism in Romanian literature and art. He was married to Elena Vianu, herself a literary critic, and was the father of Ion Vianu, a well-known writer.\n\n\n== Biography ==\nBorn in Giurgiu to a Jewish family (whose members had converted to Romanian Orthodoxy), he completed his primary and secondary education in the city, attending the Gheorghe Lazăr High School. Around 1910, he began writing poetry — which he never published.\nIn 1915, Vianu became a student at the Department of Philosophy and Law at the University of Bucharest. During the period, Vianu began attending Alexandru Macedonski's Symbolist literary circle, and, in 1916, he published a study on Macedonski and later his own verses in Flacăra magazine.\nUpon Romania's entry in World War I, he was into the Romanian Army, trained as an artillery cadet in Botoşani, and took part in the Moldavian campaign. In 1918, he returned to Bucharest, where he was editor of Macedonski's Literatorul, and resumed his studies, graduating in 1919. Vianu also worked on the editorial staff for Constantin Rădulescu-Motru's Ideea Europeană and for Luceafărul. In 1921, he began his long collaboration with Viaţa Românească, while he contributed to Eugen Lovinescu's Sburătorul.\nIn 1923, he obtained a doctorate in Philosophy at the Eberhard Karls University of Tübingen, with the thesis Das Wertungsproblem in Schiller Poetik (\"The Judgment of Values in Schiller's Poetics\"), his first major study in aesthetics (delivered in November 1923). The work was praised by Lucian Blaga, who was subsequently Vianu's colleague during their time as staff members for Gândirea; the two shared an appreciation of Expressionism. With Blaga, he stood for Gândirea's early modernist tendencies, and grew opposed to Nichifor Crainic's intense advocacy of traditionalism (at a time when the magazine's editor, Cezar Petrescu, was occupying a middle position).\nWith the publishing of his Dualismul artei in 1925 (followed by a long succession of collections of essays and studies), Vianu secured his place in the cultural landscape of modern Romania, and became the titular professor of aesthetics at the University of Bucharest. At around the same period, he distanced himself from Gândirea (which was becoming the mouthpiece of Crainic's far right traditionalism), and instead advocated democratic government.\nThroughout the interwar period, Vianu was an adversary of the fascist Iron Guard, and polemized with its press (becoming the target of attacks serialized in Cuvântul). His status as a professor was in peril during the (National Legionary State established by the Guard in 1940), and he felt the imminent danger of physical assaults. Anti-Semitic authorities began alluding to his Jewish origins, and several violent remarks were aimed at him. Following the Legionary Rebellion and the Guard's defeat, he sent a congratulatory telegram to Conducător Ion Antonescu. In 1945, after the end of Antonescu's regime and World War II, he was the recipient of a letter from his friend Eugène Ionesco: the document forms a list of intellectuals whom Ionesco harshly criticized for their pro-Iron Guard activism (they include Nae Ionescu, Mircea Eliade, Emil Cioran, Constantin Noica, Dan Botta, Mircea Vulcănescu, Horia Stamatu, Paul Sterian, Mihail Polihroniade, Haig Acterian, Dumitru Cristian Amzăr, Costin Deleanu and Paul Deleanu).\nIn charge of Romania's National Theater in 1945, ambassador to the Socialist Federal Republic of Yugoslavia in 1946, Vianu was an honorary member of the Romanian Academy starting in 1955. He made several concessions to the new Communist authorities, which Ion Vianu has described as \"purely formal\" (an assessment shared by Ion Papuc, who argued that Vianu joined the Romanian Communist Party \"for lack of a way out\"). He gave active support to literary figures who, as former members of the Iron Guard, faced imprisonment — Vianu was a defense witness in the trial of Traian Herseni, and, with Mihai Ralea, the author of an appeal for the release of Petre Ţuţea.\nDuring his late years, he translated several of William Shakespeare's works into Romanian. In the beginning of summer 1964, he completed Arghezi, poet al omului (\"Arghezi, Poet of Mankind\"), carrying the subtitle Cântare Omului (\"A Chant to Mankind\"), a work in the field of comparative literature. It began printing on the very day of its author's death, which was due to a heart attack.\n\n\n== Philosophy ==\nVianu's investigations into cultural history, coupled with his vivid interest in the sociology of culture, allowed him to develop an influential philosophy, which attributed culture a seminal role in shaping human destiny. According to his views, culture, which had liberated humans from natural imperatives, was an asset that intellectuals were required to preserve by intervening in social life.\nIn his analysis of the Age of Enlightenment and 19th-century philosophy, Vianu celebrated Hegel for having unified the competing trends of universalist Rationalism and ethnocentric Historicism. A sizable part of his analysis was focused on the modern crisis of values, which he attributed to the inability of values to impose themselves on all individuals, and which he evidenced in the ideas of philosophers as diverse as Friedrich Nietzsche, Karl Marx, and Søren Kierkegaard.\n\n\n== Selected works ==\nDualismul artei (\"The Dualism of Art\") - 1925;\nFragmente moderne (\"Modernist Pieces\") - 1925;\nPoezia lui Eminescu (\"The Poetry of Eminescu\") - 1930;\nArta și Frumosul (\"Art and Beauty\") -1932;\nIdealul clasic al omului (\"The Classic Idea of Man\") -1934;\nEstetica (\"Aesthetics\"), a work in two volumes - 1934-1936;\nFilosofie și poezie (\"Philosophy and Poetry\") - 1937;\nIstorism și naționalism (\"Historicism and Nationalism\") - 1938;\nIntroducere in teoria valorilor (\"Introduction to the Theory of Values\") - 1942;\nIstoria literaturii române moderne (\"The History of Modern Romanian Literature\"), in collaboration with Şerban Cioculescu and Vladimir Streinu - 1944;\nFilosofia Culturii (Philosophy of Culture) - 1945;\nDicționar de maxime (comentat) (\"Dictionary of Maxims (Annotated)\") - 1962.\n\n\n== Notes ==\n\n\n== References ==\nDan Grigorescu, Istoria unei generații pierdute: expresioniștii, Bucharest, Editura Eminescu, 1980\nPompiliu Marcea, \"Tabel cronologic\" in Tudor Vianu, Scriitori români, Bucharest, Editura Minerva, 1970\nZ. Ornea, Anii treizeci. Extrema dreaptă românească, Bucharest, Editura Fundației Culturale Române, 1995\nIoan Scurtu, \"PNL și PNȚ: Rezerve, nemulțumiri, proteste. Partidele istorice sub guvernarea antonesciano-legionară\", in Dosarele Istoriei, 9/2000\nIrina Livezeanu, \"After the Great Union: Generational Tensions, Intellectuals, Modernism, and Ethnicity in Interwar Romania\", in Nation and National Ideology. Past, Present and Prospects. Proceedings of the International Symposium held at the New Europe College, Bucharest, April 6-7, 2001, Center for the Study of the Imaginary, New Europe College, p.110-127\n(Romanian) Ion Papuc, \"Ceea ce ştiu\", letter to Convorbiri literare, no. 1, January 2006\nMihaela Pop, The Promethean Man Eastward or Westward?, at the Council for Research in Values and Philosophy site\n(Romanian) \"«Am vrut să fiu un martor». Interview with Ion Vianu\" by Ovidiu Şimonca, in Observator cultural, no. 261, March 24, 2005\n\n\n== Further reading ==\nIon Biberi, Tudor Vianu, Bucharest, Editura pentru Literatură, 1966\nTudor Vianu. Biobliografie, Bucharest, Biblioteca Centrală Universitară, 1967\nIon Pascadi, Estetica lui Tudor Vianu, Bucharest, Editura Științifică, 1968\nTraian Podgoreanu, Umanismul lui Tudor Vianu, Bucharest, Editura Cartea Românească, 1973\nEcaterina Țarălungă, Tudor Vianu, Bucharest, Editura Cartea Românească, 1984\nHenri Zalis, Tudor Vianu – apropieri, delimitări, convergențe, Bucharest, Editura Minerva, 1993\nHenri Zalis, Tudor Vianu, Bucharest, Editura Recif, 1997\nHenri Zalis, Viața lui Tudor Vianu. O biografie intelectuală , Bucharest, Editura Atlas, 1997\nVasile Lungu, Viața lui Tudor Vianu, Bucharest, Editura Minerva, 1997\nEmil Moangă, Tudor Vianu în conștiința criticii, Bucharest, Editura Floarea Darurilor, 1997\nGeorge Gană, Tudor Vianu și lumea culturii, Bucharest, Editura Minerva, 1998\nVasile Lungu, Opera lui Tudor Vianu, Bucharest, Editura Eminescu, 1999\nPetru Vaida, Opera filozofică a lui Tudor Vianu, Bucharest, Editura Enciclopedică, 2004", "ns": 0, "pageid": 938950, "title": "Tudor Vianu"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}