{"batchcomplete": "", "query": {"normalized": [{"to": "Vernon Lee", "from": "Vernon_Lee"}], "pages": {"1407553": {"extract": "Vernon Lee was the pseudonym of the British writer Violet Paget (14 October 1856 – 13 February 1935). She is remembered today primarily for her supernatural fiction and her work on aesthetics. An early follower of Walter Pater, she wrote over a dozen volumes of essays on art, music, and travel.\n\n\n== Biography ==\n\nViolet Paget was born in France on 14 October 1856, at Château St Leonard, Boulogne, to British expatriate parents, Henry Ferguson Paget and Matilda Lee-Hamilton (née Abadam). Violet Paget was the half-sister of Eugene Jacob Lee-Hamilton (1845–1907) by her mother's first marriage, and from whose surname she adapted her own pseudonym. Although she primarily wrote for an English readership and made many visits to London, she spent the majority of her life on the continent, particularly in Italy.\nHer longest residence was just outside Florence in the Palmerino villa from 1889 until her death at San Gervasio, with a brief interruption during World War I. Her library was left to the British Institute of Florence and can still be inspected by visitors. In Florence she knit lasting friendships with the painter Telemaco Signorini and the learned Mario Praz, and she encouraged his love of learning and English literature.\nAn engaged feminist, she always dressed à la garçonne. During the First World War,Lee adopted strong pacifist views, and was a member of the anti-militarist organisation, the Union of Democratic Control. She was also a lesbian, and had long-term passionate friendships with three women, Mary Robinson, Kit Anstruther-Thomson, and British author Amy Levy.\nShe played the harpsichord and her appreciation of music animates her first major work, Studies of the Eighteenth Century in Italy (1880). In her preface to the second edition of 1907, she recalled her excitement as a girl when she came across a bundle of 18th-century music. She was so nervous that it wouldn't live up to her expectations that she escaped to the garden and listened rapturously through an open window as her mother worked out the music on the piano. Along with Pater and John Addington Symonds, she was considered an authority on the Italian Renaissance, and wrote two works that dealt with it explicitly, Euphorion (1884) and Renaissance Fancies and Studies (1895).\n\nHer short fiction explored the themes of haunting and possession. The most famous were collected in Hauntings (1890) and her story \"Prince Alberic and the Snake Lady\" (1895) was first printed in the notorious The Yellow Book. She was instrumental in the introduction of the German concept of 'Einfühlung', or 'empathy' into the study of aesthetics in the English-speaking world.\nShe developed her own theory of psychological aesthetics in collaboration with her lover, Kit Anstruther-Thomson, based on previous works by William James, Theodor Lipps, and Karl Groos. She claimed that spectators \"empathise\" with works of art when they call up memories and associations and cause often unconscious bodily changes in posture and breathing.\nShe was known for her numerous essays about travel in Italy, France, Germany, and Switzerland, which attempted to capture the psychological effects of places rather than to convey any particular piece of information. Like her friend Henry James, she wrote critically about the relationship between writers and their audience, pioneering the idea of critical assessment among all the arts as relating to an audience's personal response. She was a proponent of the Aesthetic movement, and after a lengthy written correspondence met the movement's effective leader, Walter Pater, in England in 1881, just after encountering one of Pater's most famous disciples, Oscar Wilde.\n\n\n== Critical reception ==\nThe English writer and translator Montague Summers described Vernon Lee as \"the greatest [...] of modern exponents of the supernatural in fiction.\" E. F. Bleiler has claimed that \"Lee's stories are really in a category by themselves. Intelligent, amusingly ironic, imaginative, original, they deserve more than the passing attention that they have attracted\". Neil Barron described the contents of Lee's collection Hauntings thus \"The stories are powerful and very striking, among the finest of their kind.\"\n\n\n== Works ==\n\nStudies of the Eighteenth Century in Italy (1880)\nOttilie: An Eighteenth Century Idyl (1883)\nThe Prince of the Hundred Soups: A Puppet Show in Narrative (1883)\nBelcaro, Being Essays on Sundry Aesthetical Questions (1883)\nThe Countess of Albany (1884)\nMiss Brown (1884) novel\nEuphorion: Being Studies of the Antique and the Mediaeval in the Renaissance (1884)\nBaldwin: Being Dialogues on Views and Aspirations (1886)\nA Phantom Lover: A Fantastic Story (1886) novella, also Oke of Okehurst, Alice Oke\nJuvenilia, Being a second series of essays on sundry aesthetical questions (1887)\nHauntings. Fantastic Stories (1890)\nVanitas: Polite Stories (1892)\nAlthea: Dialogues on Aspirations & Duties (1894)\nRenaissance Fancies And Studies Being A Sequel To Euphorion (1895)\nArt and Life (1896)\nLimbo and Other Essays (1897)\nGenius Loci (1899) travel\nThe Child In The Vatican (1900)\nIn Umbria: A Study of Artistic Personality (1901)\nChapelmaster Kreisler A Study of Musical Romanticists (1901)\nPenelope Brandling: A Tale of the Welsh Coast in the Eighteenth Century (1903)\nThe Legend of Madame Krasinska (1903)\nAriadne in Mantua: a Romance in Five Acts (1903)\nHortus Vitae: Essays on the Gardening of life (1904)\nPope Jacynth – And Other Fantastic Tales (1904)\nThe Enchanted Woods (1905) essays\nThe Handling of Words and Other Studies in Literary Psychology (1906)\nSister Benvenuta and the Christ Child, an eighteenth-century legend (1906)\nThe Spirit of Rome (1906)\nRavenna and Her Ghosts (1907)\nThe Sentimental Traveller . Notes on Places (1908)\nGospels of Anarchy & Other Contemporary Studies (1908)\nLaurus Nobili: Chapters on Art and Life (1909)\nIn Praise of Old Gardens (1912) with others\nVital Lies: Studies of Some Varieties of Recent Obscurantism ( 1912).\nThe Beautiful. An Introduction to Psychological Aesthetics (1913)\nThe Tower of the Mirrors and Other Essays on the Spirit of Places (1914)\nLouis Norbert. A Twofold Romance (1914) novel\nThe Ballet of the Nations. A Present-Day Morality (1915) illustrations by Maxwell Armfield\nSatan the Waster: A Philosophic War Trilogy (1920)\nProteus or The Future Of Intelligence (1925)\nThe Golden Keys (1925) essays\nThe Poet's Eye (Hogarth Press, 1926)\nFor Maurice. Five Unlikely Stories (1927)\nMusic and its Lovers (1932)\nSnake Lady and Other Stories (1954)\nSupernatural Tales (1955)\nThe Virgin of the Seven Daggers – And Other Chilling Tales of Mystery and Imagination (1962)\n\n\n== Notes and references ==\n\n\n== Further reading ==\nColby, Vineta (2003). Vernon Lee: A Literary Biography. Charlottesville: University of Virginia Press. ISBN 978-0-8139-2158-7. \nGardner, Burdett (1987). The Lesbian Imagination (Victorian style): A psychological and critical study of \"Vernon Lee\". New York: Garland. ISBN 978-0-8240-0059-2. \nGunn, Peter (1964). Vernon Lee: Violet Paget, 1856–1935. London: Oxford University Press. OCLC 249229. \nMacDonald, Erin E. (2005). \"Lee, Vernon\". Who's Who in Gay and Lesbian History. Routledge. pp. 301–302. ISBN 978-1-134-72215-0. \nTearle, Oliver (2014). Bewilderments of Vision. Brighton,UK: Sussex Academic Press. ISBN 978-0-8240-0059-2. A Critical Study of the supernatural fiction of Vernon Lee, Henry James, Robert Louis Stevenson, Arthur Machen and Oliver Onions \n\n\n== External links ==\nWorks by Vernon Lee at Project Gutenberg\nWorks by or about Vernon Lee at Internet Archive\nWorks by or about Violet Paget at Internet Archive\nWorks by Vernon Lee at LibriVox (public domain audiobooks) \nEssays by Vernon Lee at Quotidiana.org\n\"Archival material relating to Vernon Lee\". UK National Archives.", "ns": 0, "pageid": 1407553, "title": "Vernon Lee"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}