{"batchcomplete": "", "query": {"normalized": [{"to": "Virgil Aldrich", "from": "Virgil_Aldrich"}], "pages": {"2139648": {"extract": "Virgil Charles Aldrich (September 13, 1903, Narsinghpur, India – May 28, 1998, Salt Lake City, Utah), was an American philosopher of art, language, and religion.\n\n\n== Early life and education ==\nThe son of Floyd Clement Aldrich and his wife Ann Hanley, Virgil Aldrich earned his Bachelor of Arts degree at Ohio Wesleyan University in 1925. He studied at Oxford University in 1927 and then went on to earn a Diplôme d'Études Supérieures de Philosophie at the Sorbonne in 1928 before completing his Ph.D. at the University of California Berkeley in 1931. He married Louise Hafliger on 3 September 1927 and they had one son, David Virgil Aldrich.\n\n\n== Academic career ==\nAldrich's first academic appointment was his appointment as an instructor in philosophy at Rice University in 1931 and Sterling Fellow at Yale University in 1931-32. Promoted to assistant professor, he remained at Rice until 1942, when he was appointed visiting professor at Columbia University from 1942 to 1946. Appointed professor of philosophy at Kenyon College in 1946, he remained there until 1965, serving as visiting professor at Brown University in 1962-63. In 1965, he became professor of philosophy at the University of North Carolina at Chapel Hill, where he remained until his retirement in 1972. On his retirement, he moved to Salt Lake City, Utah, where he became an adjunct professor at the University of Utah.\nAldrich served as Director of the Kyoto American Studies Institute in Japan and for short periods was visiting professor at Harvard University, the University of Michigan, and the University of Texas. He served as trustee and president of the American Society of Aesthetics and president of American Philosophical Association.\n\n\n== Some Meanings of Vague (1937) ==\nIn his article Some Meanings of Vague, Aldrich puts forth a series of definitions of vague objects and sensum, and then argues that any empiricist must account for vague sensum every bit as much as clear sensum, without skirting the issue. He takes there to be many kinds of vagueness—importantly, there is vagueness of symbols and vagueness of senses. Here symbols are anything which is used to refer, including verbal words, signs, pictures, and more. Vagueness regarding symbols can be the same as the vagueness which regards the senses. There can, additionally, be vagueness of the practices surrounding the use of the symbol to refer. These, he suggests, should be avoided.\n\n\n== Honors ==\nL.H.D., Ohio Wesleyan University, 1963\nL.H.D., Kenyon College, 1972\n\n\n== Writings ==\nBooks:\nLanguage and philosophy ([Kyoto]: Kyoto American Studies Seminar, 1955)\nPhilosophy of Art, (Englewood Cliffs, N.J., Prentice-Hall, 1963)\nThe Body of a Person, (Lanham, MD: University Press of America, 1988)\nMy Century, Nantucket, Massachusetts, EditAndPublishYourBook.com/Lulu, November 20, 2010\nPhilosophical Reflections, Nantucket, Massachusetts, EditAndPublishYourBook.com/Lulu,\nDecember 11, 2010\nContributions:\nReadings in Philosophical Analysis (1951)\nReflections on Art (1958)\nReligious Experience and Truth (1961)\nFaith and the Philosophers (1962)\nWorld Perspectives on Philosophy (1967)\n\"Design, Composition, and Symbol\", The Journal of Aesthetics and Art Criticism (Vol. 27, No. 4, Summer, 1969), pp. 379–388.\nStudies in philosophy: a symposium on Gilbert Ryle, Edited by Konstantin Kolenda. (Houston, Tex. : William Marsh Rice University, 1972)\n\"Pictures and Persons\" in Review of Metaphysics (1975)\n\"Description and expression: Physicalism restricted,\" Inquiry vol. 20 (1977), pp. 149–164.\nFalling in love with wisdom: American philosophers talk about their calling, edited by David D. Karnos, Robert G. Shoemaker. (New York : Oxford University Press, 1993\nFestschrift\nBody, mind, and method: essays in honor of Virgil C. Aldrich edited by Donald F. Gustafson and Bangs L. Tapscott. (Dordrecht and Boston: D. Reidel Pub. Co., 1979)\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== References ==\n\n\n== Sources ==\nUniversity of Utah Library\nWho's Who\n\n\n== External links ==\nKenyon College Obituary\nInventory of the Vigil Aldrich Papers, Marriott Library, University of Utah\nBody, Mind and Method available at Google Books\nEntry for Virgil Aldrich at JSTOR\nReview at the Journal of Symbolic Logic", "ns": 0, "pageid": 2139648, "title": "Virgil Aldrich"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}