{"batchcomplete": "", "query": {"normalized": [{"to": "Vladimir Andreyevich Uspensky", "from": "Vladimir_Andreyevich_Uspensky"}], "pages": {"36509107": {"extract": "Vladimir A. Uspensky (Russian: Влади́мир Андре́евич Успе́нский; born November 27, 1930, Moscow) is a Russian mathematician, linguist, writer, doctor of physics and mathematics (1964). He is the author of numerous papers on mathematical logic and linguistics. In addition, he has also penned a number of memoir essays. Uspensky initiated a reform of linguistic education in Russia.\n\n\n== Biography ==\nUspensky graduated in 1952 from the MSU Faculty of Mechanics and Mathematics (Lomonosov Moscow State University). He was a student of Andrey Kolmogorov. He is the head of the Chair of Mathematical Logic and Theory of Algorithms in the MSU Faculty of Mechanics and Mathematics (1995) and one of the founders of the Structural Linguistics branch (now the Theoretical and Applied Linguistics branch) in the MSU Faculty of Philology, where he also teaches. He is the author of many books and of over 100 research papers. He has prepared 25 candidates and 4 doctors of sciences. His book \"The Apology of Mathematics\" received in 2010 the “Enlightener\" award in the field of natural and exact sciences. He is a distinguished professor at the Moscow State University (1998). His brother Boris Uspensky is a distinguished Russian philologist and mythographer.\n\n\n== References ==\nV.A. Uspensky. Труды по нематематике. М.: ОГИ, 2002, т. I—II. ISBN 5-94282-087-2 (т.1), ISBN 5-94282-088-0 (т.2)\nChapter from the book \"Апология математики\"\nV.A. Uspensky: Seven reflections on the themes of philosophy of mathematics\nV.A. Uspensky: Lecture on mathematics as part of the culture, and the Poincare conjecture\n\n\n== External links ==\nMathematics Genealogy Project entry\nMSU home page\nDynkin Collection entry with video interviews\nRussian listing of publications\nMath-Net.ru list of publications, including video lectures", "ns": 0, "pageid": 36509107, "title": "Vladimir Andreyevich Uspensky"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}