{"batchcomplete": "", "query": {"normalized": [{"to": "Voltairine de Cleyre", "from": "Voltairine_de_Cleyre"}], "pages": {"748619": {"extract": "Voltairine de Cleyre (November 17, 1866 – June 20, 1912) was an American anarchist writer and feminist. She was a prolific writer and speaker, opposing the state, marriage, and the domination of religion over sexuality and women's lives. She began her activist career in the freethought movement. De Cleyre was initially drawn to individualist anarchism but evolved through mutualism to an \"anarchism without adjectives.\" She believed that any system was acceptable as long as it did not involve force. She was a colleague of Emma Goldman, with whom she maintained a relationship of respectful disagreement on many issues. Many of her essays were in the Selected Works of Voltairine de Cleyre, published posthumously by Mother Earth in 1914.\n\n\n== Life ==\nBorn in the small town of Leslie, Michigan, she later moved with her family to St. Johns, Michigan, where she lived with her unhappily married parents in extreme poverty. Her father named her after the famed French Enlightenment author Voltaire. At age 12, she was placed into a Catholic convent in Sarnia, Ontario, by her father, because he thought it would give her a better education. This experience had the effect of moving her towards atheism rather than Christianity. Of her time spent there she said, \"it had been like the Valley of the Shadow of Death, and there are white scars on my soul, where ignorance and superstition burnt me with their hell fire in those stifling days\". She attempted to run away by swimming to Port Huron, Michigan, and hiking 17 miles (27 km); but she met friends of her family who contacted her father and sent her back.\nFamily ties to the abolitionist movement and the Underground Railroad, the harsh and unrelenting poverty that she grew up in, and being named after the philosopher Voltaire all contributed to the radical rhetoric that she developed shortly after adolescence. After schooling in the convent, de Cleyre moved to Grand Rapids, Michigan and began her intellectual involvement in the strongly anti-clerical freethought movement by lecturing and contributing articles to freethought periodicals, eventually becoming the editor of a freethought newspaper titled The Progressive Age.\n\nDuring her time in the freethought movement in the mid and late 1880s, de Cleyre was especially influenced by Thomas Paine, Mary Wollstonecraft and Clarence Darrow. Other influences were Henry David Thoreau, Big Bill Haywood and Eugene Debs. After the hanging of the Haymarket protesters in 1887, however, she became an anarchist. \"Till then I believed in the essential justice of the American law of trial by jury,\" she wrote in an autobiographical essay, \"After that I never could\".\nShe was known as an excellent speaker and writer – in the opinion of biographer Paul Avrich, she was \"a greater literary talent than any other American anarchist\" – and as a tireless advocate for the anarchist cause, whose \"religious zeal,\" according to Goldman, \"stamped everything she did.\"\nShe was close to and inspired by Dyer D. Lum, (\"her teacher, her confidant, her comrade\" in the words of Goldman), although she gave birth to a son, Harry, on June 12, 1890, fathered by freethinker James B. Elliot. Harry lived with Elliot by an agreement between them, and De Cleyre had no further part in his upbringing. Her relationship with Lum ended shortly before he killed himself in 1893.\nDe Cleyre based her operations from 1889 to 1910 in Philadelphia, where she lived among poor Jewish immigrants, and where sympathy for anarchist beliefs was common. There, she taught English and music, and she learned to speak and write in Yiddish.\nThroughout her life she was plagued by illness and depression, attempting suicide on at least two occasions and surviving an assassination attempt on December 19, 1902. Her assailant, Herman Helcher, was a former pupil who had earlier been rendered insane by a fever, and whom she immediately forgave. She wrote, \"It would be an outrage against civilization if he were sent to jail for an act which was the product of a diseased brain\". The attack left her with chronic ear pain and a throat infection that often adversely affected her ability to speak or concentrate.\nDuring the spring of 1911 she was encouraged by the revolution in Mexico, and especially by the activities of anarchist Ricardo Flores Magón. Her last poem was dedicated to the Mexican activists.\nVoltairine de Cleyre died on June 20, 1912, at St. Mary of Nazareth Hospital in Chicago, Illinois, from septic meningitis. She is interred near Emma Goldman, the Haymarket defendants, and other social activists at the Waldheim Cemetery (now Forest Home Cemetery), in Forest Park, a suburb west of Chicago.\n\n\n== Political beliefs ==\nVoltairine de Cleyre's political perspective shifted throughout her life, eventually leading her to become an outspoken proponent of \"anarchism without adjectives,\" a doctrine, according to historian George Richard Esenwein, \"without any qualifying labels such as communist, collectivist, mutualist, or individualist. For others, … [it] was simply understood as an attitude that tolerated the coexistence of different anarchist schools.\"\nFor several years de Cleyre associated primarily with the American individualist anarchist milieu. Her early allegiance to individualism can be seen in the way she differentiated herself from Emma Goldman: \"Miss Goldman is a communist; I am an individualist. She wishes to destroy the right of property, I wish to assert it. I make my war upon privilege and authority, whereby the right of property, the true right in that which is proper to the individual, is annihilated. She believes that co-operation would entirely supplant competition; I hold that competition in one form or another will always exist, and that it is highly desirable it should.\"\nDespite their early dislike for one another, Goldman and de Cleyre came to respect each other intellectually. In her 1894 essay \"In Defense of Emma Goldman and the Right of Expropriation\", de Cleyre wrote in support of the right of expropriation while remaining neutral on its advocacy: \"I do not think one little bit of sensitive human flesh is worth all the property rights in N. Y. city … I say it is your business to decide whether you will starve and freeze in sight of food and clothing, outside of jail, or commit some overt act against the institution of property and take your place beside Timmermann and Goldmann.\"\nEventually, however, de Cleyre was moved to embrace mutualism over individualism. In 1908 she argued \"that the best thing ordinary workingmen or women could do was to organise their industry to get rid of money altogether\" and \"produce together, co-operatively rather than as employer and employed.\" In 1912 she argued that the Paris Commune's failure was due to its having \"respected [private] property.\" In her essay, \"The Commune Is Risen\", she states that \"In short, though there were other reasons why the Commune fell, the chief one was that in the hour of necessity, the Communards were not Communists. They attempted to break political chains without breaking economic ones…\".\n\"Socialism and Communism both demand a degree of joint effort and administration which would beget more regulation than is wholly consistent with ideal Anarchism; Individualism and Mutualism, resting upon property, involve a development of the private policeman not at all compatible with my notion of freedom.\" Instead, she became one of the most prominent advocates of anarchism without adjectives. In The Making of an Anarchist, she wrote, \"I no longer label myself otherwise than as 'Anarchist' simply\".\nSome disagreement exists as to whether or not de Cleyre's rejection of individualism constituted an embrace of pure communism. Rudolf Rocker and Emma Goldman made such an assertion, but others, including biographer Paul Avrich, have taken exception. Cleyre, herself, in response to claims that she had been an anarchist communist, asserted in 1907 that \"I am not now, and have never been at any time, a communist.\" Anarchist author Iain McKay argues that de Cleyre's subsequent 1908 advocacy of a money-less economy was communism.\nIn her 1901 essay titled Anarchism, de Cleyre wrote \"My ideal would be a condition in which all natural resources would be forever free to all, and the worker individually able to produce for himself sufficient for all his vital needs, if he so chose, so that he needs not govern his working or not working by the times and seasons of his fellows. I think that time may come; but it will only be through the development of the modes of production and the taste of the people. Meanwhile we all cry with one voice for the freedom to try\".\n\"Direct Action\", her 1912 essay in defense of direct action, is widely cited today. In this essay, de Cleyre points to examples such as the Boston Tea Party, noting that \"direct action has always been used, and has the historical sanction of the very people now reprobating it.\"\nIn her 1895 lecture entitled Sex Slavery, de Cleyre condemns ideals of beauty that encourage women to distort their bodies and child socialization practices that create unnatural gender roles. The title of the essay refers not to traffic in women for purposes of prostitution, although that is also mentioned, but rather to marriage laws that allow men to rape their wives without consequences. Such laws make \"every married woman what she is, a bonded slave, who takes her master's name, her master's bread, her master's commands, and serves her master's passions.\"\nShe also adamantly opposed the standing army, arguing that its existence made wars more likely. In her 1909 essay, Anarchism and American Traditions, she argued that in order to achieve peace, \"all peaceful persons should withdraw their support from the army, and require that all who wish to make war do so at their own cost and risk; that neither pay nor pensions are to be provided for those who choose to make man-killing a trade.\"\n\n\n== Legacy ==\n\nVoltairine de Cleyre was a prominent American anarchist, and as one of the few women of stature in the anarchist movement she was acclaimed by Emma Goldman as \"the most gifted and brilliant anarchist woman America ever produced\". Today she is not widely known, something biographer Sharon Presley attributes to the shortness of her life. Her life was chronicled in the book An American Anarchist, written by Paul Avrich and published by the Princeton University Press in 1978. A collection of her speeches, The First Mayday: The Haymarket Speeches, 1895–1910, was published by the Libertarian Book Club in 1980 and in 2004, AK Press released The Voltairine de Cleyre Reader. In 2005, two more collections of her speeches and articles were published – Exquisite Rebel: The Essays of Voltairine De Cleyre – Anarchist, Feminist, Genius, edited by Presley and Crispin Sartwell and published by SUNY Press, and the other, Gates of Freedom: Voltairine De Cleyre and the Revolution of the Mind, from University of Michigan Press. Her papers are held at the YIVO Institute for Jewish Research in New York City.\n\n\n== Selected works ==\n(1889) The Drama of the Nineteenth Century\n(1894) In Defense of Emma Goldmann [sic] and the Right of Expropriation\n(1895) The Past and Future of the Ladies' Liberal League\n(1898?) The Gods And The People\n(1900) The Worm Turns\n(1903) Det Anarkistiske Ideal\n(1903) Crime and Punishment\n(1907) McKinley's Assassination from the Anarchist Standpoint\n(1909) Anarchism and American Traditions\n(1910) The Dominant Idea\n(1912) Direct Action\n(1914) Selected Works of Voltairine de Cleyre\n(1916) Selected Stories\n\n\n== See also ==\nEugene Debs\nEmma Goldman\nHaymarket affair\nBill Haywood\nThe writing on the wall – influenced de Cleyre's Written in Red\nDyer D. Lum\nHenry David Thoreau\n\n\n== Citations ==\n\n\n== References ==\n\n\n== External links ==\nVoltairine.org – Web site about Voltairine de Cleyre, including articles and biography\nWorks by Voltairine de Cleyre at Project Gutenberg\nWorks by or about Voltairine de Cleyre at Internet Archive\nWorks by Voltairine de Cleyre at LibriVox (public domain audiobooks) \nVoltairine de Cleyre entry at the Anarchy Archives\nPoems by Voltairine De Cleyre from the Daily Bleed\nIn Defense of Emma Goldman and the Right of Expropriation by Voltairine de Cleyre\nAt the Molinari Institute – (near the bottom of the page)\nRiggenbach, Jeff (June 17, 2010), \"Voltairine de Cleyre: Penitent Priestess of Anarchism\", Mises Daily, Ludwig von Mises Institute \nVoltairine de Cleyre at Find a Grave\nVoltairine de Cleyre, Selected Writings\nVoltairine de Cleyre and Joseph Jacob Cohen Papers held at the YIVO Institute for Jewish Research, New York, NY.", "ns": 0, "pageid": 748619, "title": "Voltairine de Cleyre"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}