{"batchcomplete": "", "query": {"normalized": [{"to": "W. Hugh Woodin", "from": "W._Hugh_Woodin"}], "pages": {"2275071": {"extract": "William Hugh Woodin (born April 23, 1955) is an American mathematician and set theorist at Harvard University. He has made many notable contributions to the theory of inner models and determinacy. A type of large cardinal, the Woodin cardinal, bears his name.\n\n\n== Biography ==\nBorn in Tucson, Arizona, Woodin earned his Ph.D. from the University of California, Berkeley in 1984 under Robert M. Solovay. His dissertation title was Discontinuous Homomorphisms of C(Omega) and Set Theory. He served as chair of the Berkeley mathematics department for the 2002–2003 academic year. Woodin is a managing editor of the Journal of Mathematical Logic. He was elected a Fellow of the American Academy of Arts and Sciences in 2000.\nHe is the great-grandson of William Hartman Woodin, former Secretary of the Treasury.\n\n\n== Work ==\nHe has done work on the theory of generic multiverses and related concept of Ω-logic which suggested an argument that the continuum hypothesis is either undecidable or false in the sense of mathematical platonism. Woodin criticizes this view arguing that it leads to a counterintuitive reduction in which all truths in the set theoretical universe can be decided from a small part of it. He claims that these and related mathematical results lead (intuitively) to the conclusion that Continuum Hypothesis has a truth value and the Platonistic approach is reasonable.\nWoodin now predicts that there should be a way of constructing an inner model for almost all known large cardinals which he calls the Ultimate L and which would have similar properties as Gödel's constructible universe. In particular, the Continuum Hypothesis would be true in this universe.\n\n\n== See also ==\nAD+\n\n\n== References ==\n\n\n== External links ==\nW. Hugh Woodin at the Mathematics Genealogy Project\nWoodin, W. Hugh (2010). The Axiom of Determinacy, Forcing Axioms, and the Nonstationary Ideal. Walter de Gruyter. ISBN 978-3-11-019702-0. OCLC 605013810. \nHome page at University of California, Berkeley\nWoodin's plenary talk at the 2010 International Congress of Mathematicians\nIncompatible Ω-Complete Theories (with Peter Koellner), Journal of Symbolic Logic, Volume 74, Issue 4 (2009), 1155–1170.[1].", "ns": 0, "pageid": 2275071, "title": "W. Hugh Woodin"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}