{"batchcomplete": "", "query": {"normalized": [{"to": "Walter Pitts", "from": "Walter_Pitts"}], "pages": {"302949": {"extract": "Walter Harry Pitts, Jr. (23 April 1923 – 14 May 1969) was a logician who worked in the field of computational neuroscience. He is widely remembered to have spent three days in a library, at the age of 12, reading Principia Mathematica and sent a letter to Bertrand Russell pointing out what he considered serious problems with the first half of the first volume. Russell was appreciative and invited him to study in the United Kingdom.\nHe proposed landmark theoretical formulations of neural activity and generative processes that influenced diverse fields such as cognitive sciences and psychology, philosophy, neurosciences, computer science, artificial neural networks, cybernetics and artificial intelligence, together with what has come to be known as the generative sciences. He is best remembered for having written along with Warren McCulloch, a seminal paper entitled \"A Logical Calculus of Ideas Immanent in Nervous Activity\" (1943). This paper proposed the first mathematical model of a neural network. The unit of this model, a simple formalized neuron, is still the standard of reference in the field of neural networks. It is often called a McCulloch–Pitts neuron.\n\n\n== Early life ==\nWalter Pitts was born in Detroit. Michigan on April 23, 1923, the son of Walter and Marie (née Welsia). He was an autodidact who taught himself logic and mathematics and was able to read several languages including Greek and Latin. Although Bertrand Russell invited him to Cambridge University at the age of only 12, the offer was not taken up although Pitts did decide to become a logician.\n\n\n== Academic career ==\nPitts probably continued to correspond with Bertrand Russell; and at the age of 15 he attended Russell's lectures at the University of Chicago. He stayed there, without registering as a student. While there, in 1938 he met Jerome Lettvin, a pre-medical student, and the two became close friends. Bertrand Russell was a visiting professor at the University of Chicago in the Fall of 1938, and he directed Pitts to go study there with the logician Rudolf Carnap. Pitts met Carnap at Chicago by walking into his office during office hours, and presenting him with an annotated version of Carnap's recent book on logic, The Logical Syntax of Language. Since Pitts did not introduce himself, Carnap spent months searching for him, and, when he found him, he obtained for him a menial job at the university and had Pitts study with him. Pitts at the time was homeless and without income. He mastered Carnap's abstract logic, then met with and was intrigued by the work of the Ukrainian mathematical physicist Nicolas Rashevsky, who was also at Chicago and was the founder of mathematical biophysics, remodeling biology on the structure of the physical sciences and mathematical logic. Pitts also worked closely with the mathematician Alston Householder, who was a member of Rashevsky's group.\nLater Warren McCulloch also arrived at the University of Chicago, and in early 1942 invited Pitts, who was still homeless, together with Lettvin to live with his family. In the evenings McCulloch and Pitts collaborated. Pitts was familiar with the work of Gottfried Leibniz on computing and they considered the question of whether the nervous system could be considered a kind of universal computing device as described by Leibniz. This led to their seminal neural networks paper A Logical Calculus of Ideas Immanent in Nervous Activity. After five years of unofficial studies, the University of Chicago awarded Pitts an Associate of Arts (his only earned degree) for his work on the paper.\nIn 1943 Lettvin introduced Pitts to Norbert Wiener at MIT, who had recently lost his \"right-hand man\". Their first meeting, where they discussed Wiener's proof of the ergodic theorem, went so well that Pitts moved to Boston to work with Wiener. While Pitts was an unofficial student under the aegis of Wiener at MIT until their acrimonious parting in 1952, he formally enrolled as a graduate student in the physics department during the 1943-1944 academic year and in the electrical engineering department from 1956-1958.\nIn 1944 Pitts was hired by Kellex Corporation (later acquired in 1950 by Vitro Corporation) in New York City, part of the Atomic Energy Project.\nFrom 1946, Pitts was a core member and involved with the Macy conferences, whose principal purpose was to set the foundations for a general science of the workings of the human mind.\nIn 1951 Wiener convinced Jerome Wiesner to hire some physiologists of the nervous system. A group was established with Pitts, Lettvin, McCulloch, and Pat Wall. Pitts wrote a large thesis on the properties of neural nets connected in three dimensions. Lettvin described him as \"in no uncertain sense the genius of the group … when you asked him a question, you would get back a whole textbook\". Pitts was also described as an eccentric, refusing to allow his name to be made publicly available. He refused all offers of advanced degrees or positions of authority at MIT (in part as he would have to sign his name), culminating in Pitts burning his unpublished doctoral dissertation and years of unpublished research following the publication of the paradigmatic \"What the Frog’s Eye Tells the Frog’s Brain\" (a collaboration with Lettvin, McCulloch and Humberto Maturana which conclusively demonstrated that \"analog processes in the eye were doing at least part of the interpretive work\" in image processing as opposed to \"the brain computing information digital neuron by digital neuron using the exacting implement of mathematical logic\") in 1959. Nevertheless, he remained employed as a research associate in the Research Laboratory of Electronics at MIT \"as little more than a technicality\" from 1951 to 1969.\n\n\n== Emotional trauma and decline ==\nIn 1952, Wiener suddenly turned against McCulloch—his wife, Margaret Wiener, hated McCulloch—and broke off relations with anyone connected to him, including Pitts. Pitts became increasingly socially isolated for the rest of his life. He burned the manuscript on three-dimensional networks and took little further interest in work, excepting only a collaboration with Robert Gesteland which produced a paper on olfaction. Pitts died in 1969 of bleeding esophageal varices, a condition usually associated with cirrhosis and alcoholism.\n\n\n== Publications ==\nWalter Pitts, \"Some observations on the simple neuron circuit\", Bulletin of Mathematical Biology, Volume 4, Number 3, 121–129, 1942.\nWarren McCulloch and Walter Pitts, \"A Logical Calculus of Ideas Immanent in Nervous Activity\", 1943, Bulletin of Mathematical Biophysics 5:115–133.\nReprinted in Neurocomputing: Foundations of Research. Edited by James A. Anderson and Edward Rosenfeld. MIT Press, 1988. pages 15–27\nWarren McCulloch and Walter Pitts, \"On how we know universals: The perception of auditory and visual forms\", 1947, Bulletin of Mathematical Biophysics 9:127–147.\nR. Howland, Jerome Lettvin, Warren McCulloch, Walter Pitts, and P. D. Wall, \"Reflex inhibition by dorsal root interaction\", 1955, Journal of Neurophysiology 18:1–17.\nP. D. Wall, Warren McCulloch, Jerome Lettvin and Walter Pitts, \"Effects of strychnine with special reference to spinal afferent fibres\", 1955, Epilepsia Series 3, 4:29–40.\nJerome Lettvin, Humberto Maturana, Warren McCulloch, and Walter Pitts, \"What the Frog's Eye Tells the Frog's Brain\", 1959, Proceedings of the Institute of Radio Engineers 47: 1940–1951.\nHumberto Maturana, Jerome Lettvin, Warren McCulloch, and Walter Pitts, \"Anatomy and physiology of vision in the frog\", 1960, Journal of General Physiology, 43:129—175.\nRobert Gesteland, Jerome Lettvin and Walter Pitts, \"Chemical Transmission in the Nose of the Frog\", 1965, J.Physiol. 181, 525–529.\n\n\n== See also ==\nCognitive science\nWarren McCulloch\nJerome Lettvin\n\n\n== References ==\nAizawa, Kenneth, \"Connectionism and artificial intelligence: history and philosophical interpretation\", Journal of Experimental and Theoretical Artificial Intelligence, Volume 4, Issue 4, 1992, pages 295–313\nAizawa, Kenneth; Schlatter, Mark, \"Walter Pitts and 'A Logical Calculus'\", Synthese (2008) 162:235–250.\nAizawa, Kenneth; Schlatter, Mark, \"Another Look at McCulloch and Pitts's 'Logical Calculus'\", Centenary College of Louisiana, Shreveport, Louisiana\nAnderson, James A.; Rosenfeld, Edward (editors), Talking Nets: An Oral History of Neural Networks, 1998. The interview with Jerome Lettvin discusses Walter Pitts.\nConway, Flo; Siegelman, Jim, Dark hero of the information age: in search of Norbert Wiener, the father of Cybernetics, Basic Books, 2005. Cf. p.138 & various.\nEasterling, Keller, \"Walter Pitts\", Cabinet, Issue 5 Winter 2001/02\n\n\n== Further reading ==\nPiccinini, Gualtiero, \"The First Computational Theory of Mind and Brain: A Close Look at McCulloch and Pitts's 'Logical Calculus of Ideas Immanent in Nervous Activity'\", Synthese 141: 175–215, 2004. Kluwer Academic Publishers\n\n\n== External links ==\n\"Walter Pitts\", website of Professor Charles Wallis, Department of Cognitive Science, California State University at Long Beach, accessed 30 Jan. 2009 (archived 2009)\n\"The Man who Tried to Redeem the World with Logic\", Nautilus Magazine issue 21, 5 February 2015", "ns": 0, "pageid": 302949, "title": "Walter Pitts"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}