{"batchcomplete": "", "query": {"normalized": [{"to": "Walter Pater", "from": "Walter_Pater"}], "pages": {"311303": {"extract": "Walter Horatio Pater (4 August 1839 – 30 July 1894) was an English essayist, literary and art critic, and fiction writer, regarded as one of the great stylists. His works on Renaissance subjects were popular but controversial, reflecting his lost belief in Christianity.\n\n\n== Early life ==\nBorn in Stepney in London's East End, Walter Pater was the second son of Richard Glode Pater, a physician who had moved to London in the early 19th century to practice medicine among the poor. Dr Pater died while Walter was an infant and the family moved to Enfield, London. Walter attended Enfield Grammar School and was individually tutored by the headmaster.\nIn 1853, he was sent to The King's School, Canterbury, where the beauty of the cathedral made an impression that would remain with him all his life. He was fourteen when his mother, Maria Pater, died in 1854. As a schoolboy Pater read John Ruskin's Modern Painters, which helped inspire his lifelong attraction to the study of art and gave him a taste for well-crafted prose. He gained a school exhibition, with which he proceeded in 1858 to Queen's College, Oxford.\nAs an undergraduate, Pater was a \"reading man\", with literary and philosophical interests beyond the prescribed texts. Flaubert, Gautier, Baudelaire and Swinburne were among his early favourites. Visiting his aunt and sisters in Germany during the vacations, he learned German and began to read Hegel and the German philosophers. The scholar Benjamin Jowett was struck by his potential and offered to give him private lessons. In Jowett's classes, however, Pater was a disappointment; he took a Second in literae humaniores in 1862. As a boy Pater had cherished the idea of entering the Anglican clergy, but at Oxford his faith in Christianity had been shaken. In spite of his inclination towards the ritual and aesthetic elements of the church, he had little interest in Christian doctrine and did not pursue ordination. After graduating, Pater remained in Oxford and taught Classics and Philosophy to private students. His years of study and reading now paid dividends: he was offered a classical fellowship in 1864 at Brasenose on the strength of his ability to teach modern German philosophy, and he settled down to a university career.\n\n\n== Career and writings ==\n\n\n=== The Renaissance ===\nThe opportunities for wider study and teaching at Oxford, combined with formative visits to the Continent – in 1865 he visited Florence, Pisa and Ravenna – meant that Pater's preoccupations now multiplied. He became acutely interested in art and literature, and started to write articles and criticism. First to be printed was an essay on the metaphysics of Coleridge, 'Coleridge's Writings', contributed anonymously in 1866 to the Westminster Review. A few months later his essay on Winckelmann (1867), an early expression of his intellectual and artistic idealism, appeared in the same review, followed by 'The Poems of William Morris' (1868), expressing his admiration for romanticism. In the following years the Fortnightly Review printed his essays on Leonardo da Vinci (1869), Sandro Botticelli (1870), and Michelangelo (1871). The last three, with other similar pieces, were collected in his Studies in the History of the Renaissance (1873), renamed in the second and later editions The Renaissance: Studies in Art and Poetry. The Leonardo essay contains Pater's celebrated reverie on the Mona Lisa (\"probably still the most famous piece of writing about any picture in the world\"); the Botticelli essay was the first in English on this painter, contributing to the revival of interest in this artist. An essay on 'The School of Giorgione' (Fortnightly Review, 1877), added to the third edition (1888), contains Pater's much-quoted maxim \"All art constantly aspires towards the condition of music\" (i.e. the arts seek to unify subject-matter and form, and music is the only art in which subject and form are seemingly one). The final paragraphs of the 1868 William Morris essay were reworked as the book's 'Conclusion'.\nThis brief 'Conclusion' was to be Pater's most influential – and controversial – publication. It asserts that our physical lives are made up of scientific processes and elemental forces in perpetual motion, \"renewed from moment to moment but parting sooner or later on their ways\". In the mind \"the whirlpool is still more rapid\": a drift of perceptions, feelings, thoughts and memories, reduced to impressions \"unstable, flickering, inconstant\", \"ringed round for each one of us by that thick wall of personality\"; and \"with the passage and dissolution of impressions... [there is a] continual vanishing away, that strange, perpetual weaving and unweaving of ourselves\". Since all is in flux, to get the most from life we must learn to discriminate through \"sharp and eager observation\": for\nThrough such discrimination we may \"get as many pulsations as possible into the given time\": \"To burn always with this hard, gem-like flame, to maintain this ecstasy, is success in life.\" Forming habits means failure on our part, for habit connotes the stereotypical. \"While all melts under our feet,\" Pater wrote, \"we may well catch at any exquisite passion, or any contribution to knowledge that seems by a lifted horizon to set the spirit free for a moment, or any stirring of the senses, or work of the artist's hands. Not to discriminate every moment some passionate attitude in those about us in the brilliancy of their gifts is, on this short day of frost and sun, to sleep before evening.\" The resulting \"quickened, multiplied consciousness\" counters our insecurity in the face of the flux. Moments of vision may come from simple natural effects, as Pater notes elsewhere in the book: \"A sudden light transfigures a trivial thing, a weathervane, a windmill, a winnowing flail, the dust in the barn door; a moment – and the thing has vanished, because it was pure effect; but it leaves a relish behind it, a longing that the accident may happen again.\" Or they may come from \"intellectual excitement\", from philosophy, science and the arts. Here we should \"be for ever testing new opinions, never acquiescing in a facile orthodoxy\"; and of these, a passion for the arts, \"a desire of beauty\", has (in the summary of one of Pater's editors) \"the greatest potential for staving off the sense of transience, because in the arts the perceptions of highly sensitive minds are already ordered; we are confronted with a reality already refined and we are able to reach the personality behind the work\".\nThe Renaissance, which appeared to some to endorse amorality and \"hedonism\", provoked criticism from conservative quarters, including disapproval from Pater's former tutor at Queen's College, from the college chaplain at Brasenose College and from the Bishop of Oxford. Margaret Oliphant, reviewing the book in Blackwood's Magazine, dismissed it as \"rococo Epicureanism\", while George Eliot condemned it as \"quite poisonous in its false principles of criticism and false conceptions of life\". In 1874 Pater was turned down at the last moment by his erstwhile mentor Benjamin Jowett, Master of Balliol, for a previously-promised proctorship. Letters have recently emerged documenting a \"romance\" with a nineteen-year-old Balliol undergraduate, William Money Hardinge, who had attracted unfavorable attention as a result of his outspoken homosexuality and blasphemous verse, and who later became a novelist. Many of Pater's works focus on male beauty, friendship and love, either in a Platonic way or, obliquely, in a more physical way. Another undergraduate, W. H. Mallock, had passed the Pater-Hardinge letters to Jowett, who summoned Pater:\n\"Pater's whole nature changed under the strain\" (wrote A. C. Benson in his diary) \"after the dreadful interview with Jowett. He became old, crushed, despairing – and this dreadful weight lasted for years; it was years before he realised that Jowett would not use them.\"\nIn 1876 Mallock parodied Pater's message in a satirical novel The New Republic, depicting Pater as a typically effete English aesthete. The satire appeared during the competition for the Oxford Professorship of Poetry and played a role in convincing Pater to remove himself from consideration. A few months later Pater published what may have been a subtle riposte: 'A Study of Dionysus' the outsider-god, persecuted for his new religion of ecstasy, who vanquishes the forces of reaction (The Fortnightly Review, Dec. 1876).\n\n\n=== Marius the Epicurean and Imaginary Portraits ===\n\nPater was now at the centre of a small but gifted circle in Oxford – he had tutored Gerard Manley Hopkins in 1866 and the two remained friends till September 1879 when Hopkins left Oxford – and he was gaining respect in the London literary world and beyond, numbering some of the Pre-Raphaelites among his friends. Conscious of his growing influence and aware that the 'Conclusion' to his Renaissance could be misconstrued as amoral, he withdrew the essay from the second edition in 1877 (he was to reinstate it with minor modifications in the third in 1888) and now set about clarifying and exemplifying his ideas through fiction.\nTo this end he published in 1878 in Macmillan's Magazine an evocative semi-autobiographical sketch entitled 'Imaginary Portraits 1. The Child in the House', about some of the formative experiences of his childhood – \"a work\", as Pater's earliest biographer put it, \"which can be recommended to anyone unacquainted with Pater's writings, as exhibiting most fully his characteristic charm.\" This was to be the first of a dozen or so \"Imaginary Portraits\", a genre and term Pater could be said to have invented and in which he came to specialise. These are not so much stories – plotting is limited and dialogue absent – as psychological studies of fictional characters in historical settings, often personifications of new concepts at turning-points in the history of ideas or emotion. Some look forward, dealing with innovation in the visual arts and philosophy; others look back, dramatising neo-pagan themes. Many are veiled self-portraits exploring dark personal preoccupations.\nPlanning a major work, Pater now resigned his teaching duties in 1882, though he retained his Fellowship and the college rooms he had occupied since 1864, and made a research visit to Rome. In his philosophical novel Marius the Epicurean (1885), an extended imaginary portrait set in the Rome of the Antonines, which Pater believed had parallels with his own century, he examines the \"sensations and ideas\" of a young Roman of integrity, who pursues an ideal of the \"aesthetic\" life – a life based on αἴσθησις, sensation – tempered by asceticism. Leaving behind the religion of his childhood, sampling one philosophy after another, becoming secretary to the Stoic emperor Marcus Aurelius, Marius tests his author's theory of the stimulating effect of the pursuit of sensation and insight as an ideal in itself. The novel's opening and closing episodes betray Pater's continuing nostalgia for the atmosphere, ritual and community of the religious faith he had lost. Marius was favourably reviewed and sold well; a second edition came out in the same year. For the third edition (1892) Pater made extensive stylistic revisions.\nIn 1885, on the resignation of John Ruskin, Pater became a candidate for the Slade Professorship of Fine Art at Oxford University, but though in many ways the strongest of the field, he withdrew from the competition, discouraged by continuing hostility in official quarters. In the wake of this disappointment but buoyed by the success of Marius, he moved with his sisters from North Oxford (2 Bradmore Road), their home since 1869, to London (12 Earls Terrace, Kensington), where he was to live (outside term-time) till 1893 and where he was to enjoy his status of minor literary celebrity.\n\nFrom 1885 to 1887, Pater published four new imaginary portraits in Macmillan's Magazine, each set at a turning-point in the history of ideas or art, and each a study of misfits, men born out of their time, who bring disaster upon themselves – 'A Prince of Court Painters' (1885) (on Watteau and Jean-Baptiste Pater), 'Sebastian van Storck' (1886) (17th-century Dutch society and painting, and the philosophy of Spinoza), 'Denys L'Auxerrois' (1886) (Dionysus and the medieval cathedral-builders), and 'Duke Carl of Rosenmold' (1887) (the German Renaissance). These were collected in the volume Imaginary Portraits (1887). Here Pater's examination of the tensions between tradition and innovation, intellect and sensation, asceticism and aestheticism, social mores and amorality, becomes increasingly complex. Implied warnings against the pursuit of extremes in matters intellectual, aesthetic or sensual are unmistakable. The second portrait, 'Sebastian van Storck', a powerful critique of philosophical solipsism, is perhaps Pater's most striking work of fiction.\n\n\n=== Appreciations and Plato and Platonism ===\nIn 1889 Pater published Appreciations, with an Essay on Style, a collection of previously-printed essays on literature. It was well received. 'Style' (reprinted from the Fortnightly Review, 1888) is a statement of his creed and methodology as a prose-writer, ending with the paradox \"If style be the man, it will be in a real sense 'impersonal' \". The volume also includes an appraisal of the poems of Dante Gabriel Rossetti, first printed in 1883, a few months after Rossetti's death; 'Aesthetic Poetry', a revised version of the William Morris essay of 1868 minus its final paragraphs; and an essay on Thomas Browne, whose mystical, Baroque style Pater admired. The essay on Coleridge reprints 'Coleridge's Writings' (1866) but omits its explicitly anti-Christian passages; it adds paragraphs on Coleridge's poetry that Pater had contributed to T. H. Ward's The English Poets (1880). Pater suppressed, however, in the second edition of Appreciations (1890) the essay 'Aesthetic Poetry' – evidence of his growing cautiousness in response to establishment criticism. All subsequent reprints of Appreciations have followed the second edition.\nIn 1893 Pater and his sisters returned to Oxford (64 St Giles). He was now in demand as a lecturer. In this year appeared his book Plato and Platonism. Here and in other essays on ancient Greece Pater relates to Greek culture the romanticism-classicism dialectic which he had first explored in his essay 'Romanticism' (1876), reprinted as the 'Postscript' to Appreciations. \"All through Greek history,\" he writes, \"we may trace, in every sphere of activity of the Greek mind, the action of these two opposing tendencies, the centrifugal and centripetal. The centrifugal – the Ionian, the Asiatic tendency – flying from the centre, throwing itself forth in endless play of imagination, delighting in brightness and colour, in beautiful material, in changeful form everywhere, its restless versatility driving it towards the development of the individual\": and \"the centripetal tendency\", drawing towards the centre, \"maintaining the Dorian influence of a severe simplification everywhere, in society, in culture\". Harold Bloom noted that \"Pater praises Plato for Classic correctness, for a conservative centripetal impulse, against his [Pater's] own Heraclitean Romanticism,\" but \"we do not believe him when he presents himself as a centripetal man\". The volume, which also includes a sympathetic study of ancient Sparta ('Lacedaemon', 1892), was praised by Jowett. \"The change that occurs between Marius and Plato and Platonism,\" writes Anthony Ward, \"is one from a sense of defeat in scepticism to a sense of triumph in it.\"\nOn 30 July 1894, Pater died suddenly in his Oxford home of heart failure brought on by rheumatic fever, at the age of 54. He was buried at Holywell Cemetery, Oxford.\n\n\n=== Greek Studies, Miscellaneous Studies and other posthumous volumes ===\nIn 1895, a friend and former student of Pater's, Charles Lancelot Shadwell, a Fellow and later Provost of Oriel, collected and published as Greek Studies Pater's essays on Greek mythology, religion, art and literature. This volume contains a reverie on the boyhood of Hippolytus, 'Hippolytus Veiled' (first published in Macmillan's Magazine in 1889), which has been called \"the finest prose ever inspired by Euripides\". The sketch (it is in genre another 'imaginary portrait') illustrates a paradox central to Pater's sensibility and writings: a leaning towards ascetic beauty apprehended sensuously. The volume also reprints Pater's 1876 'Study of Dionysus'.\nIn the same year Shadwell assembled other uncollected pieces and published them as Miscellaneous Studies. This volume contains 'The Child in the House' and another two obliquely self-revelatory Imaginary Portraits, 'Emerald Uthwart' (first published in The New Review in 1892) and 'Apollo in Picardy' (from Harper's Magazine, 1893) – the latter, like 'Denys L'Auxerrois', centring on a peculiarly Paterian preoccupation: the survival or reincarnation of pagan deities in the Christian era. Also included were Pater's last (unfinished) essay, on Pascal, and two pieces that point to a revival in Pater's final years of his earlier interest in Gothic cathedrals, sparked by regular visits to northern Europe with his sisters. Charles Shadwell \"in his younger days\" had been \"strikingly handsome, both in figure and feature\", \"with a face like those to be seen on the finer Attic coins\"; he had been the unnamed inspiration of an unpublished early paper of Pater's, 'Diaphaneitè' (1864), a tribute to youthful beauty and intellect, the manuscript of which Pater gave to Shadwell. This piece Shadwell also included in Miscellaneous Studies. Shadwell had accompanied Pater on his 1865 visit to Italy, and Pater was to dedicate The Renaissance to him and to write a preface to Shadwell's edition of The Purgatory of Dante Alighieri (1892).\nIn 1896 Shadwell edited and published seven chapters of Pater's unfinished novel, Gaston de Latour, set in turbulent late 16th-century France, the product of the author's interest in French history, philosophy, literature, and art. Pater had conceived Marius as the first novel of \"a trilogy of works of similar character dealing with the same problems, under altered historical conditions\"; Gaston was to have been the second, while the third was to have been set in England in the late 18th century. In 1995 Gerald Monsman published Gaston de Latour: The Revised Text, re-editing the seven chapters and editing the remaining six which Shadwell had withheld as too unfinished. \"Through the imaginary portrait of Gaston and Gaston's historical contemporaries – Ronsard, Montaigne, Bruno, Queen Marguerite, King Henry III – Pater's fantasia confronts and admonishes the Yellow Nineties, Oscar Wilde not least.\" In an 1891 review of The Picture of Dorian Gray in The Bookman, Pater had disapproved of Wilde's distortion of Epicureanism: \"A true Epicureanism aims at a complete though harmonious development of man's entire organism. To lose the moral sense therefore, for instance the sense of sin and righteousness, as Mr. Wilde's heroes are bent on doing so speedily, as completely as they can, is ... to become less complex, to pass from a higher to a lower degree of development.\"\nEssays from The Guardian (a selection of Pater's book-reviews) and an Uncollected Essays were privately printed in 1896 and 1903 respectively (the latter was republished as Sketches and Reviews in 1919). A Collected Edition of Pater's works, including all but the last volume, was issued in 1901 and was reprinted frequently until the late 1920s.\n\n\n== Influence ==\nToward the end of his life Pater's writings were exercising a considerable influence. The principles of what would be known as the Aesthetic Movement were partly traceable to him, and his effect was particularly felt on one of the movement's leading proponents, Oscar Wilde, who paid tribute to him in The Critic as Artist (1891). Among art critics influenced by Pater were Bernard Berenson, Roger Fry, Kenneth Clark and Richard Wollheim: among early literary Modernists, Marcel Proust, James Joyce, W. B. Yeats, Paul Valéry, Ezra Pound, T. S. Eliot and Wallace Stevens; and Pater's influence can be traced in the subjective, stream-of-consciousness novels of the early 20th century. In literary criticism, Pater's emphasis on subjectivity and on the autonomy of the reader helped prepare the way for the revolutionary approaches to literary studies of the modern era. Among ordinary readers, idealists have found, and always will find inspiration in his desire \"to burn always with this hard, gemlike flame\", in his pursuit of the \"highest quality\" in \"moments as they pass\". The Paterian sensibility is also apparent in the political philosophy of Michael Oakeshott.\n\n\n== Critical method ==\nPater's critical method was outlined in the 'Preface' to The Renaissance (1873) and refined in his later writings. In the 'Preface' he argues initially for a subjective, relativist response to life, ideas, art, as opposed to the drier, more objective, somewhat moralistic criticism practised by Matthew Arnold and others. \"The first step towards seeing one's object as it really is,\" Pater wrote, \"is to know one's own impression, to discriminate it, to realise it distinctly. What is this song or picture, this engaging personality in life or in a book, to me?\" When we have formed our impressions we proceed to find \"the power or forces\" which produced them, the work's \"virtue\". \"Pater moves, in other words, from effects to causes, which are his real interest,\" noted Richard Wollheim. Among these causes are, pre-eminently, original temperaments and types of mind; but Pater \"did not confine himself to pairing off a work of art with a particular temperament. Having a particular temperament under review, he would ask what was the range of forms in which it might find expression. Some of the forms will be metaphysical doctrines, ethical systems, literary theories, religions, myths. Pater's scepticism led him to think that in themselves all such systems lack sense or meaning – until meaning is conferred upon them by their capacity to give expression to a particular temperament.\"\nPater's critical method, then, sometimes seen as a quest for \"impressions\", is really more a quest for the sources of individual expression.\n\n\n== Style ==\nPater was much admired for his prose style, which he strove to make worthy of his aesthetic ideals, taking great pains and fastidiously correcting his work. He kept on his desk little squares of paper, each with its ideas, and shuffled them about attempting to form a sequence and pattern. \"I have known writers of every degree, but never one to whom the act of composition was such a travail and an agony as it was to Pater,\" wrote Edmund Gosse, who also described Pater's method of composition: \"So conscious was he of the modifications and additions which would supervene that he always wrote on ruled paper, leaving each alternate line blank.\" He would then make a fair copy and repeat the process, sometimes paying to have drafts printed, to judge their effect. \"Unlike those who were caught by Flaubert's theory of the unique word and the only epithet,\" wrote Osbert Burdett, \"Pater sought the sentence, and the sentence in relation to the paragraph, and the paragraph as a movement in the chapter. The numerous parentheses deliberately exchanged a quick flow of rhythm for pauses, for charming little eddies by the way.\" At the height of his powers as a writer, Pater discussed his principles of composition in the 1888 essay 'Style'. A. C. Benson called Pater's style \"absolutely distinctive and entirely new\", adding, however, that \"it appeals, perhaps, more to the craftsman than to the ordinary reader.\" To G. K. Chesterton, Pater's prose, serene and contemplative in tone, suggested a \"vast attempt at impartiality.\" Indeed, in its richness, depth, and acuity, in its sensuous rhythms, Pater's style was perfectly attuned to his philosophy of life.\n\n\n== In literature ==\nWilde's Lord Henry Wotton in The Picture of Dorian Gray (1890) incessantly and wilfully misquotes Pater's Renaissance and Marius.\nPater's The Renaissance is praised as a \"wonderful new volume\" in Edith Wharton's 1920 novel The Age of Innocence, set in the 1870s.\nPater is referred to in W. Somerset Maugham's 'Of Human Bondage', at the end of Chapter 41.\nIn Sinclair Lewis's Arrowsmith (chap. 1), Professor Gottlieb tells his medical students (in his accented English), \"Before the next lab hour I shall be glad if you will read Pater's 'Marius the Epicurean,' to derife [sic] from it the calmness which iss [sic] the secret of laboratory skill.\"\nLines from the 'Conclusion' to Pater's Renaissance are quoted among the sixth formers in Julian Mitchell's 1982 play Another Country.\nPater, along with several of his colleagues, appears as a minor character in Tom Stoppard's play The Invention of Love.\nPater is the subject of a poem by Billy Collins named The Great Walter Pater.\nCitations from Pater's The Renaissance are sprinkled throughout Frederic Tuten's novel The Adventures of Mao on the Long March.\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n=== Primary ===\nPater, Walter (1964), Brzenk, Eugene J, ed., Imaginary Portraits: a new collection, NY: Harper . Contains \"An English Poet\", The Fortnightly Review, 1931 .\n——— (1970), Evans, Lawrence, ed., Letters, Oxford: Clarendon, ISBN 0-19-953507-8 .\n——— (1973), Uglow, Jennifer, ed., Essays on Literature and Art, Everyman Library, London: Dent . Includes several essays in their original periodical form.\n——— (1980), Hill, Donald L, ed., The Renaissance – Studies in Art and Poetry; the 1893 text, University of California Press . An annotated edition of Pater's revised text.\n——— (1982) [1974], Bloom, Harold, ed., Selected Writings, NY: Signet .\n——— (1983), Bloom, Harold, ed., Plato and Platonism, NY: Chelsea House .\n——— (1986), Small, Ian, ed., Marius the Epicurean, Oxford: World's Classics (facsimile of the 1934 Everyman's Library edition text, with new introduction and notes) .\n——— (1994) [1985], Levey, Michael, ed., Marius the Epicurean, Middlesex: Penguin .\n——— (1995), Monsman, Gerald, ed., Gaston de Latour: The Revised Text, Greensboro: ELT Press; University of North Carolina .\n——— (2010), Beaumont, Matthew, ed., Studies in the History of the Renaissance, Oxford World's Classics, OUP, ISBN 0-19-953507-8 , ISBN 0-19-953507-8. An annotated edition of the 1873 text.\n\n\n=== Secondary ===\nBenson, A. C. (1906), Walter Pater, London: Macmillan .[1]\nCecil, David (1955), Walter Pater the Scholar Artist, Rede Lecture .\nDonoghue, Denis (1995), Walter Pater: Lover of Strange Souls, New York: Knopf .\nInman, Billie Andrew (1991), \"Estrangement and Connection: Walter Pater, Benjamin Jowett, and William M. Hardinge\", Pater in the 1990s (PDF), retrieved 21 December 2015 \nLevey, Michael (1978), The Case of Walter Pater (biography), London: Thames & Hudson .\nSharp, W. (1912), Papers Critical and Reminiscent .\nShuter, William F (1997), Rereading Walter Pater, Cambridge Studies in Nineteenth-Century Literature and Culture, Cambridge, ISBN 0-521-01981-8 \nThomas, Edward (1913), Walter Pater: A Critical Study, London: Martin Secker \nWard, Anthony (1966), Walter Pater: The Idea in Nature, London .\nWright, S (1975), A Bibliography of the Writings of Walter H. Pater .\nWright, Thomas (1907), The Life of Walter Pater, London .\n\n\n== Further reading ==\nInman, Billie Andrew (1991b), \"Pater's Letters at the Pierpont Morgan Library\", English Literature in Transition, 1880–1920, 34 (4): 406–17, ISSN 0013-8339 . Abstract: discusses six letters of Walter Pater at the Pierpont Morgan Library in New York City, addressed to George Moore, Arthur Symons, John Lane and others.\n\n\n== External links ==\n\"Walter Pater\", Oxford Dictionary of National Biography .\n\"Walter Pater: An Overview\", Authors, Victorian Web .\nWorks by Walter Pater at Project Gutenberg\nWorks by or about Walter Pater at Internet Archive\nWorks by Walter Pater at LibriVox (public domain audiobooks) \nOscar Wilde and Walter Pater (mr-oscar-wilde.de) \nKaylor, Michael Matthew (2006), Secreted Desires: The Major Uranians: Hopkins, Pater and Wilde , a 500 pp scholarly volume situating Pater among the Victorian writers of Uranian poetry and prose (the author has made this volume available in a free, open-access, PDF version).\n\"Pater's Grave at Holywell Cemetery\", Flickr (JPEG), Yahoo .\nBlue plaque to Walter & Clara Pater on their home in Bradmore Road, Oxford, UK: Oxfordshire blue plaques .\n\"Archival material relating to Walter Pater\". UK National Archives. \nPortraits of Walter Horatio Pater at the National Portrait Gallery, London", "ns": 0, "pageid": 311303, "title": "Walter Pater"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}