{"batchcomplete": "", "query": {"normalized": [{"to": "Walter Terence Stace", "from": "Walter_Terence_Stace"}], "pages": {"7916544": {"extract": "Walter Terence Stace (17 November 1886 – 2 August 1967) was a British civil servant, educator, public philosopher and epistemologist, who wrote on Hegel, mysticism, and moral relativism. He worked with the Ceylon Civil Service from 1910-1932, and from 1932-1955 he was employed by Princeton University in the Department of Philosophy. He is most renowned for his work in the philosophy of mysticism, and for books like Mysticism and Philosophy (1960) and Teachings of the Mystics (1960). These works have been influential in the study of mysticism, but they have also been severely criticised for their lack of methodological rigor and their perennialist pre-assumptions.\n\n\n== Early life and education ==\nWalter Terence Stace was born in Hampstead, London into an English military family. He was a son of Major Edward Vincent Stace (September 3, 1841 - May 6, 1903) (of the Royal Artillery) and Amy Mary Watson (1856 - March 29, 1934), who were married on December 21, 1872 in Poona (Pune), India. In addition to attaining high rank in the Royal Artillery, Walter's father Edward had also served as a British Political Agent (February 1889-August 1893) in British Somaliland. Walter's great-grandfather William Stace (1755 - May 31, 1839) was Chief Commissary (Commissary-General) of the Royal Artillery during the Battle of Waterloo (June 18, 1815). Walter's mother Amy was a daughter of Rev. George Augustus Frederick Watson (1821-1897) and Elizabeth Mary Williams, who were married on June 15, 1852 in St. James' Church, Paddington, London. Rev. G. A. F. Watson was vicar (1877-1893) of St. Margaret's Church in Abbotsley, Huntingdonshire/Cambridgeshire.\nInstead of pursuing a military career, Walter decided to follow a religious and philosophical path. He was educated at Bath College (1895-1901), Fettes College (in Edinburgh, Scotland) (1902-1904), and later at Trinity College Dublin (Ireland). His original intention was to become a priest in the Anglican Church, having experienced a religious conversion in his teens. However, while at Trinity College, through the influence of Hegel scholar Henry Stewart Macran (1867-1937) (professor of moral philosophy in Trinity College) he developed a deep interest in the systematic philosophy of G. W. F. Hegel (1770-1831), and graduated in philosophy in 1908.\n\n\n== Career ==\nUnder family pressure Stace joined the British Civil Service, and between 1910-1932 he served in the Ceylon Civil Service (now Sri Lanka) which was then a part of the British Empire. He held several positions in the Ceylonese government, including District Judge (1919-1920) and Mayor of Colombo (1931-1932), the capitol city of Ceylon. In Colombo a street named after him (Stace Road) still exists.\n\nIt was during his period in Ceylon that he developed an interest in Hinduism and Buddhism, religions which were to influence his subsequent studies of mysticism. While employed by the Ceylon Civil Service, during the period 1920-1932 Stace published 4 philosophical works (see below).\nAnticipating a change in the Ceylonese government and a possible termination of his employment, in 1929 Stace persuaded Trinity College to grant him an honorary LittD degree after he presented the College with the equivalent of a doctoral thesis he had written titled The Theory of Knowledge and Existence. In 1932 this thesis was published as a book by Oxford University Press. The LittD degree, and the 4 books he had published while an employee of the Ceylon Civil Service, proved to be the keys to his entry into a new career.\nAfter being employed for 22 years (1910-1932) in the Ceylon Civil Service, in 1932 Stace was offered the option of retirement, which he took. He then moved to Princeton University (in Princeton, New Jersey, USA) where he was employed by the Department of Philosophy, first as Lecturer in Philosophy (1932-1935) and then as Stuart Professor of Philosophy (1935-1955). In 1949-1950 he was president of the American Philosophical Association (Eastern Division). Stace retired from Princeton University in 1955. From 1955-1967 he held the title/status of Professor Emeritus.\nStace was married twice. His first wife, Adelaide McKechnie (born 1868 in Carlow, Ireland), was 18 years older than him. He married Adelaide in 1910 and divorced her in 1924. His second wife was Blanche Bianca Beven (August 4, 1897 - July 17, 1986), whom he married in 1926. Blanche was born in Colombo, Ceylon and died in Los Angeles County, California.\nWalter Terence Stace died on 2 August 1967, of a heart attack at his home in Laguna Beach, California.\n\n\n== Philosophy ==\nStace's first 4 books - A Critical History of Greek Philosophy (1920), The Philosophy of Hegel: A Systematic Exposition (1924), The Meaning of Beauty (1929), and The Theory of Knowledge and Existence (1932) - were all published while he was employed by the Ceylon Civil Service. After these early works, his philosophy followed the British empiricist tradition of David Hume, G.E. Moore, Bertrand Russell and H.H. Price. However, for Stace, empiricism did not need to be confined to propositions which it is possible to demonstrate. Instead, our common sense beliefs find support in two empirical facts: (1) men’s minds are similar (2) men co-operate with each other, with the aim of solving their common problems.\nStace is regarded as a pioneer in the philosophical study of mysticism. Many scholars regard Mysticism and Philosophy (1960) as his major work. Stace was the dissertation advisor of John Rawls when Rawls was a graduate student at Princeton, though it is not clear that he had a strong influence on Rawls. Richard Marius attributed his loss of faith partly to his intellectual engagement with Stace's essay Man Against Darkness.\n\n\n=== Phenomenalist philosophy ===\nHis work in the 1930s and 40s bears a strong influence of phenomenalism, a form of radical empiricism (not to be confused with phenomenology, which examines the structure and content of consciousness). In his first book published while at Princeton, The Theory of Knowledge and Existence (1932), Stace proposes an empirical epistemology. He attempts to \"trace out the logical steps by which the mind, starting with what is given, arrives at and justifies its belief in an external world\". The book can be seen as a criticism of pragmatism. His paper Refutation of Realism (1934) acted as a response to G.E. Moore's famous refutation of idealism. Stace did not argue that realism is false, but that \"there is absolutely no reason for asserting\" it is true, so it \"ought not be believed\". Turning from epistemology to ethics, in 1937 he considered whether morals were relative or subject to a general law in The Concept of Morals.\n\n\n=== The public philosopher ===\nIn 1948, Stace wrote an influential essay, Man Against Darkness, for The Atlantic Review in which he examined religion. He concluded that the spirit of scientific enquiry (rather than scientific discoveries themselves) has furthered religious scepticism by undermining the teleological presumption of an ultimate 'final cause'. Concern with divine purpose of events had been replaced by investigation into what had caused them; the new imaginative picture of the world was dominated by the idea that life is purposeless and meaningless. The effects of this change included moral relativity, the individualisation of morality, and the loss of belief in free will. Stace wrote:\n\nSkepticism did not have to wait for the discoveries of Darwin and the geologists in the nineteenth century. It flooded the world immediately after the age of the rise of science. Neither the Copernican hypothesis nor any of Newton's or Galileo's particular discoveries were the real causes. Religious faith might well have accommodated itself to the new astronomy. The real turning point between the medieval age of faith and the modern age of unfaith came when the scientists of the seventeenth century turned their backs upon what used to be called \"final causes.\" ... If the scheme of things is purposeless and meaningless, then the life of man is purposeless and meaningless too. Everything is futile, all effort is in the end worthless. A man may, of course, still pursue disconnected ends, money, fame, art, science, and may gain pleasure from them. But his life is hollow at the center. Hence the dissatisfied, disillusioned, restless, spirit of modern man.\n\nIn the spring of 1949, the Massachusetts Institute of Technology hosted a forum called \"The Social Implications of Scientific Progress—an Appraisal at Mid-Century.\" Winston Churchill, Harry S. Truman, Vannevar Bush, Nelson Rockefeller were amongst those in attendance. Stace took part in a discussion called 'Science, Materialism and the Human Spirit' alongside J. Seelye Bixler (1894-1985), Percy W. Bridgman and Jacques Maritain. He contributed an essay, The Need for a Secular Ethic, in which he concluded that although supernatural or metaphysical justifications for morality are in decline, this should not lead to a crisis of the moral faith if it is remembered that 'morals have a perfectly firm and objective foundation in the human personality'. In 1954, he gave the annual Howison Lecture in Philosophy at University of California, Berkeley, where he spoke on \"Mysticism and Human Reason\".\nIn the fall of 1957, two years after retiring from his post at Princeton, Stace was involved in a controversy surrounding Dr. Joseph Hugh Halton (1913-1979), a member of the Roman Catholic Dominican Order (Order of Preachers) who was the Roman Catholic chaplain at Princeton University and the Director of the Aquinas Institute (located near the Princeton University campus). Halton criticised the university's 'abusive liberalism', and Stace was the first of those singled out for censure. Halton stated that 'Stace is enthroning the devil' and that he was 'professionally incompetent', while his philosophy was described as a 'metaphysical mambo'. The Princeton president Dr. Robert F. Goheen stripped Dr. Halton of his title, an action which was supported by Jacques Maritain, the noted Roman Catholic philosopher and theologian and former Princeton professor.\nStace continued to engage with the public until the end of his career. Two of his final books, Religion and the Modern Mind (1952) and The Teachings of the Mystics (1960) were written for the general reader. He gave lectures at various university campuses around the United States, many of which were included in Man Against Darkness and other essays (1967).\n\n\n== Philosophy of religion and mysticism ==\nIt is in the philosophy of mysticism that Stace is both important and influential, and his thought is at its most original. He has been described as \"one of the pioneers in the philosophical study of mysticism\", as someone who laid out and offered solutions to the major issues in the study of the subject, and created an important phenomenological classification of mystical experience. Stace is seen as an important representative of the perennial philosophy (also known as the perennialism) that sees a universal core to religious feelings. However, although he is seen by many scholars as an important thinker to acknowledge, he is also one to dispute.\nStace’s philosophy of mysticism grew out of his earlier empiricist epistemology, although this is something many critics of his position fail to appreciate. The concept of the ‘given’, commonly used in phenomenalism to understand the nature of experience, is crucial to both his earlier epistemology and his later analysis. For Stace it lies at the basis of our knowledge of the external world and of ourselves. The given has an important epistemological function because it possesses the properties of certainty (infallibility, incorrigibility, indubitability), and it provides the ultimate justification for all forms of human knowledge. Stace’s Theory of Knowledge and Existence (1932) explains that knowledge arises from the process of interpretation of the given, although he writes that it is not easy to distinguish between the given and interpretation of it. For Overall, the ‘pure experience’ or ‘sensation’ he refers to in Mysticism and Philosophy (1960) is the same as the given that he had been writing about earlier.\n\n\n=== The 1952 books ===\nIn 1952 Stace published three books about religion. Each examined the struggle between the religious worldview and those of science and of naturalism, which he had begun to explore in his essays Man Against Darkness and The Need for a Secular Ethic in the 1940s. Religion and the Modern Mind is divided into three sections, the first of these looks at the medieval \"world-picture\" which Stace characterises as marked by a religious, moral and purposeful view of existence. The second section looks at the modern world, which is characterised by the rise of science and naturalism (although Stace denies that the latter logically follows from the former), and the Romantic reaction to this. The final section looks specifically at religion and morality in the modern world. Stace examines religious truth and its expression, and concludes that the latter necessarily takes symbolic form in much the same way as he does in Time and Eternity. He also roots morality in both utilitarian considerations and in mysticism, which together fuse into \"a single homogeneous set of ideal ends\".\nThe Gate of Silence is a 50-page poetic meditation on the religion and naturalism in which Stace expounds \"the doctrine of the flatness of the world\", which is a world that is void of meaning, purpose and value, in which \"the hogwash of spirituality\" will provide no solace. In his prefatory note Stace explains that he wrote the book four years previously and that it \"records the phase of intellectual and emotional experience through which the writer was passing at the time.\"\nStace called Time and Eternity a \"defence of religion\" that also seeks to investigate how God can be both being and non-being. He roots the book in the ancient religious insight that \"all religious thought and speech are through and through symbolic\". Addressing the apparent inconsistency between the book and the naturalism of Man Against Darkness, he maintains that he does not withdraw his naturalism by \"a jot or a tittle\", but rather seeks \"to add to it that other half of the truth which I now think naturalism misses.\" In addition to the symbolic nature of all religious expression, the book proposes the existence of two realms of being, time and eternity, which intersect but do not contradict each other. According to the Encyclopedia of Philosophy, many consider this to be his most profound work.\n\n\n=== The 1960 books ===\nStace published his two final books on religion in 1960. The Teachings of the Mystics(1960) was written for the general rather than academic reader. The book sets out a simplified version of his philosophy of religion found in Mysticism and Philosophy, and gives examples from writings of mystics (and occasionally from the scriptures of the world’s principal religions) that illustrate his idea that mysticism is everywhere \"the apprehension of an ultimate nonsensuous unity in all things\".\nMysticism and Philosophy (1960) is generally regarded both as Stace’s key work and one that is the \"standard point of departure\" in the critical study of mysticism. In it Stace explains that he writes as a philosopher, empiricist and analyst rather than mystic, and that mystical experience can and should be distinguished from its interpretation. He makes a distinctinction between extrovertive and introvertive mystical experience. In the former, the mystic perceives the unity in \"the multiplicity of external material objects\", while in the latter the mystic perceives the One within the depths of her consciousness \"as the wholly naked One devoid of any plurality whatever\". Stace also looks at whether mystical experience can be considered objective or subjective, and considers whether the relationship between God and the world should properly be considered pantheism, dualism or something else. He examines mysticism, logic and language, and concludes that the laws of logic do not apply to mysticism and that mystical experience is paradoxical but not ineffable (a development in his thought from Time and Eternity). Finally, Stace says he does not wish to be drawn into a battle of prejudices as to whether or not mysticism contributes to the moral good.\nStace summarised his thought on mysticism in two lectures given at Mount Holyoke College in 1961, entitled The Psychology of Mysticism and The Philosophy of Mysticism respectively. In the former he states that the psychology of mysticism must rely on introspection, because it is the only method that is available to investigate the phenomenon, despite it being difficult to verify (unlike the inspection of physical events). Like William James, he distinguishes between ordinary and mystical consciousness; the former he describes as sensory-intellectual, while the latter contains neither sensory nor intellectual content. He then proceeds to layout the psychological qualities of mystical experience, which he roots in a passage from the Mandukya Upanishad:\nUndifferentiated unity\nDissolution of the self\nFeeling of revelation or veracity of the event\nFeeling of blessedness and peace\nFeeling of serenity\nThe transformation of the subject's moral character from evil towards good and nobility.\nStace characterised his philosophy of mysticism as the examination of whether mystical experience is subjective or objective, that is whether it is imagined or real. Again he turns to the Mandukya Upanishad for his definition of mysticism, and identifies the realisation the personal self is identical with the infinite Self at the core of the experience. Although there are three causes for this (loss of individuality; transcending space and time; feeling of peace and bliss) these are not logical reasons. Further he holds that the unanimity of mystical experience across cultures is not an argument for its objectivity, as illusions can be found in all peoples and cultures. That mystical experience is found in all cultures indicates that it is a part of human nature. Next Stace asks how we can say if something is objective. He defines the most important criteria for determining objectivity as ‘orderliness’ - or keeping in order with the laws of nature - rather than verifiability. Mystical experience is neither orderly nor disorderly, so cannot be classed as either subjective or objective. Stace terms this \"transsubjective\" (because the notions of subjective and objective do not apply to the infinite).\n\n\n== Influence ==\nStace's schema of mystical experience formed the basis for the most commonly cited scale to measure reports of mystical experience, Ralph W. Hood's Mysticism-scale.\n\n\n== Criticism ==\nAlthough Stace's work on mysticism received a positive response, it has also been criticised in the 1970s and 1980s, for its lack of methodological rigour and its perennialist pre-assumptions. Major criticism came from Steven T. Katz in his influential series of publications on mysticism and philosophy, and from Wayne Proudfoot in his Religious experience (1985).\nAs early as 1961 the Times Literary Supplement was critical of Stace's scholarship:\n\nProfessor Stace seems to have no knowledge of any Indian language and his examples are drawn from what is most monistic in the Upanishads and other sacred writings, usually in a very free translation not notable for its accuracy or for its lack of bias.\n\nMoore (1973) gives an overview of criticisms of Stace. He notes that the positing of a \"phenomenological identity in mystical experiences\" is problematic, which leads to either non-descriptive statements, or to value-laden statements on mystical experiences. Moore doubts whether Stace phenomenology of mystical experience is sufficient. Moore notes that Stace's quotations from mystical writings are brief, \"often second-hand,\" and omitting the contexts of these quotations. Stace's list of characteristics hardly represents the broad variety of mystical experiences described by mystics. His \"unitary consciousness\" is only one characteristic, and not necessarily connected to illuminating insight. According to Moore, Stace also thinks too lightly about the relation between experience and language, supposing that descriptions are phenomenologically straightforward and reliable. Stace is also normative in his preference for monistic mysticism and his rejection of theistic mysticism. Moore concludes by noting that Stace fails to understand the difference between phenomenology and metaphysics, and that his writings don't provide solutions to the philosophical problems which mystical claims raise.\nMasson & Masson (1976) note that Stace starts with a \"buried premise,\" namely that mysticism can provide truths about the world which cannot be obtained with science or logical thinking. According to Masson & Masson, this premise makes Stace naive in his approach, and which is not accord with his self-presentation as an objective and empirical philosopher. According to Masson & Masson, Stace fails in presenting mystical experiences as an objective source of information. They question Stace's exclusion of trances and other phenomena from his investigations, noting that such phenomena are an essential part of many descriptions of mystical experiences. They give the example of Ramakrishna, a 19th-century Indian mystic, who is presented without a critical consideration of the sources. They further note that Ramakrishna had delusions, a fact which they deem problematic for the use of Ramakrishna as a prime example of mystical consciousness. They further note that Stace seems to be unaware of the major relevant scholarly studies on mysticism at the time of his writings. According to Masson & Masson, Stace's criteria for inclusion and exclusion of cases are based on personal preferences, and \"his work reads more like a theological text than a philosophical one.\"\nAccording to Katz (1978), Stace's typology is \"too reductive and inflexible,\" reducing the complexities and varieties of mystical experience into \"improper categories.\" According to Katz, Stace does not notice the difference between experience and interpretation of experience, and Stace fails to notice the epistemological issues involved in \"mystical\" experiences, especially the fundamental epistemological issue of which conceptual framework precedes and shapes these experiences. Katz further notes that Stace supposes that similarities in descriptive language also implies a similarity in experience, an assumption which Katz rejects. According to Katz, close examination of the descriptions and their contexts reveals that those experiences are not identical. Katz further notes that Stace held one specific mystical tradition to be superior and normative, whereas Katz rejects reductionist notions and leaves God as God, and Nirvana as Nirvana.\nIn defense of Stace, Hood (2001) cites Forman, who argues that introverted mysticism is correctly conceptualized as a common core, since it lacks all content, and is the correct basis for a perennial philosophy. Hood notes that Stace's work is a conceptual approach, based on textual studies. He posits his own work as a parallel approach, based on an empirical approach, thereby placing the conceptual claims in an empirical framework, assuming that Stace is correct in his approach. Jacob van Belzen (2010) criticized Hood, noting that Hood validated the existence of a common core in mystical experiences, but based on a conceptual framework which presupposes the existence of such a common core:\n\n[T]he instrument used to verify Stace's conceptualization of Stace is not independent of Stace, but based on him.\"\n\nBelzen also notes that religion does not stand on its own, but is embedded in a cultural context, and this should be taken into account. To this criticism Hood et al. answer that universalistic tendencies in religious research \"are rooted first in inductive generalizations from cross-cultural consideration of either faith or mysticism,\" stating that Stace sought out texts which he recognized as an expression of mystical expression, from which he created his universal core. Hood therefor concludes that Belzen \"is incorrect when he claims that items were presupposed.\"\nShear (2011) notes that Stace regarded extroverted mysticism to be a less complete form of mysticism, but was puzzled by the fact that there are far more descriptions of introverted mysticism than of extroverted mysticism. Shear proposes a developmental sequence of three higher states of consciousness:\nthe recognition of pure consciousness/emptiness\nthe stable presence of this pure consciousness/emptiness throughout all activity\nthe recognition of this pure consciousness/emptiness as the ground of all being\nAccording to Shear, HS1 corresponds to Stace's introverted mysticism, whereas HS3 corresponds to Stace's extroverted mysticism, and is actually the more developed form of mysticism, in contrast to what Stace supposed.\n\n\n== Works ==\nA Critical History of Greek Philosophy (1920) Online text\nThe Philosophy of Hegel: A systematic exposition (1924) Online text\nThe Meaning of Beauty (1929)\nThe Theory of Knowledge and Existence (1932)\nThe Concept of Morals (1937)\nThe Nature of the World. An Essay in Phenomenalist Metaphysics (1940)\nThe Destiny of Western Man (1942)\nReligion and the modern mind (1952)\nTime and Eternity (1952)\nMysticism and Philosophy (1960) Full text online\nTeachings of the Mystics (1960)\nMan against darkness, and other essays (1967)\n\n\n== See also ==\nWilliam James and The Varieties of Religious Experience\nRichard Maurice Bucke and Cosmic Consciousness\nAldous Huxley and The Perennial Philosophy\nNondualism\n\n\n== Explanatory notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n=== Printed sources ===\n\n\n=== Web-sources ===\n\n\n== Further reading ==\nMohammad Fanaei Nematsara, Walter Stace's philosophy of mysticism: a critical analysis\n\n\n== External links ==\nShort biography at Princeton University\nSlide show on some of Stace's ideas\nIntroductory chapter, The Teachings of the Mystics\nPhotograph of Walter Stace at LIFE, 12 August 1955\nWorks by Walter Terence Stace at Project Gutenberg\nWorks by or about Walter Terence Stace at Internet Archive", "ns": 0, "pageid": 7916544, "title": "Walter Terence Stace"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}