{"batchcomplete": "", "query": {"normalized": [{"to": "Wesley J. Smith", "from": "Wesley_J._Smith"}], "pages": {"7707870": {"extract": "Wesley J. Smith (born 1949) is an American lawyer and author, a Senior Fellow at the Discovery Institute's Center on Human Exceptionalism. He is also a consultant for the Patients Rights Council. In 2004 he was named by the National Journal as one of the nation’s top expert thinkers in bioengineering for his work in bioethics. He is among the world's foremost critics of assisted suicide and utilitarian bioethics.\nSmith has authored or co-authored fourteen books. He formerly collaborated with consumer advocate Ralph Nader, and has been published in regional and national outlets such as The New York Times, Newsweek, The Wall Street Journal, USA Today, the San Francisco Chronicle, The Seattle Times, the New York Post, and others. He is also well known for his blog, \"Human Exceptionalism\", hosted by National Review, which advances his theory of \"human exceptionalism\" and defends intrinsic human dignity. He is a critic of those he labels \"mainstream\" bioethicists such as Peter Singer, Julian Savulescu, Jacob M. Appel, and R. Alta Charo. He has also been highly critical of science writer Matt Ridley.\n\n\n== Biography ==\nSmith practiced law in the San Fernando Valley from 1976–1985, at which time he left law practice to pursue other interests, particularly as a public policy advocate. His first book in 1987 was The Lawyer Book: A Nuts and Bolts Guide to Client Survival, introduced by consumer advocate Ralph Nader beginning a collaboration between the two men. Smith is a prolific author and a frequent contributor to National Review and The Weekly Standard. He closely followed the Terri Schiavo case in 2005, and wrote frequently on the topic.\nHe opposes policies allowing for assisted suicide, euthanasia, human cloning, and granting human style \"rights\" to animals,\" making a clear distinction between animal rights and animal welfare. He is also a noted critic of mainstream views in bioethics, human cloning research, radical environmentalism and of what he calls the radical animal liberation movement, which he worries exhibits \"anti-humanism\". His book Culture of Death: The Assault on Medical Ethics in America was named Best Health Book of the Year at the 2001 Independent Publishers Book Awards.\nSmith is one of the world's foremost apologists of \"human exceptionalism,\" which he defends from a secular perspective.\nSmith is a frequent guest on radio and television talk shows, having appeared on national programs such as Good Morning America and Nightline, as well as internationally on BBC Radio 4. He has testified as an expert witness in front of federal and state legislative committees, and is an international public speaker, appearing throughout the United States, Canada, Australia, South Africa, and many countries in Europe.\nSmith is married to the syndicated San Francisco Chronicle columnist Debra J. Saunders.\n\n\n== Criticism ==\nIn a 2001 essay, physician Matthew K. Wynia and attorney Arthur Derse accused Smith of selectively using evidence to create a false impression that bioethics is a monolithic field. They argued that Smith was \"prepared to bend the truth to make a point, turn a stomach, and potentially radicalize a reader.\" Smith rebutted these criticisms, stating in part, \"Wynia and Derse assert that I claim bioethics is a monolith. That is not what I write. What I do believe is that bioethics has, generally, crystallized into an orthodoxy, perhaps even an ideology. I acknowledge that disagreements certainly exist within the field. But I view them, with some exceptions, as the arguing of people who agree on fundamentals but disagree on details -- sort of like Catholics bickering with Baptists.\"\n\n\n== Bibliography ==\nThe Lawyer Book: A Nuts and Bolts Guide to Client SurvivalPrice Stern Sloan Publishers, 1987, ISBN 0-8431-1569-6\nThe Doctor Book: A Nuts and Bolts Guide to Patient Power Price Stern Sloan Publishers, 1988, ISBN 0-89586-747-8\nThe Senior Citizen's Handbook: A Nuts and Bolts Guide to More Comfortable Living Price Stern Sloan Publishers, 1989, ISBN 0-89586-795-8\nWinning the Insurance Game (1990) Ralph Nader and Wesley J. Smith, ISBN 1-877961-17-5\nThe Frugal Shopper (1991) Ralph Nader and Wesley J. Smith, ISBN 0-936758-30-9\nCollision Course: The Truth About Airline Safety (1993) Ralph Nader and Wesley J. Smith, ISBN 0-8306-4271-4\nNo Contest: Corporate Lawyers and the Perversion of Justice in America (1996) Random House, Ralph Nader and Wesley J. Smith, ISBN 0-679-42972-7\nForced Exit: The Slippery Slope from Assisted Suicide to Legalized Murder (1997), ISBN 0-8129-2790-7\nForced Exit: Euthanasia, Assisted Suicide, and the New Duty to Die (2006) Encounter Books, ISBN 1-59403-119-3\nCulture of Death: The Assault on Medical Ethics in America (2001), Encounter Books, ISBN 1-893554-06-6\nPower Over Pain, Eric M. Chevlen, MD and Wesley J. Smith, 2002, ISBN 0-9710946-0-8\nConsumer’s Guide to a Brave New World (2005), Encounter Books, ISBN 1-893554-99-6\nA Rat is a Pig is a Dog is a Boy: The Human Cost of the Animal Rights Movement (2010) Encounter Books, ISBN 978-1-59403-346-9\nThe War on Humans (2014)\nCulture of Death: The Age of \"Do Harm\" Medicine (2016) ISBN 978-1594038556\n\n\n== See also ==\nBioethics\nThe President's Council on Bioethics\nStem Cell Research\nEuthanasia\nAssisted Suicide\nAnimal liberation movement\nHuman exceptionalism\nBaxter v. Montana\n\n\n== References ==\n\n\n== External links ==\nHuman Exceptionalism Blog\nDiscovery Institute's Bioethics Program\nLecture on Euthanasia at Princeton\nLecture: \"Why Being Human Matters,\" presented August 16, 2007 at the Discovery Institute\nAudio interview with Smith at National Review Online", "ns": 0, "pageid": 7707870, "title": "Wesley J. Smith"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}