{"batchcomplete": "", "query": {"normalized": [{"to": "Wilhelm Ackermann", "from": "Wilhelm_Ackermann"}], "pages": {"62727": {"extract": "Wilhelm Friedrich Ackermann (29 March 1896 – 24 December 1962) was a German mathematician best known for the Ackermann function, an important example in the theory of computation.\nAckermann was born in Herscheid municipality, Germany, and was awarded a Ph.D. by the University of Göttingen in 1925 for his thesis Begründung des \"tertium non datur\" mittels der Hilbertschen Theorie der Widerspruchsfreiheit, which was a consistency proof of arithmetic apparently without full Peano induction (although it did use e.g. induction over the length of proofs). From 1929 until 1948, he taught at the Arnoldinum Gymnasium in Burgsteinfurt, and then at Lüdenscheid until 1961. He was also a corresponding member of the Akademie der Wissenschaften (Academy of Sciences) in Göttingen, and was an honorary professor at the University of Münster.\nIn 1928, Ackermann helped David Hilbert turn his 1917 – 22 lectures on introductory mathematical logic into a text, Principles of Mathematical Logic. This text contained the first exposition ever of first-order logic, and posed the problem of its completeness and decidability (Entscheidungsproblem). Ackermann went on to construct consistency proofs for set theory (1937), full arithmetic (1940), type-free logic (1952), and a new axiomatization of set theory (1956).\nAlthough Ackermann did not choose a university career and rather continued as a high school teacher, he was continually engaged in research and published many contributions to the foundations of mathematics until the end of his life. He died in Lüdenscheid, Germany.\n\n\n== See also ==\nAckermann coding\nAckermann ordinal\nAckermann set theory\nAckermann function\nInverse Ackermann function\n\n\n== Bibliography ==\n1928. \"On Hilbert's construction of the real numbers\" in Jean van Heijenoort, ed., 1967. From Frege to Gödel: A Source Book in Mathematical Logic, 1879-1931. Harvard Univ. Press: 493-507.\n1940. Zur Widerspruchtfreisheit der Zahlentheorie, Mathematische Annalen, vol. 117, pp 162–194.\n1950 (1928). (with David Hilbert) Principles of Mathematical Logic. Chelsea. Translation of 1938 German edition.\n1954. Solvable cases of the decision problem. North Holland.\n\n\n== External links ==\nO'Connor, John J.; Robertson, Edmund F., \"Wilhelm Ackermann\", MacTutor History of Mathematics archive, University of St Andrews .\nWilhelm Ackermann at the Mathematics Genealogy Project\nErich Friedman's page on Ackermann at Stetson University\nHermes, In memoriam WILHELM ACKERMANN 1896-1962 (pdf 945 KB)\nAuthor profile in the database zbMATH", "ns": 0, "pageid": 62727, "title": "Wilhelm Ackermann"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}