{"batchcomplete": "", "query": {"normalized": [{"to": "William Whewell", "from": "William_Whewell"}], "pages": {"205488": {"extract": "William Whewell FRS FGS (/ˈhjuːəl/ HEW-əl; 24 May 1794 – 6 March 1866) was an English polymath, scientist, Anglican priest, philosopher, theologian, and historian of science. He was Master of Trinity College, Cambridge. In his time as a student there, he achieved distinction in both poetry and mathematics.\nWhat is most often remarked about Whewell is the breadth of his endeavours. At a time when men of science were becoming increasingly specialised, Whewell appears as a vestige of an earlier era when men of science dabbled in a bit of everything. He researched ocean tides (for which he won the Royal Medal), published work in the disciplines of mechanics, physics, geology, astronomy, and economics, while also finding the time to compose poetry, author a Bridgewater Treatise, translate the works of Goethe, and write sermons and theological tracts. In mathematics, Whewell introduced what is now called the Whewell equation, an equation defining the shape of a curve without reference to an arbitrarily chosen coordinate system.\nOne of Whewell's greatest gifts to science was his wordsmithing. He often corresponded with many in his field and helped them come up with new terms for their discoveries. Whewell contributed the terms scientist, physicist, consilience, catastrophism, and uniformitarianism, amongst others; Whewell suggested the terms ion, dielectric, anode, and cathode to Michael Faraday.\nWhewell died in Cambridge in 1866 as a result of a fall from his horse.\n\n\n== Life and career ==\nWhewell was born in Lancaster. His father, a carpenter, wished him to follow his trade, but his success in mathematics at Lancaster and Heversham grammar schools won him an exhibition (a type of scholarship) at Trinity College, Cambridge (1812). In 1814 he was awarded the Chancellor's Gold Medal for poetry. He was Second Wrangler in 1816, President of the Cambridge Union Society in 1817, became fellow and tutor of his college, and, in 1841, succeeded Dr Christopher Wordsworth as master. He was professor of mineralogy from 1828 to 1832 and Knightbridge Professor of Philosophy (then called \"moral theology and casuistical divinity\") from 1838 to 1855.\nWhewell died in Cambridge in 1866 as a result of a fall from his horse. He is buried in the Mill Road cemetery, Cambridge, together with his first and second wives: Cordelia Whewell and Everina Frances, Lady Affleck.\n\n\n== Endeavours ==\n\n\n=== Tracing the history and development of science ===\n\nFor all these pursuits, it comes as no surprise that his best-known works are two voluminous books which attempt to map and systematize the development of the sciences, History of the Inductive Sciences (1837) and The Philosophy of the Inductive Sciences, Founded Upon Their History (1840). While the History traced how each branch of the sciences had evolved since antiquity, Whewell viewed the Philosophy as the \"Moral\" of the previous work as it sought to extract a universal theory of knowledge through the history he had just traced. In the Philosophy, Whewell attempted to follow Francis Bacon's plan for discovery of an effectual art of discovery. He examined ideas (\"explication of conceptions\") and by the \"colligation of facts\" endeavoured to unite these ideas with the facts and so construct science. But no art of discovery, such as Bacon anticipated, follows, for \"invention, sagacity, genius\" are needed at each step.\n\n\n=== Whewell's three steps of induction ===\nWhewell analysed inductive reasoning into three steps:\nThe selection of the (fundamental) idea, such as space, number, cause, or likeness (resemblance);\nThe formation of the conception, or more special modification of those ideas, as a circle, a uniform force, etc.; and,\nThe determination of magnitudes.\nUpon these follow special methods of induction applicable to quantity: the method of curves, the method of means, the method of least squares and the method of residues, and special methods depending on resemblance (to which the transition is made through the law of continuity), such as the method of gradation and the method of natural classification. In Philosophy of the Inductive Sciences Whewell was the first to use the term \"consilience\" to discuss the unification of knowledge between the different branches of learning.\n\n\n=== Opponent of English empiricism ===\nHere, as in his ethical doctrine, Whewell was moved by opposition to contemporary English empiricism. Following Immanuel Kant, he asserted against John Stuart Mill the a priori nature of necessary truth, and by his rules for the construction of conceptions he dispensed with the inductive methods of Mill.\n\n\n=== Whewell's neologisms ===\nAs stated, one of Whewell's greatest gifts to science was his wordsmithing. He often corresponded with many in his field and helped them come up with new terms for their discoveries. In fact, Whewell came up with the term scientist itself in 1833, and it was first published in Whewell's anonymous 1834 review of Mary Somerville's On the Connexion of the Physical Sciences published in the Quarterly Review. (They had previously been known as \"natural philosophers\" or \"men of science\").\n\n\n== Work in college administration ==\n\nWhewell was prominent not only in scientific research and philosophy, but also in university and college administration. His first work, An Elementary Treatise on Mechanics (1819), cooperated with those of George Peacock and John Herschel in reforming the Cambridge method of mathematical teaching. His work and publications also helped influence the recognition of the moral and natural sciences as an integral part of the Cambridge curriculum. In general, however, especially in later years, he opposed reform: he defended the tutorial system, and in a controversy with Connop Thirlwall (1834), opposed the admission of Dissenters; he upheld the clerical fellowship system, the privileged class of \"fellow-commoners,\" and the authority of heads of colleges in university affairs. He opposed the appointment of the University Commission (1850), and wrote two pamphlets (Remarks) against the reform of the university (1855). He stood against the scheme of entrusting elections to the members of the senate and instead, advocated the use of college funds and the subvention of scientific and professorial work.\nHe was elected Master of Trinity College, Cambridge in 1841, and retained that position until his death in 1866; he is buried in the chapel of Trinity College, Cambridge while his wives are buried together in the Mill Road Cemetery, Cambridge.\nThe Whewell Professorship of International Law and the Whewell Scholarships were established through the provisions of his will.\n\n\n== Whewell's interests in architecture ==\nAside from Science, Whewell was also interested in the history of architecture throughout his life. He is best known for his writings on Gothic architecture, specifically his book, Architectural Notes on German Churches (first published in 1830). In this work, Whewell established a strict nomenclature for German Gothic churches and came up with a theory of stylistic development. His work is associated with the \"scientific trend\" of architectural writers, along with Thomas Rickman and Robert Willis.\nHe paid from his own resources for the construction of two new courts of rooms at Trinity College, Cambridge, built in a Gothic style. The two courts were completed in 1860 and (posthumously) in 1868, and are now collectively named Whewell's Court (in the singular).\n\n\n== Whewell's works in philosophy and morals ==\n\nBetween 1835 and 1861 Whewell produced various works on the philosophy of morals and politics, the chief of which, Elements of Morality, including Polity, was published in 1845. The peculiarity of this work—written from what is known as the intuitional point of view—is its fivefold division of the springs of action and of their objects, of the primary and universal rights of man (personal security, property, contract, family rights and government), and of the cardinal virtues (benevolence, justice, truth, purity and order).\nAmong Whewell's other works—too numerous to mention—were popular writings such as the third Bridgewater Treatise Astronomy and General Physics considered with reference to Natural Theology (1833), and the essay, Of the Plurality of Worlds (1853), in which he argued against the probability of life on other planets, and also the Platonic Dialogues for English Readers (1850–1861), the Lectures on the History of Moral Philosophy in England (1852), the essay, Of a Liberal Education in General, with particular reference to the Leading Studies of the University of Cambridge (1845), the important edition and abridged translation of Hugo Grotius, De jure belli ac pacis (1853), and the edition of the Mathematical Works of Isaac Barrow (1860).\nWhewell was one of the Cambridge dons whom Charles Darwin met during his education there, and when Darwin returned from the Beagle voyage he was directly influenced by Whewell, who persuaded Darwin to become secretary of the Geological Society of London. The title pages of On the Origin of Species open with a quotation from Whewell's Bridgewater Treatise about science founded on a natural theology of a creator establishing laws:\n\n\"But with regard to the material world, we can at least go so far as this—we can perceive that events are brought about not by insulated interpositions of Divine power, exerted in each particular case, but by the establishment of general laws.\"\n\n\n=== Works by Whewell ===\n(1831) Review of J. Herschel's Preliminary discourse on the study of Natural Philosophy (1830), Quarterly Review 90: 374–407.\n(1833) Astronomy and general physics considered with reference to Natural Theology (Bridgewater Treatise). Cambridge.\n(1836) Elementary Treatise on Mechanics, 5th edition, first edition 1819.\n(1837) History of the Inductive Sciences, from the Earliest to the Present Times. 3 vols, London. 2nd ed 1847. Volume 1, volume 2, volume 3. 3rd ed 1857. 1st German ed 1840–41.\n(1840) The Philosophy of the Inductive Sciences, founded upon their history. 2 vols, London. 2nd ed 1847. Volume 1. Volume 2.\n(1845) The Elements of Morality, including polity. 2 vols, London. Volume 1 Volume 2.\n(1846) Lectures on systematic Morality. London.\n(1849) Of Induction, with especial reference to Mr. J. Stuart Mill's System of Logic. London.\n(1850) Mathematical exposition of some doctrines of political economy: second memoir. Transactions of the Cambridge Philosophical Society 9:128–49.\n(1852) Lectures on the history of Moral Philosophy. Cambridge: Cambridge University Press.\n(1853) Hugonis Grotii de jure belli et pacis libri tres : accompanied by an abridged translation by William Whewell, London: John W. Parker, volume 1, volume 2, volume 3.\n(1853) Of the Plurality of Worlds. London.\n(1857) Spedding's complete edition of the works of Bacon. Edinburgh Review 106:287–322.\n(1858a) The history of scientific ideas. 2 vols, London.\n(1858b) Novum Organon renovatum, London.\n(1860a) On the philosophy of discovery: chapters historical and critical. London.\n(1861) Plato's Republic (translation). Cambridge.\n(1862) Six Lectures on Political Economy, Cambridge.\n(1862) Additional Lectures on the History of Moral Philosophy, Cambridge.\n(1866) Comte and Positivism. Macmillan's Magazine 13:353–62.\n\n\n== Honors and recognitions ==\nForeign Honorary Member of the American Academy of Arts and Sciences (1847)\nThe crater Whewell on the Moon\nThe Gothic buildings known as Whewell's Court in Trinity College, Cambridge\nThe Whewell Mineral Gallery in the Sedgwick Museum of Earth Sciences, Cambridge\nThe mineral whewellite\nThe debating society at Lancaster Royal Grammar School is named the Whewell Society in honour of Whewell being an Old Lancastrian.\n\n\n== See also ==\nCatastrophism\nUniformitarianism\nEarl of Bridgewater for other Bridgewater Treatise\nLaw of three stages for Whewell's opposition to Auguste Comte's positivism\nMichael Faraday\n\n\n== References ==\n\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Whewell, William\". Encyclopædia Britannica. 28 (11th ed.). Cambridge University Press. \n\n\n== Further reading ==\nHeilbron, J L (2002), \"Coming to terms\", Nature (published 7 February 2002), 415 (6872), pp. 585–585, doi:10.1038/415585a, PMID 11832919 \nLosee, J (1983), \"Whewell and Mill on the relation between philosophy of science and history of science\", Studies in history and philosophy of science (published Jun 1983), 14 (2), pp. 113–126, doi:10.1016/0039-3681(83)90016-X, PMID 11615935 \nFisch, M (1991), William Whewell Philosopher of Science, Oxford: Oxford University Press.\nFisch, M and Schaffer S J (eds.) (1991), William Whewell: A Composite Portrait, Oxford: Oxford University Press.\nMetcalfe, J F (1991), \"Whewell's developmental psychologism: a Victorian account of scientific progress\", Studies in history and philosophy of science (published Mar 1991), 22 (1), pp. 117–139, doi:10.1016/0039-3681(91)90017-M, PMID 11622706 \nRuse, M (1975), \"Darwin's debt to philosophy: an examination of the influence of the philosophical ideas of John F. W. Herschel and William Whewell on the development of Charles Darwin's theory of evolution\", Studies in history and philosophy of science (published Jun 1975), 6 (2), pp. 159–181, doi:10.1016/0039-3681(75)90019-9, PMID 11615591 \nSnyder, Laura J. (2006), Reforming Philosophy: A Victorian Debate on Science and Society, Chicago: The University of Chicago Press . Includes an extensive bibliography.\nSnyder, Laura J. (2011), The Philosophical Breakfast Club, New York: Broadway Books .\nWhewell, W., Astronomy and General Physics Considered with Reference to Natural Theology; Bridgewater Treatises, W. Pickering, 1833 (reissued by Cambridge University Press, 2009; ISBN 978-1-108-00012-3)\nWhewell, W., Of the Plurality of Worlds. An Essay; J. W. Parker and son, 1853 (reissued by Cambridge University Press, 2009; ISBN 978-1-108-00018-5)\nYeo, Richard. \"Whewell, William (1794–1866)\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/29200.  (Subscription or UK public library membership required.)\n\n\n== External links ==\nThe philosophy of the inductive sciences, founded upon their history (1847) – Complete Text\nWilliam Whewell (1794-1866) by Menachem Fisch, from The Routledge Encyclopedia of Philosophy\nWilliam Whewell by Laura J. Snyder, from Stanford Encyclopedia of Philosophy\nSix Lectures from Archive for the History of Economic Thought – papers on mathematical economics as well as a set of introductory lectures\nWilliam Whewell from History of Economic Thought\nPapers of William Whewell\nThe Master of Trinity at Trinity College, Cambridge\n\"William Whewell\" at The MacTutor History of Mathematics archive\nWorks by William Whewell at Project Gutenberg\nWorks by or about William Whewell at Internet Archive", "ns": 0, "pageid": 205488, "title": "William Whewell"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}