{"batchcomplete": "", "query": {"normalized": [{"to": "William Ernest Johnson", "from": "William_Ernest_Johnson"}], "pages": {"2635773": {"extract": "William Ernest Johnson (23 June 1858 – 14 January 1931), usually cited as W. E. Johnson, was a British logician mainly remembered for his Logic (1921–1924), in 3 volumes. In 1924, in volume III he introduced the important concept of exchangeability.\n\n\n== Biography ==\nJohnson graduated MA and was Sidgwick lecturer in Moral Sciences. He was elected a Fellow of King's College, Cambridge in March 1902, and taught there for nearly thirty years. He wrote a bit on economics, and John Maynard Keynes was one of his students. Johnson was a colleague of Keynes's father, John Neville Keynes. He was a Cambridge Apostle.\nLogic was dated at the time of its publication, and Johnson can be seen as a member of the British logic \"old guard\" pushed aside by the Principia Mathematica of Alfred North Whitehead and Bertrand Russell. Yet an article entitled \"The Logical Calculus\" (Johnson 1892) reveals that he had nontrivial technical capabilities in his youth, and that he was significantly influenced by the formal logical work of Charles Sanders Peirce. The article begins as follows:\n\n\"As a material machine economises the exertion of force, so a symbolic calculus economises the exertion of intelligence ... the more perfect the calculus, the smaller the intelligence compared to the results.\"\n\nA.N. Prior's Formal Logic cites this article several times.\nJohn Passmore tells us:\n\n\"His neologisms, as rarely happens, have won wide acceptance: such phrases as “ostensive definition”, such contrasts as those between ... “determinates” and “determinables”, “continuants” and “occurrents”, are now familiar in philosophical literature\" (Passmore 1966, p. 344).\n\n\n== References ==\n\n\n== Bibliography ==\nGrattan-Guinness, Ivor (2000), The Search for Mathematical Roots 1870–1940. Princeton University Press.\nJohnson, W. E. (1892), \"The Logical Calculus\", Mind 1 (New Series), 3–30, 235–250, 340–357.\nPassmore, John (1966). A Hundred Years of Philosophy (2nd ed.). London: Penguin (1957). \nSanford, David H. (2011), \"Determinates vs. Determinables\" in the online Stanford Encyclopedia of Philosophy.\nZabell, S. L. (1992). \"Predicting the unpredictable\". Synthese. 90: 205. doi:10.1007/bf00485351.", "ns": 0, "pageid": 2635773, "title": "William Ernest Johnson"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}