{"batchcomplete": "", "query": {"normalized": [{"to": "William Lycan", "from": "William_Lycan"}], "pages": {"7697407": {"extract": "William G. Lycan (born September 26, 1945) is an American philosopher teaching at the University of North Carolina at Chapel Hill, where he is the William Rand Kenan, Jr. Distinguished Professor. He won the Class of 2001 Outstanding Faculty Award (in 2001) and a Distinguished Teaching Award for Post-Baccalaureate Instruction in 2002. Before moving to UNC in 1982, Lycan taught for twelve years at Ohio State University. Since 2011, Lycan has also been Professor of Philosophy at University of Connecticut.\nHis principal interests include philosophy of mind, philosophy of language, philosophy of linguistics, epistemology, and metaphysics. The author of eight books and over 150 articles (and over 20 reviews) Lycan is an advocate of the version of functionalism, known as homuncular functionalism.\nLycan is an unapologetic realist and physicalist about almost everything – mental states (intentionality and consciousness), epistemic justification, linguistic meaning, perception (especially color and smell), moral properties, aesthetic properties, and more. This realist, physicalist philosophical tapestry is held together by several common threads: the view that persons are complex systems composed of sub-personal systems, sub-sub-personal systems, etc., all the way down to sub-atomic functions; the view that natural teleology is ubiquitous, that there exists a non-ideal but nonetheless discernible evolved fit between human capacities and the environment; the view that meaning in natural language manifests a logical form that at its core is truth-functional; and more.\nThese (and other) common threads are prominent in Lycan’s theories of mind. Mental states are type-identical to functional states instantiated in sub- or sub-sub-personal systems, where the function of any such state is determined by its natural teleology. This is Lycan’s Homuncular Functionalism. The appeal to teleology dissolves problems with earlier functionalist theories, especially those concerning consciousness. A correct theory of consciousness, on Lycan’s view, comprises multiple parts corresponding to the multiple phenomena to which the term ‘consciousness’ is applied. Thus, Lycan defends a higher-order, inner sense theory of awareness, according to which attention mechanisms have the function of monitoring and integrating lower level psychological processes; a pronominal theory of subjectivity, according to which the subjective or perspectival nature of conscious states is a product of the utterly unique semantic role of introspective mental concepts (e.g., ‘I’); a representational theory of qualia, according to which sensory qualities are the intentional objects of sensory representations; and more. (Consciousness 1987; Consciousness and Experience 1996.)\nThese same threads are prominent in Lycan’s account of knowledge, including his account of belief acquisition and epistemic justification. To acquire a new belief is to acquire a new real, internal representation instantiated in one’s functional architecture. And a new belief is justified if it, better than its competitors, increases the explanatory coherence of the person’s entire belief set. This is Lycan’s explanationist theory of justification. Canons of epistemic value used to identify degrees of explanatory coherence are themselves justified by appeal to natural teleology. (Judgement and Justification 1988.) In defense of his view, Lycan critically assesses major competitors (especially reliabilism) and other views (e.g., epistemic minimalism).\nMeaning in natural language (Logical Form in Natural Language 1984), including the meaning of indicative conditionals (Real Conditionals 2001), is explained by Lycan in truth-theoretic terms. Here, too, the requisite psycho-linguistic machinery coheres with Lycan’s Homuncular Functionalism and, more generally, with the above common threads.\nAlong with Robert Adams, Lycan considers David Kellogg Lewis's notion of possible worlds to be metaphysically extravagant and suggests in its place an actualist interpretation of possible worlds as consistent, maximally complete sets of descriptions or propositions about the world, so that a \"possible world\" is conceived of as a complete description (i.e. a maximally consistent set of propositions) of a way the world could be – rather than a world which is that way.\n\n\n== Education ==\nWilliam Lycan received his B.A. from Amherst College in 1966 while working as a teaching assistant in the Music department. His honors thesis was on \"Noam Chomsky's Investigation of Syntax.\" He went on to receive his M.A. in 1967 and Ph.D. in 1970, both from the University of Chicago. His doctoral dissertation was on \"Persons, Criteria, and Materialism.\" In 2013, he was elected an Honorary Fellow of the Australian Academy of the Humanities.\n\n\n== Publications ==\nLogical Form in Natural Language (Bradford Books / MIT Press, 1984), xii + 348 pp.\nKnowing Who (with Steven Boër) (Bradford Books / MIT Press, 1986), xiv + 212 pp.\nConsciousness (Bradford Books / MIT Press, 1987), ix + 165 pp.\nJudgement and Justification (Cambridge University Press, 1988), xiii + 230 pp.\nModality and Meaning (Kluwer Academic Publishing, Studies in Linguistics and Philosophy series, 1994), xxii + 335 pp.\nConsciousness and Experience (Bradford Books / MIT Press, 1996), xx + 211 pp.\nPhilosophy of Language: A Contemporary Introduction (Routledge Publishers, 1999), xvi + 243 pp.\nReal Conditionals (Oxford University Press, 2001), vii + 223 pp.\n\n\n== See also ==\nAmerican philosophy\nList of American philosophers\n\n\n== External links ==\nStaff Homepage at UNC\nWilliam G. Lycan's Curriculum Vitae", "ns": 0, "pageid": 7697407, "title": "William Lycan"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}