{"batchcomplete": "", "query": {"normalized": [{"to": "William George Ward", "from": "William_George_Ward"}], "pages": {"250686": {"extract": "William George Ward (21 March 1812 – 6 July 1882) was an English theologian and mathematician. A Roman Catholic convert, his career illustrates the development of religious opinion at a time of crisis in the history of English religious thought.\n\n\n== Life ==\nHe was the son of William Ward and Emily Combe. He was educated at Winchester College and went up to Christ Church, Oxford, in 1830, but his father's financial difficulties forced him in 1833 to try for a scholarship at Lincoln College, which he succeeded in obtaining. Ward had a gift for pure mathematics but for history, applied mathematics or anything outside the exact sciences, he felt contempt. He was endowed with a strong sense of humour and a love of paradox carried to an extreme. His examination for mathematical honours exhibited some of the peculiarities of his character and mental powers. Four out of his five papers on applied mathematics were sent up absolutely blank. Honours, however, were not refused him, and in 1834 he obtained an open fellowship at Balliol.\nIn the previous year the Tractarian movement had been launched: Ward was attracted to it by his hatred of moderation and what he called \"respectability\". He was repelled by the conception he had formed of John Henry Newman, whom he regarded as a mere antiquary. When, however, he was at length persuaded by a friend to go and hear Newman preach, he at once became a disciple. But he had, as Newman afterwards said of him, \"struck into the movement at an angle.\" He had no taste for historical investigations. He treated the question at issue as one of pure logic: disliking the Reformers, the right of private judgment which Protestants claimed, and the somewhat prosaic uniformity of the English Church, he flung himself into a general campaign against Protestantism in general and the Anglican form of it in particular. He nevertheless took deacon's orders in 1838 and priest's orders in 1840.\n\nIn 1839 Ward became editor of the British Critic, the organ of the Tractarian party, and he excited suspicion among the adherents of the party by his violent denunciations of the Church to which he still belonged. In 1841 he urged the publication of the celebrated Tract 90, and wrote in defence of it. From that period Ward and his associates worked undisguisedly for union with the Church of Rome, and in 1844 he published his Ideal of a Christian Church, in which he openly contended that the only hope for the Church of England lay in submission to the Church of Rome. This publication brought to a height the storm which had long been gathering. The University of Oxford was invited, on 13 February 1845, to condemn Tract 90, to censure the Ideal, and to deprive Ward from his degrees. The two latter propositions were carried with Ward being deprived of his tutorship and Tract 90 only escaped censure by the non placet of the proctors, Guillemard and Church.\nWard left the Church of England in September 1845, and was followed by many others, including Newman himself. After his reception into the Church of Rome, Ward devoted himself to ethics, metaphysics and moral philosophy. He wrote articles on free will, the philosophy of theism, on science, prayer and miracles for the Dublin Review. He also dealt with the condemnation of Pope Honorius I, carried on a controversial correspondence with John Stuart Mill, and took a leading part in the discussions of the Metaphysical Society, founded by James Knowles, of which Alfred Lord Tennyson, T H Huxley and James Martineau were also prominent members. He was an opponent of Liberal Catholicism and defender of papal authority.\nIn 1851 he became professor of moral philosophy at St Edmund's College, Ware, and the following year he was appointed to the chair of dogmatic theology. In 1863 he became editor of the Dublin Review (1863–1878). He supported the promulgation of the dogma of Papal Infallibility in 1870. After his admission into the Roman Catholic Church he had married, and for a time had to struggle with poverty. But his circumstances later improved.\n\n\n== Family ==\nWard was the grandnephew of Robert Plumer Ward, the nephew of Sir Henry George Ward, and the son of William Ward.\nHe was the father of Newman's biographer, Wilfrid Philip Ward; a grandfather of Father Leo Ward, a missioner in Japan and co-founder of Sheed & Ward, and of Leo's sister, the writer and publisher Maisie Ward; and a great-grandfather of the translator Rosemary Sheed, and of Rosemary's brother, the novelist Wilfrid Sheed.\n\n\n== Works ==\n\n\n== See also ==\nAnglo-Catholicism\n\n\n== References ==\n\n Herbermann, Charles, ed. (1913). \"William George Ward\". Catholic Encyclopedia. New York: Robert Appleton Company. \n Chisholm, Hugh, ed. (1911). \"Ward, William George\". Encyclopædia Britannica (11th ed.). Cambridge University Press. \n\n\n== Further reading ==\n\n\n== External links ==\nWorks by or about William George Ward at Internet Archive\nWorks by William George Ward, at Hathi Trust\nWorks by William George Ward, at Europeana", "ns": 0, "pageid": 250686, "title": "William George Ward"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}