{"batchcomplete": "", "query": {"normalized": [{"to": "Wolfgang Smith", "from": "Wolfgang_Smith"}], "pages": {"11902898": {"extract": "Wolfgang Smith (born 1930) is a mathematician, physicist, philosopher of science, metaphysician, Roman Catholic and member of the Traditionalist School. He has written extensively in the field of differential geometry, as a critic of scientism and as a proponent of a new interpretation of quantum mechanics that draws heavily from medieval ontology and realism.\n\n\n== Biography ==\nSmith graduated in 1948 from Cornell University with a B.A. in Philosophy, Physics and Mathematics. Two years later he obtained his M.S. in Physics from Purdue University and, some time later, a Ph.D in Mathematics from Columbia University.\nHe worked as a physicist in Bell Aircraft corporation, researching aerodynamics and the problem of atmospheric reentry. He was a mathematics professor at MIT, UCLA and Oregon State University, doing research in the field of differential geometry and publishing in academic journals such as the Transactions of the American Mathematical Society, the Proceedings of the National Academy of Sciences, the American Journal of Mathematics, and others. He retired from academic life in 1992.\nIn parallel with his academic duties, he developed and still develops philosophical inquiries in the fields of Metaphysics and Philosophy of science, publishing in specialized journals such as The Thomist and Sophia: The Journal of Traditional Studies.\n\n\n== Philosophy ==\nSmith is a member of the Traditionalist School of Metaphysics, having contributed extensively to its criticism of modernity while exploring the philosophical underpinnings of the scientific method and emphasizing the idea of bringing science back into the Aristotelian framework of traditional ontological realism.\nIdentifying with Alfred North Whitehead's criticism of Scientism's \"bifurcationism\" and \"physical reductionism\", i.e., the belief that, first, the qualitative properties of the objects of perception (the \"corporeal objects\") are ultimately distinct from their respective quantitative properties (the \"physical objects\" studied by the different sciences); and second, that the physical objects are \"in fact\" all there is, meaning the corporeal objects are reduced to their physical counterparts, Smith examines critically in his work Cosmos and Transcendence (1984) the Cartesian roots of modern physical sciences.\nProceeding from his critique of Scientism, in his The Quantum Enigma (1995) Smith poses the questions of whether the scientific method is actually dependent on the Scientistic philosophy and, if it isn't, whether linking it to other philosophical frameworks would provide better solutions to the way we interpret physical phenomena. Demonstrating that in no case either the scientific method or its results depend upon or require adhering to a scientistic metaphysics, he answers in the positive to the first question, with the end result that it's possible to link the scientific method to any underlying metaphysics, or to none at all. Working then into the second question, he proposes linking the scientific method, thus the modern sciences, to a non-bifurcationist, non-reductionist metaphysics in the form of a modified thomistic ontology, showing how such a move can provide a positive outcome by solving the apparent incoherences perceived in Quantum Mechanics' phenomena.\nAccording to Smith, such an interpretation of quantum mechanics allows for the usage of the hylomorphic concepts of act and potential to properly understand Quantum superpositions. For example, instead of considering that a photon is simultaneously a wave and a particle, or a particle in two distinct position, and other counterintuitive constructs, one would consider that the photon (or any other \"physical object\") at first doesn't exist \"in act\", but only \"in potency\", i.e., as \"matter\" in the hylomorphic meaning of the word, having the potential of becoming a wave, or a particle, or of being here or there etc. Whether one of these outcomes will happen to this undifferentiated matter is dependent on the determination imposed upon it by the macroscopic \"corporeal object\" that provides to it its actualization. A photon, thus, would be no more strange for having many potentials than, say, an individual who has the \"superimposed\" potentials of learning French and/or Spanish and/or Greek, all the while reading and/or walking and/or stretching his arms etc. And a further consequence of such an interpretation would be a corporeal and its related physical objects aren't dichotomized or reduced one to the other anymore, but quite the opposite, they all together constitute a whole of which different aspects are dealt with depending on perspective.\nSmith's understanding of the relationship between corporeal and physical objects extend to his interpretation of biology, where he has become an opponent of Darwinian evolution, as the fundamental element in a species would be its form, not its causal history, which evolutionists favor. This leads him to be a supporter of the intelligent design movement, even though the hylomorphic approach itself isn't widely adopted by the mainstream intelligent designers, who also favor causal history, even though differently from evolutionists.\nSmith has also taken a stance towards a relativistic rehabilitation of geocentrism. It is important however to note that Smith is not supporting Ptolemaic or medieval geocentrism as such, or asserting that heliocentrism is absolutely false. Rather he argues that according to the theory of relativity, both Heliocentrism and Geocentrism have merit from a scientific viewpoint, since any (scientific) observations depend on the reference of frame of the observer and any observation made from Earth (and any Near-Earth satellites) are virtually geocentric in that respect.\n\n\n== Bibliography ==\n\n\n=== Books ===\nBooks written by Wolfgang Smith or including his contributions:\n\n\n=== Articles ===\n\n\n==== General ====\nArticles on philosophy, religion, physics and non-mathematical subjects in general:\n\n\n==== Mathematics ====\nAcademic articles on mathematics signed as \"J. Wolfgang Smith\":\n\n\n== See also ==\n\nQuantum mechanics\nPhilosophy of physics\nInterpretation of quantum mechanics\nPhilosophical realism\nNeo-Scholasticism\nPerennial philosophy\nTraditionalist School\nList of American philosophers\n\n\n== Notes ==\n\n\n== References ==", "ns": 0, "pageid": 11902898, "title": "Wolfgang Smith"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}