{"batchcomplete": "", "query": {"pages": {"223339": {"extract": "Xenophanes of Colophon (/zəˈnɒfəniːz/; Ancient Greek: Ξενοφάνης ὁ Κολοφώνιος [ksenopʰánɛːs ho kolopʰɔ̌ːnios]; c. 570 – c. 475 BC) was a Greek philosopher, theologian, poet, and social and religious critic. Xenophanes lived a life of travel, having left Ionia at the age of 25 and continuing to travel throughout the Greek world for another 67 years. Some scholars say he lived in exile in Sicily. Knowledge of his views comes from fragments of his poetry, surviving as quotations by later Greek writers. To judge from these, his elegiac and iambic poetry criticized and satirized a wide range of ideas, including Homer and Hesiod, the belief in the pantheon of anthropomorphic gods and the Greeks' veneration of athleticism. He is the earliest Greek poet who claims explicitly to be writing for future generations, creating \"fame that will reach all of Greece, and never die while the Greek kind of songs survives.\"\n\n\n== Life ==\nXenophanes was a native of Colophon and was the son of Orthomenes or, according to others, of Dexius. He is said to have flourished during the 60th Olympiad (540-537 BC). He was mentioned in the writings of Heraclitus and Epicharmus and had himself mentioned Thales, Epimenides, and Pythagoras. In a fragment of his elegies, he mentions the Median invasion as an event that took place in his time, which may refer to the expedition of Harpagus against the Greek cities in Ionia (546/5 BC). He left his native land as a fugitive or exile and went to the Ionian colonies in Sicily, Zancle and Catana. He may have lived for some time in Elea (founded by the Phocaeans in the 61st Olympiad 536-533 BC), since he wrote about the foundation of the colony. According to the fragments of one of his elegies, he had left his native land at the age of 25 and had already lived 67 years in the Greek lands, when, at the age of 92, he composed that elegy.\n\n\n== Poems ==\nAccording to biographer Diogenes Laërtius, Xenophanes wrote in hexameters and also composed elegies and iambics against Homer and Hesiod. Laertius also mentions two historical poems concerning the founding of Colophon and Elea, but of these, only the titles have been preserved. There is no good authority that says that Xenophanes wrote a philosophical poem. The Neoplatonist philosopher Simplicius tells us he had never met with the verses about the earth stretching infinitely downwards (fr. 28), even though he had access to many philosophical works. Several of the philosophical fragments are derived from commentators on Homer. It is thus likely that the philosophical remarks of Xenophanes were expressed incidentally in his satires. The satires are called Silloi by late writers, and this name may go back to Xenophanes himself, but it may originate in the fact that Timon of Phlius, the \"sillographer\" (3rd century BC), put much of his own satire upon philosophers into the mouth of Xenophanes.\n\n\n== Theology ==\nXenophanes' surviving writings display a skepticism that became more commonly expressed during the fourth century. He satirized traditional religious views of his time as human projections. He aimed his critique at the polytheistic religious views of earlier Greek poets and of his own contemporaries: \"Homer and Hesiod,\" one fragment states, \"have attributed to the gods all sorts of things that are matters of reproach and censure among men: theft, adultery, and mutual deception.\" Sextus Empiricus reported that such observations were appreciated by Christian apologists. Xenophanes is quoted, memorably, in Clement of Alexandria, arguing against the conception of gods as fundamentally anthropomorphic:\n\nBut if cattle and horses and lions had hands\nor could paint with their hands and create works such as men do,\nhorses like horses and cattle like cattle\nalso would depict the gods' shapes and make their bodies\nof such a sort as the form they themselves have.\n...Ethiopians say that their gods are snub–nosed [σιμούς] and blackThracians that they are pale and red-haired.\n\nAn additional criticism of the gods is found in the quote\n\nThe gods have not, of course, revealed all things to mortals\nfrom the beginning;\nbut rather, seeking in the course of time, they discover\nwhat is better.\n\nXenophanes could be trying to say that humans are independent of the gods with their intelligence, that discoveries in science and other areas are the result of human work and not divine favors, thus removing the gods from the role of receiving credit for human accomplishment.\nOther passages quoted by Clement of Alexandria that argue against the traditional Greek conception of gods include:\n\"One god, greatest among gods and humans,\nlike mortals neither in form nor in thought.\"\n\"But mortals think that the gods are born\nand have the mortals' own clothes and voice and form.\"\nRegarding Xenophanes' theology five key concepts about God can be formed. God is: beyond human morality, does not resemble human form, cannot die or be born (God is divine thus eternal), no divine hierarchy exists, and God does not intervene in human affairs. While Xenophanes is rejecting Homeric theology, he is not questioning the presence of a divine entity, rather his philosophy is a critique on Ancient Greek writers and their conception of divinity. There is also the concept of God being whole with the universe, essentially controlling it, while at the same time being physically unconnected.\nXenophanes espoused a belief that \"God is one, supreme among gods and men, and not like mortals in body or in mind.\" He maintained there was one greatest God. God is one eternal being, spherical in form, comprehending all things within himself, is the absolute mind and thought, therefore is intelligent, and moves all things, but bears no resemblance to human nature either in body or mind. He is considered by some to be a precursor to Parmenides and Spinoza. Because of his development of the concept of a \"one god greatest among gods and men\" that is abstract, universal, unchanging, immobile and always present, Xenophanes is often seen as one of the first monotheists, in the Western philosophy of religion, although the quotation that seems to point to Xenophanes's monotheism also refers to multiple \"gods\" who the supreme God is greater than. Physicist and philosopher Max Bernhard Weinstein specifically identified Xenophanes as one of the earliest pandeists.\n\n\n== Physical ideas ==\nXenophanes wrote about two extremes predominating the world: wet and dry (water and earth). These two extreme states would alternate between one another, and with the alternation human life would become extinct, then regenerate (or vice versa depending on the dominant form). The idea of alternating states and human life perishing and coming back suggests he believed in the principle of causation, another distinguishing step that Xenophanes takes away from Ancient philosophical traditions to ones based more on scientific observation. The argument can be considered a rebuke to Anaximenes' air theory. A detailed account of the wet and dry form theory is found in Hippolytus' Refutation.\nHe also holds that there is an infinite number of worlds, not overlapping in time.\nXenophanes concluded from his examination of fossils that water once must have covered all of the Earth's surface. The use of evidence is an important step in advancing from simply stating an idea to backing it up by evidence and observation.\n\n\n=== Knowing ===\nXenophanes is credited with being one of the first philosophers to distinguish between true belief and knowledge, which he further developed into the prospect that you can know something but not really know it. Due to the lack of whole works by Xenophanes, a lot of meaning is lost and a large amount of guessing is at hand, so that the implication of knowing being something deeper (\"a clearer truth\") may have special implications, or it may mean that you cannot know something just by looking at it. It is known that the most and widest variety of evidence was considered by Xenophanes to be the surest way to prove a theory.\nHis epistemology, which is still influential today, held that there actually exists a truth of reality, but that humans as mortals are unable to know it. Karl Popper read Xenophanes as saying that it is possible to act only on the basis of working hypotheses—we may act as if we knew the truth, as long as we know that this is extremely unlikely. Xenophanes' views then might serve as a basis of Critical rationalism.\nIn today's philosophical and classics discourse, Xenophanes is seen as one of the most important presocratic philosophers. It had also been common since antiquity to see him as the teacher of Zeno of Elea, the colleague of Parmenides, and generally associated with the Eleatic school, but common opinion today is likewise that this is false.\nThere is one fragment dealing with the management of a feast, another which denounces the exaggerated importance attached to athletic victories, and several which deny the humanized gods of Homer. Arguments such as these made Xenophanes infamous for his attacks on \"conventional military and athletic virtues of the time\" and well known to side with the intellectual instead.\n\n\n== See also ==\nOn Melissus, Xenophanes, and Gorgias\n\n\n== Notes ==\n\n\n== Bibliography ==\n\n\n=== Editions ===\nE. Zeller, Die Philosophie der Griechen, 1st Volume, p. 378-395, Tübingen, 1856\nA. Fairbanks, The First Philosophers of Greece, p. 65-85, New York, 1898 (cf. Hanover Historical Texts)\nH. Diels and W. Kranz (eds.), Die Fragmente der Vorsokratiker, pp. 38–58, 1st Edition, Berlin, 1903 (6th Ed. is considered standard work and reprinted unaltered; much superior to Kirk/Raven)\nG. S. Kirk, J. E. Raven, and M. Schofield, The Presocratic Philosophers, Chapter 5, 2nd Edition, Cambridge, 1983\nM. R. Wright, The Presocratics - the main fragments in Greek, Bristol, 1985 (cf. Xenophanes of Colophon by Giannis Stamatellos)\nB. Gentili and C. Prato (eds.), Poetarum Elegiacorum Testimonia et Fragmenta 1, Leipzig 1988 (best Greek text available)\nJ.H. Lesher (ed.), Xenophanes. Fragments, Toronto 1992 (best English edition and translation)\n\n\n=== Further reading ===\nJ. Lesher, Presocratic Contributions to the Theory of Knowledge, 1998\nU. De Young, \"The Homeric Gods and Xenophanes' Opposing Theory of the Divine\", 2000\nW. Drechsler and R. Kattel, \"Mensch und Gott bei Xenophanes\", in: M. Witte, ed., Gott und Mensch im Dialog. Festschrift für Otto Kaiser zum 80. Geburtstag, Berlin – New York 2004, 111-129\nH. Fränkel, \"Xenophanesstudien\", Hermes 60 (1925), 174-192\nE. Heitsch, Xenophanes und die Anfänge kritischen Denkens. Mainzer Akademie der Wissenschaften und der Literatur, Abh. d. Geistes- und Sozialwiss. Kl., 1994, H. 7\nW. Jaeger, The Theology of the Early Greek Philosophers, Gifford Lectures 1936, repr. Westport, Ct. 1980\nK. Jaspers, The Great Philosophers 3, New York etc. 1993\nR. Kattel, \"The Political Philosophy of Xenophanes of Colophon\", Trames 1(51/46) (1997), 125-142\nO. Kaiser, \"Der eine Gott und die Götter der Welt\", in: Zwischen Athen und Jerursalem. Studien zur griechischen und biblischen Theologie, ihrer Eigenart und ihrem Verhältnis, Berlin - New York 2003, 135-152\nLuchte, James (2011). Early Greek Thought: Before the Dawn. London: Bloomsbury Publishing. ISBN 978-0567353313. \nRichard D. McKirahan, Xenophanes of Colophon. Philosophy Before Socrates. Indianapolis: Hackett Publishing Company, 1994\nK. Ziegler, \"Xenophanes von Kolophon, ein Revolutionär des Geistes\", Gymmasium 72 (1965), 289-302\n\n\n== External links ==\nLesher, James. \"Xenophanes\". Stanford Encyclopedia of Philosophy. \nXenophanes of Colophon by Giannis Stamatellos\n Laërtius, Diogenes (1925). \"Others: Xenophanes\". Lives of the Eminent Philosophers. 2:9. Translated by Hicks, Robert Drew (Two volume ed.). Loeb Classical Library. \nXenophanes of Colophon - Primary and secondary resources", "ns": 0, "pageid": 223339, "title": "Xenophanes"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}