{"batchcomplete": "", "query": {"normalized": [{"to": "Xun Kuang", "from": "Xun_Kuang"}], "pages": {"608209": {"extract": "Xun Kuang ([ɕy̌n kʰu̯âŋ]; Chinese: 荀況; pinyin: Xún Kuàng, c. 310 – c. 235 BC, alt. c. 314 – c. 217 BC), also widely known as Xun Zi (Chinese: 荀子; pinyin: Xún Zǐ, \"Master Xun\"), was a Chinese Confucian philosopher who lived during the Warring States period and contributed to one of the Hundred Schools of Thought. A book known as the Xunzi, an influential collection of essays, is traditionally attributed to him.\nXunzi witnessed the chaos surrounding the fall of the Zhou dynasty and rise of the Qin state – which upheld legalistic doctrines focusing on state control, by means of law and penalties. Xunzi's variety of Confucianism therefore has a darker, more pragmatic flavour than the optimistic Confucianism of Mencius, who tended to view humans as innately good. Like Shang Yang, Xunzi believed that humanity's inborn tendencies were evil and that ethical norms had been invented to rectify people. Xunzi was educated in the state of Qi and taught proponents of legalism, including the Qin Chancellor Li Si and Han Feizi. Because of this, he is sometimes associated with legalism. But like most Confucians, he believed that people could be refined through education and ritual.\nWhile Xunzi's doctrines were influential in forming the official state doctrines of the Han dynasty, during the Tang dynasty his influence waned, relative to that of Mencius. Xunzi mentioned Laozi as a figure for the first time in early Chinese history.\n\n\n== Life ==\nXunzi was born Xun Kuang (荀況). Some texts recorded his surname as Sun (孫) instead of Xun, either because the two surnames were homophones in antiquity or because Xun was a naming taboo during the reign of Emperor Xuan of Han (73–48 BC), whose given name was Xun. Herbert Giles and John Knoblock both consider the naming taboo theory more likely.\nThe early years of Xunzi's life are enshrouded in mystery. Nothing is known of his lineage. Sima Qian records that he was born in Zhao, and Anze County has erected a large memorial hall at his supposed birthplace. He was first known at the age of fifty, around 264 BC, when he went to the state of Qi to study and teach at the Jixia Academy. Xunzi was well respected in Qi; the King Xiang of Qi honoured him as a teacher and a libationer.\nIt was around this time that Xunzi visited the state of Qin and praised its governance, and debated military affairs with Lord Linwu (臨武君) in the court of King Xiaocheng of Zhao. Later, Xunzi was slandered in the Qi court, and he retreated south to the state of Chu, where Lord Chunshen, the prime minister, gave him a position as Magistrate of Lanling (蘭陵令). In 238 BC, Lord Chunshen was assassinated by a court rival and Xunzi subsequently lost his position. He remained in Lanling, a region in what is today's southern Shandong province, for the rest of his life and was buried there. The year of his death is unknown.\nOf his disciples, the most notable are Li Si (prime minister to the First Emperor of Qin) and the Han state royal Han Feizi, who developed the quasi-authoritarian aspects of his thought into the doctrine called the School of Law, or Legalism. Because of Li Si and Han Feizi's staunch anti-Confucian stances, Xunzi's reputation as a Confucian philosopher has often come into question.\n\n\n== Notes ==\n\n\n== References ==\nCua, A.S. (1985). Ethical Argumentation: A Study in Hsün Tzu's Moral Epistemology. Honolulu: University of Hawaii Press. ISBN 0-8248-0942-4. \nKnechtges, David R.; Shih, Hsiang-lin (2014). \"Xunzi 荀子\". In Knechtges, David R.; Chang, Taiping. Ancient and Early Medieval Chinese Literature: A Reference Guide, Part Three. Leiden: Brill. pp. 1757–65. ISBN 978-90-04-27216-3. \nLoewe, Michael (1993). \"Hsün tzu 荀子\". In Loewe, Michael. Early Chinese Texts: A Bibliographical Guide. Berkeley: Society for the Study of Early China; Institute of East Asian Studies, University of California Berkeley. pp. 178–88. ISBN 1-55729-043-1. \nMunro, Donald J. (2001). The Concept of Man in Early China. Ann Arbor, MI: University of Michigan. ISBN 978-0892641512. \nSchwartz, Benjamin I. (1985). The World of Thought in Ancient China. Cambridge, MA.: Harvard University Press. ISBN 0-674-96190-0. \n\n\n== External links ==\nXun Zi at DMOZ\nHsun Tzu historical information and writing excerpts\nArticle from the Internet Encyclopedia of Philosophy\nFull text of the Xunzi (in Chinese)\nQuotes by Xunzi", "ns": 0, "pageid": 608209, "title": "Xun Kuang"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}