{"batchcomplete": "", "query": {"normalized": [{"to": "Yi I", "from": "Yi_I"}], "pages": {"342409": {"extract": "Yi I (Hangul: 이이; hanja: 李珥, December 26, 1536 – 1584) was one of the two most prominent Korean Confucian scholars of the Joseon Dynasty, the other being his older contemporary, Yi Hwang (Toegye). Yi I is often referred to by his pen name Yulgok (\"Chestnut valley\"). He is not only known as a scholar but also as a revered politician and reformer. He was academical successor of Jo Gwang-jo.\n\n\n== Life ==\nYi I was born in Gangneung, Gangwon Province in 1536. His father was a Fourth State Councillor (jwachanseong 좌찬성) and his mother, Shin Saimdang, the accomplished artist and calligraphist. He was the grand nephew of Yi Gi, prime minister 1549 to 1551. early years he was learn of Baik In-geol, successor of Jo Gwang-jo. late years, It is said that by the age of seven he had finished his lessons in the Confucian classics, and passed the Civil Service literary examination at the age of 13. Yi I secluded himself in Kumgang-san following his mother's death when he was 16 and stayed for 3 years, studying Buddhism. He left the mountains at 20 and devoted himself to the study of Confucianism.\nHe married at 22 and a half, went to visit Yi Hwang at Dosan the following year. He passed special exams with top honors with a winning thesis titled Cheondochaek (hangul:천도책, hanja: 天道策, \"Book on the Way of Heaven\"), which was widely regarded as a literary masterpiece, displaying his knowledge of history and the Confucian philosophy of politics, and also reflecting his profound knowledge of Taoism. He continuously received top honors on civil exams for a consecutive 9 times. His father died when he was 26. He served in various positions in government from the age of 29, and visited the Ming Dynasty as seojanggwan (hangul: 서장관, hanja: 書狀官, document officer) in 1568. He also participated in the writing of the Myeongjong Annals and at 34, authored Dongho Mundap, an eleven-article political memorial devoted to clarifying his conviction that a righteous government could be achieved.\nDue to his vast experience in different offices over the years, Yi I was able to garner a wide vision of politics and with the deep trust of the king, became one of the central figures of politics by the time he was 40. His many documents and theses were presented to the royal court but when political conflicts escalated in 1576, his efforts proved fruitless and he returned home. Following his return, he devoted his time to studies and education of his disciples and authored several books.\nHe returned to office at 45 and while holding various minister positions, produced many writings which recorded crucial political events and showed his efforts to ease the political conflicts that were rampant at that time. However, King Seonjo was noncommittal in his attitude and it became difficult for Yi I to remain in a neutral position in the conflicts. He left office in 1583 and died the following year.\nAccording to legend, he had a pavilion built near the ford of the Imjin River in his lifetime and instructed his heirs to set it ablaze when the king had to flee northward from Seoul, to provide a guiding beacon. This took place during Hideyoshi's invasions of Korea at the Imjin war.\n\n\n== Teachings ==\nYi I was not only known as a philosopher but also as a social reformer. He did not completely agree with the dualistic Neo-Confucianism teachings followed by Yi Hwang. His school of Neo-Confucianism placed emphasis on the more concrete, material elements; rather than inner spiritual perception, this practical and pragmatic approach valued external experience and learning. Unlike Yi Hwang, who suffered through tumultuous times and did not enjoy being in politics, Yi I was an active official who thought it important to implement Confucian values and principles to government administration. He emphasized sage learning and self-cultivation as the base of proper administration.\nYi I is also well known for his foresight about national security. He proposed to draft and reinforce the army against a possible Japanese attack. His proposal was rejected by the central government, his worry was found to be well-founded soon after his death, during the Imjin war.\n\n\n== Selected works ==\nYi I's published writings encompass 193 works in 276 publications in 6 languages and 2,236 library holdings.\n\nQuestions and Answers at East Lake (hangul:동호문답, hanja:東湖問答) - Eleven articles about political reform.\nMemorial in Ten Thousand Words (hangul: 만언봉사, hanja: 萬言封事) - Suggestions about Confucian learning, self-cultivation, and application to government administration.\nThe Essentials of the Studies of the Sages (hangul: 성학집요, hanja: 聖學輯要) - Fundamentals of Confucian ethics, self-cultivation and statecraft.\nThe Secret of Expelling Ignorance (hangul: 격몽요결, hanja: 擊蒙要訣) - Systematic guide of learning.\nDaily Records of Lectures before the Throne (hangul: 경연일기, hanja: 經筵日記) - Record of political events and happenings.\nThe Complete Works of Yulgok (hangul: 율곡전서, hanja: 栗谷全書) was compiled after his death on the basis of the writings he bequeathed.\n\n\n== In modern culture ==\n\nYulgongno, a street in central Seoul, is named after him, and he is depicted on the South Korean 5,000 won note. The Taekwondo pattern Yul-Gok was also named in his honor. This is the pattern required to advance from 5th Kup Green Belt with Blue Tag to 4th Kup Blue Belt. The 38 movements of this pattern refer to his birthplace on the 38th degree latitude. The \"Yulgok Project\", a modernization project for the South Korean military, is named after him as well.\n\n\n== See also ==\nKorean Confucianism\nYi Hwang\nKorean philosophy\nList of Korea-related topics\nList of Joseon Dynasty people\nHistory of Korea\n\n\n== Notes ==\n\n\n== References ==\nChung, Edward Y. J. (1995). The Korean Neo-Confucianism of Yi Tʻoegye and Yi Yulgok: a Reappraisal of the 'Four-Seven Thesis' and its Practical Implications for Self-Cultivation. Albany: State University of New York Press. ISBN 9780791422755; ISBN 9780791422762; OCLC 30594574\nDaehwan, Noh. \"The Eclectic Development of Neo-Confucianism and Statecraft from the 18th to the 19th Century,\" Korea Journal. Winter 2003.\nHaboush, JaHyun Kim and Martina Deuchler. (1999). Culture and the State in Late Chosŏn Korea. Cambridge: Harvard University Press. ISBN 9780674179820; OCLC 40926015\nLee, Peter H. (1993). Sourcebook of Korean Civilization, Vol. 1. New York: Columbia University Press. ISBN 9780231079129; ISBN 9780231079143; ISBN 9780231104449; OCLC 26353271\n\n\n== External links ==\nYulgok Academy\nOjukheon & Gangneung Municipal Museum\nYulgok and the Logic of Li and Qi\nSelected bibliography", "ns": 0, "pageid": 342409, "title": "Yi I"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}