{"batchcomplete": "", "query": {"normalized": [{"to": "Yuri Matiyasevich", "from": "Yuri_Matiyasevich"}], "pages": {"2627712": {"extract": "Yuri Vladimirovich Matiyasevich, (Russian: Ю́рий Влади́мирович Матиясе́вич; born March 2, 1947, in Leningrad) is a Russian mathematician and computer scientist. He is best known for his negative solution of Hilbert's tenth problem (Matiyasevich's theorem), presented in his doctoral thesis, at LOMI (the Leningrad Department of the Steklov Institute of Mathematics).\n\n\n== Biography ==\nIn 1962–1963, Matiyasevich studied at Saint Petersburg Lyceum 239;\nIn 1963–1964, he studied at Kolmogorov School;\nIn 1964–1969, Matiyasevich studied at Mathematics & Mechanics Faculty of Leningrad State University. As a winner of IMO Yuri Matiyasevich was accepted without exams to LSU, skipping the last year of high school studies.\nIn 1966, he presented a talk at International Congress of Mathematicians held in Moscow. He was a second-year undergraduate student at that time.\nIn 1969–1970, he pursued Ph.D. studies at Leningrad Department of Steklov Institute of Mathematics under supervision of Sergey Maslov.\nIn 1970, he received his Ph.D. degree at LOMI.\nIn 1970–1974, he was a researcher at LOMI.\nIn 1972, he obtained a second doctoral degree (called \"doktor nauk\" in Soviet Union).\nIn 1974–1980, he was a senior researcher at LOMI.\nSince 1980, Yuri Matiyasevich has been the head of Laboratory of mathematical logic at LOMI.\nSince 1995, he has been a professor of Saint-Petersburg State University, initially at the chair of software engineering, later at the chair of algebra and number theory.\nIn 1997, he was elected as a corresponding member of Russian Academy of Sciences.\nSince 1998, Yuri Matiyasevich has been a vice-president of St. Petersburg Mathematical Society.\nSince 2002, he has been a head of St.Petersburg City Mathematical Olympiad.\nSince 2003, Matiyasevich has been a co-director of annual German–Russian student school JASS.\nIn 2008, he was elected as a full member of Russian Academy of Sciences.\n\n\n== Awards and honors ==\n1964: Gold medal at the International Mathematical Olympiad held in Moscow.\n1970: \"Young mathematician prize\" of the Leningrad Mathematical Society.\n1980: Markov Prize of Academy of Sciences of the USSR.\n1996: Honorary Degree, Université d'Auvergne.\n1998: He received Humboldt Research Award to Outstanding Scholars.\n2003: Honorary Degree, Université Pierre et Marie Curie (UPMC).\n2007: Member of the Bayern Academy of Sciences.\n\n\n== Notable facts ==\nA polynomial related to colorings of triangulation of sphere was named after Matiyasevich; see The Matiyasevich polynomial, four colour theorem and weight systems.\nHe was a member of the American Mathematical Society and the Association for Symbolic Logic; and also of the editorial boards for the journals Discrete Mathematics and Applications and Computer Instruments in Education.\nNotable students include: Eldar Musayev, Maxim Vsemirnov, Alexei Pastor, Dmitri Karpov.\n\n\n== Selected works ==\n\n\n=== Book ===\nYuri Matiyasevich Hilbert's 10th Problem, Foreword by Martin Davis and Hilary Putnam, The MIT Press, 1993. ISBN 0-262-13295-8.\n\n\n=== Papers ===\nYuri Matiyasevich (1973). \"Real-time recognition of the inclusion relation\" (PDF). Journal of Sovjet Mathematics. 1 (1): 64–70. doi:10.1007/bf01117471. ISSN 0090-4104. \nYuri Matiyasevich, Julia Robinson (1975). \"Reduction of an arbitrary Diophantine equation to one in 13 unknowns\". Acta Arithmetica. XXVII: 521–549. \nYuri Matiyasevich, Géraud Sénizergues (1996). \"Decision Problems for Semi-Thue Systems with a Few Rules\". LICS. \nYuri Matiyasevich, Proof Procedures as Bases for Metamathematical Proofs in Discrete Mathematics, Personal Journal of Yury Matiyasevich.\nYuri Matiyasevich, Elimination of bounded universal quantifiers standing in front of a quantifier-free arithmetical formula, Personal Journal of Yuri Matiyasevich.\nYuri Matiyasevich, A Polynomial related to Colourings of Triangulation of Sphere, Personal Journal of Yuri Matiyasevich.\nYuri Matiyasevich (2004). \"Some Probabilistic Restatements of the Four Color Conjecture\". Journal of Graph Theory. 46 (3): 167–179. doi:10.1002/jgt.10178. \n\n\n== See also ==\nMatiyasevich's theorem\n\n\n== References ==\n\n\n== External links ==\nYuri Matiyasevich's home page.\nYuri Matiyasevich at DBLP.\nHilbert's Tenth Problem: a History of Mathematical Discovery.\n\"Yuri Matiyasevich's results\". International Mathematical Olympiad. \nMatiyasevich theorem on Scholarpedia.\nVita and collaboration with France (French).\nO'Connor, John J.; Robertson, Edmund F., \"Yuri Matiyasevich\", MacTutor History of Mathematics archive, University of St Andrews .\nSupercomputing for a Superproblem: A Computational Journey Into Pure Mathematics", "ns": 0, "pageid": 2627712, "title": "Yuri Matiyasevich"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}