{"batchcomplete": "", "query": {"normalized": [{"to": "Zalman Schachter-Shalomi", "from": "Zalman_Schachter-Shalomi"}], "pages": {"142870": {"extract": "Meshullam Zalman Schachter-Shalomi, commonly called \"Reb Zalman\", (28 August 1924 – 3 July 2014) was one of the founders of the Jewish Renewal movement and an innovator in ecumenical dialogue.\n\n\n== Early life ==\nBorn in 1924 in Żółkiew, Poland (now Ukraine), Schachter was raised in Vienna. His father was a liberal Belzer hasid and had Zalman educated at both a Zionist high school and an Orthodox yeshiva. Schachter was interned in detention camps under the Vichy French and fled the Nazi advance by coming to the United States in 1941. He was ordained as an Orthodox rabbi in 1947 within the Chabad Lubavitch Hasidic community while under the leadership of the sixth Lubavitcher Rebbe, Yosef Yitzchok Schneersohn, and served Chabad congregations in Massachusetts and Connecticut. He subsequently earned an M.A. in psychology of religion at Boston University, and a doctorate from the Reform-run Hebrew Union College.\nAlong with Rabbi Shlomo Carlebach, Schachter was initially sent out to speak on college campuses by the Lubavitcher Rebbe. In 1958, Schachter privately published what may have been the first English book on Jewish meditation. It was later reprinted in The Jewish Catalog, and was read by a generation of Jews and as well as some Christian contemplatives. Schachter left the Lubavitcher movement after experimenting with \"the sacramental value of lysergic acid\" from 1962. With subsequent rise of the hippie movement in the 1960s, and exposure to Christian mysticism, he moved away from the Chabad lifestyle.\n\n\n== Career and work ==\n\nWhile pursuing a course of study at Boston University (including a class taught by Howard Thurman), he experienced an intellectual and spiritual shift. In 1968, on sabbatical from the Near Eastern and Judaic studies department of the University of Manitoba in Winnipeg, he joined a group of other Jews in founding a havurah (small cooperative congregation) in Somerville, Massachusetts, called Havurat Shalom. In 1974, Schachter hosted a month-long Kabbalah workshop in Berkeley, California; his experimental style and the inclusion of mystical and cross-cultural ideas are credited as the inspiration for the formation of the havurah there that eventually became the Aquarian Minyan congregation. He eventually left the Lubavitch movement altogether, and founded his own organization known as B'nai Or, meaning the \"Children of Light,\" a title he took from the Dead Sea Scrolls writings. During this period he was known to his followers as the \"B'nai Or Rebbe\", and the rainbow prayer shawl he designed for his group was known as the \"B'nai Or tallit\". Both the havurah experiment and B'nai Or came to be seen as the early stirrings of the Jewish Renewal movement. The congregation later changed its name to the more gender neutral, \"P'nai Or\" meaning \"Faces of Light\", and it continues under this name.\nIn the 1980s, Schachter added \"Shalomi\" (based on the Hebrew word shalom, peace) to his name, as a statement of his desire for peace in Israel and around the world.\nIn later years, Shachter-Shalomi held the World Wisdom Chair at The Naropa Institute; he was Professor Emeritus at both Naropa and Temple University. He also served on the faculty of the Reconstructionist Rabbinical College, Omega, the NICABM and many other major institutions. He was founder of the ALEPH Ordination Programs and ALEPH: Alliance for Jewish Renewal. The seminary he founded has ordained over 80 rabbis and cantors.\nSchachter-Shalomi was among the group of rabbis, from a wide range of Jewish denominations, who traveled together to India to meet with the Dalai Lama and discuss diaspora survival for Jews and Tibetan Buddhists with him. Tibetans, exiled from their homeland for more than three generations, face some of the same assimilation challenges experienced by Jewish diaspora. The Dalai Lama was interested in knowing how the Jews had survived with their culture intact. That journey was chronicled in Rodger Kamenetz' 1994 book The Jew in the Lotus.\n\n\n== Themes and innovations ==\nSchachter-Shalomi's work reflects several recurring themes, including:\n\"Paradigm shifts\" within Judaism\nNew approaches to halakha (Jewish law) including \"psycho-halakha\" (as of 2007, called \"integral halakha\") and doctrines like \"eco-kashrut\"\nThe importance of interfaith dialogue and \"deep ecumenism\" (meaningful connections between traditions)\n\"Four Worlds\" Judaism (integrating the Physical, Emotional, Intellectual, and Spiritual realms)\nHe was committed to the Gaia hypothesis, to feminism, and to full inclusion of LGBT people within Judaism. His innovations in Jewish worship include chanting prayers in English while retaining the traditional Hebrew structures and melodies, engaging davenners (worshipers) in theological dialogue, leading meditation during services and the introduction of spontaneous movement and dance. Many of these techniques have also found their way into the more mainstream Jewish community.\nSchachter-Shalomi encouraged diversity among his students and urged them to bring their own talents, vision, views and social justice values to the study and practice of Judaism. Based on the Hasidic writings of Rabbi Mordechai Yosef Leiner of Izbitz, he taught that anything, even what others consider sin and heresy could be God's will. His detractors argued that his views were too unconventional and that the theology he promulgated borders on pantheism. His supporters argued that his empowering approach was legitimate, and praised the range of Jewish ritual art, music and liturgical innovation that his work seeded.\nHis major academic work, Spiritual Intimacy: A study of Counseling in Hasidism, was the result of his doctoral research into the system of spiritual direction cultivated within Chabad Hasidism. This led to his encouragement of students to study widely in the field of Spiritual Direction (one-on-one counseling) and to innovate contemporary systems to help renew a healthy spirituality in Jewish life. He also pioneered the practice of \"spiritual eldering\", working with fellow seniors on coming to spiritual terms with aging and becoming mentors for younger adults.\n\n\n== Death ==\nZalman Schachter-Shalomi died in 2014 at the age of 89.\n\n\n== Honors ==\nRabbi Zalman Schachter-Shalomi was honored by the New York Open Center in 1997 for his Spiritual Renewal.\nIn 2012 his book Davening: A Guide to Meaningful Jewish Prayer won the Contemporary Jewish Life and Practice Award (one of the National Jewish Book Awards).\nHe was also recognized as a shaikh in the Sufi Order of Pir Vilayat Khan in the United States and in the Holy Land.\nIn 2012, the Unitarian Universalist Starr King School for the Ministry awarded Schachter-Shalomi an honorary doctorate of theology, and he gave a popular series of lectures on the \"Emerging Cosmology\".\n\n\n== Works ==\nSchachter-Shalomi produced a large body of articles, books, audio and video recordings. His free-association homiletical style, typical of Hasidic-trained rabbis, and his frequent use of psychological terminology and computer metaphors are appreciated by many first-time readers.\nHis publications include:\nFragments of a Future Scroll: Hassidism For The Aquarian Age (ed. Philip Mandelkorn and Stephen Gerstman, 1975)\nThe First Step (with Donald Gropman, 1983)\nThe Dream Assembly: Tales of Rabbi Zalman Schachter-Shalomi Collected and Retold by Howard Schwartz (1988)\nSpiritual Intimacy: A Study of Counseling in Hasidism (1991)\nGate to the Heart (1993).\nParadigm Shift (ed. Ellen Singer, 1993)\nFrom Age-ing to Sage-ing (with Ronald Miller, 1995)\nWrapped in a Holy Flame (ed. Nataniel Miles-Yepez, 2003)\nCredo of a Modern Kabbalist (with Daniel Siegel, 2005)\nJewish with Feeling: a guide to Meaningful Jewish Practice (written with Joel Segel, 2005)\nIntegral Halachah: Transcending and Including (with Daniel Siegel, 2007)\nAhron's Heart: The Prayers, Teachings and Letters of Ahrele Roth, a Hasidic Reformer (with Yair Hillel Goelman, 2009)\nA Heart Afire: Stories and Teaching of the Early Hasidic Masters (with Netanel Miles-Yepez, 2009)\nThe December Project: An Extraordinary Rabbi and a Skeptical Seeker Confront Life's Greatest Mystery (with Sara Davidson, 2014)\n\n\n== References ==\n\n\n== External links ==\nArticles by Rabbi Zalman Schacter-Shalomi\nFind A Grave memorial for Rabbi Zalman Schachter-Shalomi (1924-2014)\nIndex of Works by Rabbi Zalman Schachter Shalomi\nThe Reb Zalman Legacy Project\nPatheos interview with Reb Zalman on interfaith dialogue\nBeyond Jewish Triumphalism, an interview with Reb Zalman by Patheos\nZalman M. Schachter Shalomi Collection, University of Colorado Boulder Libraries", "ns": 0, "pageid": 142870, "title": "Zalman Schachter-Shalomi"}}}, "limits": {"extracts": 20}, "warnings": {"extracts": {"*": "exlimit was too large for a whole article extracts request, lowered to 1"}, "main": {"*": "Unrecognized parameter: 'rvprop'"}}}