{"batchcomplete": "", "query": {"pages": {"1893748": {"ns": 0, "pageid": 1893748, "revisions": [{"*": "{{for|the 10th century teacher from Suvarṇadvīpa|Dharmakīrtiśrī}}\n{{EngvarB|date=October 2013}}\n{{Use dmy dates|date=October 2013}}\n[[File:Dharmakirti.gif|thumb|Dharmakirti]]\n{{SpecialChars}}\n{{buddhism}}\n'''Dharmakīrti''' (fl. c. 6th or 7th century) was an influential Indian [[Buddhism|Buddhist]] philosopher who worked at [[Nālandā]].<ref name=tillemanssep>Tom Tillemans (2011), [http://plato.stanford.edu/entries/dharmakiirti/ Dharmakirti], Stanford Encyclopedia of Philosophy</ref> He was one of the key scholars of [[epistemology]] ([[pramana]]) in [[Buddhist philosophy]], and is associated with the [[Yogacara]] <ref>{{cite book|author=Donald S. Lopez Jr.|title=Buddhism and Science: A Guide for the Perplexed|url=https://books.google.com/books?id=M1rTNRb5uA4C |year=2009|publisher=University of Chicago Press|isbn=978-0-226-49324-4 |pages=133 }}</ref> and [[Sautrantika]] schools. He was also one of the primary theorists of [[Buddhist atomism]].<ref name=\"Nakamura301\"/> His works influenced the scholars of [[Mimamsa]], [[Nyaya]] and [[Shaivism]] schools of [[Hindu philosophy]] as well as scholars of [[Jainism]].{{Sfn| Eltschinger|2010}}\n\nDharmakīrti's ''Pramāṇavārttika'', his largest and most important work, was very influential in India and Tibet as a central text on [[pramana]] ('valid knowledge instruments') and was widely commented on by various Indian and Tibetan scholars. His texts remain part of modern era studies in Buddhist monasteries in Tibet.<ref name=liberman2007p52/>\n\n==History==\nLittle is known for certain about the life of Dharmakirti.<ref name=tillemanssep/> Tibetan hagiographies suggest he was a Brahmin born in South India<ref name=lmjoshi146/> and was the nephew of the [[Mimamsa]] scholar [[Kumārila Bhaṭṭa]]. When he was young, Kumārila spoke abusively towards Dharmakirti as he was taking his brahminical garments. This led Dharmakirti to take the robes of the Buddhist order instead, resolving to \"vanquish all the heretics.\"<ref>{{cite book|last1=Buton|first1=Rinchen Drub|title=History of Buddhism in India and Tibet|date=1931|translator=E. Obermiller|publisher=Harrossowitz|location=Heidelberg|page=152}}</ref> As a student of Buddhism, he first studied under Isvarasena,<ref>{{cite book|author=Hajime Nakamura|title=Indian Buddhism: A Survey with Bibliographical Notes|url=https://books.google.com/books?id=w0A7y4TCeVQC&pg=PA301 |year=1980|publisher=Motilal Banarsidass |isbn=978-81-208-0272-8 |pages=301 }}</ref> and later moved to [[Nalanda]] where he interacted with 6th century Dharmapala.<ref name=tillemanssep/><ref name=lmjoshi146>{{cite book|author=Lal Mani Joshi|title=Studies in the Buddhistic Culture of India During the 7th and 8th Centuries A.D.|url=https://books.google.com/books?id=-epU7NHNCOQC |year=1977|publisher=Motilal Banarsidass |isbn=978-81-208-0281-0|pages=146–147}}</ref> However, the accuracy of the Tibetan hagiographies is uncertain, and scholars place him in the 7th-century instead. This is because of inconsistencies in different Tibetan and Chinese texts, and because it is around the middle of 7th-century, and thereafter, that Indian texts begin discussing his ideas,<ref name=tillemanssep/><ref>{{cite book|author=Kurtis R. Schaeffer|title=Sources of Tibetan Tradition|url=https://books.google.com/books?id=buDN9BdRkN8C&pg=PA372 |year=2013|publisher=Columbia University Press|isbn=978-0-231-13599-3 |pages=372 }}</ref><ref name=liberman2007p52>{{cite book|author=Kenneth Liberman|title=Dialectical Practice in Tibetan Philosophical Culture: An Ethnomethodological Inquiry into Formal Reasoning|url=https://books.google.com/books?id=H9O57AB42yoC |year=2007|publisher=Rowman & Littlefield Publishers|isbn=978-0-7425-7686-5 |pages=52 }}</ref> such as the citation of Dharmakirti verses in the works of [[Adi Shankara]].<ref name=\"Nakamura301\">{{cite book|author=Hajime Nakamura|title=Indian Buddhism: A Survey with Bibliographical Notes|url=https://books.google.com/books?id=w0A7y4TCeVQC&pg=PA301 |year=1980|publisher=Motilal Banarsidass |isbn=978-81-208-0272-8 |pages=301 with footnotes}}</ref> Dharmakīrti is placed by most scholars to have lived between 600–660 CE, but a few place him earlier.{{Sfn| Eltschinger|2010}}\n\nDharmakirti is credited with building upon the work of [[Dignāga]], the pioneer of Buddhist logic, and Dharmakirti has ever since been influential in the Buddhist tradition.<ref name=liberman2007p52/> His theories became normative in Tibet and are studied to this day as a part of the basic monastic curriculum.<ref name=liberman2007p52/>\n\nDharmakirti worked at Nalanda as a lay Buddhist, not as an ordained monk, and his work reflects his belief that no one will understand the value of his work, his efforts soon forgotten.<ref name=tillemanssep/><ref name=\"collins\">{{cite book | url=https://books.google.com/books?id=2HS1DOZ35EgC&pg=PA177&source=gbs_toc_r&cad=0_0#v=onepage&q=plunder&f=false | title=The sociology of philosophies: a global theory of intellectual change. Volume 30, Issue 2 of Philosophy of the social sciences. | publisher=Harvard University Press | author=Collins, Randall | authorlink=Randall Collins | year=2000 | pages=240 | isbn=978-0-674-00187-9}}</ref> History proved his fears wrong.<ref name=tillemanssep/>\n\n==Philosophy==\n===Historical context===\nThe Buddhist works such as the ''[[Yogacarabhumi-sastra]]'' and the ''Mahāyānasūtrālaṅkāra'' composed before the 6th century CE, on hetuvidyā (logic, dialectics) are unsystematic, whose approach and structure are heresiological, proselytical and apologetic.{{Sfn| Eltschinger|2010}} Their aims were to defeat non-Buddhist opponents (Hinduism, Jainism, Ajivikas, others), defend the ideas of Buddhism, develop a line of arguments that monks can use to convert those who doubt Buddhism and to strengthen the faith of Buddhists who begin to develop doubts.{{Sfn| Eltschinger|2010}} Around the middle of the 6th century, possibly to address the polemics of non-Buddhist traditions with their [[pramana]] foundations, the Buddhist scholar [[Dignāga]] shifted the emphasis from dialectics to more systematic [[epistemology]] and logic, retaining the heresiological and apologetic focus.{{Sfn| Eltschinger|2010}} Dharmakīrti followed in Dignāga footsteps, and is credited with systematic philosophical doctrines on Buddhist epistemology, which Vincent Eltschinger states, has \"a full-fledged positive/direct apologetic commitment\".{{Sfn| Eltschinger|2010}} Dharmakīrti lived during the collapse of the [[Gupta Empire]], a time of great insecurity for Buddhist institutions. The role of Buddhist logic was seen as an intellectual defense against Hindu philosophical arguments formulated by epistemically sophisticated traditions like the [[Nyaya]] school. However, Dharmakīrti and his followers also held that the study of reasoning and its application was an important tool for [[soteriological]] ends.{{Sfn| Eltschinger|2010}}\n\n===Epistemology===\n[[File:2 Pramana Epistemology Buddhism.svg|thumb|Buddhist epistemology holds that perception and inference are the means to correct knowledge.]]\nDharmakīrti's philosophy is based on the need to establish a theory of logical validity and certainty grounded in causality. Following [[Dignāga]]'s ''Pramāṇasamuccaya'', Dharmakīrti also holds that there are only two instruments of knowledge or 'valid cognition' (''pramāṇa''); \"perception\" ([[Pramana#Hinduism|pratyaksa]]) and \"inference\" ([[anumāṇa]]). Perception is a non-conceptual knowing of particulars which is bound by causality, while inference is reasonable, linguistic and conceptual.<ref name=tillemanssep/> In the ''Pramāṇavārttika'' Dharmakīrti defines a pramana as a \"reliable cognition\". What it means for a cognition to be reliable has been interpreted in different ways. Following commentators like Dharmottara, who define it as meaning that a cognition is able to lead to the obtaining of one's desired object, some modern scholars such as Jose I. Cabezon have interpreted Dharmakīrti as defending a form of [[Pragmatism]].<ref>Cabezón, José I., 2000, “Truth in Buddhist Theology,” in R. Jackson and J. Makransky, (eds.), Buddhist Theology, Critical Reflections by Contemporary Buddhist Scholars. London: Curzon, 136–154.</ref> Tillemans sees him as holding to a weak form of [[correspondence theory]], which holds that to \"confirm causal efficacy\" (''arthakriyāsthiti'') is to have a justification that an object of cognition has the causal powers we expected.<ref name=tillemanssep/> That justification comes through a certain kind of non-conceptual perception (''pratyakṣa'') which is said to be an \"intrinsical source of knowledge\" (''svataḥ prāmāṇya'') which is ultimately reliable. Dharmakīrti sees a cognition as being valid if it has a causal connection with the object of cognition through an intrinsically valid, un-conceptual perception of the object which does not err regarding its functionality. As Dharmakirti says: \"A pramāṇa is a reliable cognition. [As for] reliability, it consists in [this cognition’s] compliance with [the object’s capacity to] perform a function\" (''Pramāṇavārttika'' 2.1ac).{{Sfn| Eltschinger|2010}}\n\nDharmakīrti also holds that there were certain extraordinary epistemic warrants, such as the words of the Buddha, who was said to be a authoritative/reliable person (''pramāṇapuruṣa'') as well as the 'inconceivable' perception of a yogi (''yogipratyakṣa''). On the role of scriptural authority, Dharmakīrti has a moderate and nuanced position. For Dharmakīrti, scripture (Buddhist or otherwise) is not a genuine and independent mean of valid cognition. He held that one should not use scripture to guide one on matters which can be decided by factual and rational means and that one is not to be faulted for rejecting unreasonable parts of the scriptures of one's school. However scripture is to be relied upon when dealing with \"radically inaccessible things\", such as the laws of karma and [[soteriology]]. However according to Dharmakīrti scripture is a fallible source of knowledge and has no claim to certainty.<ref name=tillemanssep/> \n\n===Metaphysics===\nAccording to Buddhologist [[Tom Tillemans]], Dharmakīrti's ideas constitute a [[nominalist]] philosophy which disagrees with the [[Madhyamaka]] philosophy, by asserting that some entities are real. Dharmakīrti states that the real is only the momentarily existing particulars (''svalakṣaṇa''), and any universal (''sāmānyalakṣaṇa'') is unreal and a fiction. He criticized the Nyaya theory of [[Universal (metaphysics)|universals]] by arguing that since they have no causal efficacy, there is no rational reason to posit them. What is real must have powers (''śakti''), fitness (''yogyatā'') or causal properties which is what individuates a real particular as an object of perception. Dharmakīrti writes \"whatever has causal powers (''arthakriyāsamartha''), that really exists (''paramārthasat'').\"<ref name=tillemanssep/> This theory of causal properties has been interpreted as a form of [[Trope_(philosophy)#Trope_theory_in_philosophy_.28metaphysics.29|trope theory]].<ref name=tillemanssep/> ''Svalakṣaṇa'' are said to be part-less, undivided and property-less, and yet they impart a causal force which give rise to perceptual cognitions, which are direct reflections of the particulars.{{Sfn| Eltschinger|2010}} \n\nDharmakīrti's ultimately real (''paramārthasat'') particulars are contrasted with conventionally real entities (''saṃvṛtisat'') as part of his presentation of the Buddhist [[Two truths doctrine]]. The conventionally real for him are based on linguistic categories, intellectual constructs and erroneous superimpositions on the flow of reality, such as the idea that universals exist.{{Sfn| Eltschinger|2010}} According to Dharmakīrti, cognitive distortion of the direct perception of particulars occurs during the process of recognition (''pratyabhijñāna'') and perceptual judgment (''niścaya'') which arises due to latent tendencies (''vāsanā'') in the mind left over from past impressions of similar perceptions. These latent dispositions come together into constructed representations of the previously experienced object at the moment of perception, and hence it is an imposed error on the real, a pseudo-perception (''pratyakṣābhāsa'') which conceals (''saṃvṛti'') reality while at the same time being practically useful for navigating it.{{Sfn| Eltschinger|2010}} Ignorance (''[[Avidyā (Buddhism)|avidyā]]'') for Dharmakīrti is conceptuality, pseudo-perception and superimposition overlaid on the naturally radiant (''prabhāsvara'') nature of pure perception. By correcting these defilements of perception through mental cultivation as well as using inference to gain \"insight born of (rational) reflection\" (''cintāmayī prajñā'') a Buddhist yogi is able to better see the true nature of reality until his perception is fully perfected.{{Sfn| Eltschinger|2010}} \n\nDharmakīrti, again following [[Dignāga]], also holds that that things as they are in themselves are “ineffable” (''avyapadeśya''). Language is never about the things in themselves, only about conceptual fictions, hence they are [[nominalists]].<ref name=tillemanssep/> Due to this theory, the main issue for Dharmakirti becomes how to explain that it is possible for our arbitrary and conventional linguistic schemas to refer to perceptual particulars which are ineffable and non conceptual. To explain this gap between conceptual schema and perceptual content, Dharmakirti takes up Dignaga's theory of \"exclusion\" (''apoha''). Dignāga's view is that \"a word talks about entities only as they are qualified by the negation of other things.\"<ref name=tillemanssep/> Dharmakīrti's unique take on this nominalist theory, which underlies his entire system, is to reinterpret it in terms of causal efficacy - ''arthakriyā'' (which can also be translated as 'telic function', 'functionality', and 'fulfillment of purpose').{{Sfn| Eltschinger|2010}}\n\nDharmakīrti developed his philosophical system to defend Buddhist doctrines, so it is no surprise that he developed a number of arguments for [[rebirth]], the [[four noble truths]], the authority of the Buddha, [[karma]], [[anatta]] and compassion as well as attacking Brahminical views such as the authority of the [[Vedas]], the existence of God and the [[Indian caste system]].{{Sfn| Eltschinger|2010}} \n\nDharmakīrti also defended the Buddhist theory of momentariness (''kṣaṇikatva''), which held that dhammas spontaneously perish the moment they arise. Dharmakīrti came up with an argument for the theory which stated that since anything that really exists has a causal power, the fact that its causal power is in effect proves it is always changing. For Dharmakīrti, nothing could be a cause while remaining the same, and any permanent thing would be causally inert.<ref name=tillemanssep/>\n\n===Philosophy of Mind===\nDharmakīrti defends Dignāga's theory of consciousness being non-conceptually reflexive (''svasamvitti'' or ''[[svasaṃvedana]]''). This is the idea that an act of intentional consciousness is also aware of itself as aware.<ref name=tillemanssep/> Consciousness is said to illuminate itself like a lamp that illuminates objects in a room as well as itself. Dharmakīrti also defends the Yogacara theory of \"awareness-only\" (''[[Yogachara#Vij.C3.B1apti-m.C4.81tra|vijñaptimātratā]]''), which held that 'external objects' of perception do not exist.<ref name=tillemanssep/> According to Dharmakīrti, an object of cognition is not external or separate from the act of cognition itself. This is because the object is \"necessarily experienced simultaneously with the cognition [itself]\" (''Pramāṇavārttika'' 3.387).{{Sfn| Eltschinger|2010}} The view that there is a duality (''dvaya'') between an object (''grāhya'') and a subjective cognition (''grāhaka'') arises out of ignorance.\n\nDharmakīrti's ''Substantiation of Other Mindstreams'' (''Saṃtānāntarasiddhi'') is a treatise on the nature of the [[mindstream]] and Buddhist response to the [[Problem of other minds]]<ref>Source: [https://web.archive.org/web/20101110082146/http://www.sub.uni-goettingen.de/ebene_1/fiindolo/gretil/1_sanskr/6_sastra/3_phil/buddh/bsa059_u.htm] (accessed: Wednesday 28 October 2009). There is an English translation of this work by Gupta (1969: pp.81–121) which is a rendering of [[Fyodor Shcherbatskoy|Stcherbatsky]]'s work from the Russian: Gupta, Harish C. (1969). ''Papers of Th. Stcherbatsky''. Calcutta: Indian Studies Past and Present. (translated from Russian by Harish C. Gupta).</ref> Dharmakirti held the mindstream to be beginning-less yet also described the mindstream as a temporal sequence, and that as there are no true beginnings, there are no true endings, hence, the \"beginningless time\" motif that is frequently used to describe the concept of mindstream.<ref>Dunne, John D. (2004). ''Foundations of Dharmakīrti's philosophy''. Studies in Indian and Tibetan Buddhism. Wisdom Publications.\nISBN 978-0-86171-184-0. Source: [https://books.google.com/books?id=Z1p4V4_lnY4C&printsec=frontcover&dq=dharmakirti&ei=W7PfS-X4Ao7ikwSnlvAC&cd=1#v=onepage&q=dharmakirti&f=false] (accessed: Monday May 4, 2010), p.1</ref></blockquote>\n\n===Affiliation===\nThere is disagreement among Indian and Tibetan doxographers as to how to categorise Dharmakīrti's thought. The [[Gelug]] school asserts that he expressed [[Yogacara]] views, most non-Gelug Tibetan commentators assert that he expressed [[Sautrāntika]] views and, according to one Tibetan source, a number of renowned later Indian Madhyamikas asserted that he expressed [[Madhyamaka]] views.<ref>Ngawang Palden in the Sautrantika chapter of his ''Explanation of the Conventional and the Ultimate in the Four Systems of Tenets'' (''Grub mtha' bzhi'i lugs kyi kun rdzob dang don dam pa'i don rnam par bshad pa legs bshad dpyid kyi dpal mo'i glu dbyangs'', New Delhi: Guru Deva, 1972, 39.5–39.6) says that some such as Prajñakaragupta, Suryagupta, Shantarakshita, Kamalashila, and Jetari interpret Dharmakirti’s ''Commentary on [Dignaga’s] Compendium of Valid Cognition'' (''Tshad ma rnam 'grel'', ''Pramanavarttika'') as a Madhyamika treatise. ''Dependent-Arising and Emptiness: A Tibetan Buddhist Interpretation of Madhyamika Philosophy Emphasizing the Compatibility of Emptiness and Conventional Phenomena'' [[Elizabeth Napper|Napper, Elizabeth]]. Boston: Wisdom Publications. p. 685, note 142</ref> \n\nAmong modern scholars, some like Tillemans argue that Dharmakīrti represented the [[Yogacara]] school, while Amar Singh argues that he was a [[Sautrāntika]].<ref>Singh, Amar; The Heart of Buddhist Philosophy: Dinnaga and Dharmakīrti, New Delhi: Munshiram Manoharlal, 1984. xvi + 168 pp.\nAppendices, glossary, bibliography and indices.</ref> For Christine Mullikin Keyt, Dharmakīrti represents a \"synthesis of two schools of Indian Buddhism, the Sautrantika and the Yogacara.\"<ref>Keyt, Christine Mullikin; Dharmakīrti's concept of the Svalakṣaṇa, 1980, https://digital.lib.washington.edu/researchworks/handle/1773/5723</ref> Likewise, Dan Arnold argues that Dharmakīrti's alternating philosophical perspectives of Sautrantika and Yogacara views are ultimately compatible and are applied at different levels of his ‘sliding scale of analysis.’<ref>Arnold, Dan; Buddhist Idealism, Epistemic and Otherwise: Thoughts on the Alternating Perspectives of Dharmakīrti, 2008</ref>\n\nThere is also a tendency to see Dignāga and Dharmakīrti as founding a new type of Buddhist school or tradition, which is known in Tibetan as \"those who follow reasoning\" (''rigs pa rjes su ‘brang ba'') and sometimes is known in modern literature as ''pramāṇavāda''.\n\n==Writings and Commentaries==\nDharmakīrti is credited with the following major works:\n\n*''Saṃbandhaparikṣhāvrtti'' (Analysis of Relations)\n*''Pramāṇaviniścaya'' (Ascertainment of Valid Cognition)\n*''Pramāṇavārttikakārika'' (Commentary on Dignaga's 'Compendium of Valid Cognition')\n*''Pramāṇavārttikasvavrtti'' (Auto-commentary on the above text)\n*''Nyāyabinduprakaraṇa'' (Drop of Logic)\n*''Hetubindunāmaprakaraṇa'' (Drop of Reason)\n*''Saṃtānāntarasiddhināmaprakaraṇa'' (Proof of Others' Mindstreams)\n*''Vādanyāyanāmaprakaraṇa'' (Reasoning for Debate)\n\nThere are various commentaries by later thinkers on Dharmakīrti, the earliest commentators are the Indian scholars Devendrabuddhi (ca. 675 C E.) and Sakyabuddhi (ca. 700 C.E.).<ref>Dunne, John D; Foundations of Dharmakirti's Philosophy, page 4</ref> Other Indian commentators include Karṇakagomin, Prajñākaragupta, Manorathanandin, Ravigupta and Śaṅkaranandana.<ref>Cluster of Excellence \"Asia and Europe in a Global Context\" of the University of Heidelberg, http://east.uni-hd.de/buddh/ind/7/16/</ref>\n\nHe was extremely influential in Tibet, where Cha-ba (phya pa chos kyi seng ge, 1182-1251) wrote the first summary of his works, called \"Clearing of Mental Obscuration with Respect to the\nSeven Treatises on Valid Cognition\" (''tshad ma sde bdun yid gi mun sel''). [[Sakya Pandita]] (sa skya pandita) wrote the \"Treasure on the Science of Valid Cognition\" (''tshad ma rigs gter'') and interpreted Dharmakirti as an anti-realist against Cha-ba's realism.<ref>Recognizing Reality: Dharmakirti’s Philosophy and its Tibetan Interpretations, (Suny: 1997), page 23-24</ref> These two main interpretations of Dharmakīrti became the foundation for most debates in Tibetan epistemology.\n\n==See also==\n* [[Pramana]]\n* [[Buddhist atomism]]\n* [[Epistemology]]\n* [[Dignāga]]\n* [[William of Ockham]]\n\n==References==\n{{reflist|30em}}\n\n===Sources===\n*{{cite journal|last= Eltschinger|first= Vincent| year= 2010|title= Dharmakīrti: Revue internationale de philosophie|number= 253|journal =Buddhist Philosophy|volume=2010.3| url=http://www.cairn-int.info/article.php?ID_ARTICLE=E_RIP_253_0397| pages= 397–440|ref=harv}}\n* ''Buddhist Logic'' (1932) by [[Fyodor Shcherbatskoy]] introduced the West to Buddhist logic, and more specifically to Dignaga. Although pioneering, this work is now regarded as outdated by some Buddhist scholars. — [[David Loy]] complains about viewing Buddhist philosophy \"through the categories of another system – Stcherbatsky's Kant, Murti's [[Vedanta|Vedānta]], Gudmundsen's [[Ludwig Wittgenstein|Wittgenstein]] – which (as with earlier interpretations of [[Nirvana|nirvāṇa]]) reveals more about the interpreter than the interpreted.\" ({{cite journal|last1=Loy|first1=David|title=How not to criticize Nāgārjuna|journal=Philosophy East and West|date=1984|volume=34|issue=4|pages=437–445|doi=10.2307/1399177}}).\n*{{cite book |title=Foundations of Dharmakirti's Philosophy |last=Dunne |first=John D. |year=2004 |publisher=Wisdom Publications |location=Somerville, Mass. |isbn=978-0-86171-184-0 |url=https://books.google.com/books?id=Z1p4V4_lnY4C }}\n*{{cite book |last = Dreyfus |first = Georges | title = Recognizing Reality: Dharmakirti's Philosophy and Its Tibetan Interpretations |year = 1997 |\n publisher = State University of New York Press | location = New York | isbn = 978-0-7914-3098-9}}  extensive discussion of the Dharmakirti's Tibetan reception\n* {{cite book |title=Scripture, Logic, Language: Essays on Dharmakirti and His Tibetan Successors |last=Tillemans |first=T. J. F. |authorlink=Tom Tillemans |year=1999 |publisher=Wisdom Publications |location=Somerville, Mass. |isbn=978-0-86171-156-7 |url=https://books.google.com/books?id=2fWSdQmCRT0C }}\n* Pecchia, C. (ed., with the assistance of Pierce P.). (2015). ''Dharmakīrti on the Cessation of Suffering. A Critical Edition with Translation and Comments of Manorathanandinʼs Vṛtti and Vibhūticandraʼs Glosses on Pramāṇavārttika II.190-216''. Leiden, Brill.\n\n==External links==\n*{{cite SEP |url-id=dharmakirti |title=Dharmakirti |last=Tillemans |first=Tom}}\n\n{{Buddhism topics}}\n\n{{Authority control}}\n\n[[Category:Atomists]]\n[[Category:Buddhist philosophers]]\n[[Category:Buddhist writers]]\n[[Category:Indonesian philosophers]]\n[[Category:Indonesian writers]]\n[[Category:Indonesian Buddhists]]\n[[Category:History of logic]]\n[[Category:7th-century Indian writers]]\n[[Category:Buddhist logic]]\n[[Category:Yogacara]]\n[[Category:Srivijaya]]\n[[Category:7th-century Indian philosophers]]", "contentmodel": "wikitext", "contentformat": "text/x-wiki"}], "title": "Dharmakirti"}}}}